[
  {
    "name": "Story Time with Cows - Storytime for Children and Families",
    "description": "Join us for a unique and heartwarming experience! This event is perfect for children and their parents. We`ll start with a visit to a local gaushala, where you`ll have the opportunity to interact with gentle farm animals. Following the gaushala visit, we’ll head to Atta Galatta for a captivating reading of \"Vijay Visits a Farm.\" This beautifully illustrated book will inspire young minds to connect with nature and animals. After the reading, we`ll have a lively kid-friendly discussion about animal welfare and the importance of protecting our environment.\nKey Highlights:\n\nMeet at Akhila Karnataka Prani Daya Sangha \nBook reading at Atta Galatta\nEngaging discussion\nFamily-friendly fun\nMeet at Akhila Karnataka Prani Daya Sangh @ 9:30am (please arrange transportation to transit to Atta Galatta at 11am) \nYou can join just for the storytelling portion directly at Atta Galatta, at 11 AM",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT802",
    "image": "https://attagalatta.com/admin/uploads/events/1170378338.jpg",
    "performer": "Preethi Srinivas",
    "keywords": [
      "Storytelling",
      "Walk, Performance and Activities"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-11-09T09:30:00+05:30",
    "endDate": "2024-11-09T12:00:00+05:30"
  },
  {
    "name": "Introduction to Design Thinking - Workshop",
    "description": "Are you ready to unlock your creative potential and revolutionize the way you approach problems? Design thinking is a human-centered approach that empowers you to empathize with users, ideate innovative solutions, and prototype your ideas rapidly.\nIn this workshop, you’ll learn:\n\nThe five-step design thinking process: Empathize, Define, Ideate, Prototype, and Test.\nHow to apply design thinking to real-world challenges.\nPractical tools and techniques for brainstorming and problem-solving.\n\nJoin us and discover how design thinking can help you:\n\nInnovate more effectively.\nCollaborate with others more productively.\nCreate solutions that truly meet the needs of your users.\n\nDon’t miss this opportunity to ignite your creativity and drive innovation.\nFacilitated by business consultant and corporate trainer Mr. Vishal Mimani",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT800",
    "image": "https://attagalatta.com/admin/uploads/events/1686934183.png",
    "performer": "Vishal Mimani",
    "keywords": [
      "Upskill",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-09T11:00:00+05:30",
    "endDate": "2024-11-09T14:00:00+05:30"
  },
  {
    "name": "Citizen by Descent - Book-Based Session",
    "description": "Discover the heartwarming and insightful world of Citizen by Descent with author Kritika Arya.\nCitizen by Descent is a captivating collection of autobiographical essays exploring themes of home, mental health, identity, and the unique experiences of a third-culture kid.\nBorn in Dubai, educated in the UK, and now living in India, the book chronicles a life in constant motion, searching for roots amidst the journeys. Each essay is brought to life by stunning illustrations from a diverse group of international artists. Through introspective essays set in different homes, the book offers a relatable narrative for those seeking growth and self-discovery.\nKritika Arya is a writer and storyteller with a passion for exploring the human experience. With a master’s degree (MA) in Dramatic Writing and a background in theatre, production and documentaries, she moved to India in 2017 to pursue a career as a writer. Since then, she has written for an award-winning international web series called Bhak, worked on Life in a Day 2020 and is currently part of the team making a global documentary about mental health called I Hope This Helps.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT799",
    "image": "https://attagalatta.com/admin/uploads/events/2011677863.jpg",
    "performer": "Krtika Arya",
    "keywords": [
      "Books",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-09T12:30:00+05:30",
    "endDate": "2024-11-09T13:30:00+05:30"
  },
  {
    "name": "Secrets of  Sari Storytelling - Immersive Styling Workshop",
    "description": "Like Bill Waterson-Calvin’s SpaceMan Spiff, if you too nurture an alter ego of becoming a sari storyteller, attend this session. It discusses tips and techniques to refine your sari styling and fashion storytelling. Okay, it does not promise to turn you into a chic sensation overnight, but it can make you mindful of telling your sari style story by managing your fashion image for the world. You can apply the learning to daily life. NOTE: The workshop is for a limited number of participants. We request you to register accordingly. Please carry a sari you love or dislike, your fave journal, and a pen.\nOBJECTIVES\n\nTo help you express your sari fashion identity in a safe circle of listeners.\nTo help you know the ground rules of mindful sari styling for SELF.\nTo help you learn the basics of sari story writing for SELF (read: for social media).\n\nFACILITATOR\nThe session is conducted by Bhawana Pingali, former Fashion Features Editor of FEMINA (Worldwide Media Ltd.—Times of India / BBC Magazines). She is a mother of a teen, has been an editor-educator for the last 19+ years, and is currently authoring a book with PENGUIN. Her articles have appeared in The Hindu, Hindustan Times-Mint Lounge, Time Out, Lonely Planet, Travel + Leisure, Maxim, Orissa Post, Signature-Oman, among others. She has taught at NIFT, Pearl Academy, Symbiosis Institute of Design, CEPT-Ahmedabad, IIM-A, British Council (TEFL-certified trainer), GD Goenka and Ansal Universities. Her heart now lies in teaching yoga, and reviving saris and rituals through fashion research lab REVASTRA.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT764",
    "image": "https://attagalatta.com/admin/uploads/events/583020367.png",
    "performer": "Bhawana Pingali",
    "keywords": [
      "Fashion",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-09T17:00:00+05:30",
    "endDate": "2024-11-09T19:00:00+05:30"
  },
  {
    "name": "Mahabharata Stories in Bengaluru - Storytelling",
    "description": "The Mahabharata is a living epic that thrives amongst us.  If so, what about Bengaluru? What stories live in this city in the form of art, architecture, rituals, and landscape. Join Aparna Jaishankar for an oral storytelling performance, as she shares a few episodes from the Mahabharata that one might have seen and experienced in the city of Bengaluru.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT801",
    "image": "https://attagalatta.com/admin/uploads/events/301875766.jpeg",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "Mythology",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-09T17:00:00+05:30",
    "endDate": "2024-11-09T18:00:00+05:30"
  },
  {
    "name": "An Evening of Magic - International Edition - Magic Show",
    "description": "Your favourite show – An Evening of Magic – just went International! \nThe November edition of this acclaimed magic show presents an amazing ensemble of top magicians and mentalists, led by American magician Joshua Jay and British Illusionist Andi Gladwin, both of whom have performed all over the world and appeared on numerous TV shows, including FOOL US! \nJoshua and Andi are performing for the first time ever in India and will be joined by their friends and top international magicians from across the world and India, including Jeff Kowalk, David Nobo, Raja Moorthy, Pradip Amladi, Prahlad Acharya, and Shankar Junior. This special once-in-a-lifetime edition of ‘An Evening of Magic' will be hosted by the Indian mentalist, Nakul Shenoy.\nCome, experience magic at its very best. \nAn Evening of Magic is a most amazing magic show presented by `Nakul Shenoy & Friends`, featuring top entertainers and magic acts. Curated and hosted by the internationally-acclaimed mentalist Nakul Shenoy, each event in this series brings unique acts and performances by nationally and internationally acclaimed magicians, alongside some of the most notable up-and-coming stars of magic. This is an evening that is truly magical, and one you will want to experience many times over.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT798",
    "image": "https://attagalatta.com/admin/uploads/events/1672644709.jpg",
    "performer": "Andi Gladwin, \nJoshua Jay,",
    "keywords": [
      "Magic",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-09T18:00:00+05:30",
    "endDate": "2024-11-09T20:00:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT803",
    "image": "https://attagalatta.com/admin/uploads/events/2113628756.jpeg",
    "performer": "The Listeners Circle",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-11-10T11:00:00+05:30",
    "endDate": "2024-11-10T13:00:00+05:30"
  },
  {
    "name": "River of Stories - Storytelling for Children and Families",
    "description": "Renu Narayan, Professional Storyteller and Founder of KathaVriksh is a passionate storyteller who believes that stories are for all ages right from the foetus in the womb to a 100 years old person. She curates stories for children, adults and for family audiences. Her storytelling is highly interactive and very enjoyable. She travels to different cities in India to spread the joy of stories. She has also travelled abroad to attend Storytelling conferences and does storytelling for audiences in other countries through Zoom. She was one of the main organisers of the recent Children’s Storytelling Festival at Chennai in August 2024.\nA River of Stories is a 60 minutes program wherein she’ll share an eclectic collection of stories meant for both children and adults. She believes stories can bring people together fostering love, understanding and harmony. Through her stories she highlights the importance of love and concern for animals, the environment and for each other.\nWhenever the occasion demands it, she uses puppets and other props to make the stories come alive.  She also tells stories using Kamishibai which is the Japanese style of storytelling.\nWe invite you to attend the session for a fun filled time with family and friends.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT804",
    "image": "https://attagalatta.com/admin/uploads/events/980470090.png",
    "performer": "Renu Narayan",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-11-10T11:00:00+05:30",
    "endDate": "2024-11-10T12:00:00+05:30"
  },
  {
    "name": "BeST Festival - Storytelling Festival",
    "description": "Bangalore Storytelling Society (BSS), estd. in 2013, is a not-for-proﬁt collective of Professional Storytellers in Bangalore, who work towards reviving, nurturing and promoting the art of Oral Storytelling in the community and in the contemporary context.\nBengaluru Storytelling Festival (BeSt Festival) is a yearly event that was started by team BSS in the year 2018, with the aim of giving a wholesome story experience for the storylovers of Bengaluru.\nThis year is the 6th edition of the BeSt fest and we proudly present to you the following events at Atta Galatta:\n\nStory Mania\nTapestry of Tales\nUnderstanding the Special String Puppets of India",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT805",
    "image": "https://attagalatta.com/admin/uploads/events/1268153584.jpeg",
    "performer": "Bangalore Storytelling Society",
    "keywords": [
      "Storytelling",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-10T13:30:00+05:30",
    "endDate": "2024-11-10T19:30:00+05:30"
  },
  {
    "name": "Story Mania - Storytime for Children as part of BeST Fesival",
    "description": "Do you like to solve puzzles, crack codes, create stories and have super fun all at the same time? Put your thinking hats on and get ready to participate in a high energy, game-filled, OG-level story-based event exclusively put together for all young kids who love stories, games and a whole new level of excitement!\nFor Children Aged 7-12 Years",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT806",
    "image": "https://attagalatta.com/admin/uploads/events/727762829.png",
    "performer": "Bangalore Storytelling Society",
    "keywords": [
      "Storytelling",
      "Activities"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-11-10T13:30:00+05:30",
    "endDate": "2024-11-10T15:30:00+05:30"
  },
  {
    "name": "Understanding the Special String Puppets of India - Learning Capsule on Puppetry and Storytelling",
    "description": "The BeSt Festival Learning Capsule is curated keeping in mind the knowledge seekers of Bengaluru who aim to upskill themselves and delve deeper in to the art of storytelling through unique workshops by eminent storytellers and artists from Karnataka.\nThis year`s learning capsule is titled \" Understanding the Special String Puppets of India\". It will be led by the eminent storyteller, Padmashri awardee and the founder director of Dhaatu Puppet Theatre, Smt.Anupama Hoskere from Bengaluru.\nThis workshop will give you an idea of storytelling through a puppeteer`s lens. Please note that this can be attended by anyone above16 years of age and does not require one to know about puppetry or storytelling as a pre requirement.This will be an experience in itself.\nBook your tickets to experience the magic of this unique art form.\nBangalore Storytelling Society (BSS), estd. in 2013, is a not-for-proﬁt collective of Professional Storytellers in Bangalore, who work towards reviving, nurturing and promoting the art of Oral Storytelling in the community and in the contemporary context.\nBengaluru Storytelling Festival ( BeSt Festival) is a yearly event that was started by team BSS in the year 2018, with the aim of giving a wholesome story experience for the storylovers of Bengaluru.\nThis year is the 6th edition of the BeSt fest and we proudly present to you the learning capsule.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT808",
    "image": "https://attagalatta.com/admin/uploads/events/347556486.png",
    "performer": "Anupama Hoskere, \nBangalore Storytelling Society,",
    "keywords": [
      "Storytelling",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-10T16:00:00+05:30",
    "endDate": "2024-11-10T17:30:00+05:30"
  },
  {
    "name": "Tapestry of Tales - Storytelling",
    "description": "Are we part of our land or is our land part of us? Join Bangalore Storytelling Society for a Tapestry of Tales. This is an evening of oral stories of Professions and Heritage woven together; exploring the rich tapestry of culture, history, and nature.\nCelebrating Karnataka’s diversity and heritage in crafts, cuisines, conservation and culture, BSS brings to you a Tapestry of Tales. To weave this beautiful tapestry, we have Vrunda Sekhar, who will give a peek into the world of Ilkal weaves, Monika Manchanda, who will bring in the aroma of food stories in Bangalore, Krithi Karanth, who will give us a glimpse into the world of wildlife conservation and Anil Ravindran, who will take us into the world of Coffee and its aromatic tales.\nDo mark your calendar and spend an evening at the cosy Atta Galatta on a Sunday evening traveling our rich landscape.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT807",
    "image": "https://attagalatta.com/admin/uploads/events/1125070214.png",
    "performer": "Anil Ravindran, \nBangalore Storytelling Society, \nKrithi Karanth, \nMonika Manchanda, \nVrunda Sekhar,",
    "keywords": [
      "Storytelling",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-10T18:00:00+05:30",
    "endDate": "2024-11-10T19:30:00+05:30"
  },
  {
    "name": "Hook Book Day - Let's Get Hooked! - Children's Festival",
    "description": "Have you heard of the Sweet Shop Wars? Or asked too many questions like Cyrus the Whyrus? What if I Want A Pet is the book for you? Get Hooked at Hook book day brought to you by Atta Galatta! Hear from authors and illustrators who helped created your favourite Hook books, participate in fun activities and most importantly- stick your nose in a new book!\nThis special event brings together authors, storytellers, illustrators and other artists coupled with fun finger-food and snacks, for a day of readings, interactive discussions and roundtables! So join us at Atta Galatta on 16th November and let's get hooked!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT816",
    "image": "https://attagalatta.com/admin/uploads/events/1666739416.png",
    "performer": "Penguin",
    "keywords": [
      "Storytelling",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-16T10:30:00+05:30",
    "endDate": "2024-11-16T17:30:00+05:30"
  },
  {
    "name": "I Won't Wash My Hair - Book Reading",
    "description": "A girl who refuses to wash her hair, a dog named Riksha and chilli from Chile. Join author Aparna Kapur and a cast of colourful characters from I Won't Wash My Hair (a Hook Book illustrated by Ogin Nayam and published by Duckbill Books).\nAbout Aparna\nAparna Kapur writes books for children of all ages. She has been on various editorial teams, and currently is a consultant for HarperCollins Children's. She is often found poring over a book or pouring herself a large cup of coffee.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT811",
    "image": "https://attagalatta.com/admin/uploads/events/292569623.png",
    "performer": "Aparna Kapur",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-16T11:15:00+05:30",
    "endDate": "2024-11-16T11:45:00+05:30"
  },
  {
    "name": "Boy Bear - Interactive Session for Kids",
    "description": "Does Bear like to dance? Is bread his favourite food? Was he happy to leave his forest home and come live on the streets of Mumbai?\nAre all bears born with broken teeth…\nCome find the answers to these questions with Boy as he makes friends with a creature he’s lived with all his life yet never truly known.\nAbout Adithi Rao\nAdithi gobbles chocolate, takes long walks and smuggles treats to the friendly street dogs behind the backs of unfriendly neighbours. In her free time, she writes books and short stories, plays and film scripts. She is visiting faculty at the Srishti Manipal Institute of Art, Design & Technology, and often conducts writing workshops across the country.\nTwo of her books - Noon Chai and a Story and Candid Tales: India on a Motorcycle - were on the Parag Honour List.\nYou can find her at the chocolate store, or at www.adithirao.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT812",
    "image": "https://attagalatta.com/admin/uploads/events/2075679240.png",
    "performer": "Adithi Rao",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-16T12:00:00+05:30",
    "endDate": "2024-11-16T13:00:00+05:30"
  },
  {
    "name": "Cyrus the Whyrus - Interactive Session for Kids",
    "description": "Are you a Whyrus? Or maybe a Howrus? And have you done your Homework? Enter the Why-niverse with Lavanya Karthik in a fun filled session based on her books 'Cyrus the Whyrus' and 'Homework'. There will be quizzes, stories, some Why-ld ideas and a chance to compete in the Whylympic Games!\nAbout Lavanya Karthik\nLavanya Karthik is the award-winning author and illustrator of over 35 books for children of all ages. Her books have been translated into many languages and travelled the world. Lavanya stays in Mumbai where she writes, draws, eats a lot of chocolate and takes a lot of naps.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT817",
    "image": "https://attagalatta.com/admin/uploads/events/647588481.png",
    "performer": "Lavanya Karthik",
    "keywords": [
      "Books",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-16T14:00:00+05:30",
    "endDate": "2024-11-16T14:45:00+05:30"
  },
  {
    "name": "Mythology Marvels - Children's Day Special - Storytime for Children and Families",
    "description": "Indic Mythology is full of answers to the many whys of our culture. Join Lavanya Prasad and Meenu Sivaramakrishnan, as they explore and bring forth the marvellous stories from the Indic Mythology through music, dance and theatre.\nThis November, we are celebrating Children. Come and listen to lesser-known tales of the Gods when they were young. Adventures, challenges they faced it all Join us to listen to tales that enthral.\nLooking forward to meeting you all!\nAbout the Storytellers:\nLavanya Prasad & Meenu Sivaramakrishnan are passionate professional storytellers with mutual love for Music and Mythology. Mythology Marvels is their humble attempt to bring to light the treasures from Indian mythology (this time from around the world too) to the children and Families of Bengaluru through music, dance and theatre. Both Lavanya and Meenu run their respective storytelling ventures.\nPlease find more about them here.\nLavanya Prasad : www.talescope.in\nMeenu Sivaramakrishnan : www.kathagalatta.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT809",
    "image": "https://attagalatta.com/admin/uploads/events/943578637.png",
    "performer": "Lavanya Prasad, \nMeenu Sivaramakrishnan,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-11-16T14:30:00+05:30",
    "endDate": "2024-11-16T15:30:00+05:30"
  },
  {
    "name": "The Paper Plane Flew - Interactive Session",
    "description": "Let's draw an elephant together and send it flying into the world.\n\nAbout Sheena Deviah\nSheena Deviah is an illustrator and book designer who loves to play with words and imagery. She has illustrated several books for children (and adults) and lives in Bangalore with a toothless cat, Ramona.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT813",
    "image": "https://attagalatta.com/admin/uploads/events/54184216.png",
    "performer": "Sheena Deviah",
    "keywords": [
      "Drawing",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-16T15:00:00+05:30",
    "endDate": "2024-11-16T15:30:00+05:30"
  },
  {
    "name": "If Wishes Were Butterflies - Session",
    "description": "Come read the new Hook Book 'Gawa's Bag of good Regards' with Canato and join him in making some origami butterflies and birds.\n\nAbout Canato Jim\nCanato Jimo is a picture-book maker from Nagaland, currently working as an Art Director in Bangalore. He moonlights as a musician, loves to guzzle tea and pop bubble wrap, and is a recovering stationery addict.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT814",
    "image": "https://attagalatta.com/admin/uploads/events/2044565344.png",
    "performer": "Canato Jim",
    "keywords": [
      "Books",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-16T15:45:00+05:30",
    "endDate": "2024-11-16T16:45:00+05:30"
  },
  {
    "name": "I Want A Pet - Interactive Session",
    "description": "Guess what Jasbir gets when he says \"I WANT A PET'? Take part in TRING, TRUNG, TRANG! Make silly sounds and have fun with author Arundhati Venkatesh! \nBonus: a treasure hunt with clues from the book, I WANT A PET.\n\nAbout Arundhati Venkatesh\nArundhati Venkatesh writes terrifically funny books about terribly serious things like monsters, democracy, maths and science. She is the author of the bestselling Bookasura and the Petu Pumpkin series for ages 6 to 9, Junior Kumbhakarna and I Want a Pet for children 4 years and above. Her books have won several awards, including the Comic Con India Best Publication for Children Award and the SCBWI Crystal Kite Award for India, Middle East and Asia. Her three latest releases all happen to be hilarious books for ages 10+: PETU PUMPKIN: Freedom Fighter, RAMANUJAN: From Zero to Infinity, RAMAN & CHANDRASEKHAR: Lighting Up the Stars.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT815",
    "image": "https://attagalatta.com/admin/uploads/events/1412795286.png",
    "performer": "Arundhati Venkatesh",
    "keywords": [
      "Books",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-16T17:00:00+05:30",
    "endDate": "2024-11-16T17:30:00+05:30"
  },
  {
    "name": "Pen & Latte 6.0 - Story Writing Workshop",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT818",
    "image": "https://attagalatta.com/admin/uploads/events/2049366924.jpeg",
    "performer": "Aristotle's Writers Club",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-17T11:11:00+05:30",
    "endDate": "2024-11-17T14:22:00+05:30"
  },
  {
    "name": "Weaving A Story - A curated exploration of Bhujodi Sarees through stories",
    "description": "Join us for a curated storytelling morning - Weaving a story (An exploration of Bhujodi Sarees and textiles)\nAparna Jaishankar, in collaboration with Priyanka Rajwar and Roli Mishra,  will delve into stories of the symbolic significance of the colors and motifs, from the threads to the textured pallu . A curated collection of sarees from Vayaka India will be on display.\nWhether you're a lover of textiles, mythology, or just fascinated by Indian heritage, this event will wrap you in the magic of tradition.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT820",
    "image": "https://attagalatta.com/admin/uploads/events/971456739.jpg",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-17T12:00:00+05:30",
    "endDate": "2024-11-17T13:00:00+05:30"
  },
  {
    "name": "Read A Kitaab - Monthly Book Club",
    "description": "Read A Kitaab is an unbiased community of Readers, Booklovers, writers and artists. We strive to provide the community an ecosystem with an online library, book discussions, author meet, book of the month, monthly meets, newsletters & much more...\nRead A Kitaab is a calm & comfort space to be yourself, to discuss books and life with no bars on age/gender/ethnicity/political views etc.\nJoin us for the August meet on Sunday 17th November to discuss books on magical realism! Entry free.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT819",
    "image": "https://attagalatta.com/admin/uploads/events/1167171764.jpeg",
    "performer": "Anurag Kothari, \nEkta Bhandari,",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-17T16:00:00+05:30",
    "endDate": "2024-11-17T18:00:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nNovember Read: Whose Samosa is it Anyway? The Story of Where “Indian” Food Really Came From by Sonal Ved\nWe assure you that you will relish every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT794",
    "image": "https://attagalatta.com/admin/uploads/events/1512218646.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-23T11:00:00+05:30",
    "endDate": "2024-11-23T13:00:00+05:30"
  },
  {
    "name": "All-In: The Moments - Improv Comedy Show",
    "description": "9 improvisers take over the stage without any script. A few prompts from the audience are all that they want. Can they make things funny? Can they even come up with a story? They have 1.5 hours to prove.\nWhat is improv?\nImprov is not a play, there’s no script. It is also not standup, there are no tried and tested jokes. It is somewhere in between these two things. You’ll have to come to find out!\nWhy should you attend?\n\nYou are part of the script - your prompts will decide where the show will go\nYou can bring a date for a cool show\nYou can tell your Instagram friends that you attended a cool show",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT821",
    "image": "https://attagalatta.com/admin/uploads/events/1795373959.png",
    "performer": "All In Improv",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-21T17:30:00+05:30",
    "endDate": "2024-12-21T19:00:00+05:30"
  }
]