[
  {
    "name": "Chapters Unsealed 6.0 - Monthly Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nCurated Books for Discussion on Monthly Reads:\n- CARRIE by Stephen King (Winner of Vote list)\n- MEN WITHOUT WOMEN by Murakami\n- MURDER IN A MINUTE by Shouvik Bhattacharya\n- THE VEGETARIAN by HAN KANG\n- THE INMATE by Frieda McFadden\n- STARSHIP TROOPERS by Robert A Heinlien\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nSharing your views on favorite books.\nParticipating in the curated discussion.\nVoting for a Monthly Book Read.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT864",
    "image": "https://attagalatta.com/admin/uploads/events/1711557125.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-22T11:11:00+05:30",
    "endDate": "2024-12-22T14:22:00+05:30"
  },
  {
    "name": "Hugs - December Storytelling Meetup for Adults",
    "description": "Another wonderful year has passed by. As we come closer to the new year, let's end this year that has given us stories to remember, stories to cherish, stories to ponder, with a warm embrace. BSS invites you all to our year end story party 🥳 🎉 - Our monthly storytelling meet up for adults\nThe theme for this month is HUG.\nWhat does this word mean to you? What emotions does it trigger and what stories are coming to you? We would love to hear!\nSend us the synopsis of your storyline to bangalorestorytellingsociety@gmail.com by 19th December. Come one and come all, if not to tell, to listen and be there to send farewell to this year with your story tribe.\n\" Warm hugs and Entry\" FREE!!!\nAbout BSS \nBSS is a not-for-profit organization established in the year 2013 by like-minded story lovers with the sole idea of reviving and promoting the oral storytelling traditions in India. The monthly meet-up for adults by the BANGALORE STORYTELLING SOCIETY, that began in 2013, aims to revive the traditional way of sharing tales amidst a gathering.  This is one of the longest running meetups in India.\nAny questions? We are glad to help. WhatsApp: 9845680816",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT863",
    "image": "https://attagalatta.com/admin/uploads/events/732075484.jpg",
    "performer": "Bangalore Storytelling Society",
    "keywords": [
      "Storytelling",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-22T15:30:00+05:30",
    "endDate": "2024-12-22T17:00:00+05:30"
  },
  {
    "name": "Read A Kitaab - Monthly Book Club",
    "description": "Read A Kitaab is an unbiased community of Readers, Booklovers, writers and artists. We strive to provide the community an ecosystem with an online library, book discussions, author meet, book of the month, monthly meets, newsletters & much more...\nRead A Kitaab is a calm & comfort space to be yourself, to discuss books and life with no bars on age/gender/ethnicity/political views etc.\nJoin us for the August meet on Sunday 17th November to discuss your yearly recap on books! Entry free.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT865",
    "image": "https://attagalatta.com/admin/uploads/events/1698086995.jpeg",
    "performer": "Anurag Kothari, \nEkta Bhandari,",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-22T16:00:00+05:30",
    "endDate": "2024-12-22T18:00:00+05:30"
  },
  {
    "name": "Shine N Inspire - Book Launch",
    "description": "Mark Your Date for an Inspiring Journey! \nJoin us as we celebrate the launch of Shine n Inspire by Anshita Sharma!\nTogether, let’s raise awareness on mental health and empower one another.\nEvent Highlights:\nMeet & Greet | Book Signing with the Author | Lucky Draw | Live Instrumental Performance & More\nLet’s connect, get inspired, and make a difference! \nFor More Info - www.shineninspire.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT867",
    "image": "https://attagalatta.com/admin/uploads/events/549050165.jpg",
    "performer": "Anshita Sharma",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-22T16:00:00+05:30",
    "endDate": "2024-12-22T17:00:00+05:30"
  },
  {
    "name": "Enchanted Tales in Fantasyland - Storytelling for Children",
    "description": "Join us for a delightful, interactive oral storytelling event crafted especially for young dreamers and their families. As you settle into the warm glow of our fairy-lit tent, our Storyteller will whisk you away to a fantasy land filled with characters from old tales and new. Enjoy the world of imagination sprinkled with the pixie dust of story creation with Aparna Jaishankar. Psstttt …. There is also a delicious surprise for our story creators.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT869",
    "image": "https://attagalatta.com/admin/uploads/events/1368649582.png",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-12-22T18:00:00+05:30",
    "endDate": "2024-12-22T19:00:00+05:30"
  },
  {
    "name": "Queer Meet and Greet - Meetup",
    "description": "This is a queer meet and greet event hosted by Prarthana (@shorthairedbrownqueer). It's an informal, inclusive and neurodivergent friendly space for members of the LGBTQIA+ to come together and connect with like-minded folks.\nFolks of all ages from the LGBTQIA+ community are welcome!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT871",
    "image": "https://attagalatta.com/admin/uploads/events/858195469.png",
    "performer": "Short Haired Brown Queer",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-12-29T16:00:00+05:30",
    "endDate": "2024-12-29T19:00:00+05:30"
  }
]