[
  {
    "name": "The Lion, The Admiral, and a Cat called B. Uma Vijaylakshmi - Book Launch",
    "description": "V. Raghunathan has worn many hats: naval cadet, IIM professor, president of a private sector bank, chief executive of a large private foundation. Along the way, he has been an advisor for a Punjabi gaali competition, calculated the price of a piss and the age of a state bus, built one of the largest collection of padlocks in India, written a host of bestselling titles, and even named a cat.\nThe Lion, the Admiral and a Cat Called B. Uma Vijaylakshmi is a thrilling account of a career and a life in the changing landscape of India from the 1970s to the present. This book is about viewing each life-situation as an adventure and a lesson, and offers valuable insights into management, resilience and innovative problem-solving. Through it all, Raghunathan’s sharp wit and constantly curious intelligence shines as a beacon of hope and cheer in an often-difficult world.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT838",
    "image": "https://attagalatta.com/admin/uploads/events/2064189854.jpg",
    "performer": "V. Raghunathan",
    "keywords": [
      "Books",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-29T18:00:00+05:30",
    "endDate": "2024-11-29T19:00:00+05:30"
  },
  {
    "name": "Understanding the Form - Kathak Tradition, Concept & Choreography - Lecture - Demonstration",
    "description": "Join us for a lecture-demonstration on Kathak tradition, concept, and choreography, by Vidushi Saswati Sen. Saswati Sen is an Indian dancer and choreographer, and an exponent of Kathak, an Indian classical dance form. She was a senior disciple of Pandit Birju Maharaj, and still teaches and performs at his Kalashram Institute in the Jor Bagh district of New Delhi. Saswati Sen received a Sangeet Natak Akademi Award in 2004.\nTickets are priced at Rs. 200 per person and are available at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT839",
    "image": "https://attagalatta.com/admin/uploads/events/1082104881.png",
    "performer": "Vidushi Saswati Sen",
    "keywords": [
      "Dance",
      "Lecture/Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-30T11:00:00+05:30",
    "endDate": "2024-11-30T13:00:00+05:30"
  },
  {
    "name": "Cake Frosting Workshop - Workshop",
    "description": "One-of-a-kind Cake-Frosting workshop happening on 30th November, 2024 in one of the scenic, serene places - Atta Galata in Indiranagar. The workshop is a place to get creative in a fun way with lots of vibrant vibes and colors. We at Gobananas_bakes, strive for everyone walk-away with an amicable experience. It is the perfect getaway for people who like to unwind and furthermore learn Frosting to make intriguing cakes. The Event covers step by step concise, lucid instructions with insights to easier, smarter way to Frost a Bento Cake from an experienced Home-Baker who has conducted many similar workshops. All the materials will be provided to frost a cake, including cute toppers to get an ethereal experience. The participants get to know-how of trending piping methods to notch-up the looks of a piped flower or to border a cake. Furthermore, recipe will be provided to get the stable cream which gives Baker’s sleepless nights. Adieu, icing of the event, the participants get to take the cake proudly along with goodies.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT841",
    "image": "https://attagalatta.com/admin/uploads/events/112357618.jpg",
    "performer": "Sambavi Ganesh",
    "keywords": [
      "Arts and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-30T17:00:00+05:30",
    "endDate": "2024-11-30T19:00:00+05:30"
  },
  {
    "name": "Acupuncture Healing Energy Bootcamp - Wellness Workshop",
    "description": "Join us for an eye-opening and heart-opening session of healing at Atta Galatta on Saturday, 30th Nov. 6 to 7:30 PM! In this session you will:\n\nLearn about the ancient Chinese system of healing known as Acupuncture\nUnderstand how blocked and imbalanced energies in our bodies could lead to chronic physical and emotional ailments\nGet personalized treatment to unblock and balance your energies (no needles involved)\nHave an intense guided journalling and meditation session to uncover inner wounds and heal them\nGet tips for a more balanced life\n\nIdeal for those who suffer from recurring physical ailments, those who seek to break recurring unhealthy behavioural patterns, those seeking relief from stress and anxiety and for curious souls looking to understand their bodies and minds better.\nParticipants are requested to wear loose and comfortable clothing as we will be doing some light stretches during the session.\nPlease bring along a pen and a bottle of water.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT840",
    "image": "https://attagalatta.com/admin/uploads/events/1041735628.png",
    "performer": "Benazir",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-30T18:00:00+05:30",
    "endDate": "2024-11-30T19:30:00+05:30"
  },
  {
    "name": "The Colony Brats - Book Launch",
    "description": "Experience the Exclusive Launch of The Colony Brats, a Coming-of-Age Comedy-Drama by Vineed P Menon!\nHi, I’m Niv, though my parents named me Nivrutti Nandan Nedumpilly Nair—yeah, I know, what a ridiculous name. But trust me, the name is nothing compared to the ridiculousness of my life. And here’s why we call ourselves brats in Sawalpur, a town dominated by the cement plant:\n\nAs children of wage board workers, we faced injustice and weren’t allowed to enter the officers’ colony. But I had the guts to sneak into my girlfriend’s quarters—don’t ask why.\nMy best friend, Baiju, had the audacity to have an affair—sorry, a relationship—with the colony’s schoolteacher.\nOur so-called ordinary life was filled with mischief, adventures, and escapades.\nOur shift to an ultra-ordinary life came with reckless schemes and acts of revenge, making the lives of the factory officers, who took their privilege a bit too literally, a living hell—just to prove our worth.\nMy problem? I take things to heart and always make sure to get back at those who hurt me. This time, it was the cement company that wronged me, and I made sure to give back royally.\n\nRead The Colony Brats to learn how not to screw up your life—and everyone else's—with vengeance. Get ready to laugh, cry, and rethink everything as you follow our journey from innocent kids to not-so-innocent troublemaking adults. Outrage can turn your world upside down, and our story is living proof of that.\nThe Invite\nHey there! Niv here. Curious about me, my best friend Baiju, and the chaotic world of our cement colony in Sawalpur? Join us at Atta Galatta on 30th November at 6:30 pm. Trust me—you won’t want to miss the laughs, the drama, and all the mayhem in between.\nAnd here’s the kicker: you’ll meet the mastermind behind all this—our storyteller and certified troublemaker, Vineed P. Menon! He’s more than just a writer, let me tell you. He’s written and directed over eight original plays, including That Night and Family Ke Side Effects, along with short films like First Sin, Interfere, and Ring Road that even made the Dadasaheb Phalke Awards take notice. Oh, and he’s also the co-writer of the Assamese film Birangana Xaadhani (currently in post-production). And if that’s not enough, he’s also a seasoned Training Manager—though I’ve got a few “training” stories of my own he wouldn’t dare share!\nSo, whether you're here for the stories, the laughs, or just to see what kind of madness unfolds, be there. You won’t regret it—well, at least not as much as the cement company regrets messing with me!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT827",
    "image": "https://attagalatta.com/admin/uploads/events/1907161670.png",
    "performer": "Vineedh Menon",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-30T18:30:00+05:30",
    "endDate": "2024-11-30T19:30:00+05:30"
  },
  {
    "name": "All-In: The Moments - Improv Comedy Show",
    "description": "9 improvisers take over the stage without any script. A few prompts from the audience are all that they want. Can they make things funny? Can they even come up with a story? They have 1.5 hours to prove.\nWhat is improv?\nImprov is not a play, there’s no script. It is also not standup, there are no tried and tested jokes. It is somewhere in between these two things. You’ll have to come to find out!\nWhy should you attend?\n\nYou are part of the script - your prompts will decide where the show will go\nYou can bring a date for a cool show\nYou can tell your Instagram friends that you attended a cool show",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT821",
    "image": "https://attagalatta.com/admin/uploads/events/1795373959.png",
    "performer": "All In Improv",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-21T17:30:00+05:30",
    "endDate": "2024-12-21T19:00:00+05:30"
  }
]