[
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nOctober Read: A Touch of Salt by Anita Agnihotri. Translated by Arunava Sinha\nWe assure you that you will relish every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT758",
    "image": "https://attagalatta.com/admin/uploads/events/1722056.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-19T11:00:00+05:30",
    "endDate": "2024-10-19T13:00:00+05:30"
  },
  {
    "name": "Don't Stop Acting 2.0 - Acting Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Acting Workshop in town. \nJoin fellow aspiring actors and actresses for an inspiring session of learning acting through basics at our Writers Club Meet event in the cozy ambiance of the library cafe. Our Acting workshop is designed for aspiring artists who wish to explore the fundamentals of acting and develop their performance skills in a supportive and engaging environment. This immersive workshop offers participants a thorough grounding in acting techniques, character development, and scene work, providing them with the tools needed to bring authenticity and depth to their performances.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no acting experience, as well as intermediate actors looking to refresh their skills. It is also suitable for anyone interested in improving their public speaking and presentation abilities.\nWorkshop Objectives:\n- To introduce participants to the basic principles of acting.\n- To develop participants` abilities to create believable and compelling characters.\n- To enhance participants` skills in scene study and script analysis.\n- To build participants` confidence in performing in front of an audience.\nKey Components involves learning theory and practicals of: \n- Acting Techniques\n- Character Development and Analysis\n- SCript Analysis and Interpretation\n- Understanding Director`s Vision\n- Conveying Emotions\n- Physicality and Movement of Camera\n- Improvization and Spontaneity\n- Voice and Diction\n- Working with Props and Costumes\n- Rehearsals and Performances\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Participating in workshop with enthusiasm.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT737",
    "image": "https://attagalatta.com/admin/uploads/events/217366545.png",
    "performer": "MWM Movies",
    "keywords": [
      "Film",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-19T11:11:00+05:30",
    "endDate": "2024-10-19T14:22:00+05:30"
  },
  {
    "name": "Noor Inayat Khan - Theatre Performance",
    "description": "The play - Noor is a reconstruction of the story of Noor Inayat Khan, a direct descendant of Tipu Sultan, who served in Britain’s Special Operations during World War II. It is an extraordinary tale of devotion to duty, resilience in the face of Nazi oppression in France. A fascinating life of a woman who defied all labels in her own quiet way - daughter of a Sufi pacifist who joined the war yet didn`t want to kill anyone, an Indian origin woman who served a country that colonised India, a demure looking woman with extraordinary inner strength. Her story is brought to life as a ‘Courtyard Theatre’ production, a format developed by BLT. A team of two actors who play different characters with very minimal props and sets, lights and sounds.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT759",
    "image": "https://attagalatta.com/admin/uploads/events/621271238.png",
    "performer": "Bangalore Little Theatre",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "TheatreEvent",
    "startDate": "2024-10-19T16:30:00+05:30",
    "endDate": "2024-10-19T17:30:00+05:30"
  },
  {
    "name": "Manga Mochas 1.0 - Manga and Comics Fan Meet",
    "description": "Atta Galatta and Your View on Books, Novel Club cordially invite you to the unique Manga Mochas, a fans meet for Comics & Manga readers.\nAre you a Manga maven or a comic connoisseur? Have you ever wanted to share your passion, connect with like-minded enthusiasts, and debate the finer points of your favorite stories? Well, your wait is over!\nCalling all voracious readers of Manga, comics, and graphic novels! Join us for an exhilarating in-person meet-up where you can express YOUR views, discuss your beloved series, and meet fellow aficionados!\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\n \nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolising the conversation.\nEvent Sections:\n1. Icebreaker Extravaganza: Kick things off with a fun game and introduce yourself. Let`s warm up the crowd!\n2. Manga Mochas: Step into the spotlight for 5-7 minutes and share your passion for your favorite Manga or comic. No slides, just pure enthusiasm!\nINTERMISSION: Chill & Chat\n3. Fun & Games: Prepare for laughs with another engaging game.\n4. What’s Next? Discuss and vote on the next Manga, comic, or graphic novel we’ll dive into!\n5. Special Surprise Activity: Stay tuned for an exciting twist!\n6. Photo Op: Say \"cheese\" for our group picture!\nCurated Books for Discussion on Monthly Reads:\n- The Maus Chapter I (Graphic Novel) by Art Spigelman\n- Batman Year One (Comics) by Frank Miller\n- Rave Master (Manga) by Hiro Mashima\n- Saga Volume One (Comics) by Brian K. Vaughan\n- Palestine (Graphic Novel) by Joe Sacco\n- Noragami Volume 1 (Manga) by Adachitoka\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT739",
    "image": "https://attagalatta.com/admin/uploads/events/329144806.png",
    "performer": "MWM Movies",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-20T14:22:00+05:30",
    "endDate": "2024-10-20T17:55:00+05:30"
  },
  {
    "name": "Junior Detectives: Mystery Hunters - Session",
    "description": "So you want to be a detective? Do you love reading mystery books? Then put on your thinking caps and get your magnifying glasses ready!\n- Create your own secret codes\n- Learn about fingerprints\n- Test your observation skills\n-Find clues and solve a mystery\nAll participants get one free copy of The Egghead Detective Agency Vol. 1!\nPika Nani is a children’s author based in Bengaluru. Her popular titles include, The Egghead Detective Agency Vol 1 and 2, an interactive chapter book with two little girls and a ghost detective. The Adventures of Shrilok Homeless Vol 1 & 2, an Indian version of Sherlock Holmes set in Mumbai. Little Indians: Stories from across the country, a bestselling fact plus fiction book. Five of her stories appear in school text books by Orient Blackswan and Macmillan.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT754",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Pika Nani",
    "keywords": [
      "Books",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-20T16:30:00+05:30",
    "endDate": "2024-10-20T17:30:00+05:30"
  },
  {
    "name": "Pichwai Art Workshop - Art Workshop",
    "description": "Come, let’s celebrate Krishna and his Leelas through the beautiful art form of Pichwai Paintings. It is a traditional art form that dates back to the 16th century from the city of Nathdwara, Rajasthan. These paintings portray Krishna (Srinath ji) and his leelas through bright and vivid colours.\nPichwai means backdrops, these paintings were used as backdrops mainly in Srinathji Temple at Nathdwara. The paintings are a way for us to connect with the Lord Krishna.\nThis art is soul-satisfying and divine, another art form to start with your basic art skill. You need no prior knowledge of drawing or painting in order to attend this workshop.\nNO TRACING OR COPYING, you will be drawing on your own.\nSrinathji will be taught in this workshop and some of the required basic pichwai motifs.\nNote: All the materials will be provided by the host.\nWhat will you take home?\nKnowledge of Indian Art Culture\nLearn an ancient art form\nCompleted piece of artwork done by yourself\nWhat do you need to bring?\nWater bottle to keep you hydrated.\nThis workshop includes all materials, if required kindly get an Examination Pad / Paper Board also maybe a pro circle if available.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT761",
    "image": "https://attagalatta.com/admin/uploads/events/395599221.png",
    "performer": "Sindhoor Suryavamshi",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-26T11:00:00+05:30",
    "endDate": "2024-10-26T14:00:00+05:30"
  },
  {
    "name": "Secrets of  Sari Storytelling - Immersive Styling Workshop",
    "description": "Like Bill Waterson-Calvin’s SpaceMan Spiff, if you too nurture an alter ego of becoming a sari storyteller, attend this session. It discusses tips and techniques to refine your sari styling and fashion storytelling. Okay, it does not promise to turn you into a chic sensation overnight, but it can make you mindful of telling your sari style story by managing your fashion image for the world. You can apply the learning to daily life. NOTE: The workshop is for a limited number of participants. We request you to register accordingly. Please carry a sari you love or dislike, your fave journal, and a pen.\nOBJECTIVES\n\nTo help you express your sari fashion identity in a safe circle of listeners.\nTo help you know the ground rules of mindful sari styling for SELF.\nTo help you learn the basics of sari story writing for SELF (read: for social media).\n\nFACILITATOR\nThe session is conducted by Bhawana Pingali, former Fashion Features Editor of FEMINA (Worldwide Media Ltd.—Times of India / BBC Magazines). She is a mother of a teen, has been an editor-educator for the last 19+ years, and is currently authoring a book with PENGUIN. Her articles have appeared in The Hindu, Hindustan Times-Mint Lounge, Time Out, Lonely Planet, Travel + Leisure, Maxim, Orissa Post, Signature-Oman, among others. She has taught at NIFT, Pearl Academy, Symbiosis Institute of Design, CEPT-Ahmedabad, IIM-A, British Council (TEFL-certified trainer), GD Goenka and Ansal Universities. Her heart now lies in teaching yoga, and reviving saris and rituals through fashion research lab REVASTRA.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT764",
    "image": "https://attagalatta.com/admin/uploads/events/583020367.png",
    "performer": "Bhawana Pingali",
    "keywords": [
      "Fashion",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-09T17:00:00+05:30",
    "endDate": "2024-11-09T19:00:00+05:30"
  }
]