[
  {
    "name": "Vanilla Hour - Book Launch with Neer Ya",
    "description": "Join us at Atta Galatta for the launch of Vanilla Hour by Neer Ya on 9 January, from 2:00PM – 5:00 PM. The author will be present to launch the book and speak about the writing and themes behind the novel.\nVanilla Hour follows Dr. Nandini Yadav, a geochemist and single mother who has rebuilt her life after years of trauma. When an unexpected reunion takes her back to Goa and to a relationship she thought she had left behind, she is forced to confront memories and choices she has long avoided.\nMoving between Delhi, Goa, and Tokyo, the novel explores love, loss, forgiveness, and the ways the past continues to shape the present. Blending elements of romantic suspense and literary fiction, Vanilla Hour is a thoughtful, emotionally grounded story about mothers and daughters, memory, and learning how to live without fear.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1583",
    "image": "https://attagalatta.com/admin/uploads/events/393182896.jpeg",
    "performer": "Neer Ya",
    "keywords": [
      "Book Discussion",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-09T14:00:00+05:30",
    "endDate": "2026-01-09T17:00:00+05:30"
  },
  {
    "name": "THE HORSE DID FLY: AND OTHER SHORT STORIES - Book Reading Balakrishna Adiga",
    "description": "Atta Galatta is excited to host a book reading by Balakrishna Adiga for his latest collection, The Horse Did Fly, on 9th January 2026, from 5:30 PM to 7:00 PM at our bookstore.\nThe Horse Did Fly is an incisive collection of urban tales, bringing everyday characters—teachers, clerks, and neighbours caught in hilarious and surprising twists—to life. Each story, inspired by true incidents, offers a sharp and unfiltered look at the ingenuity required to navigate modern life. From the absurdities of petty corruption to the challenges of 21st-century matchmaking, these stories promise to make readers laugh, reflect, and linger on the moments long after the final page.\nJoin us at Atta Galatta for an evening of reading, conversation, and storytelling with Balakrishna Adiga.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1601",
    "image": "https://attagalatta.com/admin/uploads/events/87723284.jpeg",
    "performer": "Balakrishna Adiga",
    "keywords": [
      "Books and Literature",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-09T17:30:00+05:30",
    "endDate": "2026-01-09T19:00:00+05:30"
  },
  {
    "name": "Qu for Quiz - Quiz by Karthik Srinivasan and Ganesh Balakrishnan",
    "description": "The Qu for Quiz is based on a grid format with the grids formed by topics on one axis and level of difficulty (and hence the points) on the other. The topics could be varied like History, Sports, Music, Literature, Movies and more. A team of two members would get to choose a topic and the level of difficulty and the question would be revealed. The rest of the teams can go for the buzzer if they know the answer. Depending on the number of teams registering, the size of the grid would be decided. \nSAMPLE Qu: 2. The name is inspired by the traditional malt whisky distillation process in which malted barley was mixed by hand with shovels. This labor-intensive process often caused a shoulder injury to workers, causing their arms to hang low. Which brand is named thus? \nGanesh Balakrishnan is an entrepreneur, marketer and creator of terrible dad jokes. His claim to fame is attempting to sell shoes during the pandemic, culminating in a viral Shark Tank \"Down But Not Out\" appearance. He is a collector of useless facts since childhood, and has dabbled in trivia quiz circuits since college. ganesh.flatheads@gmail.com\r\nKarthik Srinivasan is a pseudo-retired software leader by choice, specializing in innovative ideas to spend time that include organizing cricket leagues at the scale of IPL but for free, staying up to date on latest debates in virtual social groups helmed by family and friends and more on similar lines. emailkarth@gmail.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1587",
    "image": "https://attagalatta.com/admin/uploads/events/165083966.png",
    "performer": "Karthik Srinivasan",
    "keywords": [
      "Quiz",
      "Quiz"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-09T19:00:00+05:30",
    "endDate": "2026-01-09T20:30:00+05:30"
  },
  {
    "name": "Meenu the Meemi - Book Launch by Dr.Sreelekha Kopparambil",
    "description": "A dream dialogue with a little fish, Meenu, changes Nandu's life and gives him a purpose. As he decides to champion a rare cause with grit and determination, he faces many hurdles. Will Nandu succeed in his mission? What is this mission that Nandu has taken up? Who helps him on the way? To know more read, Meenu the Meemi, a dream fantasy about how a little fish befriends a little boy and how it changes lives of many others. \n* Free entry so no tickets to the event.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1580",
    "image": "https://attagalatta.com/admin/uploads/events/1876509479.jpeg",
    "performer": "Dr.Sreelekha Kopparambil",
    "keywords": [
      "Book Discussion",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-10T11:00:00+05:30",
    "endDate": "2026-01-10T12:30:00+05:30"
  },
  {
    "name": "Make Your Own Comic - A Doodling Workshop",
    "description": "A fun, beginner-friendly doodling and comic-making workshop open to all ages. Participants will learn the basics of creating cute doodles, developing their own comic character, and understanding how to frame a simple comic strip. No prior drawing experience is needed — this workshop is all about exploring ideas and enjoying the process.\r\nAll materials will be provided. Just bring a fresh mind and curiosity.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1588",
    "image": "https://attagalatta.com/admin/uploads/events/1452954094.png",
    "performer": "Sowbarnika S",
    "keywords": [
      "Comics",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-10T11:00:00+05:30",
    "endDate": "2026-01-10T13:00:00+05:30"
  },
  {
    "name": "Atta Galatta presents “AG Book Club” - Monthly Book Club with Palgun KJ",
    "description": "What have you been reading? Come, discuss your latest read. Each member gets 5-7 minutes to talk about the book, theme, plot, with 2 minutes to answer any questions others might have. This month’s special focus will be translations- come tell us what you've been reading.\nJanuary’s special focus will be on works of translation",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1623",
    "image": "https://attagalatta.com/admin/uploads/events/69206992.png",
    "performer": "Palgun KJ",
    "keywords": [
      "Books and Literature",
      "Book Club"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-10T15:00:00+05:30",
    "endDate": "2026-01-10T17:00:00+05:30"
  },
  {
    "name": "Christmas Fruit Soaking - An event and hi-tea by Bulbul Ki Bakery",
    "description": "As a thank you for an incredible Christmas Season 2025, Bulbul Ki Bakery begins soaking fruits a year ahead.\nOur fruits are soaked in alcohol a full year in advance to build depth of flavour. Last season we baked over 100kg of Christmas cakes.\nWith Gratitude and excitement for an even bigger season next year - we invite you to our Christmas cake fruit mixing event at Atta Galatta on the 10th of January at 3:30 PM followed by Hi-Tea",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1612",
    "image": "https://attagalatta.com/admin/uploads/events/649550122.png",
    "performer": "Bulbul,",
    "keywords": [
      "Food",
      "Event"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-10T15:30:00+05:30",
    "endDate": "2026-01-10T16:30:00+05:30"
  },
  {
    "name": "I’m Buzzin’: A Zine-Making Workshop - Workshop by Bazinega",
    "description": "A playful and powerful zine-making + storytelling workshop exploring the joy of independent publishing and self-expression through folded pages and storytelling. Open to everyone — whether you’re a seasoned artist, a curious beginner, or simply someone with something to say.\nWhat to expect:\n\n\nA short introduction to zines and their cultural, political, and artistic history\n\n\nInspiring examples of zines from around the world\n\n\nFun prompts to help you get started\n\n\nHands-on time to create your own 8-page zine\n\n\nGuidance on folding, layout, storytelling, and collage\n\n\nAn optional space to share your zine with others\n\n\nParticipants take home their own zine — and maybe make a few new friends.\nWhat to carry (optional):\r\nAny personal writing, poems, sketches, or images you’d like to include.\nAll materials will be provided. No prior experience needed.\n\nNote: Please arrive 10 minutes early. Tickets once purchased are non-refundable.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1589",
    "image": "https://attagalatta.com/admin/uploads/events/1324987960.png",
    "performer": "Bazinega",
    "keywords": [
      "Zine Making",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-10T17:00:00+05:30",
    "endDate": "2026-01-10T19:00:00+05:30"
  },
  {
    "name": "Let’s Walk - Book launch by Prakash Kannan",
    "description": "Join us for an intimate evening at Atta Galatta as we celebrate the launch of \"Let’s Walk\" by Prakash Kannan. This is more than just a book release; it is an invitation to explore the quiet, lingering moments that define our lives.\nThe Story: \"Let’s Walk\" is a poignant tale of two strangers brought together by chance. Set against the rhythmic backdrop of city life, the story explores the beauty of timing, the weight of unspoken words, and the type of love that stays with you long after the final page.\n \nThe Event Experience:\n· A Sneak Peek: Get an exclusive look into the heart of the story.\n· Meet the Author: Hear Prakash Kannan share his creative journey and the deep emotions that inspired this book.\n· Q&A: A chance to ask the author about the themes of timing and connection.\nLocation: Atta Galatta, Indira Nagar, Bengaluru Date: January 10, 2026 Time: 05:30 PM",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1579",
    "image": "https://attagalatta.com/admin/uploads/events/1849422911.jpg",
    "performer": "Prakash Kannan",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-10T17:30:00+05:30",
    "endDate": "2026-01-10T19:00:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup by The Listeners Circle",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1592",
    "image": "https://attagalatta.com/admin/uploads/events/2113108856.jpg",
    "performer": "The Listeners Circle",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-11T11:00:00+05:30",
    "endDate": "2026-01-11T13:00:00+05:30"
  },
  {
    "name": "Math Cafe by Career Space - A gamified math experience by Career Space",
    "description": "Join us for a 3-hour gamified session where math lovers, puzzle solvers, and curious minds come together to play, solve, and win.\nYou’ll crack puzzles, earn Career Space coins, unlock hints, and compete for medals, all while sipping coffee and having fun.\nThink of it as India’s version of a brain-game reality show, but live, interactive, and completely immersive. Whether you love math or fear it, Math Café will make you see numbers in a whole new way.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1606",
    "image": "https://attagalatta.com/admin/uploads/events/699094487.png",
    "performer": "Career Space",
    "keywords": [
      "Math",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-11T12:30:00+05:30",
    "endDate": "2026-01-11T15:30:00+05:30"
  },
  {
    "name": "BaggIt Yourself: A Finger Knitting Workshop - A Finger Knitting Workshop",
    "description": "A cozy and creative finger knitting workshop where participants will learn how to craft their own stylish bag, no needles required.\r\nAll materials will be provided, and participants will take home their finished bag along with any leftover yarn to continue creating.\r\nNo prior experience needed, just bring your fingers and your creativity.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1590",
    "image": "https://attagalatta.com/admin/uploads/events/563897385.png",
    "performer": "the crochet girl",
    "keywords": [
      "Knitting",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-11T14:00:00+05:30",
    "endDate": "2026-01-11T16:00:00+05:30"
  },
  {
    "name": "Secret Lives of Bats - A lecture by Rohit Chakravorty",
    "description": "We're bringing back one of our most popular lectures after 5 months! Pint of View returns with The Secret Lives of Bats, a lecture over drinks about the coolest yet so underrated species living amongst us.\nWe’re thrilled to host Bangalore’s very own Batman, Dr. Rohit Chakravarty, bat researcher and conservationist, for an evening exploring the hidden world of bats. From echolocation and flight to their misunderstood role in ecosystems, this lecture will change the way you see the night sky and the creatures that inhabit it.\nAll of this unfolds over sober drinks by Bangalore's homegrown kombucha brand Local Ferment Co. at Atta Galatta.\n \nWhat to expect\n> A lively, accessible science lecture designed for curious non-specialists\n> Drinks available at the venue to enjoy alongside the conversation\n> Plenty of room for questions, discussion, and close interaction with the speaker\n> A fresh perspective on urban wildlife and the species we often overlook\r\n \nThis isn’t an academic lecture hall experience. Think thoughtful storytelling, real research, and a warm, informal atmosphere where ideas flow as easily as the drinks.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1605",
    "image": "https://attagalatta.com/admin/uploads/events/1817866850.jpeg",
    "performer": "Pint of View",
    "keywords": [
      "Nature",
      "A lecture by Rohit Chakravorty"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-11T16:00:00+05:30",
    "endDate": "2026-01-11T18:00:00+05:30"
  },
  {
    "name": " Hello 2026, Be Nice: An Art Journaling Workshop - An Art Journaling Workshop",
    "description": "A gentle, creative space for real and tired thoughts. This is not a goal-setting or resolution workshop. Instead, we slow down, talk, create, and document thoughts as they are, using art journaling to make 2026 feel a little less overwhelming and a lot more humane.\nWhat to expect:\n\n\nA brand-new journal for yourself\n\n\nCraft materials to explore junk journaling\n\n\nA pack of crayons\n\n\nGuided prompts and grounding activities\n\n\nTime to create, reflect, and have fun without pressure\n\n\nThis workshop is for you, whether you journal every day or have never journaled before. No experience or skills needed, just a little curiosity and the willingness to make 2026 feel less scary in your head.\nAll materials, including the journal, will be provided.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1591",
    "image": "https://attagalatta.com/admin/uploads/events/1846390207.png",
    "performer": "Your Journal Project",
    "keywords": [
      "Art Journaling",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-11T17:00:00+05:30",
    "endDate": "2026-01-11T19:00:00+05:30"
  },
  {
    "name": "HEARTBeat Improv Show - with the theme of Stories in Colours by HEARTBeat Improv",
    "description": "Join *HEARTBeat Improv* 🎭 for 90 minutes of Themed Improv. Whether you want to sit back and watch as an *Audience* member, this is where your 2026 gets its first splash of colour 🫟\n_Where the audience(you) call the shots and we performers provide the \"colour\" 😉🎨_\nHoping to see you & your friends at Atta Gallata on 11th, Sunday evening at 6:20pm onwards :) \n(AND) To step into the spotlight as a *Performer* : Reach OUT TO HEARTBeat Admin & Host - Anuraag. Ph 8939384066.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1613",
    "image": "https://attagalatta.com/admin/uploads/events/1990550858.jpg",
    "performer": "HEARTBeat Improv",
    "keywords": [
      "Improv",
      "Improv"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-11T18:20:00+05:30",
    "endDate": "2026-01-11T20:00:00+05:30"
  },
  {
    "name": "Picture Books, Soundscapes, and the Art of Wonder - A Workshop by Barkha Sharda",
    "description": "That Book Store is Goa’s only fully curated bookstore of subsidised and preloved books. Started in 2021 as an endeavour to make books more relatable and accessible to readers of all ages but their joy has been in bringing picture books to bring out the child in you.\nThe workshop focuses on bringing back our lost sense of wonder in an otherwise cluttered life using a combination of a soundscape and curated picture books to find each of us a story to take back and treasure.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1611",
    "image": "https://attagalatta.com/admin/uploads/events/550685776.jpg",
    "performer": "Barkha Sharda",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-14T11:30:00+05:30",
    "endDate": "2026-01-14T13:00:00+05:30"
  },
  {
    "name": "The Bold Chronicles - Book discussion by Sarita Mandanna",
    "description": "Atta Galatta is delighted to host author Sarita Mandanna for an engaging conversation around storytelling, history, and imagination, as she discusses her two exciting new books.\nIn The War Elephants of Trigarta, Mandanna transports young readers to 326 BCE, where a spirited girl named Mili and her rare white elephant, Nathu, find themselves at the heart of the legendary Battle of Hydaspes. The book is a gripping tale of courage, loyalty, and the extraordinary bond between a child and her elephant, set against one of the most dramatic moments in ancient Indian history.\nIn Secrets Among the Stars, ten-year-old Arya moves to Kerala after the mysterious death of his father, only to be drawn into a thrilling quest involving an ancient vimana, hidden manuscripts, and India’s space journey through ISRO. Blending science fiction and mystery, the story explores grief, curiosity, and the search for truth.\nTogether, the books reflect Mandanna’s signature style — rich storytelling rooted in India’s past, brought to life for young readers through adventure, heart, and unforgettable characters.\nJoin us for an evening of conversation, readings, and insights into the creative process behind these remarkable stories.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1615",
    "image": "https://attagalatta.com/admin/uploads/events/1856700694.png",
    "performer": "Sarita Mandanna",
    "keywords": [
      "Book Discussion",
      "Book Talk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-14T18:30:00+05:30",
    "endDate": "2026-01-14T20:00:00+05:30"
  },
  {
    "name": "WITH HER HANDS: Art Journaling  - A women-only guided art journaling meetup to create, connect and chat freely!",
    "description": "Over two thoughtful hours, we create together, share our stories, and carve out a creative corner that feels safe, sincere, and ours. This meetup is shaped with the intention to make space for self-expression and community. Through guided journaling and art, we gently uncover what we’re carrying from the year gone by, and what we hope to carry forward in 2026. \nWhat you get:\n\nFilter coffee on the house\nAll art materials provided\nGuided facilitation for 2 hours\nIf you’ve been craving a space to create freely and meet women who get it, this is your circle!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1619",
    "image": "https://attagalatta.com/admin/uploads/events/833722169.png",
    "performer": "Women in the hood",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-16T17:00:00+05:30",
    "endDate": "2026-01-16T19:00:00+05:30"
  },
  {
    "name": "Daphne du Maurier Reader Meetup - A Group discussion for Literature Enthusiasts",
    "description": "Daphne du Maurier’s writing is a haunting blend of atmosphere, suspense, and psychological depth. With her gift for crafting moody landscapes, ambiguous characters, and stories that linger long after the last page, she draws readers into worlds where the familiar becomes unsettling and the ordinary glimmers with mystery. From windswept Cornish cliffs to shadowed manor houses, her narratives explore love, identity, obsession, and the quiet menace of the unknown.\nHer novels and short stories – whether it’s the iconic Rebecca, the eerie tension of Jamaica Inn, or the chilling brilliance of “The Birds” – continue to captivate generations of readers who crave storytelling that is both immersive and unsettlingly beautiful.\nWhether you have long been enthralled by du Maurier’s atmospheric prose or are just beginning to step into her shadowed, intriguing worlds, you are warmly invited to join us this month as we gather to discuss, reflect, and lose ourselves in her unforgettable stories.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1595",
    "image": "https://attagalatta.com/admin/uploads/events/2070546948.png",
    "performer": "Lakshmi Sankar",
    "keywords": [
      "Literary Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-17T11:00:00+05:30",
    "endDate": "2026-01-17T12:00:00+05:30"
  },
  {
    "name": "Art of Erotic Writing - A Workshop - Writing Workshop by Bhushan Korgaonkar",
    "description": "Sex is an inevitable part of our lives. Most of us indulge in either doing it, dreaming it, dreading it or otherwise thinking about it at some point in time. Years of social conditioning makes us consider it as ‘undesirable’, ‘immoral’ and ‘dirty’ but in fact, it is ‘desirable’, ‘natural’ and ‘healthy’.\nIn this workshop, you can learn to navigate the fine line between titillating and tacky, and discover how to craft compelling erotic content. Explore various aspects of sexuality and sensuality. Discover your niche and develop your skills in writing erotic content that resonates with your audience. Gain relevant information and techniques to enhance your writing, and take away valuable tips to apply to your own work.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1609",
    "image": "https://attagalatta.com/admin/uploads/events/1318485525.jpeg",
    "performer": "Bhushan Korgaonkar",
    "keywords": [
      "Writing Workshop",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-17T11:00:00+05:30",
    "endDate": "2026-01-17T14:00:00+05:30"
  },
  {
    "name": "Quiet Joys: A Gratitude Zine–Making Workshop - Workshop by Nitya Menon",
    "description": "Join us for an afternoon of quiet creativity. This workshop invites you to slow down, reflect on the small joys that often go unnoticed, and turn those moments into an 8-page gratitude zine. Through gentle prompts and simple illustration exercises, you’ll create a personal keepsake that captures what grounded you, moved you, or made you smile. It’s a reflective, hands-on session for anyone seeking a pause through creativity and mindful noticing. All materials will be provided, and no prior art experience is required.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1584",
    "image": "https://attagalatta.com/admin/uploads/events/1074968289.jpg",
    "performer": "Nitya Menon",
    "keywords": [
      "Zine Making",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-17T15:00:00+05:30",
    "endDate": "2026-01-17T16:30:00+05:30"
  },
  {
    "name": "Atta Galatta presents “The BWW Short Story Community” - Literary Meetup by Bhumika Anand",
    "description": "The BWW Short Story Community\nThis month we will discuss Gina Chung’s “Presence,” from her collection Green Frog. \nWhat this is:\nThis is a ticketed, curated literary and community event, presented by Bhumika Anand from the Bangalore Writers Workshop, where we will do a deep-dive analysis and discussion of a short story.\nYou get to join a reading community where you will get to read a pre-chosen short story a month.\nYou get to examine the story in terms of its literary merit, yes, but also in terms of writing craft and context, which will be very useful if you are an aspiring storyteller or writer.\nWho should join:\nIf you are above 18 years old, interested in storytelling, literature, or are an aspiring or published author, this is for you.\nIf you are new in the city and want to be part of a community and make friends over writing,storytelling, and literature, then this is for you.\nWhat does it entail:\nReading the prescribed story. \nParticipating in the curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1614",
    "image": "https://attagalatta.com/admin/uploads/events/1579219737.jpeg",
    "performer": "Bhumika Anand",
    "keywords": [
      "Books and Literature",
      "Book Talk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-17T16:00:00+05:30",
    "endDate": "2026-01-17T18:00:00+05:30"
  },
  {
    "name": "Kaayaa: Book Launch - Book Launch by Dr. Guruprasad Kaginele",
    "description": "Atta Galatta is delighted to host the launch of Kaayaa, the Kannada novel by acclaimed writer Guruprasad Kaginele, on 17th January, from 6:00 PM to 7:00 PM.\nSet largely in the United States, Kaayaa (which translates to Body) follows the life of Dr Bheem Malik, one of Manhattan’s most sought-after plastic surgeons, whose professional and personal worlds begin to unravel when his name surfaces in a MeToo scandal. As his career hangs in the balance and political ambitions close to him are threatened, the novel traces a reckoning with the past, forcing its characters to confront desire, power, love, and moral responsibility.\nThrough sharp satire and emotional depth, Kaayaa explores contemporary themes of sexuality, disease, marriage, and politics, while questioning society’s obsession with appearance and perfection. The novel lays bare characters caught between their real and imagined selves, each chasing a version of the American dream, only to discover its costs.\nA searing and honest meditation on beauty, ambition, and the human condition, Kaayaa reaffirms Guruprasad Kaginele’s voice as one of the most compelling in contemporary Kannada literature.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1616",
    "image": "https://attagalatta.com/admin/uploads/events/511150827.jpeg",
    "performer": "Dr. Guruprasad Kaginele",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-17T18:00:00+05:30",
    "endDate": "2026-01-17T19:00:00+05:30"
  },
  {
    "name": "In full Bloom: A Crochet Flower Workshop - Crochet Workshop",
    "description": "Step away from the noise of everyday life and spend a slow, joyful afternoon learning the art of crochet.\nIn Full Bloom is a beginner-friendly workshop where you’ll learn how to crochet a flower from scratch. Guided gently through the basics, this session is designed for absolute beginners and anyone curious about making something with their hands.\nThis workshop isn’t about perfection—it’s about the process. About slowing down, focusing on each stitch, and finding calm in the rhythm of making. By the end of the session, you’ll walk away with your own handmade crochet flower and the confidence to keep creating.\nAll materials will be provided. Just bring your curiosity.\nHosted by SlipStitch at Atta Galatta",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1622",
    "image": "https://attagalatta.com/admin/uploads/events/1159115621.png",
    "performer": "SlipStitch",
    "keywords": [
      "Crocheting",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-18T11:00:00+05:30",
    "endDate": "2026-01-18T14:00:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup by ADHD Queeple",
    "description": "Queer Quiet Hours is a low-pressure meetup for queer folks who want company without conversation being the main event.\r\nWe meet in person and spend time doing our own things side by side. Reading, drawing, journaling, knitting, scrolling, resting, all welcome.\r\nThe space is calm, not silent. Organic conversations do happen, and you’re welcome to talk or keep to yourself.\r\nWe’ll have some art supplies available to use, and you’re also very welcome to bring your own thing.\nThis space is exclusively for LGBTQIA+ folks. We haven’t opened it up to allies yet, thank you for understanding. 🏳️‍🌈\n🌈 Spots are limited, sign up through the link in bio!\n🗓️ 18th Jan, 2026\r\n⏰ 3 to 6 PM\r\n📍Atta Galatta, Indiranagar, Bangalore",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1620",
    "image": "https://attagalatta.com/admin/uploads/events/1795212448.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Community",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-18T15:00:00+05:30",
    "endDate": "2026-01-18T18:00:00+05:30"
  },
  {
    "name": "Bad Daughter Book Salon - Book Discussion by Sangeeta Pillai",
    "description": "BECAUSE GOOD GIRLS DON’T CHANGE THE WORLD. For every woman who has been told she's \"too much,\" this is a memoir about becoming exactly who you're meant to be.\nSangeeta Pillai was called a \"Bad Daughter\" for defying the rigid expectations placed on \"good Indian girls.\" But in her rebellion, she found her voice. From a harrowing childhood in a Mumbai slum-haunted by a violent father and the brutal murder of her mother-this is a story of resilience. With a fire in her belly, she\nbattled patriarchy, chased her dreams, and built a new life in London, creating a successful podcast to inspire other women. Yet, all her success couldn't outrun the past. Faced with debilitating mental health, she explored many healing avenues from psychotherapy, hypnotherapy, EMDR, acupuncture to Tantra. But to truly heal, she had to go back to her birthplace: tropical Kerala to confront her deep trauma. There, she experienced the most profound spiritual transformation in Kerala's ancient temples. Sangeeta's powerful, spiritual and deeply inspiring journey shows us that healing means finding your way back home to yourself. Bad Daughter is an inspirational feminist memoir for every woman who wants to break free. Ultimately, it's a reminder that the courage to be your authentic self can transform your own life - and the lives of those around you.\nAuthor Description:\nSangeeta Pillai grew up in a Mumbai slum. Today, she is recognised as a leading voice for South Asian feminism globally. Award-winning podcaster, writer and feminist activist, Sangeeta is the creator of Masala Podcast (all about cultural taboos) which won 6 British Podcast Awards, 1 Audio Production Award & Spotify SoundUp 2018 award. She's also the founder of South Asian feminist network Soul Sutras. Sangeeta has been featured extensively in the press from BBC Radio, Guardian, Metro, Cosmopolitan, Evening Standard, Stylist, Eastern Eye to Huffington Post. As well as on giant billboards in New York, London, Dublin, Cardiff & Glasgow. She is also the creator of the Masala Monologues series of writing workshops & theatre shows in the UK & the US. Sangeeta is a regular speaker at WOW Festival, Podcast Show London, Shameless Festival, Primadonna Festival as well as being a regular speaker on innumerable panels and podcasts.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1594",
    "image": "https://attagalatta.com/admin/uploads/events/1492321805.png",
    "performer": "Sangeeta Pillai",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-18T18:00:00+05:30",
    "endDate": "2026-01-18T19:00:00+05:30"
  },
  {
    "name": "Bangalore Storytelling Society January Meetup - A story telling meetup by BSS",
    "description": "The monthly meet-up for adults by the BANGALORE STORYTELLING SOCIETY, that began in 2013, aims to revive the traditional way of sharing tales amidst a gathering.  The theme this month is BLANK PAGE. The Lores can be from folklore , mythology, travels , books etc . If you would like to share a tale, do mail at bangalorestorytellingsociety@gmail.com\n\r\nIf you would like to listen, do join us at ATTA GALATTA  on the 24th of January, at 12pm.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1610",
    "image": "https://attagalatta.com/admin/uploads/events/1818823626.jpg",
    "performer": "Bangalore Storytelling Society",
    "keywords": [
      "Storytelling",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-24T12:00:00+05:30",
    "endDate": "2026-01-24T13:00:00+05:30"
  },
  {
    "name": "Brand Basics for First-Time Entrepreneurs - Workshop by Sudhir Kiran",
    "description": "A space for people who want to start or grow a business but feel lost in branding, storytelling, and marketing. This workshop will help entrepreneurs communicate better, build trust, and move forward with confidence without jargon or overwhelm.\nWho is this for?\nFirst-time entrepreneurs, professionals thinking of starting something on the side, freelancers who want clarity and confidence & MSME owners who wish to understand branding without jargon and students or anybody interested in starting a business.\nWhat do participants get from the workshop?\n\nClarity in their brand messaging\nA simple framework to build a business/ visual identity\nPractical marketing steps they can apply immediately\n\r\n\tEmail sudhirkirangn@gmail.com for more details.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1596",
    "image": "https://attagalatta.com/admin/uploads/events/1588876565.png",
    "performer": "Sudhir Kiran",
    "keywords": [
      "Business",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-25T11:00:00+05:30",
    "endDate": "2026-01-25T13:00:00+05:30"
  },
  {
    "name": "Ta Ka Dhi Mi - Book Launch by Shyama Panikkar",
    "description": "The event marks the launch of the much awaited book, Ta Ka Dhi Mi 2358, by author Shyama Panikkar. It is the 4th book in her series of music books for children. After the launch and a session by Shyama around the new book, her students will do a hindustani classical performance for the audience with live tabla.\nAll attendees need ticket. 1 ticket = 1 kid + 1 adult.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1598",
    "image": "https://attagalatta.com/admin/uploads/events/2146744333.jpeg",
    "performer": "Shyama Panikkar",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-25T16:00:00+05:30",
    "endDate": "2026-01-25T18:00:00+05:30"
  },
  {
    "name": "Aging (Un)Gracefully - Book Discussion with Lalita Iyer",
    "description": "In her memoir, Lalita reflects on ageing as something far more layered than simply “getting old”. She looks at it as a disruption — a moment when women begin to see themselves differently, take stock of friendships, rethink their roles, and slowly come into who they really are.\nShe asks simple but disarming questions: When do we actually become old? And how is coping with ageing any different from coping with puberty?\nThrough personal stories and observations, Lalita writes about losing estrogen, gaining perspective, building new tribes, and learning to live with bodies that are changing — with a mix of honesty, curiosity, and humour. For her, ageing becomes both a process of growing up and a kind of liberation.\nJoin us for an intimate reading and conversation around the themes of ageing, identity, and what it means to keep evolving.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1597",
    "image": "https://attagalatta.com/admin/uploads/events/625019098.jpeg",
    "performer": "Lalita Iyer",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-28T17:00:00+05:30",
    "endDate": "2026-01-28T18:00:00+05:30"
  },
  {
    "name": "Food In Literature - Book Club with Prachi Grover",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.  So, if viewing the world through the lens of food and literature interests you, then join us for a dialogue on “Food in Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we read our way through several powerful (and delicious) narratives.\nJanuary Read: In the Beginning there was Bombay Duck by Pronoti Datta\nWe assure you that you will enjoy every single bite! The session is free but registration is a must as we have limited spots available. \n \nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who love to read and eat!\nWhen: Saturday, 31st January, 2026 at 11 a.m.\nWhere: Atta Galatta Bookstore, Indira Nagar\nAges: 18+\nRegistration is mandatory (link in bio)\nCopies of the book are available at the store.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1582",
    "image": "https://attagalatta.com/admin/uploads/events/1865055897.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Literature",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-31T11:00:00+05:30",
    "endDate": "2026-01-31T13:00:00+05:30"
  },
  {
    "name": "Financial Freedom Starts with Awareness - A Financial Literacy Workshop by Aatmeeya",
    "description": "Financial Freedom Starts with Awareness is a financial literacy workshop organized by Aatmeeya, designed to help individuals build a strong foundation in personal finance and investing.\nThe workshop will be conducted by Sathwik N N, Co-Founder of Aatmeeya, who will simplify key financial concepts and guide participants on how to make informed investment decisions. The session focuses on practical knowledge that can be applied immediately, especially for beginners and working professionals.\nKey topics covered:\n\n\nIntroduction to Mutual Funds\n\n\nInvestment basics everyone should know\n\n\nPlanning short-term and long-term financial goals\n\n\n📅 Date: 31st January 2026\r\n⏰ Time: 3:00 PM – 5:00 PM\r\n📍 Venue: Atta Galatta, Indiranagar, Bengaluru\r\n💰 Fee: ₹299 only\nThis workshop is ideal for anyone looking to gain clarity, confidence, and awareness in their financial journey.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1617",
    "image": "https://attagalatta.com/admin/uploads/events/1624080254.jpg",
    "performer": "Sathwik N N",
    "keywords": [
      "Finance",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-31T15:00:00+05:30",
    "endDate": "2026-01-31T19:00:00+05:30"
  },
  {
    "name": "INDISHMAN  - Book reading by Dr Gopi Chandroth",
    "description": "Dr Gopi Chandroth, author of INDISHMAN – Reflections from India, Britain and the Sea, will be at Atta Galatta Bookstore in Indiranagar on 1 February, from 4.30 pm to 6 pm. He will talk about selected stories and engage informally with the audience. Signed copies of the book will be on sale.\n \nThe following are sample extracts from reviews on Amazon globally and on Goodreads:\n• India: “INDISHMAN reminded me of the lyrical beauty of Arundhati Roy, the vivid storytelling of Salman Rushdie, and the magic of García Márquez.”\n• UK: “A lovely meander through the vagaries of human nature. Each story warms the heart like a good malt whisky. A very well-written book; I defy anyone not to enjoy it.”\n• USA: “It (INDISHMAN) is hard to slot into a specific genre – the stories, reflections and gentle musings flit from rural Kerala to Nepal, from Southampton to the high seas with ease. They strike the perfect balance between being sharply observed and deeply memorable, yet light enough for an effortlessly enjoyable read, and never without a touch of humour and heart. Without a doubt, this has been the best six dollars and change I’ve spent in a very long time.”",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1600",
    "image": "https://attagalatta.com/admin/uploads/events/867047692.jpg",
    "performer": "Dr Gopi Chandroth",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-01T16:45:00+05:30",
    "endDate": "2026-02-01T18:00:00+05:30"
  },
  {
    "name": "Love Stories from Indian Heritage - A Storytelling Performance by Aparna Jaishankar and Vikram Sridhar",
    "description": "Love stories aren’t only about the hero and heroine, for love can rarely exist in isolation. Zealous messengers, art and music as mood enhancers, food as aphrodisiacs, taboos and mores – all play a pivotal role in shaping stories of love. Vikram Sridhar and Aparna Jaishankar rummage through the passages of time to bring you various hues of love etched in our heritage through literature, architecture, songs and poetry through the all- encompassing art form of oral storytelling.\n\nAbout Aparna Jaishankar\r\nAparna Jaishankar is a Storyteller with a penchant for Indic mythology. She believes that there is no ONE version of any story. Her storytelling performances take a contemporary view of ancient tales.Aparna also works with educators in developing learning perspectives in the classroom and with organisations in building internal narratives.\n\nAbout Vikram Sridhar\r\nVikram Sridhar is a Performance Storyteller, Theatre Practitioner.and a Narrative based Facilitator .  His Stories , Performance and Workshops for Children , Students , Adults and Families are rooted in Heritage , Ecology and Folklore deeply inspired from various communities of the soil . Based in Chennai and Bangalore , he travels the country extensively with his  Desi way of Storytelling",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1604",
    "image": "https://attagalatta.com/admin/uploads/events/1180907729.png",
    "performer": "Aparna Jaishankar, \nVikram Sridhar,",
    "keywords": [
      "Folklore",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-06T19:00:00+05:30",
    "endDate": "2026-02-06T20:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk by Vikram Sridhar",
    "description": "On a Saturday morning , Walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore , Heritage and Ecology of the area . The walk will begin and culminate at ATTA GALATTA . The tales will revolve around historical , mythical and personal narratives weaved as we discover the area through the walk .\n Date : 7th February ( Saturday)  2025\n Time : 10 AM\n Starting Point : Atta Galatta",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1608",
    "image": "https://attagalatta.com/admin/uploads/events/1890938241.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-07T07:00:00+05:30",
    "endDate": "2026-02-07T09:00:00+05:30"
  },
  {
    "name": "Gond Art - Workshop by Hues by Sindhoor",
    "description": "Our Gond Art workshop is your passport to explore the colorful tapestry of this ancient Indian folk tradition. Dive deep into the intricate techniques and whimsical motifs that define Gond art. Unleash your inner creativity as you paint your own vibrant masterpiece, infused with the spirit of tribal storytelling. \r\nTickets priced at INR 999/- 3 hours of workshop with Inclusive of all materials.\r\nContact +91 9513544920 for tickets & more details.\r\nGet ready for a joyous fusion of tradition and imagination that promises to ignite your artistic spark!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1603",
    "image": "https://attagalatta.com/admin/uploads/events/1582965496.jpeg",
    "performer": "Hues by Sindhoor",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-02-07T11:00:00+05:30",
    "endDate": "2026-02-07T14:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Domlur - Story Walk by Vikram Sridhar",
    "description": "On a Sunday morning , Walk through the lanes of DOMLUR , from lores dating back in time from the Madras Presidency , Mysore State to the current IT , Banking and Retail sectors with Vikram Sridhar discovering the lanes through the Folklore , Heritage and Ecology of the rich area which is identified as a village. The walk will begin from Bhandutvas , a theatre collective , and culminate at the Bangalore International Centre . The tales will revolve around historical , mythical and personal narratives weaved as we discover the area through the walk . \nDate : 8th February  (Sunday)  2025\n Time : 7 AM\n Starting Point : Bhandutvas , Domlur\nDetails and GPAY : 9945799224",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1607",
    "image": "https://attagalatta.com/admin/uploads/events/1735873685.jpeg",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T07:00:00+05:30",
    "endDate": "2026-02-08T09:00:00+05:30"
  },
  {
    "name": "Ventriloquism Show & Workshop - Ventriloquism workshop by M. Santhosh Kumar",
    "description": "Mr. M. Santhosh Kumar is a qualified Company Secretary by Profession yet a  passionate Ventriloquism  Artiste. He  is an International Ventriloquism Artiste, a TEDX Speaker, Voice Coach. He is the only Indian Ventriloquism artiste attending the International  Ventriloquism Convention in the USA since 2012. He has performed & enthralled both Kids & Adults in various Countries like USA, UAE, UK, Germany & all over India.  He specialises in presenting our Indian Values Culture blending humour and learning using the Ventriloquism Art. He is the Winner of Outstanding Ventriloquism Artiste award for 2021. Awardee for exemplary work in puppetry and storytelling from Early Childhood Association of India.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1599",
    "image": "https://attagalatta.com/admin/uploads/events/1546739439.jpg",
    "performer": "M. Santhosh Kumar",
    "keywords": [
      "Puppetry",
      "Workshop + Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T16:00:00+05:30",
    "endDate": "2026-02-08T17:00:00+05:30"
  },
  {
    "name": "SHAAM-E-BAAZGASHT | Bengaluru Diaries - An Evening of Poetry, Conversations & Healing by Krishnendu Chatterjee",
    "description": "Shaam-e-Baazgasht is an intimate, cosy, and immersive poetry experience drawn from Baazgasht – Echoes of Words & Silence, a bilingual Hindi–English collection that journeys through unrequited love, longing, heartbreak, queerness, healing, and the quiet courage of letting go.\nMore than a performance, it is a gathering that invites presence.\nThrough selected poems from the Baazgasht series, the evening unfolds alongside the stories that birthed them — gentle, honest conversations with the poet on his own journey, interwoven with brief guided moments of breathing, mindfulness, and emotional reflection. Together, these elements create a space where words are not merely heard, but felt — allowing the audience to touch closure, clarity, and a softer, steadier kind of inner peace.\nShaam-e-Baazgasht | Bengaluru Diaries offers an evening of listening, pausing, and returning — to oneself.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1621",
    "image": "https://attagalatta.com/admin/uploads/events/983215955.png",
    "performer": "Krishnendu Chatterjee",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T17:30:00+05:30",
    "endDate": "2026-02-08T19:30:00+05:30"
  }
]