[
  {
    "name": "Pichwai Art Workshop - Art Workshop",
    "description": "Come, let’s celebrate Krishna and his Leelas through the beautiful art form of Pichwai Paintings. It is a traditional art form that dates back to the 16th century from the city of Nathdwara, Rajasthan. These paintings portray Krishna (Srinath ji) and his leelas through bright and vivid colours.\nPichwai means backdrops, these paintings were used as backdrops mainly in Srinathji Temple at Nathdwara. The paintings are a way for us to connect with the Lord Krishna.\nThis art is soul-satisfying and divine, another art form to start with your basic art skill. You need no prior knowledge of drawing or painting in order to attend this workshop.\nNO TRACING OR COPYING, you will be drawing on your own.\nSrinathji will be taught in this workshop and some of the required basic pichwai motifs.\nNote: All the materials will be provided by the host.\nWhat will you take home?\nKnowledge of Indian Art Culture\nLearn an ancient art form\nCompleted piece of artwork done by yourself\nWhat do you need to bring?\nWater bottle to keep you hydrated.\nThis workshop includes all materials, if required kindly get an Examination Pad / Paper Board also maybe a pro circle if available.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT761",
    "image": "https://attagalatta.com/admin/uploads/events/395599221.png",
    "performer": "Sindhoor Suryavamshi",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-26T11:00:00+05:30",
    "endDate": "2024-10-26T14:00:00+05:30"
  },
  {
    "name": "Empathy Languages - Wellness Workshop",
    "description": "Do you sometimes feel misunderstood or invalidated? Do you wish people would just listen to you instead of always jumping to give advice? Do you enjoy meaningful conversations, but wish they could be even better? Or do you simply wish to get along better with people at work and home?  Come experience the magic of empathy languages, a new framework developed by the Conscious Communication Academy. In this 2-hour experiential workshop we will weave between theory and lots of practice, with partners or in a small group. You`ll get a taste of what empathy can look like -- and what it doesn`t look like. We`ll be sure to have fun in the process! Come get a taste of this work, it could transform your relationships for the better.\nAbout the Trainer: Roy Jacob is the founder of the Conscious Communication Academy. He has been facilitating retreats for the past 13 years, including Conscious Communication, the India Youth Jam, the EcoJam, Authentic Relating, Deep Ecology, and team retreats for NGO`s and companies. He also mediates and coaches people through conflicts. Roy grew up in the U.S. before finding his calling and coming to India (where his roots are) in 2003. Apart from facilitating, he enjoys farming, simple living, and watching the stars at night.\nGuidelines:\nYou`re in control. Choose how much you want to participate (or not)\nBe respectful of others, include keeping other people`s personal stories confidential\nUnderstand that this is not therapy (although it could be therapeutic)\nIf you like to speak a lot please give others space as well; and if you tend not to speak as much, your voice is welcome too!\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT782",
    "image": "https://attagalatta.com/admin/uploads/events/1368545558.png",
    "performer": "Roy Jacob",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-26T13:00:00+05:30",
    "endDate": "2024-10-26T15:00:00+05:30"
  },
  {
    "name": "The Write Step - Writers Group",
    "description": "The Write Step is a writers’ support group that hopes to foster and grow a community of writers who meet once a month to talk about the myriad aspects of writing. Writers in the making who haven’t published or written yet are most welcome. The aim is to devise a support group that sparks creativity.\nWhile each meeting will be around a certain predefined subject matter pertaining to the craft, there will be time set aside for the group to address individual queries.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT787",
    "image": "https://attagalatta.com/admin/uploads/events/782829641.jpeg",
    "performer": "Nandita Bose",
    "keywords": [
      "Writing",
      "Support Group"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-26T14:00:00+05:30",
    "endDate": "2024-10-26T16:00:00+05:30"
  },
  {
    "name": "Facts Meet Feelings - Writing Workshop for Beginners",
    "description": "This 2-hour workshop is designed for beginners who want to dive into the world of narrative non-fiction. We’ll explore how to transform true events and real experiences into compelling stories, focusing on structure, voice, research, and crafting scenes. By the end of the session, you’ll have tools to elevate factual writing into a dynamic, engaging narrative.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT788",
    "image": "https://attagalatta.com/admin/uploads/events/248476609.jpeg",
    "performer": "Sriram Devatha",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-26T15:30:00+05:30",
    "endDate": "2024-10-26T17:30:00+05:30"
  },
  {
    "name": "Indian Millenials - Book Talk",
    "description": "There are 440 million Millennials (born between 1980 and 1996) in India today. They constitute 34 per cent of the country’s population and 46 per cent of the workforce. They are the chief wage earners in most households. They are the first generation to grow up in a non-socialist economy. Consumerism permeates every single aspect of their lives. The food they eat, the workout regimes they follow, the language they speak, their professed ideological and political beliefs—all these are dictated by capitalism. Great bodies and English-speaking skills are crucial social aspirations—not only to boost their self-worth but also to make them stand out in the fledgling world of Indian dating. They are the first generation tasked with navigating a post-truth world where all assertions are double-faced, elastic, and subject to wilful misinterpretation. All these facets of the Millennial generation are speculated about but poorly understood.\n So, who are Indian Millennials, really? What are the attitudes and lifestyle choices that define their views on politics; gender and sexuality; work and income; caste and class; love, marriage, and family; mental health and well-being, and much, much more? In this eye-opening book, A. M. Gautam (a Millennial himself) travels across the country, meeting Millennials in small towns and big cities, to provide a fascinating account of one of the most distinctive generations of our time. Join him for an equally fascinating talk based on the book, where he will be in conversation with Swati Hegde.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT790",
    "image": "https://attagalatta.com/admin/uploads/events/217277275.jpg",
    "performer": "A. M. Gautam, \nSwati Hegde,",
    "keywords": [
      "Books",
      "Talk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-26T16:30:00+05:30",
    "endDate": "2024-10-26T17:30:00+05:30"
  },
  {
    "name": "My Stories - Sharing Session",
    "description": "“Remember that time we…”\nDo you find yourself reminiscing on good times often?\n \nWe all have that one memory, a special recollection that we hold close – unique snapshots of a moment, a person.\nAnd there’s usually one item – the one that carries a story, a memory, or maybe even a little piece of our heart. In this special MyStories event, let’s come together to celebrate those stories. Whether it’s a photo, a letter, a childhood toy, or something else entirely, we want to hear the story behind it.\nWhat is MyStories?\nMyStories are community gatherings where we sit down and gently talk about life. These are informal gatherings. Some will be facilitated by a mental health professional. Some not. But the objective is one: Can we speak? Can we have a conversation with each other? Can strangers meet and part as friends?\nMeet the host\nThis session is hosted by our co-founder and writer, Smitha Murthy. Smitha is the author of Worlds Apart, a memoir, and runs MyndStories with her old friend and foe, Swati Nair. One day, she dreams of a world where we build bridges through kindness and where mental health has no stigma.\nWhat should you bring?\nAn item you would like to speak about that holds special meaning for you. It can be anything that you hold close. Reminisce, recollect, retell. We want to hear you speak about the memory closest to your heart.\nWhat to expect from this session\nA typical MyStories event has a theme around which we open up and share our stories. For this event, ‘Memories’ is our theme. \nThis is a chance to bring something meaningful, sit in a supportive space, and share a memory that matters to you. At MyndStories, we believe in the power of sharing.\nSo, grab your special item and join us for an evening of connection and storytelling. Let’s make this a night of memories, shared experiences, and heartfelt conversations.\nWhat this session is not\n\nA dating session\nA networking meet-up\nStartup something or the other\n\nThis is a listen-and-learn-and-connect session. \nThe session does not include food and drinks. Any food or drinks can be bought from the cafe at the venue and will be paid for individually.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT789",
    "image": "https://attagalatta.com/admin/uploads/events/171373061.png",
    "performer": "MyndStories, \nSmitha Murthy,",
    "keywords": [
      "Wellness and Health",
      "Support Group"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-26T17:00:00+05:30",
    "endDate": "2024-10-26T18:30:00+05:30"
  },
  {
    "name": "Echoes of an Afterthought - Book Launch",
    "description": "Step into a world of verse and emotion! 🌿✨ Join us on October 26th, 2024 at Atta Galatta, Bengaluru, for the release of Tanay's Echoes of an Afterthought – a soul-stirring poetry collection that captures the beauty of life's quiet moments.\n⏰ 6:30 PM - 8:00 PM\n📍 Atta Galatta, Bengaluru\nCelebrate the art of poetry with us and be among the first to experience these powerful words. Don't miss it! 🖋️ #PoetryLaunch #EchoesOfAnAfterthought #Tanay #AttaGalatta #BengaluruEvents",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT784",
    "image": "https://attagalatta.com/admin/uploads/events/500456609.png",
    "performer": "Tanay Sengupta",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-26T18:30:00+05:30",
    "endDate": "2024-10-26T20:00:00+05:30"
  },
  {
    "name": "Gallery of Unspoken Tales - Curated Monologue Performances",
    "description": "The Gallery of Unspoken Words is an evening of English monologue performances curated by Bangalore Little Theatre under the mentorship and guidance of Abhay Toshniwal.\nThe theme Unspoken Tales stems from something very internal that we all experience - the things we wished we said in any situation. Many times we hold our silence because of fear, confusion, anger or sadness and often leads to that internal voice which gets trapped in our mind.\nThese monologue performances are to help set those voices and stories free.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT775",
    "image": "https://attagalatta.com/admin/uploads/events/614622114.jpg",
    "performer": "Abhay Toshniwal, \nBangalore Little Theatre,",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-26T19:00:00+05:30",
    "endDate": "2024-10-26T20:30:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT791",
    "image": "https://attagalatta.com/admin/uploads/events/1787640217.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-27T07:00:00+05:30",
    "endDate": "2024-10-27T09:00:00+05:30"
  },
  {
    "name": "Mouthful Of Stories - Family Storytime",
    "description": "On a beautiful Sunday evening, let’s get on to a Story carpet and travel on a 60-minute journey through stories of Food, People, Animals, Birds and Trees. With stories from folktales, mythology, history and oral narratives, when the carpet lands back in the children 's world, the kids and parents will be left with loads of laughter, smiles, and happiness. The session is for kids 4+ and families/parents etc.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT793",
    "image": "https://attagalatta.com/admin/uploads/events/3120292.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-27T11:00:00+05:30",
    "endDate": "2024-10-27T13:00:00+05:30"
  },
  {
    "name": "Divine Delicacies - Storytelling and Menu Tasting Session",
    "description": "Food is such an integral part of our lives that we cannot imagine any worship without food. Keeping this in mind, we welcome you to a unique experience where we shall serve you samples of prasadams from various temples and share stories of places of worship and the perceived food preferences of the divine. Join Aparna Jaishankar for Divine Delicacies, only at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT786",
    "image": "https://attagalatta.com/admin/uploads/events/1125724586.jpeg",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "Storytelling",
      "Performance and Menu Tasting"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-27T12:30:00+05:30",
    "endDate": "2024-10-27T14:30:00+05:30"
  },
  {
    "name": "Artsytale: Canvas of Stories - Painting Workshop",
    "description": "Join Us for a Unique Art Adventure: Canvas of stories\nGet ready to dive into a creative experience like no other! Whether you're an experienced artist or someone who's never picked up a brush, this event is all about fun, exploration, and collaboration.\nWho’s It For?\nAnyone looking to relax, have fun, and try something new!\nWhat's in Store?\nA blank canvas to express yourself through colours.\nMeet new people, share creative thoughts, and leave with a masterpiece.\nWhy Join?\nThis would be a whole new experience like no other, it’s all about having fun—no rules, no pressure. Just you, some paint, and endless possibilities!\nDate & Time:\n27th October, 4–6 pm\nLocation:\nAtta Galatta, Indiranagar\nAll materials are provided, so just come along! Let’s create and connect together and have a fun experience.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT792",
    "image": "https://attagalatta.com/admin/uploads/events/144383247.jpeg",
    "performer": "Brunda M",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-27T16:00:00+05:30",
    "endDate": "2024-10-27T18:00:00+05:30"
  },
  {
    "name": "Secrets of  Sari Storytelling - Immersive Styling Workshop",
    "description": "Like Bill Waterson-Calvin’s SpaceMan Spiff, if you too nurture an alter ego of becoming a sari storyteller, attend this session. It discusses tips and techniques to refine your sari styling and fashion storytelling. Okay, it does not promise to turn you into a chic sensation overnight, but it can make you mindful of telling your sari style story by managing your fashion image for the world. You can apply the learning to daily life. NOTE: The workshop is for a limited number of participants. We request you to register accordingly. Please carry a sari you love or dislike, your fave journal, and a pen.\nOBJECTIVES\n\nTo help you express your sari fashion identity in a safe circle of listeners.\nTo help you know the ground rules of mindful sari styling for SELF.\nTo help you learn the basics of sari story writing for SELF (read: for social media).\n\nFACILITATOR\nThe session is conducted by Bhawana Pingali, former Fashion Features Editor of FEMINA (Worldwide Media Ltd.—Times of India / BBC Magazines). She is a mother of a teen, has been an editor-educator for the last 19+ years, and is currently authoring a book with PENGUIN. Her articles have appeared in The Hindu, Hindustan Times-Mint Lounge, Time Out, Lonely Planet, Travel + Leisure, Maxim, Orissa Post, Signature-Oman, among others. She has taught at NIFT, Pearl Academy, Symbiosis Institute of Design, CEPT-Ahmedabad, IIM-A, British Council (TEFL-certified trainer), GD Goenka and Ansal Universities. Her heart now lies in teaching yoga, and reviving saris and rituals through fashion research lab REVASTRA.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT764",
    "image": "https://attagalatta.com/admin/uploads/events/583020367.png",
    "performer": "Bhawana Pingali",
    "keywords": [
      "Fashion",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-09T17:00:00+05:30",
    "endDate": "2024-11-09T19:00:00+05:30"
  }
]