[
  {
    "name": "Notes On A Marriage - A Novel - Book Launch",
    "description": "In his younger days, Alfred Hughes had been quite the Nineties revolutionary at his university in England, clad in faded army fatigues and smoking Cuban cigars. They called him Ché Freddo. His comradesinarms were Nido—Nitin—son of divorced Indian immigrants, and Eugenia—ardent admirer of Sylvia Plath, who believed that one had to sacrifice everything for a cause, be fearless in death. Into this mix came Anju Kale, of British Asian heritage, the only child of a disheartened Indian Marxist father and a submissive, but wealthy, English mother, and her entry into this tightly knit group caused all equations to shift and change.\nAs time goes by, Freddo gives up revolution for the security of a college professorship, Nido for a job at Goldman Sachs. Anju marries Freddo and tries to come to terms with his serial philandering, in a marriage precariously held together by middleclass sensibilities. And the devastating secret about what happened to Eugenia.\nUntil Anju too finds herself caught in an extramarital relationship. Trapped between the need for fulfilment and a love of stability, Anju must redefine what it means to be a family. In prose that is lyrical and beguiling, Selma Carvalho weaves a story about a marriage that is tender, startling and wise in turn.\nThis masterful work from the author of the remarkable fiction debut, Sisterhood of Swans, confirms Carvalho’s place in the literary firmament. Join us to discuss this book with Selma on 30th August, Friday, at 5.30 PM. She will be in conversation with noted editor and prolific author, Shinie Antony.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT707",
    "image": "https://attagalatta.com/admin/uploads/events/1254282549.png",
    "performer": "Selma Carvalho, \nShinie Antony,",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-30T17:30:00+05:30",
    "endDate": "2024-08-30T18:30:00+05:30"
  },
  {
    "name": "Underground Film Club - Monthly Film Screenings",
    "description": "At a time when we are spoilt for choice on what to watch, the best movies don't make it to streaming. And nothing beats the communal experience of watching a movie together. Join us for the first (literally) Underground film club in the city. \nAt Underground Film Club we usually screen forgotten gems or underappreciated masterpieces. But for the first time we bring you an unreleased independent film - It's all In your Head, by young talented filmmakers from 1719 Film Factory. Don't miss out on this very special screening!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT704",
    "image": "https://attagalatta.com/admin/uploads/events/291490373.jpeg",
    "performer": "Falah Faisal",
    "keywords": [
      "Film",
      "Film Screening"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-30T19:00:00+05:30",
    "endDate": "2024-08-30T21:00:00+05:30"
  },
  {
    "name": "Neurodiversity Meet - Meetup",
    "description": "Join us for an inclusive and joyful gathering celebrating neurodiverse minds at the Neurodiversity Meet, hosted by Neurodiverse.in. This event is all about creating a warm, welcoming space where you can share, learn, and connect with neurodiverse folk.\nHere’s what we have lined up:\n🌀 Fun icebreakers and games\n🎨 Mindfulness session\n🧠 Trivia\n🎁 Something special\nWe’ll also break into smaller groups for cozy, topic-based conversations. Come be part of this vibrant community, and let’s celebrate the beauty of thinking differently!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT703",
    "image": "https://attagalatta.com/admin/uploads/events/72006316.png",
    "performer": "Neurodiverse.in",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-08-31T14:00:00+05:30",
    "endDate": "2024-08-31T17:00:00+05:30"
  },
  {
    "name": "Park - Play",
    "description": "One park. Three men. Three Benches and yet not enough space for all.\nManav Kaul’s \"Park\" delves into the complicated relationship of humans with space. Who has the better right on the space? The ones who need it for convenience or the ones who have a history associated or the ones who actually occupy it now? Why are men ready to wage wars for a mere piece of land? Is it a matter of power, history, pride or just plain greed?\nThrough the lens of the park, Manav Kaul offers a commentary on the human condition, prompting the audience to reflect on their own lives and relationships.\nAavirbhaav Naatya Manch presents a play that takes place in a seemingly ordinary setting – a PARK – but transcends the mundane as it delves into the complexities of the characters’ lives.\nDirector - Avinash Jain & Vikash Kumar\nActors - Rahul Gome, Jayant Sethi, Yashodhar Upadhyay",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT677",
    "image": "https://attagalatta.com/admin/uploads/events/161060630.png",
    "performer": "Aavirbhaav Naatya Manch",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-31T16:30:00+05:30",
    "endDate": "2024-08-31T17:30:00+05:30"
  },
  {
    "name": "Park - Play",
    "description": "One park. Three men. Three Benches and yet not enough space for all.\nManav Kaul’s \"Park\" delves into the complicated relationship of humans with space. Who has the better right on the space? The ones who need it for convenience or the ones who have a history associated or the ones who actually occupy it now? Why are men ready to wage wars for a mere piece of land? Is it a matter of power, history, pride or just plain greed?\nThrough the lens of the park, Manav Kaul offers a commentary on the human condition, prompting the audience to reflect on their own lives and relationships.\nAavirbhaav Naatya Manch presents a play that takes place in a seemingly ordinary setting – a PARK – but transcends the mundane as it delves into the complexities of the characters’ lives.\nDirector - Avinash Jain & Vikash Kumar\nActors - Rahul Gome, Jayant Sethi, Yashodhar Upadhyay",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT677",
    "image": "https://attagalatta.com/admin/uploads/events/161060630.png",
    "performer": "Aavirbhaav Naatya Manch",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-31T19:00:00+05:30",
    "endDate": "2024-08-31T17:30:00+05:30"
  },
  {
    "name": "Chaw Chaw Bath 24.0 - Performance",
    "description": "Team “a” Productions is back on popular demand with the 24th    edition of its ensemble “Chaw Chaw Bath”. The unique blend of different art forms viz. Plays, monologues, Poetry, Stand-up Comedy, Mime and Storytelling is what define Chaw Chaw Bath’s popularity among audiences of various genres and interests. The stage is flavored by a host of emotions spread across the performances, guaranteeing wholesome entertainment. This time around, we bring you a true mélange of lingual diversity in the cultural amalgamation of Chaw Chaw Bath!\nPoetry: A poetry reading session to stir up your soul. After all, we dream of a world where the mind is without fear and knowledge is free.\nPlay (English): In this play, you will watch the protagonist struggle to keep his ego aside to take that step to a moment of realization where he knows exactly what he wants. Does he reach her, or does he run out of time?\nMonologue (English): The master of monologue indulged in the past event and how the memories are put together in bits and pieces with mixed feelings.\nStandup Comedy – English and Hindi: Headlining this rib-tickling experience like no other.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT700",
    "image": "https://attagalatta.com/admin/uploads/events/49688328.jpg",
    "performer": "Team 'A' Productions",
    "keywords": [
      "Comedy",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-01T18:30:00+05:30",
    "endDate": "2024-09-01T20:00:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Reflection Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other`s experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT682",
    "image": "https://attagalatta.com/admin/uploads/events/2080566301.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Social",
      "Support Group"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-09-08T17:00:00+05:30",
    "endDate": "2024-09-08T19:00:00+05:30"
  },
  {
    "name": "Returning Home - Workshop",
    "description": "How do I break free from the deep-rooted conditioning of shame, self-doubt and self-judgment and embrace my authenticity? How do I align with my life`s essence and emerge as a whole?\nIf you find yourself grappling with these questions,\nIf you are someone finding it challenging to navigate through your emotions and aspire to lead a harmonious life.\nOr a curious explorer willing to discover the mysteries of our bodies. We invite you to join the Audacious Circle where we dive deep into understanding life essence, the concept of audacious love and return to our bodies.\nThe Audacious Circle is an initiative by Yashika CG, an educator, author and yoga practitioner who is on a forever journey into the great unknown.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT669",
    "image": "https://attagalatta.com/admin/uploads/events/138855616.jpg",
    "performer": "Yashika C. G.",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-14T11:00:00+05:30",
    "endDate": "2024-09-14T14:00:00+05:30"
  },
  {
    "name": "Pen & Latte 4.0 - Story Writing Workshop",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT683",
    "image": "https://attagalatta.com/admin/uploads/events/419501552.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-15T11:11:00+05:30",
    "endDate": "2024-09-15T14:22:00+05:30"
  },
  {
    "name": "Infinitely Polar Bear - Mindful Cinema",
    "description": "\"Two emotions fighting each other to have control of you. Fights never end well. But being mindful around people who struggle with this fight every day is possible. Being at two poles of emotions is a conflict, confusion, embarrassment, and much more. Let`s know more about it!\"\nPrevention begins when we generate awareness and have empathy towards the happenings of our surroundings as well. Shraddha decided to screen cinema from the world to bring in some awareness about various aspects of mental health. The screening of the film will be followed by a discussion on the subject.\nOn 18th August 2024, we will screen the movie \"Infinitely Polar Bear\". It is an English movie with English subtitles on the father-daughter relationship.\nDirector and Writer: Maya Forbes\nCast: Mark Ruffalo and Zoe Saldana\nAfter the movie, there will be a facilitated discussion around \"Bipolar Disorder.\"\nFacilitator: Shraddha Modi, a psychologist and behavior therapist whose passion for mental health has motivated her to study and work in this field.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT696",
    "image": "https://attagalatta.com/admin/uploads/events/435924419.png",
    "performer": "Shraddha Modi",
    "keywords": [
      "Wellness and Health",
      "Film Screening"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-15T12:30:00+05:30",
    "endDate": "2024-09-15T14:30:00+05:30"
  },
  {
    "name": "Build-A-Book - Book Making Workshop",
    "description": "Build -A- Book is a carefully curated skill-based workshop about bookmaking. The participants will experiment together and learn how to transform ordinary household objects to repurpose them into journals and notebooks, and experiment with other materials!\nSaachi will be sharing all tips and tricks that she has learned and gathered over her 5 years of experience and practice with the skill. She will also be working with the participants to sharpen their observation skills and imagination to help them customise notebooks and journals to suit their needs and purpose.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT701",
    "image": "https://attagalatta.com/admin/uploads/events/816480318.jpg",
    "performer": "Saachi Pimprikar",
    "keywords": [
      "Book Making",
      "Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-15T15:00:00+05:30",
    "endDate": "2024-09-15T17:00:00+05:30"
  },
  {
    "name": "Screen Craft 2.0 - Screenplay Writing Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Screenplay Writing Workshop in town. \nOur Screenplay Writing workshop is an intensive program designed to guide aspiring screenwriters through the process of crafting compelling and marketable screenplays. This workshop provides participants with a solid foundation in screenplay structure, character development, dialogue writing, and industry-standard formatting, ensuring they are equipped to bring their stories to life on the big screen.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no screenwriting experience, as well as intermediate writers looking to refine their skills. It is also suitable for novelists, playwrights, or anyone interested in exploring the craft of screenwriting.\nWorkshop Objectives:\n- To introduce participants to the fundamentals of screenplay writing.\n- To develop participants` skills in creating engaging plots and well-rounded characters.\n- To enhance participants` abilities to write effective dialogue and visual storytelling.\n- To familiarize participants with the screenplay industry and submission processes.\nKey Components involves learning theory and practicals of: \n- Story and Character Development\n- Screenplay Structure\n- Dialogue Writing\n- Scene Construction\n- Visual Storytelling\n- Formatting and Style\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Writing a story based on a prompt.\n- Participating in the curated feedback discussion.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT685",
    "image": "https://attagalatta.com/admin/uploads/events/227598307.png",
    "performer": "MWM Movies",
    "keywords": [
      "Film",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-21T11:11:00+05:30",
    "endDate": "2024-09-21T14:22:00+05:30"
  },
  {
    "name": "Chapters Unsealed 4.0 - Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nBring along your favorite book and delve into a shared reading experience.\n \nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nSharing your views on favorite books.\nParticipating in the curated discussion.\nVoting for a Monthly Book Read.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT686",
    "image": "https://attagalatta.com/admin/uploads/events/1490616635.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-22T14:22:00+05:30",
    "endDate": "2024-09-22T17:55:00+05:30"
  },
  {
    "name": "Ranis of India - Storytelling",
    "description": "Ranis of India is a collection of stories from various oral, folk, mythical and historical narratives collected based on numerous travel and research over the last few years on the lesser-known or completely forgotten women rulers of this wonderful country by Vikram Sridhar.\nOver one hour, through oral story-telling smattered with folk songs, we travel the country, going deeper into many stories of Indian queens from myths, history and present times, whose stories need to be told and heard.\nFrom North to South, East to West there have been women rulers, administrators, changemakers who’ve changed and touched history strongly.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT681",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-28T20:00:00+05:30",
    "endDate": "2024-09-28T21:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT678",
    "image": "https://attagalatta.com/admin/uploads/events/1590760097.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-29T07:00:00+05:30",
    "endDate": "2024-09-29T09:30:00+05:30"
  },
  {
    "name": "Ranis of India - Storytelling",
    "description": "Ranis of India is a collection of stories from various oral, folk, mythical and historical narratives collected based on numerous travel and research over the last few years on the lesser-known or completely forgotten women rulers of this wonderful country by Vikram Sridhar.\nOver one hour, through oral story-telling smattered with folk songs, we travel the country, going deeper into many stories of Indian queens from myths, history and present times, whose stories need to be told and heard.\nFrom North to South, East to West there have been women rulers, administrators, changemakers who’ve changed and touched history strongly.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT681",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-29T20:00:00+05:30",
    "endDate": "2024-09-29T21:00:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Reflection Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other`s experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT684",
    "image": "https://attagalatta.com/admin/uploads/events/1778962806.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Social",
      "Support Group"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-10-06T17:00:00+05:30",
    "endDate": "2024-10-06T19:00:00+05:30"
  }
]