[
  {
    "name": "Food & Beverage Founder's Meet - Meetup by Bindu Rao",
    "description": "Calling all the Founders, Creators and Innovators in the Healthy eating space. This meet-up is designed exclusively to forge meaningful collaborations and connections worth your time.\nEvent Schedule:\n1) Introductions: 3 minutes per brand and it must cover your name, designation, brand name & how can you help others? (60 minutes)\n2) Snacks Break and Networking (30 minutes)\n3) Guided knowledge sharing about flea markets, getting connects for packaging, food consultants, recipe developers, sourcing candidates and collaborating on content and curations for mutual growth on social media. (35 minutes)\n4) Photography, Videography for Social Media (25 minutes)\nBindu Rao is a stand-up comedian turned food content creator and event coordinator who has conducted more than 1200 events across stand-up comedy, performance arts, food walks, founders only meets for the health conscious and beverage walks with Drickle Coffee (formerly Bonomi).\n- Ticket is inclusive of veg & gluten free food, we start and end on time for the event.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1578",
    "image": "https://attagalatta.com/admin/uploads/events/529755518.png",
    "performer": "Bindu Rao",
    "keywords": [
      "Business",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-03T11:00:00+05:30",
    "endDate": "2026-01-03T13:00:00+05:30"
  },
  {
    "name": "The Star - A performance by Bangalore Little Theatre Foundation",
    "description": "A heartwarming story about forgotten dreams and the magic of second chances. Based on the short story \"Patol Babu- Film Star\" by Satyajit Ray.\nRamesh Babu once dreamed of seeing his name on movie posters. Today, he lives a quiet, ordinary life with a dusty ceiling fan and a patient wife. When fate unexpectedly casts him in a film, the world he left behind flickers back to life. Is this his long-awaited moment of recognition—or merely a fleeting illusion?\nSet against the lively chaos of a film shoot and the warmth of home, the play gently reminds us that even the smallest moments can illuminate an entire life.\nBlending humour, nostalgia, and emotional depth, this high energy play, The Star celebrates rediscovering one’s passion and reminds us that it is never too late to dream again.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1585",
    "image": "https://attagalatta.com/admin/uploads/events/2098019472.png",
    "performer": "Bangalore Little Theatre Foundation",
    "keywords": [
      "Theatre",
      "Theatre Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-03T19:00:00+05:30",
    "endDate": "2026-01-03T20:15:00+05:30"
  },
  {
    "name": "Lahe Lahe Caravan presents “Harry Potter Book Discussion - Meetup by Sonali Bhatia",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1581",
    "image": "https://attagalatta.com/admin/uploads/events/1879395234.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-04T14:30:00+05:30",
    "endDate": "2026-01-04T16:00:00+05:30"
  },
  {
    "name": "Vanilla Hour - Book Launch with Neer Ya",
    "description": "Join us at Atta Galatta for the launch of Vanilla Hour by Neer Ya on 9 January, from 2:00PM – 5:00 PM. The author will be present to launch the book and speak about the writing and themes behind the novel.\nVanilla Hour follows Dr. Nandini Yadav, a geochemist and single mother who has rebuilt her life after years of trauma. When an unexpected reunion takes her back to Goa and to a relationship she thought she had left behind, she is forced to confront memories and choices she has long avoided.\nMoving between Delhi, Goa, and Tokyo, the novel explores love, loss, forgiveness, and the ways the past continues to shape the present. Blending elements of romantic suspense and literary fiction, Vanilla Hour is a thoughtful, emotionally grounded story about mothers and daughters, memory, and learning how to live without fear.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1583",
    "image": "https://attagalatta.com/admin/uploads/events/935278778.jpeg",
    "performer": "Neer Ya",
    "keywords": [
      "Book Discussion",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-09T14:00:00+05:30",
    "endDate": "2026-01-09T17:00:00+05:30"
  },
  {
    "name": "THE HORSE DID FLY: AND OTHER SHORT STORIES - Book Reading Balakrishna Adiga",
    "description": "Atta Galatta is excited to host a book reading by Balakrishna Adiga for his latest collection, The Horse Did Fly, on 9th January 2026, from 5:30 PM to 7:00 PM at our bookstore.\nThe Horse Did Fly is an incisive collection of urban tales, bringing everyday characters—teachers, clerks, and neighbours caught in hilarious and surprising twists—to life. Each story, inspired by true incidents, offers a sharp and unfiltered look at the ingenuity required to navigate modern life. From the absurdities of petty corruption to the challenges of 21st-century matchmaking, these stories promise to make readers laugh, reflect, and linger on the moments long after the final page.\nJoin us at Atta Galatta for an evening of reading, conversation, and storytelling with Balakrishna Adiga.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1586",
    "image": "https://attagalatta.com/admin/uploads/events/1300079943.jpeg",
    "performer": "Balakrishna Adiga",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-09T17:30:00+05:30",
    "endDate": "2026-01-09T19:00:00+05:30"
  },
  {
    "name": "Qu for Quiz - Quiz by Karthik Srinivasan and Ganesh Balakrishnan",
    "description": "The Qu for Quiz is based on a grid format with the grids formed by topics on one axis and level of difficulty (and hence the points) on the other. The topics could be varied like History, Sports, Music, Literature, Movies and more. A team of two members would get to choose a topic and the level of difficulty and the question would be revealed. The rest of the teams can go for the buzzer if they know the answer. Depending on the number of teams registering, the size of the grid would be decided. \nSAMPLE Qu: 2. The name is inspired by the traditional malt whisky distillation process in which malted barley was mixed by hand with shovels. This labor-intensive process often caused a shoulder injury to workers, causing their arms to hang low. Which brand is named thus? \nGanesh Balakrishnan is an entrepreneur, marketer and creator of terrible dad jokes. His claim to fame is attempting to sell shoes during the pandemic, culminating in a viral Shark Tank \"Down But Not Out\" appearance. He is a collector of useless facts since childhood, and has dabbled in trivia quiz circuits since college. ganesh.flatheads@gmail.com\r\nKarthik Srinivasan is a pseudo-retired software leader by choice, specializing in innovative ideas to spend time that include organizing cricket leagues at the scale of IPL but for free, staying up to date on latest debates in virtual social groups helmed by family and friends and more on similar lines. emailkarth@gmail.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1587",
    "image": "https://attagalatta.com/admin/uploads/events/165083966.png",
    "performer": "Karthik Srinivasan",
    "keywords": [
      "Quiz",
      "Quiz"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-09T19:00:00+05:30",
    "endDate": "2026-01-09T20:30:00+05:30"
  },
  {
    "name": "Meenu the Meemi - Book Launch by Dr.Sreelekha Kopparambil",
    "description": "A dream dialogue with a little fish, Meenu, changes Nandu's life and gives him a purpose. As he decides to champion a rare cause with grit and determination, he faces many hurdles. Will Nandu succeed in his mission? What is this mission that Nandu has taken up? Who helps him on the way? To know more read, Meenu the Meemi, a dream fantasy about how a little fish befriends a little boy and how it changes lives of many others. \n* Free entry so no tickets to the event.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1580",
    "image": "https://attagalatta.com/admin/uploads/events/1876509479.jpeg",
    "performer": "Dr.Sreelekha Kopparambil",
    "keywords": [
      "Book Discussion",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-10T11:00:00+05:30",
    "endDate": "2026-01-10T12:30:00+05:30"
  },
  {
    "name": "Make Your Own Comic - A Doodling Workshop",
    "description": "A fun, beginner-friendly doodling and comic-making workshop open to all ages. Participants will learn the basics of creating cute doodles, developing their own comic character, and understanding how to frame a simple comic strip. No prior drawing experience is needed — this workshop is all about exploring ideas and enjoying the process.\r\nAll materials will be provided. Just bring a fresh mind and curiosity.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1588",
    "image": "https://attagalatta.com/admin/uploads/events/1452954094.png",
    "performer": "Sowbarnika S",
    "keywords": [
      "Comics",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-10T11:00:00+05:30",
    "endDate": "2026-01-10T13:00:00+05:30"
  },
  {
    "name": "I’m Buzzin’: A Zine-Making Workshop - Workshop by Bazinega",
    "description": "A playful and powerful zine-making + storytelling workshop exploring the joy of independent publishing and self-expression through folded pages and storytelling. Open to everyone — whether you’re a seasoned artist, a curious beginner, or simply someone with something to say.\nWhat to expect:\n\n\nA short introduction to zines and their cultural, political, and artistic history\n\n\nInspiring examples of zines from around the world\n\n\nFun prompts to help you get started\n\n\nHands-on time to create your own 8-page zine\n\n\nGuidance on folding, layout, storytelling, and collage\n\n\nAn optional space to share your zine with others\n\n\nParticipants take home their own zine — and maybe make a few new friends.\nWhat to carry (optional):\r\nAny personal writing, poems, sketches, or images you’d like to include.\nAll materials will be provided. No prior experience needed.\n\nNote: Please arrive 10 minutes early. Tickets once purchased are non-refundable.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1589",
    "image": "https://attagalatta.com/admin/uploads/events/1324987960.png",
    "performer": "Bazinega",
    "keywords": [
      "Zine Making",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-10T17:00:00+05:30",
    "endDate": "2026-01-10T19:00:00+05:30"
  },
  {
    "name": "Let’s Walk - Book launch by Prakash Kannan",
    "description": "Join us for an intimate evening at Atta Galatta as we celebrate the launch of \"Let’s Walk\" by Prakash Kannan. This is more than just a book release; it is an invitation to explore the quiet, lingering moments that define our lives.\nThe Story: \"Let’s Walk\" is a poignant tale of two strangers brought together by chance. Set against the rhythmic backdrop of city life, the story explores the beauty of timing, the weight of unspoken words, and the type of love that stays with you long after the final page.\n \nThe Event Experience:\n· A Sneak Peek: Get an exclusive look into the heart of the story.\n· Meet the Author: Hear Prakash Kannan share his creative journey and the deep emotions that inspired this book.\n· Q&A: A chance to ask the author about the themes of timing and connection.\nLocation: Atta Galatta, Indira Nagar, Bengaluru Date: January 10, 2026 Time: 05:30 PM",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1579",
    "image": "https://attagalatta.com/admin/uploads/events/1849422911.jpg",
    "performer": "Prakash Kannan",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-10T17:30:00+05:30",
    "endDate": "2026-01-10T19:00:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup by The Listeners Circle",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1592",
    "image": "https://attagalatta.com/admin/uploads/events/2113108856.jpg",
    "performer": "The Listeners Circle",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-11T11:00:00+05:30",
    "endDate": "2026-01-11T13:00:00+05:30"
  },
  {
    "name": "BaggIt Yourself: A Finger Knitting Workshop - A Finger Knitting Workshop",
    "description": "A cozy and creative finger knitting workshop where participants will learn how to craft their own stylish bag, no needles required.\r\nAll materials will be provided, and participants will take home their finished bag along with any leftover yarn to continue creating.\r\nNo prior experience needed, just bring your fingers and your creativity.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1590",
    "image": "https://attagalatta.com/admin/uploads/events/563897385.png",
    "performer": "the crochet girl",
    "keywords": [
      "Knitting",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-11T14:00:00+05:30",
    "endDate": "2026-01-11T16:00:00+05:30"
  },
  {
    "name": " Hello 2026, Be Nice: An Art Journaling Workshop - An Art Journaling Workshop",
    "description": "A gentle, creative space for real and tired thoughts. This is not a goal-setting or resolution workshop. Instead, we slow down, talk, create, and document thoughts as they are, using art journaling to make 2026 feel a little less overwhelming and a lot more humane.\nWhat to expect:\n\n\nA brand-new journal for yourself\n\n\nCraft materials to explore junk journaling\n\n\nA pack of crayons\n\n\nGuided prompts and grounding activities\n\n\nTime to create, reflect, and have fun without pressure\n\n\nThis workshop is for you, whether you journal every day or have never journaled before. No experience or skills needed, just a little curiosity and the willingness to make 2026 feel less scary in your head.\nAll materials, including the journal, will be provided.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1591",
    "image": "https://attagalatta.com/admin/uploads/events/1846390207.png",
    "performer": "Your Journal Project",
    "keywords": [
      "Art Journaling",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-11T17:00:00+05:30",
    "endDate": "2026-01-11T19:00:00+05:30"
  },
  {
    "name": "Daphne du Maurier Reader Meetup - A Group discussion for Literature Enthusiasts",
    "description": "Daphne du Maurier’s writing is a haunting blend of atmosphere, suspense, and psychological depth. With her gift for crafting moody landscapes, ambiguous characters, and stories that linger long after the last page, she draws readers into worlds where the familiar becomes unsettling and the ordinary glimmers with mystery. From windswept Cornish cliffs to shadowed manor houses, her narratives explore love, identity, obsession, and the quiet menace of the unknown.\nHer novels and short stories – whether it’s the iconic Rebecca, the eerie tension of Jamaica Inn, or the chilling brilliance of “The Birds” – continue to captivate generations of readers who crave storytelling that is both immersive and unsettlingly beautiful.\nWhether you have long been enthralled by du Maurier’s atmospheric prose or are just beginning to step into her shadowed, intriguing worlds, you are warmly invited to join us this month as we gather to discuss, reflect, and lose ourselves in her unforgettable stories.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1595",
    "image": "https://attagalatta.com/admin/uploads/events/2070546948.png",
    "performer": "Lakshmi Sankar",
    "keywords": [
      "Literary Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-17T11:00:00+05:30",
    "endDate": "2026-01-17T12:00:00+05:30"
  },
  {
    "name": "Quiet Joys: A Gratitude Zine–Making Workshop - Workshop by Nitya Menon",
    "description": "Join us for an afternoon of quiet creativity. This workshop invites you to slow down, reflect on the small joys that often go unnoticed, and turn those moments into an 8-page gratitude zine. Through gentle prompts and simple illustration exercises, you’ll create a personal keepsake that captures what grounded you, moved you, or made you smile. It’s a reflective, hands-on session for anyone seeking a pause through creativity and mindful noticing. All materials will be provided, and no prior art experience is required.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1584",
    "image": "https://attagalatta.com/admin/uploads/events/1074968289.jpg",
    "performer": "Nitya Menon",
    "keywords": [
      "Zine Making",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-17T15:00:00+05:30",
    "endDate": "2026-01-17T16:30:00+05:30"
  },
  {
    "name": "Bad Daughter Book Salon - Book Discussion by Sangeeta Pillai",
    "description": "BECAUSE GOOD GIRLS DON’T CHANGE THE WORLD. For every woman who has been told she's \"too much,\" this is a memoir about becoming exactly who you're meant to be.\nSangeeta Pillai was called a \"Bad Daughter\" for defying the rigid expectations placed on \"good Indian girls.\" But in her rebellion, she found her voice. From a harrowing childhood in a Mumbai slum-haunted by a violent father and the brutal murder of her mother-this is a story of resilience. With a fire in her belly, she\nbattled patriarchy, chased her dreams, and built a new life in London, creating a successful podcast to inspire other women. Yet, all her success couldn't outrun the past. Faced with debilitating mental health, she explored many healing avenues from psychotherapy, hypnotherapy, EMDR, acupuncture to Tantra. But to truly heal, she had to go back to her birthplace: tropical Kerala to confront her deep trauma. There, she experienced the most profound spiritual transformation in Kerala's ancient temples. Sangeeta's powerful, spiritual and deeply inspiring journey shows us that healing means finding your way back home to yourself. Bad Daughter is an inspirational feminist memoir for every woman who wants to break free. Ultimately, it's a reminder that the courage to be your authentic self can transform your own life - and the lives of those around you.\nAuthor Description:\nSangeeta Pillai grew up in a Mumbai slum. Today, she is recognised as a leading voice for South Asian feminism globally. Award-winning podcaster, writer and feminist activist, Sangeeta is the creator of Masala Podcast (all about cultural taboos) which won 6 British Podcast Awards, 1 Audio Production Award & Spotify SoundUp 2018 award. She's also the founder of South Asian feminist network Soul Sutras. Sangeeta has been featured extensively in the press from BBC Radio, Guardian, Metro, Cosmopolitan, Evening Standard, Stylist, Eastern Eye to Huffington Post. As well as on giant billboards in New York, London, Dublin, Cardiff & Glasgow. She is also the creator of the Masala Monologues series of writing workshops & theatre shows in the UK & the US. Sangeeta is a regular speaker at WOW Festival, Podcast Show London, Shameless Festival, Primadonna Festival as well as being a regular speaker on innumerable panels and podcasts.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1594",
    "image": "https://attagalatta.com/admin/uploads/events/1492321805.png",
    "performer": "Sangeeta Pillai",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-18T18:00:00+05:30",
    "endDate": "2026-01-18T19:00:00+05:30"
  },
  {
    "name": "Brand Basics for First-Time Entrepreneurs - Workshop by Sudhir Kiran",
    "description": "A space for people who want to start or grow a business but feel lost in branding, storytelling, and marketing. This workshop will help entrepreneurs communicate better, build trust, and move forward with confidence without jargon or overwhelm.\nWho is this for?\nFirst-time entrepreneurs, professionals thinking of starting something on the side, freelancers who want clarity and confidence & MSME owners who wish to understand branding without jargon and students or anybody interested in starting a business.\nWhat do participants get from the workshop?\n\nClarity in their brand messaging\nA simple framework to build a business/ visual identity\nPractical marketing steps they can apply immediately\n\r\n\tEmail sudhirkirangn@gmail.com for more details.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1596",
    "image": "https://attagalatta.com/admin/uploads/events/1588876565.png",
    "performer": "Sudhir Kiran",
    "keywords": [
      "Business",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-25T11:00:00+05:30",
    "endDate": "2026-01-25T13:00:00+05:30"
  },
  {
    "name": "Ta Ka Dhi Mi - Book Launch by Shyama Panikkar",
    "description": "The event marks the launch of the much awaited book, Ta Ka Dhi Mi 2358, by author Shyama Panikkar. It is the 4th book in her series of music books for children. After the launch and a session by Shyama around the new book, her students will do a hindustani classical performance for the audience with live tabla.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1598",
    "image": "https://attagalatta.com/admin/uploads/events/2146744333.jpeg",
    "performer": "Shyama Panikkar",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-25T16:00:00+05:30",
    "endDate": "2026-01-25T18:00:00+05:30"
  },
  {
    "name": "Aging (Un)Gracefully - Book Discussion with Lalita Iyer",
    "description": "In her memoir, Lalita reflects on ageing as something far more layered than simply “getting old”. She looks at it as a disruption — a moment when women begin to see themselves differently, take stock of friendships, rethink their roles, and slowly come into who they really are.\nShe asks simple but disarming questions: When do we actually become old? And how is coping with ageing any different from coping with puberty?\nThrough personal stories and observations, Lalita writes about losing estrogen, gaining perspective, building new tribes, and learning to live with bodies that are changing — with a mix of honesty, curiosity, and humour. For her, ageing becomes both a process of growing up and a kind of liberation.\nJoin us for an intimate reading and conversation around the themes of ageing, identity, and what it means to keep evolving.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1597",
    "image": "https://attagalatta.com/admin/uploads/events/625019098.jpeg",
    "performer": "Lalita Iyer",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-28T17:00:00+05:30",
    "endDate": "2026-01-28T18:00:00+05:30"
  },
  {
    "name": "Food In Literature - Book Club with Prachi Grover",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.  So, if viewing the world through the lens of food and literature interests you, then join us for a dialogue on “Food in Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we read our way through several powerful (and delicious) narratives.\nJanuary Read: In the Beginning there was Bombay Duck by Pronoti Datta\nWe assure you that you will enjoy every single bite! The session is free but registration is a must as we have limited spots available. \n \nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who love to read and eat!\nWhen: Saturday, 31st January, 2026 at 11 a.m.\nWhere: Atta Galatta Bookstore, Indira Nagar\nAges: 18+\nRegistration is mandatory (link in bio)\nCopies of the book are available at the store.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1582",
    "image": "https://attagalatta.com/admin/uploads/events/1865055897.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Literature",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-31T11:00:00+05:30",
    "endDate": "2026-01-31T13:00:00+05:30"
  }
]