[
  {
    "name": "What's For Dinner?  - Proposal Writing Workshop",
    "description": "Are you an arts practitioner in Bengaluru? A filmmaker, poet, musician, author, designer, curator, dancer, painter...?\nHave you ever wondered how to approach writing a proposal for a grant, or a scholarship or for sponsorship...?\nWhether your ask is small or big, for money or for support in kind, whether you have been successful or unsuccessful in the past, if you have something brewing and want a dash of freshness... This 2-hour workshop will put proposal writing in a whole new light.\nConceived as a 6-step guide on how to prepare a meal for a guest, it will make you pause to think of:\nStage I: The Guest for Dinner\nState II: The Menu\nStage III: The Recipe and Ingredients\nStage IV: Cooking Processes\nState V: Plating and Presentation\nStage VI: Pre Dinner-Pleasantries\nCome. Cook up a proposal.\n--\nArundhati Ghosh is a writer and cultural practitioner based in Bangalore with three decades of experience in the arts and culture. She served as the Executive Director of India Foundation for the Arts (IFA) between 2013 and 2023.\nHer awards include the Global Fundraiser Award from Resource Alliance, Chevening Clore Leadership Award (2015-2016), Chevening Gurukul Scholarship at the London School of Economics (2005-2006), and Salzburg Global Seminar Fellowship.\nIn her professional capacity first as a fundraiser and then Executive Director at IFA, she has raised funds from foundations, trusts, corporations, bilateral agencies and individuals, across programmes and projects.\nShe has contributed on advisory panels and boards of the Seagull Foundation for the Arts, Blind with Camera and Toto funds the Arts, and continues to sit on the advisory panel for The Museum of Art and Photography (MAP), Bangalore and is a Board Member of Sangama, Bangalore an organisation working for the rights of sexual minorities, sex workers and people living with HIV.\nShe writes for publications such as Scroll, The Wire, The Hindu, The Deccan Herald, News 9, Himal, Business Standard, etc.\nInstructions\nPlease come with an idea or a need for support, this will make the workshop more relevant and less of an academic exercise.\nPlease bring your own writing implements - paper and pens/pencils - and a refillable water bottle.\nPlease be on time.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT753",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Arundhati Ghosh",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-04T16:00:00+05:30",
    "endDate": "2024-10-04T19:00:00+05:30"
  },
  {
    "name": "Unoccupy - Film Screening",
    "description": "Where Olive Trees Weep is a searing window into the struggles and resilience of the Palestinians under Israeli occupation. It explores themes of loss, trauma, and the quest for justice. We follow, among others, Palestinian journalist and therapist Ashira Darwish, activist Ahed Tamimi, Israeli journalist Amira Hass, and Dr. Gabor Maté’s trauma-healing work with women tortured in Israeli prisons. Ancient landscapes bear deep scars, having witnessed the brutal reality of ancestral land confiscation, expulsion, imprisonment, home demolition, water deprivation, and denial of basic human rights. Through a veil of oppression, we glimpse resilience – deep roots that have carried Palestinians through decades of darkness and shattered lives. This film lays bare the humanity of the oppressed while grappling with the question: what makes the oppressor so ruthlessly blind to its own cruelty?\nOrganised by End The War On People.\nAbout the Screening: End The War On People brings to you 'Unoccupy' as a call to refuse to accept the normalisation of the apartheid and genocidal state of Israel while it exports its fascist model to India and the world.\nWe refuse to look away as Israel uses cultural platforms to ‘artwash’ the ongoing annihilation of Gaza & West Bank and its attacks on Lebanon.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT763",
    "image": "https://attagalatta.com/admin/uploads/events/1406901723.jpg",
    "performer": "End The War",
    "keywords": [
      "Film",
      "Screening"
    ],
    "@type": "ScreeningEvent",
    "startDate": "2024-10-04T19:30:00+05:30",
    "endDate": "2024-10-04T21:00:00+05:30"
  },
  {
    "name": "Dyslexia Beyond Challenges - Session",
    "description": "In celebration of Dyslexia Awareness Month this October, Giftolexia Solutions in collaboration with Atta Galatta is organizing a special event at Atta Galatta – The Bookstore, Bangalore, on 5th October. This initiative aims to raise awareness about dyslexia, focusing on the strengths of individuals with learning challenges and the importance of acceptance and support.\n10 to 15% of people worldwide have some form of learning challenge. This program will shed light on how we can embrace their unique abilities and provide the necessary tools for success.\nJoin us for an inspiring session designed to empower each one of you.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT757",
    "image": "https://attagalatta.com/admin/uploads/events/1914705753.png",
    "performer": "Teena Paul, CEO & Founder, Giftolexia",
    "keywords": [
      "Wellness and Health",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-05T11:00:00+05:30",
    "endDate": "2024-10-05T12:30:00+05:30"
  },
  {
    "name": "Pen & Latte 5.0 - Story Writing Workshop",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT736",
    "image": "https://attagalatta.com/admin/uploads/events/2004387093.png",
    "performer": "Aparajita Sharma, \nYour View On Books,",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-05T11:11:00+05:30",
    "endDate": "2024-10-05T14:22:00+05:30"
  },
  {
    "name": "Comics and Animation Workshop for Beginners - Workshop",
    "description": "An experience into the world of Bakarmax - India’s hottest comics and animation studio.\nGet to know the basics of cartooning and animation.\nWe`ll first remove your fear of drawing with simple exercises - making circles, cartoons, and panels, while we take you through different drawing types and our own methods.\nAfter getting comfortable with drawing exercises, we will explore how comics tell stories using a sequence of images and animation takes this sequence into another pace. We will attempt our own comic and animated flipbook (as seen in Taare Zameen Pe)\nDuring the break, we will give you an inside tour of a typical cartoonist and animator’s studio - our tools, comics and animation under work, projects, inspirations. You can also buy our graphic novels.\nNext, after the break, we will take you through our process when it comes to ideas and stories. We will create fun stories using mundane examples.\nWe will introduce you to other amateur cartoonists to inspire you. In the end, we will share resources and methods for you to continue drawing - the same way that we did years ago. \nAt the very end, we will screen some of our sketches and episode of a very special show we are making - strictly confidential.\nOther things to note:\nCartooning and Animation can be ✨therapeutic✨.\nAttempt this once and we are sure you’ll be doodling through rest of your life (and meetings).",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT744",
    "image": "https://attagalatta.com/admin/uploads/events/166952260.jpg",
    "performer": "Bakarmax",
    "keywords": [
      "Comics",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-05T16:00:00+05:30",
    "endDate": "2024-10-05T20:00:00+05:30"
  },
  {
    "name": "In Pursuit of Freedom - Book Talk",
    "description": "Embark on a resplendent journey alongside acclaimed writer Pradeep Damodaran, as he follows the fault lines of freedom and independence in contemporary India and paints a vivid portrait of a nation in flux.\nDamodaran travels the length and breadth of the country--from places that played an important role in the Independence movement, such as Sabarmati, Dandi and Jhansi, to sites of contemporary significance, like Nandigram, Unnao and Kudankulam--meeting survivors of riots, descendants of freedom fighters, social workers, environmental activists, farmers and ordinary citizens to discover what freedom means to them.\nA genre-bending book, In Pursuit of Freedom touches upon several critical issues--religion, economic disparity, gender, environment, politics--as it blends travelogue and memoir, history and current affairs. Spectacular and insightful, this on-the-ground narrative of today's India is a must-read. Join us for an introduction to the man behind the book, as Pradeep will be hosting a talk based on his work at Atta Galatta on 6th October at 3.30 PM!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT762",
    "image": "https://attagalatta.com/admin/uploads/events/1910550094.jpg",
    "performer": "Pradeep Damodaran",
    "keywords": [
      "Books",
      "Talk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-06T15:30:00+05:30",
    "endDate": "2024-10-06T16:30:00+05:30"
  },
  {
    "name": "Perspective Drawing Secrets - Drawing Workshop",
    "description": "Perspective Drawing for Everyone\nJoin us for a fun and exciting workshop called \"Perspective Drawing for Everyone\"! This event is perfect for all levels who want to learn how to turn 2D sketches into 3D.\nWhy It's Important:\n\nCreate Realistic Art: Learn how to make your drawings look real and three-dimensional. Imagine drawing a road that looks like it stretches far into the distance or a building that looks tall and grand. Perspective drawing makes your art pop off the page!\nBoost Your Imagination: Perspective drawing helps you bring your creative ideas to life. Whether you're designing a cool cityscape or a fantasy world, understanding perspective will make your drawings more believable and exciting.\nImpress Your Friends: Imagine showing your friends a drawing of a skateboard park that looks like you could step right into it! Learning perspective will make your artwork stand out and impress everyone who sees it.\nHave Fun with Art: Most importantly, perspective drawing is fun! You'll get to experiment with different techniques, learn new skills, and enjoy creating amazing artwork.\n\nJoin us for \"Perspective Drawing for Everyone\" and discover the magic of making your drawings come to life!\nWhat will be provided?\n\nAll the needed materials will be provided\nSte-by-step instructions to get acquainted with the concepts\n\nMentor\n\r\nRaju Dyapur (worldofpaintings.com) has been teaching Fine Art and Vedic Mathematics for more than 6 years and conducting workshops in India since 2014. His experience in drawing/fine art comes from his learning in school and college and the training he got from private lessons in Russia.\nHis artworks are in private collections in UK, Middle East, USA, Canada, Russia and Singapore and conducted hundreds of workshops across the nation and abroad.\nRaju Dyapur was selected as one of the artists for WTC The Hague Art Gallery, Netherlands",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT674",
    "image": "https://attagalatta.com/admin/uploads/events/2132961830.jpg",
    "performer": "Raju Dyapar",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-06T16:00:00+05:30",
    "endDate": "2024-10-06T18:00:00+05:30"
  },
  {
    "name": "Crafting Your Ikigai Blueprint - Wellness Workshop",
    "description": "Atta Galatta and Dr. Divyanshi warmly invite you to a transformative journey of self-discovery through this Ikigai workshop.\nTrue Ikigai is much deeper than the simplified, westernized diagram you may have seen. It’s not just about the intersection of what you love, what you’re good at, and what pays the bills—it’s a profound connection to life itself. It’s a sense of purpose that transcends personal fulfillment and speaks to the joy of simply being alive, regardless of circumstances. In this Ikigai Workshop, you’ll dive beyond the surface-level interpretations to explore the authentic essence of Ikigai, rooted in Japanese culture and philosophy.\nThroughout the workshop, you’ll be guided through reflective exercises, guided meditations, introspective prompts and insightful discussions to explore the core elements of your purpose. Whether you feel stuck in your current routine, are searching for new directions, or simply want to live a more fulfilling life, this workshop will help you identify your personal Ikigai. Through self-reflection, guided activities, and group sharing, you’ll leave with clarity on how to live with intention, satisfaction, and a renewed sense of direction.\n\nWho Should Attend? \r\nThis workshop is perfect for anyone seeking more clarity and purpose in life. Whether you're navigating career transitions, looking for personal fulfillment, or simply curious about the Ikigai philosophy, this workshop is open to anyone aged 16 and above. No prior experience or background is needed.\n\nWorkshop Objectives:\r\n- To guide participants in understanding and applying the Ikigai framework in their lives.\r\n- To encourage self-reflection on passions, skills, and values.\r\n- To provide tools for aligning life choices with deeper purpose.\r\n- To create a supportive space for personal growth and sharing insights.\n\nCommunity Guidelines:\r\n- Be open, be civil, be kind.\r\n- Listen with respect and speak with intention.\r\n- Keep the conversation constructive and supportive.\n\r\nONLY 7 SEATS AVAILABLE\r\nWe aim to create an intimate and focused experience, ensuring personalized attention, deeper discussions, and space for meaningful reflection.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT752",
    "image": "https://attagalatta.com/admin/uploads/events/726112441.png",
    "performer": "Dr. Divyanshi",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-06T17:00:00+05:30",
    "endDate": "2024-10-06T20:00:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Reflection Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other`s experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT684",
    "image": "https://attagalatta.com/admin/uploads/events/1778962806.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Social",
      "Support Group"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-10-06T17:00:00+05:30",
    "endDate": "2024-10-06T19:00:00+05:30"
  },
  {
    "name": "Polaroids - Life In Snapshots - Book Launch",
    "description": "We are delighted to invite you to the launch of Shivangi Jain’s debut book, Polaroids – Life in Snapshots. Shivangi, a psychologist, writer, and creative powerhouse, invites you to experience life’s fleeting moments captured in her stunning collection of poems.\nThe evening will begin with the official book launch, followed by an exclusive author interview conducted by Swathi Shetty, filmmaker and founder of Elderworld. The event will wrap up with a book signing and audience interaction, accompanied by light refreshments.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT760",
    "image": "https://attagalatta.com/admin/uploads/events/1621031273.jpg",
    "performer": "Shivangi Jain",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-06T18:30:00+05:30",
    "endDate": "2024-10-06T19:30:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nOctober Read: A Touch of Salt by Anita Agnihotri. Translated by Arunava Sinha\nWe assure you that you will relish every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT758",
    "image": "https://attagalatta.com/admin/uploads/events/1722056.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-19T11:00:00+05:30",
    "endDate": "2024-10-19T13:00:00+05:30"
  },
  {
    "name": "Don't Stop Acting 2.0 - Acting Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Acting Workshop in town. \nJoin fellow aspiring actors and actresses for an inspiring session of learning acting through basics at our Writers Club Meet event in the cozy ambiance of the library cafe. Our Acting workshop is designed for aspiring artists who wish to explore the fundamentals of acting and develop their performance skills in a supportive and engaging environment. This immersive workshop offers participants a thorough grounding in acting techniques, character development, and scene work, providing them with the tools needed to bring authenticity and depth to their performances.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no acting experience, as well as intermediate actors looking to refresh their skills. It is also suitable for anyone interested in improving their public speaking and presentation abilities.\nWorkshop Objectives:\n- To introduce participants to the basic principles of acting.\n- To develop participants` abilities to create believable and compelling characters.\n- To enhance participants` skills in scene study and script analysis.\n- To build participants` confidence in performing in front of an audience.\nKey Components involves learning theory and practicals of: \n- Acting Techniques\n- Character Development and Analysis\n- SCript Analysis and Interpretation\n- Understanding Director`s Vision\n- Conveying Emotions\n- Physicality and Movement of Camera\n- Improvization and Spontaneity\n- Voice and Diction\n- Working with Props and Costumes\n- Rehearsals and Performances\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Participating in workshop with enthusiasm.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT737",
    "image": "https://attagalatta.com/admin/uploads/events/217366545.png",
    "performer": "MWM Movies",
    "keywords": [
      "Film",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-19T11:11:00+05:30",
    "endDate": "2024-10-19T14:22:00+05:30"
  },
  {
    "name": "Noor Inayat Khan - Theatre Performance",
    "description": "The play - Noor is a reconstruction of the story of Noor Inayat Khan, a direct descendant of Tipu Sultan, who served in Britain’s Special Operations during World War II. It is an extraordinary tale of devotion to duty, resilience in the face of Nazi oppression in France. A fascinating life of a woman who defied all labels in her own quiet way - daughter of a Sufi pacifist who joined the war yet didn`t want to kill anyone, an Indian origin woman who served a country that colonised India, a demure looking woman with extraordinary inner strength. Her story is brought to life as a ‘Courtyard Theatre’ production, a format developed by BLT. A team of two actors who play different characters with very minimal props and sets, lights and sounds.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT759",
    "image": "https://attagalatta.com/admin/uploads/events/621271238.png",
    "performer": "Bangalore Little Theatre",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "TheatreEvent",
    "startDate": "2024-10-19T16:30:00+05:30",
    "endDate": "2024-10-19T17:30:00+05:30"
  },
  {
    "name": "Manga Mochas 1.0 - Manga and Comics Fan Meet",
    "description": "Atta Galatta and Your View on Books, Novel Club cordially invite you to the unique Manga Mochas, a fans meet for Comics & Manga readers.\nAre you a Manga maven or a comic connoisseur? Have you ever wanted to share your passion, connect with like-minded enthusiasts, and debate the finer points of your favorite stories? Well, your wait is over!\nCalling all voracious readers of Manga, comics, and graphic novels! Join us for an exhilarating in-person meet-up where you can express YOUR views, discuss your beloved series, and meet fellow aficionados!\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\n \nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolising the conversation.\nEvent Sections:\n1. Icebreaker Extravaganza: Kick things off with a fun game and introduce yourself. Let`s warm up the crowd!\n2. Manga Mochas: Step into the spotlight for 5-7 minutes and share your passion for your favorite Manga or comic. No slides, just pure enthusiasm!\nINTERMISSION: Chill & Chat\n3. Fun & Games: Prepare for laughs with another engaging game.\n4. What’s Next? Discuss and vote on the next Manga, comic, or graphic novel we’ll dive into!\n5. Special Surprise Activity: Stay tuned for an exciting twist!\n6. Photo Op: Say \"cheese\" for our group picture!\nCurated Books for Discussion on Monthly Reads:\n- The Maus Chapter I (Graphic Novel) by Art Spigelman\n- Batman Year One (Comics) by Frank Miller\n- Rave Master (Manga) by Hiro Mashima\n- Saga Volume One (Comics) by Brian K. Vaughan\n- Palestine (Graphic Novel) by Joe Sacco\n- Noragami Volume 1 (Manga) by Adachitoka\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT739",
    "image": "https://attagalatta.com/admin/uploads/events/329144806.png",
    "performer": "MWM Movies",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-20T14:22:00+05:30",
    "endDate": "2024-10-20T17:55:00+05:30"
  },
  {
    "name": "Junior Detectives: Mystery Hunters - Session",
    "description": "So you want to be a detective? Do you love reading mystery books? Then put on your thinking caps and get your magnifying glasses ready!\n- Create your own secret codes\n- Learn about fingerprints\n- Test your observation skills\n-Find clues and solve a mystery\nAll participants get one free copy of The Egghead Detective Agency Vol. 1!\nPika Nani is a children’s author based in Bengaluru. Her popular titles include, The Egghead Detective Agency Vol 1 and 2, an interactive chapter book with two little girls and a ghost detective. The Adventures of Shrilok Homeless Vol 1 & 2, an Indian version of Sherlock Holmes set in Mumbai. Little Indians: Stories from across the country, a bestselling fact plus fiction book. Five of her stories appear in school text books by Orient Blackswan and Macmillan.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT754",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Pika Nani",
    "keywords": [
      "Books",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-20T16:30:00+05:30",
    "endDate": "2024-10-20T17:30:00+05:30"
  },
  {
    "name": "Pichwai Art Workshop - Art Workshop",
    "description": "Come, let’s celebrate Krishna and his Leelas through the beautiful art form of Pichwai Paintings. It is a traditional art form that dates back to the 16th century from the city of Nathdwara, Rajasthan. These paintings portray Krishna (Srinath ji) and his leelas through bright and vivid colours.\nPichwai means backdrops, these paintings were used as backdrops mainly in Srinathji Temple at Nathdwara. The paintings are a way for us to connect with the Lord Krishna.\nThis art is soul-satisfying and divine, another art form to start with your basic art skill. You need no prior knowledge of drawing or painting in order to attend this workshop.\nNO TRACING OR COPYING, you will be drawing on your own.\nSrinathji will be taught in this workshop and some of the required basic pichwai motifs.\nNote: All the materials will be provided by the host.\nWhat will you take home?\nKnowledge of Indian Art Culture\nLearn an ancient art form\nCompleted piece of artwork done by yourself\nWhat do you need to bring?\nWater bottle to keep you hydrated.\nThis workshop includes all materials, if required kindly get an Examination Pad / Paper Board also maybe a pro circle if available.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT761",
    "image": "https://attagalatta.com/admin/uploads/events/395599221.png",
    "performer": "Sindhoor Suryavamshi",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-26T11:00:00+05:30",
    "endDate": "2024-10-26T14:00:00+05:30"
  },
  {
    "name": "Secrets of  Sari Storytelling - Immersive Styling Workshop",
    "description": "Like Bill Waterson-Calvin’s SpaceMan Spiff, if you too nurture an alter ego of becoming a sari storyteller, attend this session. It discusses tips and techniques to refine your sari styling and fashion storytelling. Okay, it does not promise to turn you into a chic sensation overnight, but it can make you mindful of telling your sari style story by managing your fashion image for the world. You can apply the learning to daily life. NOTE: The workshop is for a limited number of participants. We request you to register accordingly. Please carry a sari you love or dislike, your fave journal, and a pen.\nOBJECTIVES\n\nTo help you express your sari fashion identity in a safe circle of listeners.\nTo help you know the ground rules of mindful sari styling for SELF.\nTo help you learn the basics of sari story writing for SELF (read: for social media).\n\nFACILITATOR\nThe session is conducted by Bhawana Pingali, former Fashion Features Editor of FEMINA (Worldwide Media Ltd.—Times of India / BBC Magazines). She is a mother of a teen, has been an editor-educator for the last 19+ years, and is currently authoring a book with PENGUIN. Her articles have appeared in The Hindu, Hindustan Times-Mint Lounge, Time Out, Lonely Planet, Travel + Leisure, Maxim, Orissa Post, Signature-Oman, among others. She has taught at NIFT, Pearl Academy, Symbiosis Institute of Design, CEPT-Ahmedabad, IIM-A, British Council (TEFL-certified trainer), GD Goenka and Ansal Universities. Her heart now lies in teaching yoga, and reviving saris and rituals through fashion research lab REVASTRA.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT764",
    "image": "https://attagalatta.com/admin/uploads/events/583020367.png",
    "performer": "Bhawana Pingali",
    "keywords": [
      "Fashion",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-09T17:00:00+05:30",
    "endDate": "2024-11-09T19:00:00+05:30"
  }
]