[
  {
    "name": "Petals and Pavement:  A Story Walk - A Story walk through Love , flowers and Secrets by Vikram Sridhar",
    "description": "Valentine and Flowers, Coffee and Roses, Betel leaves and Strawberries, as we look around there is a love tale behind everything that blooms around us. The Story walk explores the many tales of Love through Flora, Nature, people, mythology and time. Over the 90 minute slow walk, the walk explores Loves through Heritage, Folklore and Ecology.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1657",
    "image": "https://attagalatta.com/admin/uploads/events/",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-14T08:00:00+05:30",
    "endDate": "2026-02-14T09:30:00+05:30"
  },
  {
    "name": "Tea-rapy - With Dr. Gokul Ratakonda & Kvira Organics",
    "description": "Get ready to pour a cup of clarity at Tea-rapy—a soulful blend of clinical insight and sensory mindfulness. This isn't your average therapy session; it’s an immersive experience designed to help you navigate the complexities of connection while grounding your senses.\nWe’re bringing in Dr. Gokul Ratakonda, a practicing clinical psychologist, to lead a deep dive into the heart of modern dating and long-term partnerships. Alongside a curated tea ceremony and tasting by Kvira Organics, this event offers a serene space to explore the internal and external facets of love.\nWhat to Expect:\nThe Deep Dive: An open forum to ask Dr. Ratakonda your most pressing questions about relationship dynamics and emotional health.\nMindful Moments: Experience guided meditations to center your thoughts and calm the nervous system.\nSetting the Standard: Learn practical tools for establishing healthy boundaries and defining your relationship goals for the year ahead.\nSensory Soothing: Sip and savor premium blends from Kvira Organics as you learn the art of the tea ceremony.\nWhether you’re looking to heal, grow, or simply find balance, come prepared to sip, speak, and set your intentions. It’s restorative, it’s enlightening, and it’s exactly the \"me-time\" your heart deserves.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1659",
    "image": "https://attagalatta.com/admin/uploads/events/1782277217.png",
    "performer": "Dr. Gokul Ratakonda , \nKvira Organics,",
    "keywords": [
      "Wellness and Health",
      "Support Group"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-14T11:00:00+05:30",
    "endDate": "2026-02-14T13:00:00+05:30"
  },
  {
    "name": "A Right Royal Affair - A Book Talk with Prajwal Hegde and Shinie Antony",
    "description": "What happens when an eco-warrior prince meets a coffee-obsessed entrepreneur?\nWe’re hosting Prajwal Hegde to talk about her new book, You Can’t Be Serious! She’ll be joined by Shinie Antony for a chat about the chaos of North-meets-South romances, royal scandals, and why we’re all still suckers for a good rom-com.\nWhat better way to spend Galentines day than live out our Royal fantasies!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1658",
    "image": "https://attagalatta.com/admin/uploads/events/1054650329.png",
    "performer": "Prajwal Hegde, \nShinie Antony,",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-14T14:15:00+05:30",
    "endDate": "2026-02-14T15:00:00+05:30"
  },
  {
    "name": "Atta Galatta presents “AG Book Club” - Monthly Book Club with Palgun KJ",
    "description": "What have you been reading? Come, discuss your latest read. Each member gets 5-7 minutes to talk about the book, theme, plot, with 2 minutes to answer any questions others might have. This month’s special focus will be translations- come tell us what you've been reading.\nFebruary’s special focus will be on Romance and Erotica",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1660",
    "image": "https://attagalatta.com/admin/uploads/events/1364428833.png",
    "performer": "Palgun KJ",
    "keywords": [
      "Book Club",
      "Book Talk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-14T15:00:00+05:30",
    "endDate": "2026-02-14T17:00:00+05:30"
  },
  {
    "name": "Steeped in Scandal - An intimate tea-time session with Anuja Chadramouli",
    "description": "Known for her sweeping tales of mythology and history, Anuja is stepping away from the epic battles to indulge in some delicious, modern-day gossip with us. This isn’t your average literary talk—this is your chance to play investigator. We’re inviting you to submit your most \"gossipy\" questions for Anuja to answer live. Whether you're curious about the scandals behind her stories or want her to take on a provocative prompt, no topic is too bold and no secret is safe over a cup of chai.\nCome for the tea, stay for the revelations!\n\nBio:\nAnuja Chandramouli is a bestselling author and new age Indian classicist widely regarded as one of the finest writers in mythology, historical fiction and fantasy. Her highly acclaimed debut novel, Arjuna: Saga of a Pandava Warrior-Prince, was named as one of the top 5 sellers in the Indian writing category for the year 2012 by Amazon India. Her book, Mohini: The Enchantress was the winner of the JK Papers and Times of India Popular Choice Author award for the year 2021. Her books are also available as audiobooks and have been translated into Hindi. Abhimanyu: Son of Arjuna has been shortlisted for the Atta Galatta – Bangalore Literature Festival Book Prize. GIRL TALK and THE WIFE AND THE DANCING GIRL are her latest books. \nAn accomplished TEDx speaker and storyteller, Anuja Chandramouli, regularly conducts workshops on creative writing, mythology and empowerment in schools and colleges across the country. Her Mahabharata and Ramayana with Anuja storytelling series is now available on YouTube, Spotify, TuneIn Alexa, Apple Podcasts. She is a trained Bharatanatyam dancer and a columnist for The New Indian Express. This mother of two little girls lives in Sivakasi, Tamil Nadu.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1663",
    "image": "https://attagalatta.com/admin/uploads/events/42706023.png",
    "performer": "Anuja Chadramouli",
    "keywords": [
      "Community",
      "Discussion"
    ],
    "@type": "SocialEvent",
    "startDate": "2026-02-14T17:30:00+05:30",
    "endDate": "2026-02-14T18:30:00+05:30"
  },
  {
    "name": "Shiva in the Mahabharata - Storytelling by Aparna Jaishankar",
    "description": "The Mahabharata is often read as the tale of Krishna and dharma but running parallel to its grand narrative is another presence: Shiva. Elusive, ascetic, fierce, compassionate, and unsettling.\nThis storytelling session for adults explores Shiva’s appearances in the Mahabharata . The session weaves together the many Shivas through multiple lenses like regional retellings, Puranic expansions, classical and folk art, temple narratives, poetry, and oral traditions.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1650",
    "image": "https://attagalatta.com/admin/uploads/events/1988790881.png",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "History",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-14T19:00:00+05:30",
    "endDate": "2026-02-14T20:00:00+05:30"
  },
  {
    "name": "Madonna: Women’s Stories in the Modern Heart - A Galentine’s Day Play",
    "description": "Directed by Pritesh Bhandary, Atta Galatta brings you Madonna.\nThis bold, darkly funny and deeply intimate two-part play explores female desire, emotional neglect, sexual shame, and the search for pleasure and self-worth—in a world that constantly teaches women to stay silent.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1662",
    "image": "https://attagalatta.com/admin/uploads/events/940392655.png",
    "performer": "Pritesh Bhandary",
    "keywords": [
      "Theatre",
      "Interactive Theatre Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-14T20:00:00+05:30",
    "endDate": "2026-02-14T21:00:00+05:30"
  },
  {
    "name": "Ezhaam Ulagam by Jeyamohan - Book discussion by Sollazhi readers group",
    "description": "Sollazhi reading group will be discussing the Tamil novel 'Ezhaam Ulagam'. The Abyss (Ezhaam Ulagam) is one of the most acclaimed works of the great Tamil writer Jeyamohan. Written with an unflinching eye and suffused with a deep existential longing, it is an extraordinary novel – in its terrain, its fundamental questions about humanity and its depiction of human suffering and liberation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1677",
    "image": "https://attagalatta.com/admin/uploads/events/861837398.png",
    "performer": "Sollazhi readers group",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-15T11:00:00+05:30",
    "endDate": "2026-02-15T13:00:00+05:30"
  },
  {
    "name": "LOL with Dr. HiFive: The Art Of Parenting - A workshop by Dr. HiFive",
    "description": "Get ready to LOL with Dr. HiFive in Bangalore! This offline event brings together parents for a morning of laughter, fun, and insightful parenting tips. Dr. HiFive, renowned for his humorous approach to healthcare on social media, will entertain attendees with his witty jokes and clever observations about parenting. Through interactive segments and entertaining activities, parents will gain practical advice while sharing laughs with others in the community. From hilarious cabin jokes to engaging discussions, the event promises to be a memorable experience for all. Attendees can look forward to connecting with Dr. HiFive personally, asking questions, and building friendships with fellow parents. Don`t miss this opportunity to laugh, learn, and celebrate the joys of parenthood at \"LOL with Dr. HiFive\" in Bangalore!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1673",
    "image": "https://attagalatta.com/admin/uploads/events/1063300081.jpeg",
    "performer": "Dr. HiFive",
    "keywords": [
      "Parenting",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-02-15T11:30:00+05:30",
    "endDate": "2026-02-15T13:30:00+05:30"
  },
  {
    "name": "Alchemy with Art - Art Workshop by Harshitha",
    "description": "Atta Galatta presents 'Alchemy with Art' - a creative healing workshop guided by Harshitha on Sunday 28 December 2025 at 12:30 AM. \nIn this circle of Alchemy with Art, you will be guided through a transformative art session, balancing creative expression and inner work, with the intention of turning your biggest heartbreak (romantic or otherwise) into a personal breakthrough. If this is what your heart is ready for this Valentine's month, come join in the healing experience.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1678",
    "image": "https://attagalatta.com/admin/uploads/events/1027589484.jpg",
    "performer": "harshitha",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-02-15T12:30:00+05:30",
    "endDate": "2026-02-15T15:30:00+05:30"
  },
  {
    "name": "Bring Back Connection - Meetup by We Reflect",
    "description": "A 3-hour gathering where we share space, listen to each other, and have real conversations about emotions and lived experiences that matter. Using Conscious Cards as a starting point, we create space for honest talk without judgment.\nNo performance. No pressure. Just real voices and real stories.\nWhen: Feb 15, 1–3 PM\nWhere: Atta Galatta, Indiranagar\nFree entry\nCome as you are. Reserve your spot.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1676",
    "image": "https://attagalatta.com/admin/uploads/events/2054256790.png",
    "performer": "We Reflect",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-15T13:00:00+05:30",
    "endDate": "2026-02-15T15:00:00+05:30"
  },
  {
    "name": "HEARTBeat Improv Show - with the theme of \"Chemistry & Chaos\" & \"Valentine's Special Edition\" by HEARTBeat Improv",
    "description": "💘 HEARTBeat’s VALENTINE SPECIAL 💘\nTwo Sided Affair  🌹\n🎭 2 IMPROV SHOWS. 1 TICKET. 1 EVENING.\n \nH.E.A.R.T BEAT Improv presents a back-to-back improv experience:\n1. 🎭 HB UNSCRIPTED: Chemistry & Chaos\n→ Short-form improv | Fast | Playful | Wild\nHosted by Anuraag\nHigh-energy games based on your suggestions.\nWe bring the love, you bring the smiles 💕\n2. 🚀 MOBIUS TRIP\n→ Long-form sci-fi romance | Deep | Unpredictable | Unrepeatable\nFeat. Felix & Kartik\nA fully improvised journey where love, chaos, and comedy collide.\n \nDeets\n⏰ When: 15th Feb, Sunday | 3:50 PM\n📍 Where: Atta Galatta, Indiranagar\nShort-form first. Long-form next.\nSame ticket. Same seat. Twice the fun 💘\n🎟️ Book here:\nhttps://app.kahu.in/heartbeatimprov \nFor Love & Smiles 💞😁 🌹",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1675",
    "image": "https://attagalatta.com/admin/uploads/events/503414582.jpg",
    "performer": "HEARTBeat Improv",
    "keywords": [
      "Improv",
      "Improv"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-15T15:50:00+05:30",
    "endDate": "2026-02-15T18:00:00+05:30"
  },
  {
    "name": "Story Ke Peeche Kya Hai? - Storytelling & Poetry by Pramod and Sadhana",
    "description": "An irrepressible, versatile storyteller with a platter of edge-of-the-seat stories. A prolific, outspoken poet sharing highly lyrical, yet hard-hitting poetry. When they walk into a room, it's like lighting a cinder-box of magical entertainment. Pramod Shankar, one of Bangalore's favourite storytellers, and a much-published author and comedian, teams up with Sadhana Subramanian, a celebrated Bangalore poet with a unique voice, to bring you an unforgettable Saturday morning, bristling with laughter, reflection and discovery.\nBoth Sadhana and Pramod have been performing at multiple venues across Bangalore for over a decade. Pramod is the founder of Poetry with Zac, a 7-year-old poetry meet chaired by his cocker spaniel. Sadhana organizes People of the Verse (POV), a popular monthly poetry meet. Both of them are active members of Bangalore's creative community. Pramod's earlier productions such as Once Upon an Old Monk, Stories on a Rooftop and Laughter Matters have run to packed houses.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1672",
    "image": "https://attagalatta.com/admin/uploads/events/264254467.jpeg",
    "performer": "Pramod Shankar",
    "keywords": [
      "Storytelling",
      "Poetry"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-21T11:00:00+05:30",
    "endDate": "2026-02-21T13:00:00+05:30"
  },
  {
    "name": "AG Lit Sisters Book Club - Author Event by Beena Kamlani",
    "description": "Books, conversations, and a little literary magic, spend your afternoon in the company of Beena Kamlani.\nAG Lit Sisters, in collaboration with Bombay Circle Press, invites you to a special Meet the Author session with Beena Kamlani. Step into the world behind The English Problem as the author shares insights, inspirations, and the journey from idea to printed page. Expect candid conversations, thoughtful reflections, and the joy of connecting with fellow readers who love stories as much as you do.\nWhether you’re an avid reader, an aspiring writer, or simply someone who enjoys meaningful conversations, this is your chance to listen, ask questions, and even get your book signed.\nCome for the literature. Stay for the community. Leave inspired.\n📅 21 February, 2026\n⏰ 12 PM onwards\n📍 Atta Galatta\nFree entry. Curious minds welcome.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1686",
    "image": "https://attagalatta.com/admin/uploads/events/903328393.png",
    "performer": "Dr. Chhavi Gandhi Juneja",
    "keywords": [
      "Book Club",
      "Meet and Greet"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-21T12:00:00+05:30",
    "endDate": "2026-02-21T14:00:00+05:30"
  },
  {
    "name": "Math Cafe by Career Space - A gamified math experience by Career Space",
    "description": "Join us for a 3-hour gamified session where math lovers, puzzle solvers, and curious minds come together to play, solve, and win.\nYou’ll crack puzzles, earn Career Space coins, unlock hints, and compete for medals, all while sipping coffee and having fun.\nThink of it as India’s version of a brain-game reality show, but live, interactive, and completely immersive. Whether you love math or fear it, Math Café will make you see numbers in a whole new way.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1685",
    "image": "https://attagalatta.com/admin/uploads/events/1515227435.jpg",
    "performer": "Taral Shah",
    "keywords": [
      "Math",
      "Quiz"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-21T13:30:00+05:30",
    "endDate": "2026-02-21T16:30:00+05:30"
  },
  {
    "name": "Mandala Workshop - Workshop in the art of Mandala",
    "description": "Relax. Create. Connect – with your art and with others\nStep away from the daily rush and immerse yourself in the calming art of mandalas. This isn’t just a class – it’s a space to relax, express yourself, and connect with like-minded people. Whether you’re a beginner or a creative enthusiast, this workshop offers a chance to unwind, focus, and share the experience with others.\n🎨 What to Expect:\nGuided mandala creation session\nAll materials provided – just bring your curiosity\nAn afternoon of colors, mindfulness, and meaningful connections",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1679",
    "image": "https://attagalatta.com/admin/uploads/events/1059903433.png",
    "performer": "Laracology",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-02-21T15:00:00+05:30",
    "endDate": "2026-02-21T16:00:00+05:30"
  },
  {
    "name": "Writing About Loneliness in Poetry, Stories, and Essays - A Creative Workshop by Semeen Ali and Priyanka Sarkar",
    "description": "Based on the anthology Writing from the Solitary, the session invites participants to explore how isolation can be transformed into powerful literary expression. The workshop focuses on the nuances of solitude and loneliness as creative catalysts. Participants will engage with various forms of writing to navigate these complex emotions, learning how to articulate the \"solitary\" experience through prose and verse. This session is particularly unique as it draws from the editors' work on their recent anthology, providing a deep dive into the editorial and creative process of capturing such a universal human condition. Whether you are an established writer or someone looking to express personal reflections for the first time, this session promises to be a safe and inspiring space to connect through words.\n\nAbout the Facilitators\nSemeen Ali and Priyanka Sarkar are the editors of Writing from the Solitary: An Anthology on Loneliness. Their collective expertise spans across poetry and prose, with a focus on documenting the subtle, often internal experiences of the human condition. Through their editorial work and personal creative practices, they help writers find a voice for the quiet moments and the profound reflections that arise from solitude.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1680",
    "image": "https://attagalatta.com/admin/uploads/events/496485562.jpg",
    "performer": "Simon & Schuster",
    "keywords": [
      "Books and Literature",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-21T16:00:00+05:30",
    "endDate": "2026-02-21T18:00:00+05:30"
  },
  {
    "name": "Busy Women - Book Launch by Shinjini Kumar",
    "description": "Join us at Atta Galatta for the book launch of Busy Women by Shinjini Kumar, an insightful and engaging exploration of contemporary India beyond its metropolitan centres. Based on extensive travel across thirty cities and conversations with over 300 women, the book blends sharp observation with humour to examine ambition, work, and the everyday question women are constantly asked—“kya zaroorat hai?”\nDrawing from her own journey from a village to C-suite roles in India’s financial services sector, Shinjini Kumar writes with wit, empathy, and clarity, bringing to life stories of women who are redefining progress on their own terms. The author will be present at the launch and will interact with readers.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1681",
    "image": "https://attagalatta.com/admin/uploads/events/1999514977.jpeg",
    "performer": "Shinjini Kumar",
    "keywords": [
      "Books",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-21T18:30:00+05:30",
    "endDate": "2026-02-21T19:30:00+05:30"
  },
  {
    "name": "Brand Basics for First-Time Entrepreneurs - Sudhir Kiran",
    "description": "A conversation-led space for people who want to start something of their own but feel stuck at the very beginning, unsure of what they’re really building, how to explain it, or where to begin.\n\r\nThis workshop is about slowing down, asking better questions, and finding the right words before you promote, market, or invest further. The focus is on clarity, in thought, language, and direction, so everything that comes later feels more intentional and less overwhelming.\n\nWho is this for?\r\nFirst-time entrepreneurs, professionals exploring a side venture, freelancers seeking clarity in how they present their work, MSME owners who want to make sense of branding without jargon, and students or anyone considering starting something of their own.\n\nWhat will participants take away?\r\n1. Greater clarity on what they’re really building and why it matters\r\n2. A simple way to articulate their idea with confidence and intention\r\n3. A clearer understanding of how branding, marketing, and storytelling fit together, before execution begins\nPlease complete the registration form after booking. It helps us understand what you’re working on so the session can be shaped around the room. https://forms.gle/vescHTWDZhn722Jz6",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1661",
    "image": "https://attagalatta.com/admin/uploads/events/657860632.png",
    "performer": "Sudhir Kiran",
    "keywords": [
      "Business",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-02-22T11:00:00+05:30",
    "endDate": "2026-02-22T13:00:00+05:30"
  },
  {
    "name": "Read A Kitaab - book club",
    "description": "Love looks different in books.\nSometimes it’s friendship. Sometimes it’s belonging.\nSometimes it’s just finding your people between pages. ✨\n📖 Read A Kitaab – Bangalore is back with our Monthly Meetup\n💗 Theme: Love, books on friendship, relationships & bonding\nCome for the books, stay for the conversations, leave with a full heart.\nEntry is free, but registration is mandatory.\nSee you among stories, smiles, and shared silences 🌸",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1683",
    "image": "https://attagalatta.com/admin/uploads/events/1809146392.jpeg",
    "performer": "Balu",
    "keywords": [
      "Book Club",
      "book club"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-22T16:00:00+05:30",
    "endDate": "2026-02-22T18:00:00+05:30"
  },
  {
    "name": "Writing from the Solitary - A Literary Event featuring Semeen Ali and Priyanka Sarkar",
    "description": "Atta Galatta invites readers and writers to an insightful book discussion centered on the anthology Writing from the Solitary: An Anthology on Loneliness. The event features the book’s editors in conversation about the profound and often silent experience of loneliness.\nThe discussion will explore the creative journey behind compiling an anthology that navigates the depths of solitude through various literary lenses. It is an invitation for the community to engage with the themes of the book and discover how the \"solitary\" can be a space for profound connection and artistic illumination.\n\nSemeen Ali and Priyanka Sarkar are the editors of Writing from the Solitary: An Anthology on Loneliness. Their work focuses on documenting the subtle, often internal experiences of the human condition. Through their editorial practice, they help writers find a voice for the quiet moments and the deep reflections that arise from solitude.\nDibyajyoti Sarma, who joins as the moderator, is a writer and editor who will lead the conversation, guiding the audience through an exploration of the book's themes and the editorial process.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1682",
    "image": "https://attagalatta.com/admin/uploads/events/610086134.jpg",
    "performer": "Simon & Schuster",
    "keywords": [
      "Books",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-22T16:00:00+05:30",
    "endDate": "2026-02-22T17:00:00+05:30"
  },
  {
    "name": "Humzubaan: Hindi & Urdu Poetry Meet - Poetry Open Mic by Siddharth Surana",
    "description": "For long, a need was felt for a platform where good Hindi and Urdu poetry finds expression. Humzubaan, conceived by Siddharth Surana is an effort to bring together Hindi/Urdu literature enthusiasts together to celebrate the beauty of poetry. Our second meet up is happening on Sunday, 22rd Feb, 5.30 PM at Atta Galatta.\nRecite your own or your favourite author’s poems or simply soak in the magic of poetry. Clicking Here to register as audience or performer. Performance Submissions are open till 18th February.\nWe will inform you if your poem is selected for the meet. If your poem is not selected, you’re welcome to attend as an audience.\nPlease note:\n1. The poems can be your own original work or of another author. You need to mention clearly and send in your entry in the above-mentioned form.\n2. Poems/songs should be in Hindi/Urdu only.\n3. If you’re planning to perform with music/props, please mention in the form. You would need to arrange for the instruments and set-up at the venue.\nAbout the host:\nSiddharth is founder of AgriCentral, a digital platform serving 11 million farmers. He writes in Hindi, Urdu and English-mostly poems, short stories and essays but with long breaks. At least three books are jostling to come out of his mind on paper, for two decades, but none has seen the light of the day, as yet. Hopefully, it will change soon. By the way. he is also an avid trekker and a national-level gold medallist archer.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1674",
    "image": "https://attagalatta.com/admin/uploads/events/1512430637.png",
    "performer": "Siddharth Surana",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-22T17:30:00+05:30",
    "endDate": "2026-02-22T18:30:00+05:30"
  },
  {
    "name": "Art for Tired People - Art Journaling Workshop by Yukti Grover",
    "description": "If you’re tired, this workshop is for you.\nThis is a yawn-friendly journaling event, the kind where you can show up low-energy, slightly slouched, and completely yourself. You don’t need to feel creative. You don’t need a big idea. Just come as you are.\nArt for Tired People is a slow, easy art journaling session where we’ll cut, paste, doodle, layer, and play with materials, nothing complicated, nothing that demands your brain. Just simple, relaxing, creative time that helps you unwind.\nNo pressure to be “good.” No overthinking. Just two calm hours to soften at the end of your week. Honestly, is there a better way to spend a Sunday evening?\n🗓 22nd February\n📍 Atta Galatta\n⏰ 6:30 PM – 8:00 PM\n🎨 All materials included\n🎟 Early Bird: ₹349 (in this economy? don’t miss it)\nCome tired. Leave lighter.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1688",
    "image": "https://attagalatta.com/admin/uploads/events/1788265531.png",
    "performer": "Yukti Grover",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-02-22T18:30:00+05:30",
    "endDate": "2026-02-22T20:00:00+05:30"
  },
  {
    "name": "Food In Literature - Book Club with Prachi Grover",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well. \nSo, if viewing the world through the lens of food and literature interests you, then join us for a dialogue on “Food in Literature” and to celebrate those stories and their diversity. \nEach month with Prachi Grover, we read our way through several powerful (and delicious) narratives.\nFebruary Read: The Food of Paradise by Khalid Jawed\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available. \nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who love to read and eat!\nWhen: Saturday, 28th February, 2026 at 11 a.m.\nWhere: Atta Galatta Bookstore, Indira Nagar\nAges: 18+\nRegistration is mandatory (link in bio)\nCopies of the book are available at the store.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1669",
    "image": "https://attagalatta.com/admin/uploads/events/433836189.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-28T11:00:00+05:30",
    "endDate": "2026-02-28T13:00:00+05:30"
  },
  {
    "name": "Atta Galatta presents “Let Poetry Be” - Poetry Open Mic by Palgun K. J.",
    "description": "This monthly gathering will see poetry coming to life, through reading, music, art and any other forms of artistic expression, at Atta Galatta. Listeners and performers are all welcome!\n \nDate: 28th February\nTime: 4pm \nVenue: Atta Galatta, Indiranagar\n \nEvent specifics & submission guidelines –\n1. Theme - Free Verse (any original work)\n2. Works can be original or of other poets, performed live\n3. All languages welcome\n4. Participants can read to music (acoustic instrument/s), dramatise, use props & costumes\n5. Each participant will enjoy 5 minutes of reading time\n6. Kindly submit your poem and name to letpoetrybe@gmail.com on or before 26th Feb midnight. WE WILL NOT ACCEPT ATTACHMENTS OR LINKS. SUBJECT OF YOUR MAIL MUST READ AS 'Entry for-February LPB meet-up'\n7. You may also send entries that are not related to the theme\n8. The event will begin at 4pm sharp and will be held at Atta Galatta. Participants to report not later than 3:45 pm to hear about performance order and meet the host\n9. For any further clarifications, write to us at letpoetrybe@gmail.com\n \nYou are now welcome to flood our inbox!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1670",
    "image": "https://attagalatta.com/admin/uploads/events/1667357541.png",
    "performer": "Palgun KJ",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-28T16:00:00+05:30",
    "endDate": "2026-02-28T18:00:00+05:30"
  },
  {
    "name": "Atta Galatta presents “The BWW Short Story Community” - Literary Meetup by Bhumika Anand",
    "description": "The BWW Short Fiction Community at Atta Galatta will discuss \nA Child’s Smile By Jadd Hilal\nTranslated from French by Lara Vergnaud\nIn short but powerful vignettes, Jadd Hilal interweaves the lives of four generations of women from a family that has fled to Lebanon after a violent invasion of their Palestinian city by the Haganah.\nRead the text and come for the event.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1671",
    "image": "https://attagalatta.com/admin/uploads/events/2055372860.png",
    "performer": "Bhumika Anand",
    "keywords": [
      "Literary Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-28T16:00:00+05:30",
    "endDate": "2026-02-28T18:00:00+05:30"
  },
  {
    "name": "Weaving A Story - A curated exploration of Classical Dance & Textile through stories by Aparna Jaishankar",
    "description": "Join us for a curated storytelling evening - Weaving a story. Whether you're a lover of textiles, history, or just fascinated by Indian heritage and Classical Dance, this event will wrap you in the magic of tradition.\nThis event is organized in partnership with Janani Murali, renowned Bharatanatyam practitioner and Shruthi Kezhakepuram Purushotham, Mohiniyattam exponent.\nAbout Janani Murali: \nJanani Murali is a performer, researcher, educator and writer based in Bangalore who uses Bharatanatyam to access and address socio-cultural complexities. She trained under her mother, Guru Smt. Padma Murali, and serves as Associate Artistic Director of Padmalaya Dance Foundation and Executive Member of the International Dance Alliance, Bangalore Chapter. An A Grade artist of Doordarshan Kendra and empanelled artist of ICCR, Murali traverses traditional and contemporary formats of performance and dance education. Her work has earned titles including Nalanda Nrutya Nipuna, Padmavati Puraskar and Narthana Shironmani. Her work and research into “Creative Processes” under the UNBOXED series aims at using performing arts to add value in interdisciplinary environments. Murali is also a biologist with corporate experience in the pharmaceutical industry. She continues to publish clinical and medical research and holds leadership roles at Young Indians.\n\nAbout Shruti:\n\r\nShruthi Kezhakepuram Purushotham is a distinguished traditional dancer renowned for her mastery and innovative approach to Mohiniyattam. Her work reflects a deep understanding of Indian traditional dance as a movement form enriched by its historical and regional roots. Shruthi's artistry uniquely blends contemporary themes and self-expression, making her performances timeless and relevant.\nAbout Aparna:\nAparna Jaishankar is a Storyteller, Educator and Corporate Trainer.\nAparna’s passion lies in exploring Indic Mythology with a contemporary lens. She enjoys the various versions of these stories found in the nooks and crannies of the Indian subcontinent in the form of songs, theatre, dance, weaving, rituals and practices. She incorporates these rich sources in her Storytelling performances.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1687",
    "image": "https://attagalatta.com/admin/uploads/events/1885420530.png",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "History",
      "Community Event"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-28T18:30:00+05:30",
    "endDate": "2026-02-28T19:30:00+05:30"
  },
  {
    "name": "That’s What She Said - A Playback Theatre Performance by Threads and Tales",
    "description": "On the occasion of Women’s Day, we ask a simple question:\nWhy should women be celebrated only on one day?\nWomen are powerful, complex, and extraordinary every single day—yet too often treated like second-hand citizens the rest of the year. This performance begins right there, challenging the idea of limiting celebration to a date on the calendar.\nInstead, we open a space for real stories.\nStories of being a woman.\nStories of loving, learning from, and living alongside women.\nStories of mothers, teachers, mothers-in-law, partners, sisters, daughters, friends, bosses, colleagues, daughters-in-law—and everything in between.\nStories of how men see the women in their lives.\nStories of embracing the feminine within.\nWhat to Expect\nThis unique Playback Theatre experience invites the audience to share personal moments and lived experiences. In real time, our performers will transform these stories into spontaneous theatre using movement, music, and dialogue—honest, unscripted, and deeply human.\nThreads and Tales is an Applied theater initiative by Lahe Lahe Caravan \r\n \n⏱️ When: 8th March | 5:30 – 7:00 PM\n📍 Where: Atta Galata, Indiranagar\n🎟 Tickets: 300 rs per person",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1689",
    "image": "https://attagalatta.com/admin/uploads/events/1806851849.jpg",
    "performer": "Threads and Tales",
    "keywords": [
      "Theatre",
      "Interactive Theatre Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-03-08T17:30:00+05:30",
    "endDate": "2026-03-08T19:00:00+05:30"
  },
  {
    "name": "Between the Pages: A Crochet Bookmark Workshop - A Workshop by Lakshitha",
    "description": "Spend your Saturday evening slowly creating something special with your hands.\nIn this beginner-friendly workshop, we’ll learn how to crochet a handmade bookmark — a small, meaningful piece you can tuck between the pages of your favourite book or gift to someone who loves to read.\nThis session is designed by Slip Stitch for complete beginners as well as anyone who simply wants to sit, unwind, and make something beautiful in a warm, book-filled space.\nYou’ll learn:\n• Basic crochet techniques\n• How to read a simple pattern\n• How to finish and neatly assemble your bookmark\nAll materials will be provided — just bring yourself (and maybe your current read).\nWhere: Atta Galatta\nWhen: 14th March\nTime: 4:00 PM – 6:00 PM\nPrice: ₹1100\nAn evening of yarn, stories, and slow creativity.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1684",
    "image": "https://attagalatta.com/admin/uploads/events/1144059379.png",
    "performer": "Lakshitha",
    "keywords": [
      "Crochet",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-03-14T16:00:00+05:30",
    "endDate": "2026-03-14T18:00:00+05:30"
  },
  {
    "name": "Come Sit With Us - A Meetup by My Divorce Guide",
    "description": "It is an intimate, offline gathering designed for those navigating separation, relationship transitions, or quiet personal reinvention. It is a gentle, held space where stories will be shared across the room — without performance, without spotlight, without the pressure to “have it all figured out.”\nSome stories will be read aloud. Some will simply be witnessed.\nYou are welcome to speak, or just sit and listen.\nWhy this room?\nBecause separation can feel isolating.\nBecause being heard can be healing.\nBecause stories soften shame.\nBecause sometimes, you just need a space where you can exhale.\nWhether you are going through it, supporting someone who is, or reflecting on your own journey — this evening is an invitation to pause, connect, and remember that you are not alone.\nDate: March 15, 2026\nLocation: Atta Galatta, Bangalore\nDuration: 2 hours",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1690",
    "image": "https://attagalatta.com/admin/uploads/events/1633712177.png",
    "performer": "My Divorce Guide",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-03-15T12:30:00+05:30",
    "endDate": "2026-03-15T14:30:00+05:30"
  }
]