[
  {
    "name": "Bodhi Journal Workshop - by Yukti Grover",
    "description": "Hey parents 💕\nThis Children’s Day, make your kids’ evening a little more magical! 🌈\nJoin us for a cosy Journaling session, where your child (5+) gets to play with colours, stickers, and paper to express, journal and create!\n \nEach child will receive a Unicorn Kit 🦄 that includes:\n📓 A journal\n🎨 Fun craft materials\nAnd even a tasty snack!\n \n💸 ₹899 — all inclusive (Early Bird Discount!)\n 💸 ₹999 _ The regular \n \nA calm, creative evening designed to make your little one feel proud, joyful, and free to express themselves",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1535",
    "image": "https://attagalatta.com/admin/uploads/events/221263195.jpg",
    "performer": "Yukti Grover",
    "keywords": [
      "Journaling",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-14T16:30:00+05:30",
    "endDate": "2025-11-14T18:30:00+05:30"
  },
  {
    "name": "Haiku Echoes, a collaboration of haiku and storytelling - In collaboration with Lavanya Prasad Conceptualised by Kala Ramesh",
    "description": "Step into the delicate world of haikai poetry at Haiku Echoes, a 90-minute taster session celebrating the beauty of brevity and the power of pause. Conceptualised by renowned haiku poet Kala Ramesh, this evening brings together ten distinguished voices from the haiku community.\nThe line-up includes Anju Kishore, Devoshruti Mandal, Kavita Ratna, Namratha Varadarajan, Shloka Shankar, Tapan Mozumdar, Teji Sethi, Vani Sathyanarayan, Vinay R. Leo, and Kala Ramesh. Through evocative readings and enactments, and a special visual presentation of haiku by actor Lavanya Prasad, the event promises a unique and immersive poetic experience.\n📅 Date: 14 November 2025\r\n🕒 Time: 6:00 PM to 7:30 PM\r\n📍 Venue: Atta Galatta, Bengaluru\nThis gathering invites poetry lovers, new and seasoned, to listen, feel, and echo the quiet power of haiku.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1515",
    "image": "https://attagalatta.com/admin/uploads/events/1507695091.png",
    "performer": "Kala Ramesh, \nLavanya Prasad,",
    "keywords": [
      "Haiku",
      "Workshop + Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-14T18:00:00+05:30",
    "endDate": "2025-11-14T19:30:00+05:30"
  },
  {
    "name": "Qu for Quiz - Quiz by Karthik Srinivasan and Ganesh Balakrishnan",
    "description": "The Qu for Quiz is based on a grid format with the grids formed by topics on one axis and level of difficulty (and hence the points) on the other. The topics could be varied like History, Sports, Music, Literature, Movies and more. A team of two members would get to choose a topic and the level of difficulty and the question would be revealed. The rest of the teams can go for the buzzer if they know the answer. Depending on the number of teams registering, the size of the grid would be decided. \n \nSAMPLE Qu: 2. The name is inspired by the traditional malt whisky distillation process in which malted barley was mixed by hand with shovels. This labor-intensive process often caused a shoulder injury to workers, causing their arms to hang low. Which brand is named thus? \nGanesh Balakrishnan is an entrepreneur, marketer and creator of terrible dad jokes. His claim to fame is attempting to sell shoes during the pandemic, culminating in a viral Shark Tank \"Down But Not Out\" appearance. He is a collector of useless facts since childhood, and has dabbled in trivia quiz circuits since college. ganesh.flatheads@gmail.com\n\r\nKarthik Srinivasan is a pseudo-retired software leader by choice, specializing in innovative ideas to spend time that include organizing cricket leagues at the scale of IPL but for free, staying up to date on latest debates in virtual social groups helmed by family and friends and more on similar lines. emailkarth@gmail.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1532",
    "image": "https://attagalatta.com/admin/uploads/events/1552382358.png",
    "performer": "Karthik Srinivasan, \nGanesh Balakrishnan,",
    "keywords": [
      "Quiz",
      "Quiz"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-14T19:00:00+05:30",
    "endDate": "2025-11-14T20:30:00+05:30"
  },
  {
    "name": "Step into the world of junk journaling - Junk Journaling workshop by Deepa Rao",
    "description": "As the saying goes, one man’s trash is another man’s treasure! Junk journaling is described as a  sustainable craft that revolves around using whatever recycled materials or old scraps you have, to create a personalised journal. This therapeutic hobby is perfect for seasoned journalers who want to experience a new form of journaling and even for fresh beginners who want to start journaling themselves!\nIn this 2-hour session, you will learn the basics of junk journaling, which include making journals out of old paper bags, learning how to make personalised art out of scrap, and so much more! A basic starter kit is included in this workshop to help you get right to the fun stuff.\nI am Deepa, step into the world of Junk and Visual journaling with me for a fun junk journaling session that will help you turn something drab into something fab!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1523",
    "image": "https://attagalatta.com/admin/uploads/events/1881682724.png",
    "performer": "Deepa Rao",
    "keywords": [
      "Journaling",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-15T11:00:00+05:30",
    "endDate": "2025-11-15T13:00:00+05:30"
  },
  {
    "name": "The Bougainvillea Circle - Connection Circle by Radhika Ghose",
    "description": "\"Sawubona\" a Zulu Greeting meaning, \"We See You\". At Bougainvillea Circles you are offered a space to be heard, seen, welcomed as you are. A non-judgmental, safe, trusted space where you are free to be all that you want to be. Nothing More, Nothing less. No Restrictions, no judgements, just an intimate group of people looking for a space to be real. A space where we`re all less alone for a little while. Where we are seen, how we want to be seen. Conversations, Connections, Community of Compassion. All that makes the world go round, after Love of course!\nRemember - Sawubona: We See You.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1516",
    "image": "https://attagalatta.com/admin/uploads/events/973796884.png",
    "performer": "Radhika Ghose",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-15T16:00:00+05:30",
    "endDate": "2025-11-15T17:30:00+05:30"
  },
  {
    "name": "The Long and Short of Haiku - An intensive haikai workshop with Kala Ramesh",
    "description": "Haiku may be short, but it can hold a world of meaning. In this masterclass, Kala Ramesh will guide participants through the beauty, rules, and craft of this unique form of poetry.\n“What is Haiku”- exploring and understanding the masters through a PowerPoint presentation. A lot of interaction will be included, encouraging each participant to become more involved and engage with this minimalistic form of poetry in a more compelling way. Like all Japanese art forms, haiku is full of rules – though we don’t call them that! The art of writing haiku will be gradually introduced. The ‘kire’ or ‘cut’, which is so important to haiku, will be taught. Certain key Japanese aesthetics will also be introduced. Homework will be assigned.\n16th November: Haiku assigned as homework will be discussed. The class progresses into an in-depth study of the masters, both old and new. A brief introduction to haibun (prose embedded with haiku), tanka (a 1300-year-old lyrical poem), and haiku (artwork with haiku) will be provided.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1518",
    "image": "https://attagalatta.com/admin/uploads/events/1609006394.png",
    "performer": "Kala Ramesh",
    "keywords": [
      "Haiku",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-15T16:00:00+05:30",
    "endDate": "2025-11-15T19:00:00+05:30"
  },
  {
    "name": "Mahabharata Stories in Bengaluru - Storytelling by Aparna Jaishankar",
    "description": "The Mahabharata is a living epic that thrives amongst us.  If so, what about Bengaluru? What stories live in this city in the form of art, architecture, rituals, and landscape. Join Aparna Jaishankar for an oral storytelling performance, as she shares a few episodes from the Mahabharata that one might have seen and experienced in the city of Bengaluru.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1517",
    "image": "https://attagalatta.com/admin/uploads/events/729707085.png",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "Mythology",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-15T17:30:00+05:30",
    "endDate": "2025-11-15T18:30:00+05:30"
  },
  {
    "name": "Strings and Echoes- band - tribute to the legendary Salil Chowdhury",
    "description": "Suhana Safar is a heartfelt tribute to the legendary Salil Chowdhury by Strings & Echoes. Through songs and stories, we celebrate the life of this visionary composer, storyteller, and revolutionary who transformed the sound of Indian music.\nOur narratives and soundscapes are crafted to capture the essence of Salil Da, revisiting his timeless compositions across languages and exploring how he seamlessly wove Indian and Western music into beautiful evergreen songs.\n \n📅 Saturday, 15 Nov\n🕢 7:30 PM – 9:30 PM\n📍 Atta Galatta, Indiranagar\nJoin us for an evening of music, memories, and emotion... celebrating the timeless legacy of 𝗦𝗮𝗹𝗶𝗹 𝗗𝗮.✨\nScan the QR to book your tickets.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1534",
    "image": "https://attagalatta.com/admin/uploads/events/1976678171.png",
    "performer": "Strings and Echoes",
    "keywords": [
      "Live Music",
      "Community Event"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-15T19:30:00+05:30",
    "endDate": "2025-11-15T21:30:00+05:30"
  },
  {
    "name": "The Long and Short of Haiku - An intensive haikai workshop with Kala Ramesh",
    "description": "Haiku may be short, but it can hold a world of meaning. In this masterclass, Kala Ramesh will guide participants through the beauty, rules, and craft of this unique form of poetry.\n“What is Haiku”- exploring and understanding the masters through a PowerPoint presentation. A lot of interaction will be included, encouraging each participant to become more involved and engage with this minimalistic form of poetry in a more compelling way. Like all Japanese art forms, haiku is full of rules – though we don’t call them that! The art of writing haiku will be gradually introduced. The ‘kire’ or ‘cut’, which is so important to haiku, will be taught. Certain key Japanese aesthetics will also be introduced. Homework will be assigned.\n16th November: Haiku assigned as homework will be discussed. The class progresses into an in-depth study of the masters, both old and new. A brief introduction to haibun (prose embedded with haiku), tanka (a 1300-year-old lyrical poem), and haiku (artwork with haiku) will be provided.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1519",
    "image": "https://attagalatta.com/admin/uploads/events/1785798383.png",
    "performer": "Kala Ramesh",
    "keywords": [
      "Haikai",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-16T10:00:00+05:30",
    "endDate": "2025-11-16T13:00:00+05:30"
  },
  {
    "name": "Financial Freedom Starts with Awareness - Financial literacy workshop",
    "description": "Join us for a refreshing take on money matters at our upcoming Financial Literacy Workshop.\nA conversation about how to budget smarter, understand investing, and start creating real wealth for your future. You’ll walk away with simple, actionable insights to make confident financial decisions minus the jargon.\nWhat you’ll learn:\n- Practical ways to track and plan your spending.\n- How to start investing, even with small amounts\n- Steps to grow and sustain long-term wealth",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1531",
    "image": "https://attagalatta.com/admin/uploads/events/1884705138.png",
    "performer": "Sathwik N.N.",
    "keywords": [
      "Finance",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-16T11:00:00+05:30",
    "endDate": "2025-11-16T13:00:00+05:30"
  },
  {
    "name": "Career Space Math Cafe - An evening of Games, Strategy & Aha moments by Career Space",
    "description": "Math Café isn’t your regular math event, it’s a vibe.\nLast time, one of our Math Café champs said,\n“Who wastes weekends doing nothing? I came to Math Café... and wow, what an experience!”\nWe don’t like to brag, but this time, it’s your turn to experience it.\nStep into Math Café, where plus meets minus, logic meets laughter, and math finally feels like fun.\nGames, puzzles, challenges and the joy of discovering the positive side of math.\nThis weekend, don’t just scroll... come and solve!\n \nWhat to Expect\nEngaging, high-energy math-inspired games that make you think, laugh, and play.\nChallenges that spark strategy, curiosity, and collaboration.\nA fresh perspective on how math sneaks into everyday problem-solving. \nA fun afternoon where learning blends effortlessly with play.\nPerfect for students, teachers, parents, and anyone who’s ever said, “I’m not a math person.”\nCome curious. Leave fearless.\n \nBecause at the Math Café, math begins where curiosity lives and everyone makes a difference.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1536",
    "image": "https://attagalatta.com/admin/uploads/events/175236790.jpg",
    "performer": "Taral Shah",
    "keywords": [
      "Math",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-16T13:30:00+05:30",
    "endDate": "2025-11-16T16:30:00+05:30"
  },
  {
    "name": "An Evening of Magic - Magic Show",
    "description": "An Evening of Magic is a most amazing magic show presented by `Nakul Shenoy & Friends’, featuring top entertainers and magic acts. Curated and hosted by the internationally-acclaimed mentalist Nakul Shenoy, each event in this series brings unique acts and performances by nationally and internationally acclaimed magicians, alongside some of the most notable up-and-coming stars of magic. This is an evening that is truly magical, and one you will want to experience many times over.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1533",
    "image": "https://attagalatta.com/admin/uploads/events/1873596247.jpg",
    "performer": "Nakul Shenoy",
    "keywords": [
      "Magic",
      "Magic Show"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-16T18:00:00+05:30",
    "endDate": "2025-11-16T20:00:00+05:30"
  },
  {
    "name": "Food In Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food\r\nliterature combines them in a way that helps us connect not only to our past and our present, to \r\ndifferent cultures, and communities, values and rituals, events both life-changing and mundane but to \r\neach other as well. \r\nSo, if viewing the world through the lens of food and literature interests you, then join us for a \r\ndialogue on “Food in Literature” and to celebrate those stories and their diversity. Each month with \r\nPrachi Grover, we read our way through several powerful (and delicious) narratives.\r\nNovember Read: Kitchen Confidential by Anthony Bourdain\r\nWe assure you that you will enjoy every single bite!\r\nThe session is free but registration is a must as we have limited spots available. \r\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a \r\ncommunity for people who to love to read and eat!\r\nWhen: Saturday, 22nd November, 2025 at 11 a.m.\r\nWhere: Atta Galatta Bookstore, Indira Nagar\r\nAges: 18+\r\nRegistration is mandatory: https://t.ly/BO6wV \r\nCopies of the book are available at the store.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1525",
    "image": "https://attagalatta.com/admin/uploads/events/1337390941.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-22T11:00:00+05:30",
    "endDate": "2025-11-22T13:00:00+05:30"
  },
  {
    "name": "An Afternoon with the Minds Behind Thuldrun.Śūnyā - Book Launch by Samiran Ghosh & Sheetal Choksi",
    "description": "What happens when ancient secrets collide with corporate greed in the heart of Mumbai? When time itself starts to fracture in the bylanes of Dadar?\nThe story carries a healthy blend of vada pav vendors and cosmic voids. It is about Mumbai and how it exists in a state of quantum superposition. Consider the evidence. The local trains are both full and somehow still accepting passengers. It is raining and not raining, depending on which side of the street you're standing on. Infrastructure - crumbling yet functioning. A perfect backdrop for a mythology tech fiction novel. You get the gist 😎.\nIn Thuldrun.Śūnyā, authors Samiran Ghosh and Sheetal Choksi weave a believable, albeit fictional, tale in which reality isn't quite what it seems. Meet Ansh Chatterjee, a young man whose mornings don't follow the rules—clocks rewind, daylight flickers, and mysterious glitches tear open glimpses of an ancient civilisation with levitating orbs and towering Forms. Is he losing his mind, or is the universe itself unravelling?\nIn an interactive session, Samiran and Sheetal will chat about why and how they wrote the book, why the title, why the Book of ♾️ and more.\nDate: November 22, 2025\nTime: 2:00 PM - 4:00 PM\nVenue: Atta Galatta, Bangalore\nBooks will be available for purchase and signing.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1526",
    "image": "https://attagalatta.com/admin/uploads/events/1005093729.png",
    "performer": "Samiran Ghosh, \nSheetal Choksi,",
    "keywords": [
      "Book Discussion",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-22T14:00:00+05:30",
    "endDate": "2025-11-22T16:00:00+05:30"
  },
  {
    "name": "Let Poetry Be - Poetry Open Mic",
    "description": "This monthly gathering will see poetry coming to life, through reading, music, art and any other forms of artistic expression, at Atta Galatta. Listeners and performers are all welcome!\nDate: 22nd November\nTime: 4pm \nVenue: Atta Galatta, Indiranagar\nEvent specifics & submission guidelines –\n1. Theme - Free Verse (any original work)\n2. Works can be original or of other poets, performed live\n3. All languages welcome\n4. Participants can read to music (acoustic instrument/s), dramatise, use props & costumes\n5. Each participant will enjoy 5 minutes of reading time\n6. Kindly submit your poem and name to letpoetrybe@gmail.com on or before 20th Nov midnight. WE WILL NOT ACCEPT ATTACHMENTS OR LINKS. SUBJECT OF YOUR MAIL MUST READ AS 'Entry for-November LPB meet-up'\n7. You may also send entries that are not related to the theme\n8. The event will begin at 4pm sharp and will be held at Atta Galatta. Participants to report not later than 3:45 pm to hear about performance order and meet the host\n9. For any further clarifications, write to us at letpoetrybe@gmail.com\nYou are now welcome to flood our inbox!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1521",
    "image": "https://attagalatta.com/admin/uploads/events/1802200582.png",
    "performer": "Palgun KJ",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-22T16:00:00+05:30",
    "endDate": "2025-11-22T18:00:00+05:30"
  },
  {
    "name": "Step Into The World of Junk Journaling  - Junk Journaling workshop by Deepa Rao",
    "description": "As the saying goes, one man’s trash is another man’s treasure! Junk journaling is described as a  sustainable craft that revolves around using whatever recycled materials or old scraps you have, to create a personalised journal. This therapeutic hobby is perfect for seasoned journalers who want to experience a new form of journaling and even for fresh beginners who want to start journaling themselves!\nIn this 2-hour session, you will learn the basics of junk journaling, which include making journals out of old paper bags, learning how to make personalised art out of scrap, and so much more! A basic starter kit is included in this workshop to help you get right to the fun stuff.\nI am Deepa, step into the world of Junk and Visual journaling with me for a fun junk journaling session that will help you turn something drab into something fab!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1524",
    "image": "https://attagalatta.com/admin/uploads/events/786762149.png",
    "performer": "Deepa Rao",
    "keywords": [
      "Journaling",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-22T18:00:00+05:30",
    "endDate": "2025-11-22T19:30:00+05:30"
  },
  {
    "name": "Weaving A Story - A curated exploration of Ikat Sarees through stories",
    "description": "Join us for a curated storytelling evening - Weaving a story (A curated exploration of Ikat Sarees). Whether you're a lover of textiles, history, or just fascinated by Indian heritage, this event will wrap you in the magic of tradition.\nThis event is organized in partnership with Monika Manchanda, an initiative to honour the people and process behind Ikat. \nAbout Monika Manchanda: \nMonika Manchanda is a culinary writer, consultant, and trainer with over a decade of experience creating recipes, menus, and food experiences that celebrate both nourishment and culture. She is the Co-Founder and Chief Culinary Officer at LiveAltLife, a health-tech company working to reverse lifestyle diseases through food-driven wellness.\nA storyteller at heart, Monika finds deep resonance in India’s textile traditions — especially the timeless artistry of handwoven sarees. Her love for ikat stems from its philosophy of pre-planned imperfection and the rhythm between intention and spontaneity, much like cooking itself. Through her writing and talks, she explores how stories of food, fabric, and craft intertwine to tell us who we are.\nDiscover more of her work at sinamontales.com and on Instagram @monikamanchanda.\nAbout Aparna:\nAparna Jaishankar is a Storyteller, Educator and Corporate Trainer.\nAparna’s passion lies in exploring Indic Mythology with a contemporary lens. She enjoys the various versions of these stories found in the nooks and crannies of the Indian subcontinent in the form of songs, theatre, dance, weaving, rituals and practices. She incorporates these rich sources in her Storytelling performances.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1528",
    "image": "https://attagalatta.com/admin/uploads/events/777537060.png",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "History & Culture",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-22T19:00:00+05:30",
    "endDate": "2025-11-22T20:30:00+05:30"
  },
  {
    "name": "SlipStitch: A beginner’s crochet workshop - Crochet workshop by",
    "description": "Take a pause from your everyday rush and spend a quiet morning learning the art of crochet. In this beginner-friendly workshop, you’ll learn the basic stitches, how to read a pattern, and create your very own crochet coaster to take home. Guided by Slip Stitch, this session is all about finding calm in the act of creating with your hands —focused, meditative, and joyfully slow.\n When: Sunday, 23rd November | 11 AM – 1 PM\n Where: Atta Galatta, Indiranagar\n Fee: ₹1100 (all materials included)\nJoin us for a mindful making session where you create, connect, and unwind — one loop at a time.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1527",
    "image": "https://attagalatta.com/admin/uploads/events/1534663285.png",
    "performer": "Lakshita N.M",
    "keywords": [
      "Crocheting",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-23T11:00:00+05:30",
    "endDate": "2025-11-23T13:00:00+05:30"
  },
  {
    "name": "stE=mc² - Stem Workshop with Madhuri Katti",
    "description": "Join in for an interactive experiment-led science session by physics educator and writer Madhuri Katti and some of her students. The goal of the session is to show young students and adults a different and engaging way of thinking about science, history of scientific ideas and its effects on everyday life, by exploring fundamental topics via simple home-experiments. The experiments will be of three parts:\n- Fun with Forces: Explanation of the four fundamental forces of nature, and their effects. Demonstration of experiments with gravity and static electricity. \n- Magnets and Motors : construction of a simple motor with a battery, magnet, and copper wire. Discussion of electricity and magnetism.\n- Playing with fluids: demonstrations of dynamics of fluids involving surface tension, and diffusion. Light along with Fluids.\nAt the end, we hope to inspire the participants to be boldly curious and to recognise the importance of science in our everyday lives.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1520",
    "image": "https://attagalatta.com/admin/uploads/events/",
    "performer": "Madhuri Katti",
    "keywords": [
      "Science and Technology",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-23T11:30:00+05:30",
    "endDate": "2025-11-23T13:30:00+05:30"
  },
  {
    "name": "The Stray Dogs of Landour Network: A True Story by a Failed Dog Trainer - Book Launch by Lalitha Krishnan",
    "description": "Lalitha Krishnan will introduce her new memoir in an interactive session. Released earlier this year, the book is available in both print and e-book formats on Amazon, Pothi.com, and Flipkart. It is a testament to the profound lessons of compassion, resilience, and belonging taught by free-ranging dogs.\nThe story begins in Landour, where Krishnan, a newly certified dog trainer fighting battles of her own, encounters a troubled stray named Pretty on her doorstep. With a training manual in hand, she intends to help Pretty find a home. But Pretty has a different plan, and with quiet intelligence, she leads Krishnan into her world, introducing her to her pup and the rest of the pack.\nInspired by the philosophy of Ubuntu (“I am because we are”), Krishnan finds herself feeding, training, and caring for a growing network of dogs in an international neighbourhood. In doing so, she begins to heal, learning that her canine companions have as much to teach her as she has to teach them. The dogs, with their innate wisdom and social dynamics, reshape Krishnan’s understanding of love and survival.\nThe Stray Dogs of Landour Network: A True Story by a Failed Dog Trainer features a foreword by the late travel writer Bill Aitken, who also contributed a chapter titled “Mussoorie Dogs and Dog Lovers I Love.” Krishnan recounts stories shared by authors Stephen Alter and Ganesh Saili, both residents of Landour. Her book is a tribute to the silent, unseen lives of the animals who share our world and the emotional truths they awaken within us.\nReview:\n“The Stray Dogs of Landour Network is a deeply personal, unflinchingly honest memoir that sits comfortably on the shelf alongside Helen Macdonald’s H Is for Hawk or Sy Montgomery’s The Soul of an Octopus. It is a story of survival, not just of dogs, but of people finding grace in the act of caring without conditions. \nA poignant, slow-blooming debut that blends environmental awareness with emotional depth. Lalitha Krishnan’s voice is one of rare integrity, grounded, observant, and quietly radical in its compassion.”\n — The Literature Today\nAbout the Author:\nLalitha Krishnan is a writer, podcaster, potter, and nature documenter based in Ranikhet in the Indian Himalaya. Her work explores the bonds between humans, animals, and the natural world. A certified dog trainer, Krishnan is passionate about dogs and wildlife and has contributed to publications including Dogs & Pups Magazine, Garhwal Post, RoundGlass Sustain, and Sanctuary Asia, among others.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1522",
    "image": "https://attagalatta.com/admin/uploads/events/1450796694.jpg",
    "performer": "Lalitha Krishnan",
    "keywords": [
      "Book Discussion",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-23T16:00:00+05:30",
    "endDate": "2025-11-23T17:15:00+05:30"
  },
  {
    "name": "Meet & Greet: Dr. Latha & Dr. Ranjan Pejaver - Author Interaction Event",
    "description": "It is seldom that we find a blend of two mainstream professions.  Despite being busy in their respective specialities, Dr Latha Venkateswaran and Dr Ranjan Pejaver have taken time to explore the art of writing. While they have written articles and papers which are mainly medical, it is heartening to know they have ventured into writing fiction in the not-so-recent past.\nWelcome to an evening with two doctors-turned-published-authors who would like to meet and greet you. You will also be treated to soulful melodies played beautifully on the saxophone by Asha Elisha, an accomplished singer and musician.\nAbout Dr. Latha:\nDr Latha is a practicing pediatric surgeon for twenty years now. She did her undergrad from Kasturba Medical College (KMC), Mangalore, and her post-graduation FRCS (Paediatric Surgery) from the UK. She currently lives and works in Bangalore, India. This is her first attempt at story telling. Reading and writing have always been her passion. She loves thrillers and twists and brings out the most unique way of portraying this in all her stories. Her husband, son, and daughter ably support her in her passion. Ripples is a collection of short stories. It is a work of fiction. The author has attempted to present real life situations in a story form. They are all different in their content but have a characteristic twist at the end of the story.\nDr Ranjan Pejaver:\nDr Ranjan Pejaver is a renowned Pediatrician and Neonatologist. Dr Ranjan Pejaver has to his credit, more than 30 books and 150 scientific papers in his speciality. An innovator and researcher, he is an eminent speaker and a sought-after teacher. He is a well-travelled person. “The Heaven As I Saw” is a thoughtful, imaginative take on life; more rather, life soon after death! In his first non-medial book, the author Dr Ranjan Pejaver, has deftly handled the most unusual theme, holding the readers’ attention all the while. The novel is earthly and penetrative. It interrogates questions of morality and ethics in modern society. A most unusual journey of the Hero of the book. He gains wisdom through this trip. Could be inspiring for the readers.\nAbout Asha Elisha:\nAsha Elisha hails from a musical family, and has been a musician and singer all her life. She realised her dream of playing the saxophone in October 2022, when she began taking lessons from a professional musician. Since then, she hasn’t looked back, and has built up her saxophone repertoire to cover English Retro, Jazz, Gospel, Western Classical and Bollywood songs. Asha is available to play for musical gigs. You can listen to her recordings on YouTube: @ohsosaxy-7 (Oh So Saxy)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1529",
    "image": "https://attagalatta.com/admin/uploads/events/1815952356.jpeg",
    "performer": "Asha Elisha, Saxophonist, \nDr. Latha, \nDr. Ranjan Pejaver,",
    "keywords": [
      "Author Interaction",
      "Meet and Greet"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-23T18:00:00+05:30",
    "endDate": "2025-11-23T20:00:00+05:30"
  },
  {
    "name": "Healing of shame - Workshop by Nimesh and Gokul",
    "description": "Shame is the most complex emotional suffering one experiences in a lifetime. Every dimension of one’s life from relationships to one’s professional identity and being a part of one’s social reality can be influenced by shame and yet it remains unknown to many among us. Shame is the intense feeling of undeservingness to be loved and to exist. To begin with, the workshop intends to explain healing as a change which needs to transpire in one with the ultimate goal being to outline how we can bring about a change when one is consumed by shame. We will delve into the specific ways shame manifests across different layers of consciousness, and discuss targeted interventions that can address shame at each layer.\nThe workshop is hosted by Dr. Nimesh and Dr. Gokul, both practicing psychologists based in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1537",
    "image": "https://attagalatta.com/admin/uploads/events/1013769867.jpeg",
    "performer": "Dr. Nimesh George, Dr. Gokul Ratakonda",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-30T10:30:00+05:30",
    "endDate": "2025-11-30T17:30:00+05:30"
  }
]