[
  {
    "name": "Food In Literature - Book Club with Prachi Grover",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well. \nSo, if viewing the world through the lens of food and literature interests you, then join us for a dialogue on “Food in Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we read our way through several powerful (and delicious) narratives.\nDecember Read: The Evin Prison Bakers' Club by Sepideh Qolian\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available. \nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who love to read and eat!\nWhen: Saturday, 20th December, 2025 at 11 a.m.\nWhere: Atta Galatta Bookstore, Indira Nagar\nAges: 18+\nRegistration is mandatory (link in bio)\nCopies of the book are available at the store.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1559",
    "image": "https://attagalatta.com/admin/uploads/events/1817058589.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-20T11:00:00+05:30",
    "endDate": "2025-12-20T13:00:00+05:30"
  },
  {
    "name": "Four Voices, One Celebration - Book Launch Celebration by Inner Healing Oasis",
    "description": "Join us for a morning of inspiration, healing, and heartfelt storytelling as Inner Healing Oasis Publishing proudly presents the launch of four remarkable books — each offering a unique perspective on growth, resilience, and the human journey.\nOn 20th December 2025, from 11:00 AM to 1:30 PM, the iconic Atta Galatta Bookstore in Bengaluru will host this special gathering — uniting four diverse authors whose words resonate with truth, transformation, and hope.\nMeet the Authors and Their Books\nI’m a Fresher, I’m Confused by Zahed Ali A witty, heartfelt story that captures the struggles and aspirations of a young man stepping out of college and into the fast-paced world of the IT industry. Honest and humorous, it reflects the confusion, courage, and self-discovery of a generation finding its way.\nHeal with Melody by Shweta Saimy A soulful guide to using sound, rhythm, and vibration as pathways to healing. Through the language of music and emotion, this book helps readers reconnect with inner harmony and find balance through self-expression.\nHer Second Spring by Dr. Sameer Paranjape A compassionate and empowering book that brings to light the emotional, physical, and social experiences of women navigating menopause. It is a celebration of the strength, wisdom, and renewal that mark a woman’s “second spring” in life.\nRewriting Destiny by Sanjib Chowdhury A transformative exploration of quantum healing and human consciousness. Sanjib blends science and spirituality to reveal how we can transcend limiting beliefs and consciously shape our destiny.\n \nAn Event to Inspire and Connect\nThis multi-author launch is more than a literary gathering — it’s a celebration of stories that heal, empower, and ignite conversation. Meet the authors, listen to their journeys, experience live readings, and be part of a morning that celebrates creativity, courage, and community.\nWe are also honored to have industry experts from relevant fields gracing the event with their presence — adding depth, dialogue, and fresh perspectives to the conversation.\nCome witness the moment where ink meets energy, and stories come alive.\n \nVenue: Atta Galatta Bookstore, Indiranagar, Bengaluru\nDate: 20th December 2025\nTime: 11:00 AM – 1:30 PM\nHosted by: Inner Healing Oasis (IHO)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1570",
    "image": "https://attagalatta.com/admin/uploads/events/383337957.png",
    "performer": "Inner Healing Oasis (IHO)",
    "keywords": [
      "Book Discussion",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-20T11:00:00+05:30",
    "endDate": "2025-12-20T13:30:00+05:30"
  },
  {
    "name": "❄️✨ Winter pages, warm hearts, and the soft magic of stories… ✨❄️ - AG Lit Sisters Thematic Book Club",
    "description": "The AG Lit Sisters are closing the year with a beautifully cozy December gathering: Snowflakes & Storytelling!\nThink twinkling lights, favourite winter reads, shared laughter, and the joy of being surrounded by bookish soul-sisters. 💙📚\n📅 December 20, 2025\n⏰ 1:30–3:00 PM\n📍 Atta Galatta, Indiranagar\n☕ Coffee on the house for everyone!\n \nEntry is FREE but online registration is mandatory, and we have only 20 slots. First come, first seated!\nBring your favourite winter story, your festive cheer, and your warmest energy. Let’s make it a December to remember. 🌨️✨\n❓ Question of the Day:\nWhich book gave you the coziest winter feeling this year?",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1560",
    "image": "https://attagalatta.com/admin/uploads/events/292755057.jpg",
    "performer": "Dr. Chhavi Gandhi Juneja",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-20T13:30:00+05:30",
    "endDate": "2025-12-20T15:00:00+05:30"
  },
  {
    "name": "No Pressure Improv returns - An improv open mic by No Pressure Improv",
    "description": "No Pressure Improv returns with the Improv & Sketch Open Stage - think open mics, but for improv (and sketch)! Come watch Bengaluru's bubbling improv scene every month, and sign up if you will, to flaunt your improv on the Open Stage! Up to 8 performers who sign up are put together on the Open Stage to play improv together, led by the jam-master of the evening. This is a great opportunity to get stage time and to play improv in front of a kind and supporting audience, who will be alongside you as you improvise and discover the make-believe. 40 minutes of Open Stage is followed by a featured act in the second half. Bring your ensemble or solo act, improv or otherwise - whether it's storytelling or stand-up or spoken word or your original set of songs - it's the perfect stage for you to experiment with your act or present it to the community.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1571",
    "image": "https://attagalatta.com/admin/uploads/events/763578771.jpg",
    "performer": "No Pressure Improv",
    "keywords": [
      "Improv",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-20T19:00:00+05:30",
    "endDate": "2025-12-20T20:30:00+05:30"
  },
  {
    "name": "Lahe Lahe Caravan presents Harry Potter Book Discussion - Meetup by Sonali Bhatia",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1554",
    "image": "https://attagalatta.com/admin/uploads/events/565028741.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-21T11:00:00+05:30",
    "endDate": "2025-12-21T12:30:00+05:30"
  },
  {
    "name": "Letters of connection - Letter writing circle by Svaha Space",
    "description": "Letters of Connection is a community letter writing circle that was started in 2023 by Svaha Space, a creative arts mental health initiative. This circle's theme is \"Thank you and Good-bye 2025\". It's an opportunity for you and your friends to come together on a Sunday afternoon and take some space to look back at how much 2025 has brought in, taken out, and put to rest in your life. There will be opportunities to share what your letter endeavour brought up for you or to just witness what others would like to share. We look forward to having you there.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1572",
    "image": "https://attagalatta.com/admin/uploads/events/1972750011.png",
    "performer": "Svaha Space",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-12-21T15:30:00+05:30",
    "endDate": "2025-12-21T17:30:00+05:30"
  },
  {
    "name": "Whispers from the Lighthouse of Galle - Book Launch by Priyanka Kumar",
    "description": "In an era where Gen Zs and millennials seek meaning through experiences rather than possessions, Whispers from the Lighthouse of Galle – Stories of Friendships & Adventures in Nature offers exactly the kind of soulful escape today’s young adventurers crave. For those who live for spontaneous road trips, mountain treks, beach escapades, and serendipitous conversations with strangers—and secretly nurture the hope of finding love and companionship along the way—Priyanka Kumar’s latest collection is a deeply relatable read. With its mix of short stories and memoir-style reflections, this book resonates with those who believe that real connection and personal discovery often happen far away from the familiar.\nThe newest installment in Priyanka’s celebrated People’s Kafe series, Whispers from the Lighthouse of Galle brings together heartfelt stories and travel-infused memories that capture the healing magic of nature and the unspoken bonds we form with people and places. Though it’s not a travelogue in the conventional sense, the book reads like one—with vivid glimpses into landscapes and emotions that stay with the reader long after they turn the final page.\nAnd yet, the book is as much about the people as it is about the places. There are tales of peacocks who roamed her childhood garden like kin, strangers-turned-friends on spontaneous journeys, and even encounters that subtly hint at love blossoming when least expected. The presence of love—gentle, unforced, and organic—is a quiet undercurrent in a couple of these stories, offering a warm, relatable thread for every romantic dreamer who has ever looked out of a train window and wondered, what if?",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1541",
    "image": "https://attagalatta.com/admin/uploads/events/996951640.jpeg",
    "performer": "Priyanka Kumar",
    "keywords": [
      "Travel",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-21T17:30:00+05:30",
    "endDate": "2025-12-21T19:00:00+05:30"
  },
  {
    "name": "Let Poetry Be - Poetry Open Mic by Palgun K. J.",
    "description": "This monthly gathering will see poetry coming to life, through reading, music, art and any other forms of artistic expression, at Atta Galatta. Listeners and performers are all welcome!\nDate: 27th December\nTime: 4pm \nVenue: Atta Galatta, Indiranagar\n \nEvent specifics & submission guidelines –\n1. Theme - Free Verse (any original work)\n2. Works can be original or of other poets, performed live\n3. All languages welcome\n4. Participants can read to music (acoustic instrument/s), dramatise, use props & costumes\n5. Each participant will enjoy 5 minutes of reading time\n6. Kindly submit your poem and name to letpoetrybe@gmail.com on or before 25th Dec midnight. WE WILL NOT ACCEPT ATTACHMENTS OR LINKS. SUBJECT OF YOUR MAIL MUST READ AS 'Entry for-December LPB meet-up'\n7. You may also send entries that are not related to the theme\n8. The event will begin at 4pm sharp and will be held at Atta Galatta. Participants to report not later than 3:45 pm to hear about performance order and meet the host\n9. For any further clarifications, write to us at letpoetrybe@gmail.com\nYou are now welcome to flood our inbox!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1562",
    "image": "https://attagalatta.com/admin/uploads/events/271944344.png",
    "performer": "Palgun KJ",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-27T16:00:00+05:30",
    "endDate": "2025-12-27T18:00:00+05:30"
  },
  {
    "name": "My Life Closed Twice - Book Launch by Subhashini Kaligotla",
    "description": "Author Subhashini Kaligotla launches her new poetry collection My Life Closed Twice (Copper Coin, 2025), with Jeet Thayil.\nIn My Life Closed Twice, Subhashini Kaligotla charts the long aftermath of grief, and its recursive, obsessive cadences. Drawing on premodern India’s art, literature, and history, through invented forms and received ones, in fragments, litanies, lists, and queries, the poems in this spare volume embody the psychological terrain of the grieving. Two premature deaths are at the heart of the book. Kaligotla writes of their immediate aftereffects and their enduring impact. She braids her voice with voices from India’s past—from the unknown bards of the Sanskrit epics who counsel equanimity in the face of catastrophe to the laments of Ashoka, Bilhana, and Jahangir.\r\n \nAuthor Bio\nSubhashini Kaligotla is a poet and an art historian of ancient and medieval South Asia. She is author of the poetry collection Bird of the Indian Subcontinent and the monograph Shiva’s Waterfront Temples. She teaches at Columbia, dividing her time between New York City and Hyderabad.\r\n \nAdvance Praise for My Life Closed Twice\nSubhashini Kaligotla’s ingeniously fashioned poetic structures—which are light, flexible, delicate yet possessed of remarkable tensile strength and architectural clarity and integrity—aren’t just beautiful in themselves. They’re also vessels for deep imaginative feeling and thinking and wondering and longing. She has a unique, compelling lyric voice and a distinguished twenty-first century consciousness.\n- Vijay Seshadri\nAnger, denial, bargaining, despair, all the stages of grief except acceptance, each stage overlaid with the forensic precision generated by love when it has nowhere to go. These enraged, laceratingly plainspoken poems burn with the singular self-awareness that is the writer's curse, and the writer's gift. Two deaths enclose the book like 'two dates // enclosed / by parentheses'. It is impossible to read, say, 'Only Your Brother Will You Lose' – its fifty shards hammered into the flesh like fifty nine-inch nails – and come away unscathed. \n- Jeet Thayil",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1573",
    "image": "https://attagalatta.com/admin/uploads/events/537483135.jpg",
    "performer": "Subhashini Kaligotla",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-28T18:30:00+05:30",
    "endDate": "2025-12-28T19:30:00+05:30"
  }
]