[
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT791",
    "image": "https://attagalatta.com/admin/uploads/events/1787640217.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-27T07:00:00+05:30",
    "endDate": "2024-10-27T09:00:00+05:30"
  },
  {
    "name": "Mouthful Of Stories - Family Storytime",
    "description": "On a beautiful Sunday evening, let’s get on to a Story carpet and travel on a 60-minute journey through stories of Food, People, Animals, Birds and Trees. With stories from folktales, mythology, history and oral narratives, when the carpet lands back in the children 's world, the kids and parents will be left with loads of laughter, smiles, and happiness. The session is for kids 4+ and families/parents etc.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT793",
    "image": "https://attagalatta.com/admin/uploads/events/3120292.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-27T11:00:00+05:30",
    "endDate": "2024-10-27T13:00:00+05:30"
  },
  {
    "name": "Divine Delicacies - Storytelling and Menu Tasting Session",
    "description": "Food is such an integral part of our lives that we cannot imagine any worship without food. Keeping this in mind, we welcome you to a unique experience where we shall serve you samples of prasadams from various temples and share stories of places of worship and the perceived food preferences of the divine. Join Aparna Jaishankar for Divine Delicacies, only at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT786",
    "image": "https://attagalatta.com/admin/uploads/events/1125724586.jpeg",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "Storytelling",
      "Performance and Menu Tasting"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-27T12:30:00+05:30",
    "endDate": "2024-10-27T14:30:00+05:30"
  },
  {
    "name": "Artsytale: Canvas of Stories - Painting Workshop",
    "description": "Join Us for a Unique Art Adventure: Canvas of stories\nGet ready to dive into a creative experience like no other! Whether you're an experienced artist or someone who's never picked up a brush, this event is all about fun, exploration, and collaboration.\nWho’s It For?\nAnyone looking to relax, have fun, and try something new!\nWhat's in Store?\nA blank canvas to express yourself through colours.\nMeet new people, share creative thoughts, and leave with a masterpiece.\nWhy Join?\nThis would be a whole new experience like no other, it’s all about having fun—no rules, no pressure. Just you, some paint, and endless possibilities!\nDate & Time:\n27th October, 4–6 pm\nLocation:\nAtta Galatta, Indiranagar\nAll materials are provided, so just come along! Let’s create and connect together and have a fun experience.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT792",
    "image": "https://attagalatta.com/admin/uploads/events/144383247.jpeg",
    "performer": "Brunda M",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-27T16:00:00+05:30",
    "endDate": "2024-10-27T18:00:00+05:30"
  },
  {
    "name": "Secrets of  Sari Storytelling - Immersive Styling Workshop",
    "description": "Like Bill Waterson-Calvin’s SpaceMan Spiff, if you too nurture an alter ego of becoming a sari storyteller, attend this session. It discusses tips and techniques to refine your sari styling and fashion storytelling. Okay, it does not promise to turn you into a chic sensation overnight, but it can make you mindful of telling your sari style story by managing your fashion image for the world. You can apply the learning to daily life. NOTE: The workshop is for a limited number of participants. We request you to register accordingly. Please carry a sari you love or dislike, your fave journal, and a pen.\nOBJECTIVES\n\nTo help you express your sari fashion identity in a safe circle of listeners.\nTo help you know the ground rules of mindful sari styling for SELF.\nTo help you learn the basics of sari story writing for SELF (read: for social media).\n\nFACILITATOR\nThe session is conducted by Bhawana Pingali, former Fashion Features Editor of FEMINA (Worldwide Media Ltd.—Times of India / BBC Magazines). She is a mother of a teen, has been an editor-educator for the last 19+ years, and is currently authoring a book with PENGUIN. Her articles have appeared in The Hindu, Hindustan Times-Mint Lounge, Time Out, Lonely Planet, Travel + Leisure, Maxim, Orissa Post, Signature-Oman, among others. She has taught at NIFT, Pearl Academy, Symbiosis Institute of Design, CEPT-Ahmedabad, IIM-A, British Council (TEFL-certified trainer), GD Goenka and Ansal Universities. Her heart now lies in teaching yoga, and reviving saris and rituals through fashion research lab REVASTRA.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT764",
    "image": "https://attagalatta.com/admin/uploads/events/583020367.png",
    "performer": "Bhawana Pingali",
    "keywords": [
      "Fashion",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-09T17:00:00+05:30",
    "endDate": "2024-11-09T19:00:00+05:30"
  }
]