[
  {
    "name": "Qu For Quiz - Quiz",
    "description": "The Qu for Quiz is based on a grid format with the grids formed by topics on one axis and level of difficulty (and hence the points) on the other. The topics could be varied like History, Sports, Music, Literature, Movies and more. A team of two members would get to choose a topic and the level of difficulty and the question would be revealed. The rest of the teams can go for the buzzer if they know the answer. Depending on the number of teams registering, the size of the grid would be decided. \nSAMPLE Qu: 2. The name is inspired by the traditional malt whisky distillation process in which malted barley was mixed by hand with shovels. This labor-intensive process often caused a shoulder injury to workers, causing their arms to hang low. Which brand is named thus?\nGanesh Balakrishnan is an entrepreneur, marketer and creator of terrible dad jokes. His claim to fame is attempting to sell shoes during the pandemic, culminating in a viral Shark Tank \"Down But Not Out\" appearance. He is a collector of useless facts since childhood, and has dabbled in trivia quiz circuits since college. ganesh.flatheads@gmail.com\nKarthik Srinivasan is a pseudo-retired software leader by choice, specializing in innovative ideas to spend time that include organizing cricket leagues at the scale of IPL but for free, staying up to date on latest debates in virtual social groups helmed by family and friends and more on similar lines. emailkarth@gmail.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1321",
    "image": "https://attagalatta.com/admin/uploads/events/2057134007.png",
    "performer": "Ganesh Balakrishnan, \nKarthik Srinivasan,",
    "keywords": [
      "Quiz",
      "Quiz"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-08T19:00:00+05:30",
    "endDate": "2025-08-08T20:30:00+05:30"
  },
  {
    "name": "Addiction – A Doorway to Know Yourself - Wellness Session",
    "description": "In the session, we will explore:\n🟡What is an addiction?\n🟡Am I having an addiction?\n🟡Possible causes for an addiction\n🟡How to deal with addiction? \n \nThe session is for you:\n🟡If you are unsure whether what you have is an addiction or not\n🟡If you have an addiction and want to transform it\n🟡If you do not have an addiction but a family member or friend is having an addiction (it will be of help to both you and the person with addiction)\nRaamkumar will share his insights and understanding based on his own struggles with addiction for more than a decade which he finally found was an invitation for inner transformation and followed it, and his training on psychotherapy. (His bio: Raam's Journey)\nNotes:\n\nThe session is suitable for any kind of addiction including addiction to substances such as alcohol, cigarettes, coffee, sweets and compulsive behaviours related to eating, video games, sex, porn, gambling, shopping, social media. \nSince the participants may share deeply personal experiences or ask deeply personal questions, to join the session, participants need to agree to maintain confidentiality and not share the names or identities of other participants outside the session.\nHowever, it is not necessary to share your personal experiences in the session.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1335",
    "image": "https://attagalatta.com/admin/uploads/events/1213656521.png",
    "performer": "Raamkumar L., \nThe Circle of Light,",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-08-08T19:00:00+05:30",
    "endDate": "2025-08-08T20:30:00+05:30"
  },
  {
    "name": "Butter & Mashed Banana - Rehearsed Reading",
    "description": "A right-wing zealot and a left-wing rebel walk into a protest... and accidentally fall in love.\nWhat follows is a pregnancy no ideology could predict and a child born into a country already arguing over his first words. Butter & Mashed Banana is a razor-sharp, rhythm-driven satire about censorship, identity, and inherited confusion.\nThrough music, mockery and just enough movement to keep the chairs from revolting, it tells the story of a boy trapped between extremes - political, parental and poetic - who grows up to commit the most dangerous act of all: writing. Funny, furious and gloriously nonsensical, this theatrical reading asks - in a world obsessed with sides, can a voice still speak from the middle?",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1313",
    "image": "https://attagalatta.com/admin/uploads/events/125373403.png",
    "performer": "La Compagnie Dramatique",
    "keywords": [
      "Theatre",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-08T19:30:00+05:30",
    "endDate": "2025-08-08T20:30:00+05:30"
  },
  {
    "name": "Minds in Motion - Book Launch",
    "description": "We’re thrilled to announce the launch of Minds in Motion, a first-of-its-kind book bringing together voices from across the Indian sport psychology and mental health landscape.\nJoin us on 9th August at 11:30am, for an morning of conversations, reflections, and community as we celebrate the contributors behind the book and the stories that shaped it.\nFrom perfectionism and performance pressure to gender inclusivity and injury recovery, Minds in Motion explores the mental side of sport through lived experiences and professional insights.\nCome be part of this important dialogue, whether you're an athlete, coach, practitioner, or simply curious about the mind behind the game",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1333",
    "image": "https://attagalatta.com/admin/uploads/events/1761592.jpg",
    "performer": "Dr. Chaitanya Sridhar, \nKeerthana Swaminathan,",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-09T11:30:00+05:30",
    "endDate": "2025-08-09T12:30:00+05:30"
  },
  {
    "name": "Hand Painted Tea Coaster Workshop - Workshop",
    "description": "Step into a Saturday afternoon full of color and creativity at Atta Galatta in Indiranagar. Join our Hand‑Painted Tea Coaster Workshop—a light, playful, 2‑hour experience perfect for anyone looking to add a personal handmade touch to their home or gift one ahead of Raksha Bandhan.\nNo prior painting experience is required—just bring your mood and your imagination. You’ll be guided through the process of designing and painting your own set of stylish tea coasters, all while enjoying a cozy, aesthetic space filled with good energy.\nIt’s the ideal creative weekend activity to celebrate sibling bonds, or simply treat yourself to a relaxing and memorable Saturday afternoon.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1334",
    "image": "https://attagalatta.com/admin/uploads/events/1511905046.png",
    "performer": "Drush Kala, \nIt's Timb, \nShruthi Kulkarni,",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-08-09T12:30:00+05:30",
    "endDate": "2025-08-09T14:30:00+05:30"
  },
  {
    "name": "Atta Galatta Book Club - Monthly Book Club",
    "description": "What have you been reading? Come, discuss your latest read. Each member gets 5-7 minutes to talk about the book, theme, plot, with 2 minutes to answer any questions others might have. This month’s special focus will be a mid-year update- come tell us what you've been reading.\nEntry Free",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1329",
    "image": "https://attagalatta.com/admin/uploads/events/168267620.jpeg",
    "performer": "Palgun KJ",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-09T15:00:00+05:30",
    "endDate": "2025-08-09T17:00:00+05:30"
  },
  {
    "name": "Age of Mondays - Book Discussion",
    "description": "Ten-year-old Narois wakes up to find that her mother is preparing to go to a mysterious place---a place neither too far nor too close. It is a motherless Monday. The first of many.\nAs Narois's father struggles to adapt; as her parents' marriage comes apart; as Narois herself tries to make sense of the goings-on---is her mother having an affair; is she planning to abandon the family forever?---she creeps away into the dark, magical-real Jahanpanah forest to escape. Here, she encounters the Jugnus---legendary healers and weather-workers. Silver Samir, their handsome leader, Mian Pagla who followed the river, Kochi who is bendy when sad, and Velu the gentle murderer mesmerize Narois with their tales; she will do what she can to belong to them.\nIt is a world on the brink, where the mother Narois leans on may be unable to protect her and where betrayal can be love in disguise. Lyrical, precocious and devastatingly tender, Age of Mondays is a story of star-crossed friendships and childhood in a trembling, terrifying era.\nJoin us for a discussion with the author on 9th August at 4 PM! Lopa Ghosh will be in conversation with Dharini Bhaskar.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1326",
    "image": "https://attagalatta.com/admin/uploads/events/445819055.jpg",
    "performer": "Dharini Bhaskar, \nLopa Ghosh,",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-09T16:00:00+05:30",
    "endDate": "2025-08-09T17:00:00+05:30"
  },
  {
    "name": "Inheriting Shadows: Children of the Atom - Spoken Word and Performance Poetry",
    "description": "One story. Nine perspectives. Told entirely through poetry.\nHistory is never just one truth. On the 80th Anniversary of the Hiroshima and Nagasaki bombings, this event brings together nine powerful voices to tell the story of invention, destruction, and inheritance—from the birth of the atomic bomb to the shadows it left behind.\nEinstein hated guns, yet his work led to the deadliest weapon ever.\nOppenheimer built the bomb—but Germany was building one too.\nA pilot sat alone for 12 hours with the bomb. What went through his mind?\nChildren born of radiation—who do they blame? Their ancestors or their enemies?\n9 perspectives. 9 haunting truths.\nSome of Bangalore’s best poets bring them to life.\nTickets cost less than a burger. The story you’ll witness is priceless.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1314",
    "image": "https://attagalatta.com/admin/uploads/events/1609734387.png",
    "performer": "Non-Aligned Poets Collective",
    "keywords": [
      "Poetry",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-09T16:30:00+05:30",
    "endDate": "2025-08-09T18:30:00+05:30"
  },
  {
    "name": "Tiny Detectives at Atta Galatta - Treasure Hunt",
    "description": "If you’re on the lookout for a racy, entertaining hour filled with cryptic clues, secret messages, puzzles, riddles, anagrams, and more, Tiny Detectives at Atta Galatta is just the adventure for you!\nSpecially crafted for curious minds aged 6 to 12 years, this indoor treasure hunt promises giggles, gasps, and “Aha!” moments galore. Kids will put their thinking caps on, race from clue to clue, and work together to crack codes and uncover hidden surprises!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1332",
    "image": "https://attagalatta.com/admin/uploads/events/955961612.png",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "Treasure Hunt",
      "Treasure Hunt"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-09T17:30:00+05:30",
    "endDate": "2025-08-09T18:30:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1322",
    "image": "https://attagalatta.com/admin/uploads/events/500094170.png",
    "performer": "The Listeners Circle",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-08-10T11:00:00+05:30",
    "endDate": "2025-08-10T13:00:00+05:30"
  },
  {
    "name": "Dispensers of India's Destiny - Book Launch",
    "description": "📖 About the Book\nDispensers of India’s Destiny is an alternate history novel that reimagines India in a world where the Axis Powers won World War II.\nIn this reality, Subhas Chandra Bose leads an unpartitioned, newly independent India - caught between the competing ambitions of Nazi Germany and Imperial Japan, who have divided the globe into rival spheres of influence.\nThrough the lens of alternate history, Dispensers of India’s Destiny explores themes of patriotism, power, and the fragile promise of freedom.\n🎤 What to Expect\n•         Insightful conversation with the author on his book writing journey\n•         Live Q&A with the audience\n•         Exclusive book signing session\n•         Light refreshments & networking\n•         Be among the first 10 to register and join us in person to get a special launch day souvenir!\nWhether you’re a reader, a writer, or simply someone who loves to wonder about “what ifs”, this event promises imagination, reflection, and a shared sense of patriotism.\n🪶 About the Author\nTanmay Agarwal is a history buff, and an avid quizzer with a deep interest in international diplomacy. Born in Agra and having worked across the globe, he blends a love for logic with a flair for vivid imagination. A keen student of Indian history, his work explores the turning points where nations are remade or undone. His storytelling delves into ambition, betrayal, and the decisions that define freedom. Tanmay believes in agency over inevitability, and in fates shaped by intent, not by chance.\nDispensers of India’s Destiny is a gripping narrative, born of his enduring curiosity about history’s crossroads and the paths that could have been.\n📚 Books will be available for purchase at the venue.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1315",
    "image": "https://attagalatta.com/admin/uploads/events/258825687.png",
    "performer": "Tanmay Agarwal",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-10T12:30:00+05:30",
    "endDate": "2025-08-10T13:30:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "The next dates for Queer Quiet Hours are here!  \nQueer Quiet Hours is back — a cozy space to rest, make art, and just be. No pressure to talk, no need to perform. Just soft community vibes and gentle company. Bring your own project or come as you are. We'll have plenty of art stuff for you to use.\n✨ For LGBTQIA+ folks only. We haven't opened it up to allies yet.\n\r\n🆓 Free to join. Limited spots.\n\r\n📸 No photos taken without clear consent.\n\r\nSpots are limited - Sign up!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1275",
    "image": "https://attagalatta.com/admin/uploads/events/99240190.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-10T14:00:00+05:30",
    "endDate": "2025-08-10T17:00:00+05:30"
  },
  {
    "name": "A Karukku Norukku Time - Storytime",
    "description": "Guru absolutely loves the sound that murukkus make - KARUKKU NORUKKU! KARUKKU NORUKKU! Come find out if Guru manages to sneakily eat an entire packet of munchies – without sharing, that is!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1305",
    "image": "https://attagalatta.com/admin/uploads/events/1544557333.png",
    "performer": "Karadi Tales, \nSaritha Rao,",
    "keywords": [
      "Books",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-10T16:00:00+05:30",
    "endDate": "2025-08-10T17:00:00+05:30"
  },
  {
    "name": "Harry Potter Book Discussion - Meetup",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1324",
    "image": "https://attagalatta.com/admin/uploads/events/675526249.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-10T17:30:00+05:30",
    "endDate": "2025-08-10T19:00:00+05:30"
  },
  {
    "name": "An Evening of Magic - Magic Show",
    "description": "An Evening of Magic is a most amazing magic show presented by `Nakul Shenoy & Friends’, featuring top entertainers and magic acts. Curated and hosted by the internationally-acclaimed mentalist Nakul Shenoy, each event in this series brings unique acts and performances by nationally and internationally acclaimed magicians, alongside some of the most notable up-and-coming stars of magic. This is an evening that is truly magical, and one you will want to experience many times over.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1331",
    "image": "https://attagalatta.com/admin/uploads/events/1895701495.jpg",
    "performer": "Nakul Shenoy",
    "keywords": [
      "Magic",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-10T18:00:00+05:30",
    "endDate": "2025-08-10T19:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-12T17:00:00+05:30",
    "endDate": "2025-08-12T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-12T19:00:00+05:30",
    "endDate": "2025-08-12T18:00:00+05:30"
  },
  {
    "name": "Creative Passage - Art Therapy Workshop",
    "description": "Creative Passage: Moving Through Emotional Darkness with Bridging Art Activity\nA transformative workshop \nWhether you're facing personal or professional stress, anxiety, difficulty letting go, or uncertainty about the future — you're not alone. Creative Passage offers a safe, reflective space to explore your emotional landscape and move through it with intention, using the powerful, intuitive medium of expressive art.\nWhat is Creative Passage?\r\nThis workshop is grounded in the Bridging Art Activity — a guided creative process that supports emotional release, personal insight, and transformation. Through simple artistic expression, you'll gently explore what’s holding you back, and begin to build a path forward — from emotional darkness towards clarity and light.\nWho is this for? This experience is open to anyone aged 18 and above who may be:\n\nFeeling overwhelmed or anxious\nStruggling with life transitions or decisions\nHolding onto past pain or uncertainty\nHaving difficulty moving on or letting go\n\nNo art experience is needed. This is about the process, not the product.\nWhat you can expect:\n\nA guided expressive arts session using colour, shape, and symbolism\nMindful reflection to deepen insight and reconnect with your inner strength\nA supportive, non-judgmental space for emotional exploration\n\nBenefits: Participants often leave with:\n\nA greater sense of emotional relief and clarity\nFeeling more grounded, present, and empowered\nA deeper understanding of what’s holding you back — and what’s possible ahead\n\n___________________________________________________________________________\nFacilitator: Deepika Gupta\nCounselling Psychologist, Certified NLP Practitioner, Certified Life Coach\nDance Movement and Art Therapy Practitioner, Certified Grief Counsellor\nBharatanatyam Performer and Teacher",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1327",
    "image": "https://attagalatta.com/admin/uploads/events/1183736310.jpg",
    "performer": "Deepika Gupta",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-08-16T11:30:00+05:30",
    "endDate": "2025-08-16T13:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-19T17:00:00+05:30",
    "endDate": "2025-08-19T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-19T19:00:00+05:30",
    "endDate": "2025-08-19T18:00:00+05:30"
  },
  {
    "name": "Letters to Dadu: A Storytime for Hearts Big and Small - Storytelling",
    "description": "Join author Aprajita Singh for a warm and engaging storytelling session based on her picture book Summers with Dadu. Set in the world of mangoes, memories, and mischief, this session invites children (and grown-ups!) to relive the magic of holidays spent with grandparents and heartwarming connections across generations.\r\nCome be part of a fun-filled morning of stories, art and writing for the grandparents near and far!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1323",
    "image": "https://attagalatta.com/admin/uploads/events/1700706381.png",
    "performer": "Aprajita Singh",
    "keywords": [
      "Books",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-23T11:00:00+05:30",
    "endDate": "2025-08-23T12:00:00+05:30"
  },
  {
    "name": "We Fed the Whale A Greenhouse - Book Discussion",
    "description": "The AG Lit Sisters invite you to an intimate evening with award-winning journalist and debut author Sonali Prasad, as we dive into her lyrical and poignant novel Glass Bottom, a story of two pairs of mothers and daughters who reside by the sea, navigating the silent intensity of love, loss, legacy, and everything in between.\nSet against the shifting tides of the coastline, Glass Bottom offers a tender meditation on relationships, memory, and healing. In this special session, Sonali will read a short excerpt from the novel, followed by a heartfelt Q&A and book discussion with readers.\n📚 Hosted by AG Lit Sisters\r\n🎤 In collaboration with Pan Macmillan India\nWhether you're drawn to stories that stir your soul or conversations that linger long after they end, this is a session you won’t want to miss.\nSONALI PRASAD was born and raised in New Delhi, India. Her journalism has appeared in publications such as the Guardian, Washington Post, Hakai Magazine, Quartz and Esquire Singapore. She has been awarded a Pulitzer Traveling Fellowship, Global TED Fellowship, MIT Knight Science Journalism\r\nFellowship, Logan Science Journalism Fellowship and a Jan Michalski Writing Residency, among other grants and honours.\nGlass Bottom is her first book.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1308",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Dr. Chhavi Gandhi Juneja, \nSonali Prasad,",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-23T18:00:00+05:30",
    "endDate": "2025-08-23T20:00:00+05:30"
  },
  {
    "name": "Journaling Workshop - Slow Journaling Workshop",
    "description": "Best friending journaling – once again!\nA chill 2-hour journaling workshop for self-expression, fun, + reflection\nCome hang out for a relaxed afternoon where we’ll mix writing, art, and conversation. This isn’t about being “good” at journaling—it’s about showing up, having fun, and getting to know yourself a little better.\nExpect:\n🎨 Colours, of multiple kinds!\n📝 Easy journaling prompts—some deep, some totally weird\n💬 Time to share, reflect, and chat with others\nPerfect if:\n– You’re feeling stuck or rebuilding\n– You haven’t picked up a colouring tool in years\n– You want a space to express, reflect, and just be\n🧺 Bring: your journal (Important), any colours, and a curious mind\nCome as you are. No journaling or art experience needed.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1328",
    "image": "https://attagalatta.com/admin/uploads/events/1755078301.png",
    "performer": "Yukti",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-08-24T14:30:00+05:30",
    "endDate": "2025-08-24T16:30:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-26T17:00:00+05:30",
    "endDate": "2025-08-26T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-26T19:00:00+05:30",
    "endDate": "2025-08-26T18:00:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "The next dates for Queer Quiet Hours are here!  \nQueer Quiet Hours is back — a cozy space to rest, make art, and just be. No pressure to talk, no need to perform. Just soft community vibes and gentle company. Bring your own project or come as you are. We'll have plenty of art stuff for you to use.\n✨ For LGBTQIA+ folks only. We haven't opened it up to allies yet.\n\r\n🆓 Free to join. Limited spots.\n\r\n📸 No photos taken without clear consent.\n\r\nSpots are limited - Sign up!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1275",
    "image": "https://attagalatta.com/admin/uploads/events/99240190.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-07T14:00:00+05:30",
    "endDate": "2025-09-07T17:00:00+05:30"
  }
]