[
  {
    "name": "Kaleidoscope - Book Launch by Devika Das",
    "description": "Join us at Atta Galatta for the book signing with Devika Das for her latest release, “Kaleidoscope”. Art is everywhere in colours, words, music, movement. But what does it mean for those who create it? Kaleidoscope seeks to answer just that. The book features candid interviews with people from all walks of life, from painters and web-designers to teachers and homemakers . Exploring how creativity fuels their passion, transforms their worldview, and enriches their everyday existence.\r\nThrough these stories, Devika Das draws attention to the emotional and therapeutic power of art. She reveals how creativity offers healing, clarity, and a  sense of purpose, whether through colours on canvas, words on paper, or designs on a screen. Like the shifting patterns of a kaleidoscope, each story reveals a unique perspective, yet together they form a vibrant tapestry of human experience.\nJoin us at Atta Galatta for a special signing and an opportunity to hear the inspirations behind her compelling narratives.Meet the author, discover the stories behind the pages, and take home a signed copy that’s sure to stay with you long after the last line.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1567",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Devika Das",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-12T13:00:00+05:30",
    "endDate": "2025-12-12T14:00:00+05:30"
  },
  {
    "name": "Sirens of September - Book Discussion by Zeenath Khan",
    "description": "Atta Galatta is delighted to host author Zeenath Khan for a discussion on her powerful new novel, The Sirens of September, a sweeping work of historical fiction set against the turbulent backdrop of Hyderabad’s 1948 integration, Partition, and the shadowy world of espionage.\nThe novel follows Farishteh Ali Khan, a young aristocrat whose sheltered life in princely Hyderabad is upended as she is drawn into a maze of political intrigue, family secrets, and shifting loyalties. Moving between the opulent corridors of Hyderabad, the refugee camps of post-Partition Bombay, military command rooms, and the underbelly of Piccadilly in London, Khan crafts a vivid narrative of a world in upheaval.\nAt its heart, the story explores Farishteh’s unexpected bond with air force pilot Saleem El Edroos, a relationship tested by distance, war, and the consequences of a fallen kingdom. The fate of their families rests on a single figure—one whose power to save them is equal to their ability to destroy everything.\nJoin us for an engaging conversation on history, identity, and storytelling with one of the most compelling new voices in Indian historical fiction.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1566",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Zeenath Khan",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-12T16:00:00+05:30",
    "endDate": "2025-12-12T18:00:00+05:30"
  },
  {
    "name": "Qu for Quiz - Quiz by Karthik Srinivasan and Ganesh Balakrishnan",
    "description": "The Qu for Quiz is based on a grid format with the grids formed by topics on one axis and level of difficulty (and hence the points) on the other. The topics could be varied like History, Sports, Music, Literature, Movies and more. A team of two members would get to choose a topic and the level of difficulty and the question would be revealed. The rest of the teams can go for the buzzer if they know the answer. Depending on the number of teams registering, the size of the grid would be decided. \nSAMPLE Qu: 2. The name is inspired by the traditional malt whisky distillation process in which malted barley was mixed by hand with shovels. This labor-intensive process often caused a shoulder injury to workers, causing their arms to hang low. Which brand is named thus? \nGanesh Balakrishnan is an entrepreneur, marketer and creator of terrible dad jokes. His claim to fame is attempting to sell shoes during the pandemic, culminating in a viral Shark Tank \"Down But Not Out\" appearance. He is a collector of useless facts since childhood, and has dabbled in trivia quiz circuits since college. ganesh.flatheads@gmail.com\n\r\nKarthik Srinivasan is a pseudo-retired software leader by choice, specializing in innovative ideas to spend time that include organizing cricket leagues at the scale of IPL but for free, staying up to date on latest debates in virtual social groups helmed by family and friends and more on similar lines. emailkarth@gmail.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1552",
    "image": "https://attagalatta.com/admin/uploads/events/971183492.png",
    "performer": "Karthik Srinivasan",
    "keywords": [
      "Quiz",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-12T19:00:00+05:30",
    "endDate": "2025-12-12T20:30:00+05:30"
  },
  {
    "name": "Atta Galatta presents “AG Book Club” - Monthly Book Club with Palgun KJ",
    "description": "What have you been reading? Come, discuss your latest read. Each member gets 5-7 minutes to talk about the book, theme, plot, with 2 minutes to answer any questions others might have. This month’s special focus will be philosophy- come tell us what you've been reading.\nDecember’s special focus will be books on Philosophy/ Self Help/ Motivational",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1565",
    "image": "https://attagalatta.com/admin/uploads/events/374346458.png",
    "performer": "Palgun KJ",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-13T15:00:00+05:30",
    "endDate": "2025-12-13T17:00:00+05:30"
  },
  {
    "name": "The Store Of Life - Book Reading Session by Shruthi Harikrishna",
    "description": "At the supermarket, you fill your basket to get the most for your money. At the Store of Life, you fill your basket to get the most out of your time, the one truly finite resource.\nAt this book-reading session, we’ll explore a few chapters together, try out some simple activities, and reflect on what we choose to carry with us. As you spend your most important currency, your time, with me, I hope to fill your life basket with a little bit of joy, clarity, and purpose.\nThis event is free of charge, but it is “charged” in that precious currency of time.\nWhether you're struggling to say no, trying to find balance, hoping to create space for what matters, or curious about the compounding power of small habits, there’s something here for you.\nTold through simple doodles and gentle reflections, the book invites you to pause, pick wisely, and carry only what brings joy, peace, and purpose. You can flip through it lightly, dip into it occasionally, or explore it deeply - whatever your heart desires.\nSo… what will you choose to carry with you?\nAnd if you can, do join the session. It would fill my basket with joy.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1555",
    "image": "https://attagalatta.com/admin/uploads/events/1404300238.jpeg",
    "performer": "Shruthi Harikrishna",
    "keywords": [
      "Books and Literature",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-13T17:00:00+05:30",
    "endDate": "2025-12-13T19:00:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup by The Listeners Circle",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1553",
    "image": "https://attagalatta.com/admin/uploads/events/140940548.png",
    "performer": "The Listeners Circle",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-14T11:00:00+05:30",
    "endDate": "2025-12-14T13:00:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup by ADHD Queeple",
    "description": "The next dates for Queer Quiet Hours are here!  Register here - http://bit.ly/adhdqueeple\n\r\nQueer Quiet Hours is back — a cozy space to rest, make art, and just be. No pressure to talk, no need to perform. Just soft community vibes and gentle company. Bring your own project or come as you are. We'll have plenty of art stuff for you to use.\n✨ For LGBTQIA+ folks only. We haven't opened it up to allies yet.\n \n📅 14th December\nSunday, 2:00 - 5:00 PM\n📍 @attagalatta, Indiranagar, Bangalore\n🆓 Free to join. Limited spots ( Sign up)\n📸 No photos taken without clear consent.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1563",
    "image": "https://attagalatta.com/admin/uploads/events/1966888630.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Community",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-14T14:00:00+05:30",
    "endDate": "2025-12-14T17:00:00+05:30"
  },
  {
    "name": "The mystery of ETC - Book Launch by Deepak M",
    "description": "I am honoured to invite you to the launch of my debut novel at Atta Galatta, Koramangala.\nETC. is a romantic whodunit that spans continents — a story of love fractured by fate, secrets buried in silence, and a journey that crosses Russia, Ukraine, and India in search of the truth.\nAt its heart is Aditya… a man who risks everything to uncover what happened the night his wife vanished in the Russian wilderness — and why.\n \nThis evening will unravel:\n• the origin of the story\n• readings from key passages\n• a deep dive into the characters\n• an open Q&A\n• followed by book signing\n \nEvent Details:\n📅 19th December\n⏰ 6:30 PM onwards\n📍 Atta Galatta, Koramangala\n \nJoin me as we step into a world of secrets, longing, betrayal, and discovery — where not everything is as it seems… and every answer leads to another question.\nAll are welcome.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1564",
    "image": "https://attagalatta.com/admin/uploads/events/1806385050.jpg",
    "performer": "Deepak M",
    "keywords": [
      "Books",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-19T18:30:00+05:30",
    "endDate": "2025-12-19T20:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Domlur - Story Walk by Vikram Sridhar",
    "description": "On a Saturday morning , Walk through the lanes of DOMLUR , from lores dating back in time from the Madras Presidency , Mysore State to the current IT , Banking and Retail sectors with Vikram Sridhar discovering the lanes through the Folklore , Heritage and Ecology of the rich area which is identified as a village. The walk will begin from Bhandutvas , a theatre collective , and culminate at the Bangalore International Centre . The tales will revolve around historical , mythical and personal narratives weaved as we discover the area through the walk.\n*Date* : 20th December   ( Saturday)  2025\n *Time* : 7 AM\n *Starting Point* : Atta Galatta\nRegistration : 350/ per person \nTicket Link : https://in.bookmyshow.com/plays/a-story-walk-through-domlur-bangalore/ET00465609\n(or) \nDetails and GPAY : 9945799224",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1569",
    "image": "https://attagalatta.com/admin/uploads/events/1023676153.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-20T07:00:00+05:30",
    "endDate": "2025-12-20T09:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk by Vikram Sridhar",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.\n*Date* : 20 December\n *Time* : 10 AM\n *Starting Point* : Atta Galatta\nRegistration : 350/ per person \nTicket Link : https://in.bookmyshow.com/plays/a-story-walk-through-indiranagar-bangalore/ET00387939\n(or) \nDetails and GPAY : 9945799224",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1568",
    "image": "https://attagalatta.com/admin/uploads/events/946272302.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-20T10:00:00+05:30",
    "endDate": "2025-12-20T12:00:00+05:30"
  },
  {
    "name": "Food In Literature - Book Club with Prachi Grover",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well. \nSo, if viewing the world through the lens of food and literature interests you, then join us for a dialogue on “Food in Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we read our way through several powerful (and delicious) narratives.\nDecember Read: The Evin Prison Bakers' Club by Sepideh Qolian\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available. \nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who love to read and eat!\nWhen: Saturday, 20th December, 2025 at 11 a.m.\nWhere: Atta Galatta Bookstore, Indira Nagar\nAges: 18+\nRegistration is mandatory (link in bio)\nCopies of the book are available at the store.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1559",
    "image": "https://attagalatta.com/admin/uploads/events/1817058589.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-20T11:00:00+05:30",
    "endDate": "2025-12-20T13:00:00+05:30"
  },
  {
    "name": "❄️✨ Winter pages, warm hearts, and the soft magic of stories… ✨❄️ - AG Lit Sisters Thematic Book Club",
    "description": "The AG Lit Sisters are closing the year with a beautifully cozy December gathering: Snowflakes & Storytelling!\nThink twinkling lights, favourite winter reads, shared laughter, and the joy of being surrounded by bookish soul-sisters. 💙📚\n📅 December 20, 2025\n⏰ 1:30–3:00 PM\n📍 Atta Galatta, Indiranagar\n☕ Coffee on the house for everyone!\n \nEntry is FREE but online registration is mandatory, and we have only 20 slots. First come, first seated!\nBring your favourite winter story, your festive cheer, and your warmest energy. Let’s make it a December to remember. 🌨️✨\n❓ Question of the Day:\nWhich book gave you the coziest winter feeling this year?",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1560",
    "image": "https://attagalatta.com/admin/uploads/events/292755057.jpg",
    "performer": "Dr. Chhavi Gandhi Juneja",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-20T13:30:00+05:30",
    "endDate": "2025-12-20T15:00:00+05:30"
  },
  {
    "name": "Lahe Lahe Caravan presents Harry Potter Book Discussion - Meetup by Sonali Bhatia",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1554",
    "image": "https://attagalatta.com/admin/uploads/events/565028741.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-21T11:00:00+05:30",
    "endDate": "2025-12-21T12:30:00+05:30"
  },
  {
    "name": "Whispers from the Lighthouse of Galle - Book Launch by Priyanka Kumar",
    "description": "In an era where Gen Zs and millennials seek meaning through experiences rather than possessions, Whispers from the Lighthouse of Galle – Stories of Friendships & Adventures in Nature offers exactly the kind of soulful escape today’s young adventurers crave. For those who live for spontaneous road trips, mountain treks, beach escapades, and serendipitous conversations with strangers—and secretly nurture the hope of finding love and companionship along the way—Priyanka Kumar’s latest collection is a deeply relatable read. With its mix of short stories and memoir-style reflections, this book resonates with those who believe that real connection and personal discovery often happen far away from the familiar.\nThe newest installment in Priyanka’s celebrated People’s Kafe series, Whispers from the Lighthouse of Galle brings together heartfelt stories and travel-infused memories that capture the healing magic of nature and the unspoken bonds we form with people and places. Though it’s not a travelogue in the conventional sense, the book reads like one—with vivid glimpses into landscapes and emotions that stay with the reader long after they turn the final page.\nAnd yet, the book is as much about the people as it is about the places. There are tales of peacocks who roamed her childhood garden like kin, strangers-turned-friends on spontaneous journeys, and even encounters that subtly hint at love blossoming when least expected. The presence of love—gentle, unforced, and organic—is a quiet undercurrent in a couple of these stories, offering a warm, relatable thread for every romantic dreamer who has ever looked out of a train window and wondered, what if?",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1541",
    "image": "https://attagalatta.com/admin/uploads/events/996951640.jpeg",
    "performer": "Priyanka Kumar",
    "keywords": [
      "Travel",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-21T17:30:00+05:30",
    "endDate": "2025-12-21T19:00:00+05:30"
  },
  {
    "name": "Let Poetry Be - Poetry Open Mic by Palgun K. J.",
    "description": "This monthly gathering will see poetry coming to life, through reading, music, art and any other forms of artistic expression, at Atta Galatta. Listeners and performers are all welcome!\nDate: 27th December\nTime: 4pm \nVenue: Atta Galatta, Indiranagar\n \nEvent specifics & submission guidelines –\n1. Theme - Free Verse (any original work)\n2. Works can be original or of other poets, performed live\n3. All languages welcome\n4. Participants can read to music (acoustic instrument/s), dramatise, use props & costumes\n5. Each participant will enjoy 5 minutes of reading time\n6. Kindly submit your poem and name to letpoetrybe@gmail.com on or before 25th Dec midnight. WE WILL NOT ACCEPT ATTACHMENTS OR LINKS. SUBJECT OF YOUR MAIL MUST READ AS 'Entry for-December LPB meet-up'\n7. You may also send entries that are not related to the theme\n8. The event will begin at 4pm sharp and will be held at Atta Galatta. Participants to report not later than 3:45 pm to hear about performance order and meet the host\n9. For any further clarifications, write to us at letpoetrybe@gmail.com\nYou are now welcome to flood our inbox!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1562",
    "image": "https://attagalatta.com/admin/uploads/events/271944344.png",
    "performer": "Palgun KJ",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-27T16:00:00+05:30",
    "endDate": "2025-12-27T18:00:00+05:30"
  }
]