[
  {
    "name": "Qu For Quiz - Quiz",
    "description": "The Qu for Quiz is based on a grid format with the grids formed by topics on one axis and level of difficulty (and hence the points) on the other. The topics could be varied like History, Sports, Music, Literature, Movies and more. A team of two members would get to choose a topic and the level of difficulty and the question would be revealed. The rest of the teams can go for the buzzer if they know the answer. Depending on the number of teams registering, the size of the grid would be decided. \nSAMPLE Qu: 2. The name is inspired by the traditional malt whisky distillation process in which malted barley was mixed by hand with shovels. This labor-intensive process often caused a shoulder injury to workers, causing their arms to hang low. Which brand is named thus? If you know the answer, sign-up right away, and stand a chance to win an exciting prize!\nGanesh Balakrishnan is an entrepreneur, marketer and creator of terrible dad jokes. His claim to fame is attempting to sell shoes during the pandemic, culminating in a viral Shark Tank \"Down But Not Out\" appearance. He is a collector of useless facts since childhood, and has dabbled in trivia quiz circuits since college. ganesh.flatheads@gmail.com\nKarthik Srinivasan is a pseudo-retired software leader by choice, specializing in innovative ideas to spend time that include organizing cricket leagues at the scale of IPL but for free, staying up to date on latest debates in virtual social groups helmed by family and friends and more on similar lines. emailkarth@gmail.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT889",
    "image": "https://attagalatta.com/admin/uploads/events/512166282.png",
    "performer": "Ganesh Balakrishnan, \nKarthik Srinivasan,",
    "keywords": [
      "Quiz",
      "Quiz"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-10T19:00:00+05:30",
    "endDate": "2025-01-10T20:30:00+05:30"
  },
  {
    "name": "Story Frames: Unlocking the Power of Visual Interpretation - Workshop for Children",
    "description": "This 75-minute interactive workshop invites children aged 8 to 13 to explore the art of interpreting stories and fiction through visuals. Participants will delve into characters, themes, emotions, and plot points from any book or short story they have read using photographs, artwork, and craft. The session focuses on developing key skills like understanding symbolism, practising critical thinking, and engaging in self-reflection. Through this immersive experience, children will gain tools to analyze and interpret books in a meaningful way, enhancing their ability to connect with stories on a deeper level.\nAt the end of this workshop participants will,\nEnhance essential life skills such as critical thinking and making self-to-text connections in a fun, engaging, and experiential manner\nLearn how to use visuals to express their perspectives regarding a story - whether it is about the plot, emotions, themes, or characters\nDesign/Create a visual to demonstrate their understanding of any story they have read in the past\nReceive a short `how-to` guide that they can apply to future stories\nGet motivated to further engage in reading literature\nAbout SkilLit Readers\nSkilLit Readers is an initiative designed to cultivate life skills in children by blending literature with experiential learning. Our goal is to help children become self-aware, empathetic, collaborative, and socially responsible thinkers. We facilitate programs that explore characters, themes, and plot points in a book through engaging, hands-on activities involving music, writing, photography, imagery, speech, role-playing, mind mapping, movement, drawing, and crafts. Our offerings include both in-person and online sessions, spanning from single workshops to extended programs. We are also proud to be a platform that actively includes Indian literature in our curriculum and programs.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT886",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "SkilLit Readers",
    "keywords": [
      "Kids",
      "Workshop"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2025-01-11T11:00:00+05:30",
    "endDate": "2025-01-11T12:15:00+05:30"
  },
  {
    "name": "Pen & Latte 7.0 - Story Writing Workshop",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT879",
    "image": "https://attagalatta.com/admin/uploads/events/106178628.png",
    "performer": "Aristotle's Writers Club",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-11T11:11:00+05:30",
    "endDate": "2025-01-11T14:22:00+05:30"
  },
  {
    "name": "Mythology Marvels - Storytime for Children and Families",
    "description": "Indic Mythology is full of answers to the many whys of our culture. Join Lavanya Prasad and Meenu Sivaramakrishnan, as they explore and bring forth the marvellous stories from Indic mythology through music, dance and theatre.\nWho does not like a second chance in life to make the wrongs into rights? The stories we bring to you from our very own puranas are filled with hope and magic. There is a saying, when the going gets tough, the tough get going. Come and listen to these wondrous tales from Indic Mythology and go home filled with hope!\nThis is a not to be missed session for children and adults alike! We also have planned a surprise parent- child activity for you all :-).",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT892",
    "image": "https://attagalatta.com/admin/uploads/events/928363486.png",
    "performer": "Lavanya Prasad, \nMeenu Sivaramakrishnan,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2025-01-11T14:30:00+05:30",
    "endDate": "2025-01-11T15:30:00+05:30"
  },
  {
    "name": "An Evening of Nature Poetry - Poetry Circle",
    "description": "\"There is only one question: how to love this world,\" wrote Mary Oliver in her eternal poem 'Spring'. While we turn inward to watch in wonder how this one immense world we inhabit transforms into many within us, we meet another wonder that language is, one that helps us make sense of the sensations. Join us for an hour of nature poetry reading with Sourabha Rao, a writer, poet, translator and budding wildlife conservation filmmaker, and her fellow poetry lovers as they take you through the rainforests of Āgumbe and the savannahs of Africa! From a caterpillar crawling on a leaf to a cheetah charging at an impala, all churning as moving images within the Atta Galatta auditorium. All we need are a few fellow nature lovers with us!\nSee you on 11 January at 5.30 PM to witness how everything in our more-than-human world can make all that is human more bearable and beautiful. And this one hour is simply a prologue to what we believe could be a lifelong love affair for you with nature poetry.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT888",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Sourabha Rao",
    "keywords": [
      "Poetry",
      "Poetry Circle"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-11T17:30:00+05:30",
    "endDate": "2025-01-11T18:30:00+05:30"
  },
  {
    "name": "Artinomics - Session on Finance and Economics",
    "description": "Artinomics is an exploration of financial and economic concepts through examples of art and culture. Join in for a lively chai-pe-charcha type discussion on how culture and art tell us about finance. Markets are driven by market sentiment, and how sentiment is shaped is explored in art. What makes gold so stable? How do different cultures view it? What are financial bubbles? What do we know about them? What shapes our attitudes towards interest rates? These are some of the questions we will explore through poetry, literature, paintings and more! Join Nithya Sridharan, financial expert, in this riveting new discussion on the cultural history of finance.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT896",
    "image": "https://attagalatta.com/admin/uploads/events/1300437599.png",
    "performer": "Nithya Sridharan",
    "keywords": [
      "Finance",
      "Discussion"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-01-11T18:00:00+05:30",
    "endDate": "2025-01-11T19:00:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT890",
    "image": "https://attagalatta.com/admin/uploads/events/1159968854.jpeg",
    "performer": "The Listeners Circle",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-01-12T11:00:00+05:30",
    "endDate": "2025-01-12T13:00:00+05:30"
  },
  {
    "name": "Harry Potter Book Discussion - Meetup",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT891",
    "image": "https://attagalatta.com/admin/uploads/events/1776085642.jpeg",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Books and Literature",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-12T11:00:00+05:30",
    "endDate": "2025-01-12T12:30:00+05:30"
  },
  {
    "name": "Texture Painting Workshop - Workshop",
    "description": "Creative Unblock brings to you an immersive Texture Painting Workshop dedicated to the unique art of impasto painting! This session focuses exclusively on creating stunning floral designs using thick, textured strokes that bring your canvas to life.\nWe will guide you through the impasto technique, where you`ll learn how to apply paint in thick layers to achieve a three-dimensional effect. You`ll explore different tools, from palette knives to brushes, to create rich, vibrant florals that pop right off the canvas.\nWhether you`re a beginner or an experienced artist, this workshop offers a unique opportunity to dive deep into the world of impasto. All supplies will be provided, and you`ll leave with your very own floral masterpiece ready to hang.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT894",
    "image": "https://attagalatta.com/admin/uploads/events/1750695099.png",
    "performer": "Creative Unblock",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-12T17:00:00+05:30",
    "endDate": "2025-01-12T19:00:00+05:30"
  },
  {
    "name": "Fun Session on Financial Literacy for Kids - Session",
    "description": "Join us for a fun-filled, story ridden session on financial literacy for kids ages 6-11. Led by Nithya Sridharan, a financial expert, the session will include stories from around the world that have financial concepts. The session also includes a reading from the book, \"The Magic Box\". Basic concepts in the book, like what a simple bank is, what interest rates are, will be talked about. Financial literacy needs to start at a young age, in order to make fiscally responsible adults. The session is intended to create curiosity about our economic world.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT897",
    "image": "https://attagalatta.com/admin/uploads/events/420819646.png",
    "performer": "Nithya Sridharan",
    "keywords": [
      "Finance",
      "Discussion"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-01-12T17:00:00+05:30",
    "endDate": "2025-01-12T18:00:00+05:30"
  },
  {
    "name": "Weaving A Story - A curated exploration of Sambalpuri Sarees through stories",
    "description": "Join us for a curated storytelling evening - Weaving a story (A curated exploration of Sambalpuris through stories and sarees)\nDelve into the symbolic significance of the vibrant colors and intricate motifs, from the resplendent silver threads to the beautiful temple borders. Learn how each saree tells a story of devotion, culture, and timeless elegance. Whether you're a lover of textiles, mythology, or just fascinated by Indian heritage, this event will wrap you in the magic of tradition.\nAbout the Saree Connoisseur:\nDr. Sahana Das is the Director of RBANMs First Grade College and former HOD at Mount Carmel College, where she designed Bangalore University's first Honours Programme in Communication Studies. A trained Odissi dancer and Doordarshan artiste, she promotes Indian Art and Aesthetics through performances, workshops, and seminars while offering communication training to institutions.\nAbout the Storyteller:\nAparna Jaishankar is a Storyteller, Educator and Corporate Trainer.\nAparna’s passion lies in exploring Indic Mythology with a contemporary lens. She enjoys the various versions of these stories found in the nooks and crannies of the Indian subcontinent in the form of songs, theatre, dance, weaving, rituals and practices. She incorporates these rich sources in her Storytelling performances.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT895",
    "image": "https://attagalatta.com/admin/uploads/events/1002825006.jpeg",
    "performer": "Aparna Jaishankar, \nDr. Sahana Das,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-12T18:30:00+05:30",
    "endDate": "2025-01-12T19:30:00+05:30"
  },
  {
    "name": "Acupuncture Healing Energy Bootcamp - Wellness Workshop",
    "description": "Join us for an eye-opening and heart-opening session of healing at Atta Galatta on Saturday, 18th January, 11 AM to 12:30 PM\nIn this session you will:\nLearn about the ancient Chinese system of healing known as Acupuncture\nUnderstand how blocked and imbalanced energies in our bodies could lead to chronic physical and emotional ailments\nGet personalized treatment to unblock and balance your energies (no needles involved)\nHave an intense guided journalling and meditation session to uncover inner wounds and heal them\nGet tips for a more balanced life\nIdeal for those who suffer from recurring physical ailments, those who seek to break recurring unhealthy behavioural patterns, those seeking relief from stress and anxiety and for curious souls looking to understand their bodies and minds better.\nParticipants are requested to wear loose and comfortable clothing as we will be doing some light stretches during the session.\nPlease bring along a pen and a bottle of water.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT880",
    "image": "https://attagalatta.com/admin/uploads/events/1349227759.png",
    "performer": "Benazir",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-18T11:00:00+05:30",
    "endDate": "2025-01-18T12:30:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nJanuary Read: Sweet Malida: Memories of a Bene Israel Woman by Zilka Joseph\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT885",
    "image": "https://attagalatta.com/admin/uploads/events/235401023.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books and Literature",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-18T11:00:00+05:30",
    "endDate": "2025-01-18T13:00:00+05:30"
  },
  {
    "name": "Mehfil 3.0 – Celebrating Women in Poetry - Poetry Circle",
    "description": "Join us for the third edition of MEHFIL, presented by Aavirbhaav Kaavya Manch, as we come together to honor the timeless beauty of poetry.\nThis special gathering is dedicated to celebrating Women in Poetry, featuring soul-stirring recitations and thought-provoking discussions about their profound impact on the world of verse.\nWe invite you to bring your own original poems to life, offering a platform for both budding and seasoned poets to showcase their talent and creativity.\nImmerse yourself in an afternoon of poetic brilliance, meaningful conversations, and a shared love for the written word. Let your voice find its place at Aavirbhaav Kaavya Manch, where words connect hearts and minds.\nNote: Poetries from languages other than Hindi/Urdu are also welcome",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT893",
    "image": "https://attagalatta.com/admin/uploads/events/1170740124.jpg",
    "performer": "Aavirbhaav Kaavya Manch",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-18T15:00:00+05:30",
    "endDate": "2025-01-18T17:00:00+05:30"
  },
  {
    "name": "Chapters Unsealed 7.0 - Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nSharing your views on favorite books.\nParticipating in the curated discussion.\nVoting for a Monthly Book Read.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT881",
    "image": "https://attagalatta.com/admin/uploads/events/972227345.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-19T11:11:00+05:30",
    "endDate": "2025-01-19T14:22:00+05:30"
  },
  {
    "name": "Cut Nib Calligraphy - Calligraphy Workshop",
    "description": "25th & 26th January 2025 - 2-Day Workshop - 6 Hours of Training - 2 Scripts\nCut Nib Calligraphy traces its roots back centuries, to ancient civilizations such as the Greeks, Romans, and Chinese, who used vivid chisel-tipped writing instruments to inscribe their languages and artistic expressions onto various surfaces.\nFast forward to the modern era, Cut Nib Calligraphy continues to thrive as both a traditional craft and a contemporary art form. Today, artists and enthusiasts worldwide explore its expressive potential, blending traditional techniques with modern innovations to create stunning works of calligraphy art in this 2-day workshop!\nWhat you will learn from this workshop:\n-Origin of Calligraphy\n-The meaning behind this art\n-Introduction to Tools\n-Understanding Stroke Variations\n-Exploring & Learning Two Letter Forms: Roman & Gothic\n-Promoting Continued Practise post workshop\nWhether you`re a seasoned calligrapher or a curious beginner, this workshop offers an opportunity to refine your skills and discover more about Calligraphy\nWhat do you need to bring?\nWater bottle to keep you hydrated\nThis workshop includes all materials if required kindly get an Examination Pad / Paper Board",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT882",
    "image": "https://attagalatta.com/admin/uploads/events/1853531469.png",
    "performer": "Sindhoor Suryavamshi",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-25T11:00:00+05:30",
    "endDate": "2025-01-25T14:00:00+05:30"
  },
  {
    "name": "Cut Nib Calligraphy - Calligraphy Workshop",
    "description": "25th & 26th January 2025 - 2-Day Workshop - 6 Hours of Training - 2 Scripts\nCut Nib Calligraphy traces its roots back centuries, to ancient civilizations such as the Greeks, Romans, and Chinese, who used vivid chisel-tipped writing instruments to inscribe their languages and artistic expressions onto various surfaces.\nFast forward to the modern era, Cut Nib Calligraphy continues to thrive as both a traditional craft and a contemporary art form. Today, artists and enthusiasts worldwide explore its expressive potential, blending traditional techniques with modern innovations to create stunning works of calligraphy art in this 2-day workshop!\nWhat you will learn from this workshop:\n-Origin of Calligraphy\n-The meaning behind this art\n-Introduction to Tools\n-Understanding Stroke Variations\n-Exploring & Learning Two Letter Forms: Roman & Gothic\n-Promoting Continued Practise post workshop\nWhether you`re a seasoned calligrapher or a curious beginner, this workshop offers an opportunity to refine your skills and discover more about Calligraphy\nWhat do you need to bring?\nWater bottle to keep you hydrated\nThis workshop includes all materials if required kindly get an Examination Pad / Paper Board",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT882",
    "image": "https://attagalatta.com/admin/uploads/events/1853531469.png",
    "performer": "Sindhoor Suryavamshi",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-26T11:00:00+05:30",
    "endDate": "2025-01-26T14:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT887",
    "image": "https://attagalatta.com/admin/uploads/events/10443690.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T07:00:00+05:30",
    "endDate": "2025-02-23T09:30:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT887",
    "image": "https://attagalatta.com/admin/uploads/events/10443690.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T07:00:00+05:30",
    "endDate": "2025-03-09T09:30:00+05:30"
  }
]