[
  {
    "name": "Troo in Bengaluru! - A Weekend of Creativity, Curiosity and Connection for Families",
    "description": "Troo in Bengaluru: A Weekend of Creativity, Curiosity, and Connection for Families\nTroo, the new digital playful companion and learning coach for children, brought to you by Yeti, My Friend. Yeti My Friend is making its grand community launch in Bengaluru with a unique family-focused event. Hosted at the popular Atta Galatta bookstore on February 18th and 19th, the event promises an unforgettable weekend filled with creativity, curiosity, and connection for parents and kids alike.\nYeti, My Friend is a creative learning platform designed to spark curiosity and nurture creativity in children through engaging activities, stories, and screen-free experiences in its award-winning educational app for children aged 4-9.\nThis immersive two-day event will feature four interactive sessions (two hours each) tailored to engage children and parents. Kids can look forward to hands-on activities that will spark their curiosity and creativity, inspired by the magical world of Troo and captivating storytelling sessions led by Lavanya Prasad (Founder of Talescope) and Charulatha C, Author of the best-selling Beaming Child series.\nParents can participate in thought-provoking round-table discussions, parenting talks, and interactive activities that foster community and share valuable insights into modern parenting.\n\"Troo's mission has always been to nurture curiosity and creativity in children while offering parents tools and a supportive community to navigate their parenting journey,\" said Sudha Shankar, CEO & Founder of Yeti, My Friend. \"This event brings that mission to life through a screen-free, enriching experience for families.\"",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT940",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "My Friend Yeti, \nSudha Sankar,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-01T11:00:00+05:30",
    "endDate": "2025-02-01T13:00:00+05:30"
  },
  {
    "name": "1000 Days of Love - Weekly Book Reading Sessions",
    "description": "What is it? TDOL Secret Sessions is a one-of-a-kind event series to give you a front-row seat to the upcoming novel, 1000 Days of Love. In each session, the author will read two chapters and get your feedback in real time, while you get to meet like-minded people and build lifelong connections. \nWho is doing it? This event is hosted by the novel's author, Soundarya Balasubramani. She's a 2x author, founder of an American startup, renowned speaker, and influencer. Find her on LinkedIn and Instagram.\nWhy? Products have \"launches\" where they get user feedback to iterate and improve. Why not a book too? \nWhen? Ten sessions are hosted beginning January 11th, 2025 - February 9th, 2025, every Saturday and Sunday afternoon.\nWhere?  Atta Galatta- The Bookstore (178, 5th Main Rd, Indira Nagar 1st Stage, 1st Stage, Indiranagar, Bengaluru, Karnataka 560038)\nWe're only choosing 25 people per session. Spots are limited. Please apply below and we'll be in touch :) Let's create some magic together ✨\n***DETAILS***\n📅 Sessions: Every Saturday and Sunday at 2 PM IST, starting January 11, 2025\r\n🕒 Duration: 90 minutes\r\n📍 Location: Atta Galatta - The Bookstore, Bangalore, India\r\n🎟️ Cost: Free of cost + Free food and refreshments + Incentives (Receive a free copy of the book when you attend 2 or more sessions, and earn an exclusive TDOL T-shirt 👕 by joining 5 or more sessions! 😊✨)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT903",
    "image": "https://attagalatta.com/admin/uploads/events/1328315502.jpeg",
    "performer": "Soundarya Balasubramani",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-01T13:30:00+05:30",
    "endDate": "2025-02-01T17:00:00+05:30"
  },
  {
    "name": "A Whole New World! - Movie Screening and Interaction",
    "description": "On this evening, we invite you to join us for a screening of the cinematic adaptation of Timothee de Fombelle’s Toby Lolness, that has been made into a mini-series, followed by a conversation with children’s author Bijal Vachharajani on the alchemical magic that goes into creating new worlds in literature. This event will for those aged 10 and above!\nToby Alone and its sequel Toby and the Secrets of the Tree tell the story of a boy a millimeter and a half tall who lives in an oak tree and must save it from destruction. With a deft hand at describing climate change, social discrimination, extractivism and capitalist violence, themes usually explored in the adult world, de Fombelle brings to life all the horrors of the world we live in, in a bewitchingly charming world of childhood fantasy. Clever, challenging and true, Toby’s adventures craft a path for children to form their own journey into bravery and for things worth fighting for.\nIn this event, we hope to watch two episodes of the gorgeously hand-drawn animated series Toby Lolness following which we will have a discussion between Timothee de Fombelle and Bijal Vachharajani on the tools of their craft in creating a rich and vibrant new world. For children who are interested in growing up to be writers, and for adults who want to remember what it is like to be children while they write, this event will explore questions like: how much of the real world needs to be part of the worlds we create? What kind of stories do children like, the ones where they are safe, or the ones which show them the nature of the world and their place in it? And what’s the most evil character you can ever imagine, and how do you imagine him into existence?\nTimothee de Fombelle was born in the heart of Paris in 1973, but often accompanied his architect father on his travels to Africa. Each summer his family left for the countryside (the west of France), where the five brothers and sisters lived like wild horses, making huts in the trees, playing in the river and losing themselves in the woods. In the evening they performed plays for their parents and devoured the books in the library. Childhood remains for him the lost paradise which he re-discovers through writing.\nIn 2006, he made his debut as an author with Toby Alone, a young adult novel published by Gallimard Jeunesse. The novel met with great success and has been translated into 29 languages. It has received 20 awards, including the English Marsh Award for Children's Literature in Translation, the Italian Andersen Award, and most French awards for children's literature. The movie rights were bought by Amber Entertainment (UK, United States).\nWe hope to see you all at 6.30 pm on February 1 at Atta Galata in Indiranagar, Bangalore for this event marking the inauguration of the Pardon my French! corner, followed by high tea and snacks!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT944",
    "image": "https://attagalatta.com/admin/uploads/events/1718413607.png",
    "performer": "Bijal Viccharajani, \nTimothee de Fombelle,",
    "keywords": [
      "Books",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-01T14:30:00+05:30",
    "endDate": "2025-02-01T16:00:00+05:30"
  },
  {
    "name": "Troo in Bengaluru! - A Weekend of Creativity, Curiosity and Connection for Families",
    "description": "Troo in Bengaluru: A Weekend of Creativity, Curiosity, and Connection for Families\nTroo, the new digital playful companion and learning coach for children, brought to you by Yeti, My Friend. Yeti My Friend is making its grand community launch in Bengaluru with a unique family-focused event. Hosted at the popular Atta Galatta bookstore on February 18th and 19th, the event promises an unforgettable weekend filled with creativity, curiosity, and connection for parents and kids alike.\nYeti, My Friend is a creative learning platform designed to spark curiosity and nurture creativity in children through engaging activities, stories, and screen-free experiences in its award-winning educational app for children aged 4-9.\nThis immersive two-day event will feature four interactive sessions (two hours each) tailored to engage children and parents. Kids can look forward to hands-on activities that will spark their curiosity and creativity, inspired by the magical world of Troo and captivating storytelling sessions led by Lavanya Prasad (Founder of Talescope) and Charulatha C, Author of the best-selling Beaming Child series.\nParents can participate in thought-provoking round-table discussions, parenting talks, and interactive activities that foster community and share valuable insights into modern parenting.\n\"Troo's mission has always been to nurture curiosity and creativity in children while offering parents tools and a supportive community to navigate their parenting journey,\" said Sudha Shankar, CEO & Founder of Yeti, My Friend. \"This event brings that mission to life through a screen-free, enriching experience for families.\"",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT943",
    "image": "https://attagalatta.com/admin/uploads/events/936019497.png",
    "performer": "My Friend Yeti, \nSudha Sankar,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-01T16:00:00+05:30",
    "endDate": "2025-02-01T18:00:00+05:30"
  },
  {
    "name": "Harry Potter Book Discussion - Meetup",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT937",
    "image": "https://attagalatta.com/admin/uploads/events/713248164.png",
    "performer": "Lahe Lahe Caravan, \nSonali Bhatia,",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-02T11:00:00+05:30",
    "endDate": "2025-02-02T12:30:00+05:30"
  },
  {
    "name": "Chapter Carnival - Library Meetup",
    "description": "Atta Galatta and Your View On Books, A Novel Club cordially invite you to the latest Library Meetup in town.\nJoin us for a innovative Library Meet wherein there`s over hundreds of books and you could pick a book in random and start reading together.\nHave an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nCome along with Empty Minds and fill it with rich literature from Atta Galatta’s Reading Section.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nReading minimum one chapter from a random book that you choose from the libary.\nParticipating in the ensuing curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT934",
    "image": "https://attagalatta.com/admin/uploads/events/1277279384.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-02T11:11:00+05:30",
    "endDate": "2025-02-02T14:22:00+05:30"
  },
  {
    "name": "1000 Days of Love - Weekly Book Reading Sessions",
    "description": "What is it? TDOL Secret Sessions is a one-of-a-kind event series to give you a front-row seat to the upcoming novel, 1000 Days of Love. In each session, the author will read two chapters and get your feedback in real time, while you get to meet like-minded people and build lifelong connections. \nWho is doing it? This event is hosted by the novel's author, Soundarya Balasubramani. She's a 2x author, founder of an American startup, renowned speaker, and influencer. Find her on LinkedIn and Instagram.\nWhy? Products have \"launches\" where they get user feedback to iterate and improve. Why not a book too? \nWhen? Ten sessions are hosted beginning January 11th, 2025 - February 9th, 2025, every Saturday and Sunday afternoon.\nWhere?  Atta Galatta- The Bookstore (178, 5th Main Rd, Indira Nagar 1st Stage, 1st Stage, Indiranagar, Bengaluru, Karnataka 560038)\nWe're only choosing 25 people per session. Spots are limited. Please apply below and we'll be in touch :) Let's create some magic together ✨\n***DETAILS***\n📅 Sessions: Every Saturday and Sunday at 2 PM IST, starting January 11, 2025\r\n🕒 Duration: 90 minutes\r\n📍 Location: Atta Galatta - The Bookstore, Bangalore, India\r\n🎟️ Cost: Free of cost + Free food and refreshments + Incentives (Receive a free copy of the book when you attend 2 or more sessions, and earn an exclusive TDOL T-shirt 👕 by joining 5 or more sessions! 😊✨)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT903",
    "image": "https://attagalatta.com/admin/uploads/events/1328315502.jpeg",
    "performer": "Soundarya Balasubramani",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-02T13:30:00+05:30",
    "endDate": "2025-02-02T17:00:00+05:30"
  },
  {
    "name": "My Book of Alphabites - Book Reading",
    "description": "Join author-illustrator Alankrita Amaya for the launch of her one-of-a-kind accordion-folding book, My Book of Alphabites, published by Batani Books. Enjoy an afternoon filled with storytelling and a fun mini accordion book-making craft, followed by a book signing at your favorite bookstore!\nWhile you’re there, explore Batani’s other offerings, including the popular touch-and-feel book My Divine Friends, the beautifully illustrated picture book My Amma’s White Stone Mookuthi, and the engaging cooperative board game Little Butter Thieves, perfect for children aged 4 and up.\nWebsite - https://www.batanikids.com/",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT946",
    "image": "https://attagalatta.com/admin/uploads/events/977482538.png",
    "performer": "Alankrita Amaya",
    "keywords": [
      "Kids",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-02T15:00:00+05:30",
    "endDate": "2025-02-02T16:00:00+05:30"
  },
  {
    "name": "Troo in Bengaluru! - A Weekend of Creativity, Curiosity and Connection for Families",
    "description": "Troo in Bengaluru: A Weekend of Creativity, Curiosity, and Connection for Families\nTroo, the new digital playful companion and learning coach for children, brought to you by Yeti, My Friend. Yeti My Friend is making its grand community launch in Bengaluru with a unique family-focused event. Hosted at the popular Atta Galatta bookstore on February 18th and 19th, the event promises an unforgettable weekend filled with creativity, curiosity, and connection for parents and kids alike.\nYeti, My Friend is a creative learning platform designed to spark curiosity and nurture creativity in children through engaging activities, stories, and screen-free experiences in its award-winning educational app for children aged 4-9.\nThis immersive two-day event will feature four interactive sessions (two hours each) tailored to engage children and parents. Kids can look forward to hands-on activities that will spark their curiosity and creativity, inspired by the magical world of Troo and captivating storytelling sessions led by Lavanya Prasad (Founder of Talescope) and Charulatha C, Author of the best-selling Beaming Child series.\nParents can participate in thought-provoking round-table discussions, parenting talks, and interactive activities that foster community and share valuable insights into modern parenting.\n\"Troo's mission has always been to nurture curiosity and creativity in children while offering parents tools and a supportive community to navigate their parenting journey,\" said Sudha Shankar, CEO & Founder of Yeti, My Friend. \"This event brings that mission to life through a screen-free, enriching experience for families.\"",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT945",
    "image": "https://attagalatta.com/admin/uploads/events/1874849774.png",
    "performer": "My Friend Yeti, \nSudha Sankar,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-02T16:00:00+05:30",
    "endDate": "2025-02-02T18:00:00+05:30"
  },
  {
    "name": "Allegory of the Crab - Book Launch",
    "description": "Discover Resilience and Healing Through Nature at the Launch of book “Allegory of the Crab” \nAcclaimed mental wellness coach, psychologist, and author Geetha Solaraj is proud to announce the launch of her debut book, “Allegory of the Crab” - Resilient Currents, Life Lessons from the Crab’s Journey. This deeply personal and inspirational book explores themes of resilience, healing, and growth, using powerful allegories from nature to shed light on life’s challenges.\nDrawing from her own battle with cancer and her experiences as a counselling psychologist, Geetha Solaraj weaves together reflections, anecdotes, and poetic expressions to offer readers a guide to navigating life’s storms. The book connects the journey of the crab—an emblem of adaptability and strength—to our own lives, reminding us that we too have the capacity to rebuild, grow, and thrive no matter what challenges we face.\nKey Highlights of the Book:\n\nNature as a Teacher: Explore how lessons from nature and the animal kingdom, particularly the crab, can inspire us to adapt, evolve, and overcome.\nThe Power of the Mind-Body Connection: Insights into understanding how our physical health often mirrors unresolved emotional and psychological conflicts.\nPersonalized Healing Journeys: Encouragement to discover and embrace unique paths to healing, recognizing that no two journeys are alike.\nPoetry for the Soul: Heartfelt poems penned during Geetha’s most challenging times, offering comfort and hope to readers.\n\n“As someone who has faced a life-altering illness, I’ve come to realize that resilience is not just about enduring hardships but also about adapting and finding strength in unexpected places,” says Geetha Solaraj. “This book is my attempt to share those lessons and inspire others to look within, listen to their bodies, and embrace their unique journeys toward healing.”\nA Message of Hope and Resilience\nResilient Currents is more than just a book—it’s a reflection of the human spirit and its incredible ability to thrive despite adversity. Geetha’s heartfelt storytelling and profound insights make this book a valuable resource for anyone navigating life’s challenges, whether it’s a health crisis, personal transformation, or emotional upheaval.\nAbout the Author\nGeetha Solaraj is an Master NLP Mental Wellness coach and Counselling Psychologist specializing in stress reduction, communication improvement, and support for those battling cancer or caregiving. Her own transformative journey—from being a cancer survivor to a guiding light for others—has shaped her unique perspective on resilience and healing. Through her writing and workshops, Geetha continues to inspire countless individuals to embrace their strength and live fulfilling lives.\nJoin the Journey\nWe invite readers to explore Resilient Currents and discover powerful lessons about life, healing, and the beauty of the human spirit. Whether you’re seeking inspiration, guidance, or a fresh perspective, this book is a testament to the resilience we all carry within ourselves.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT930",
    "image": "https://attagalatta.com/admin/uploads/events/48583248.jpeg",
    "performer": "Geetha Solaraj",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-02T19:00:00+05:30",
    "endDate": "2025-02-02T20:00:00+05:30"
  },
  {
    "name": "Book Lovers' Singles Mixer - Single Mixer",
    "description": "Get ready for a night of books, banter, and maybe even a little romance! Join Radhika Agrawal, the author of Red Flags and Rishtas, for a Singles Mixer designed for book lovers who know that great connections start with a good story.\nIf you’re hoping to meet someone who shares your love for books, this event is for you. Radhika will guide you through an evening of quirky icebreakers and playful dating games, inspired by her latest novel.\nSo, come make new connections and maybe even discover your next chapter—both in love and literature.\nLimited spots available. Sign up now!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT953",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Radhika Agrawal",
    "keywords": [
      "Social",
      "Mixer"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-07T19:00:00+05:30",
    "endDate": "2025-02-07T21:00:00+05:30"
  },
  {
    "name": "Duhhh..It's Called A Play - Introductory Theatre Workshop",
    "description": "This workshop is perfect for freshers and novices who are curious about the magical (and playful) world of theatre. If you’ve ever wondered what it feels like to be on stage, express yourself freely, or just let loose and have fun, this is your chance to dive in!\nTheatre is not just about delivering lines or acting dramatic; it’s about embracing the art of PLAY! This 3-hour workshop is an introduction to the lighter, creative, and liberating side of theatre. Step into a space where rules are bent, laughter flows, and you can rediscover the joy of being in the moment.\nWith a mix of playful games, imaginative exercises, and insightful drills, this workshop offers a taste of what it’s like to let go of inhibitions and embrace the stage with confidence and spontaneity.\nWhat to Expect:\nLet the Play Begin! (Warm-Up & Ice Breakers):\nKick off the session with energizing activities that dissolve awkwardness and spark joy.\nLaugh, move, and connect with fellow participants in a fun and relaxed environment.\nBody Talk: Moving with Ease and Expression\nLearn how to use your body to express emotions and create dynamic stage presence.\nDive into light physical exercises that get you comfortable with movement and space.\nImprov: The Joy of Making It Up as You Go!\nDiscover the magic of spontaneity through improvisation games.\nPractice thinking on your feet and reacting in the moment—because there’s no script in life!\nPsychological Drills: Unlocking the Performer Within\nEngage in introspective exercises to understand emotions and character motivations.\nUse imagination and empathy to create authentic and relatable performances.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT947",
    "image": "https://attagalatta.com/admin/uploads/events/785868315.jpg",
    "performer": "Aavirbhaav Naatya Manch",
    "keywords": [
      "Theatre",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-02-08T11:00:00+05:30",
    "endDate": "2025-02-08T14:00:00+05:30"
  },
  {
    "name": "Master the Art of Confidence - Confidence Building Workshop",
    "description": "Step into a world of possibilities with this transformative 3-hour workshop designed to help you overcome self-doubt, unlock unwavering confidence, and manifest your dream life! Through engaging activities and powerful techniques, you`ll learn to identify and break free from limiting beliefs, build self-esteem, and create a roadmap to success.\nDon’t miss this chance to rediscover your potential and take the first step toward the life you deserve!\nHighlights: Interactive exercises, expert guidance, and a personalized action plan.\nYou’ll discover how to:\nBreak through limiting beliefs.\nCultivate unwavering confidence.\nVisualize and manifest your dreams.\nThis workshop is packed with practical tools, fun activities, and empowering techniques to help you:\nReframe negative thoughts.\nBoost self-esteem and self-worth.\nCreate a clear vision of your goals and make them a reality.\nWhether you`re seeking personal growth or professional success, this workshop will guide you toward becoming the best version of yourself.\nDon’t wait—register now and transform your life! Limited seats are available.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT948",
    "image": "https://attagalatta.com/admin/uploads/events/85126056.png",
    "performer": "Author & Life Coach Shabnam Omer",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-02-08T11:00:00+05:30",
    "endDate": "2025-02-08T14:00:00+05:30"
  },
  {
    "name": "1000 Days of Love - Weekly Book Reading Sessions",
    "description": "What is it? TDOL Secret Sessions is a one-of-a-kind event series to give you a front-row seat to the upcoming novel, 1000 Days of Love. In each session, the author will read two chapters and get your feedback in real time, while you get to meet like-minded people and build lifelong connections. \nWho is doing it? This event is hosted by the novel's author, Soundarya Balasubramani. She's a 2x author, founder of an American startup, renowned speaker, and influencer. Find her on LinkedIn and Instagram.\nWhy? Products have \"launches\" where they get user feedback to iterate and improve. Why not a book too? \nWhen? Ten sessions are hosted beginning January 11th, 2025 - February 9th, 2025, every Saturday and Sunday afternoon.\nWhere?  Atta Galatta- The Bookstore (178, 5th Main Rd, Indira Nagar 1st Stage, 1st Stage, Indiranagar, Bengaluru, Karnataka 560038)\nWe're only choosing 25 people per session. Spots are limited. Please apply below and we'll be in touch :) Let's create some magic together ✨\n***DETAILS***\n📅 Sessions: Every Saturday and Sunday at 2 PM IST, starting January 11, 2025\r\n🕒 Duration: 90 minutes\r\n📍 Location: Atta Galatta - The Bookstore, Bangalore, India\r\n🎟️ Cost: Free of cost + Free food and refreshments + Incentives (Receive a free copy of the book when you attend 2 or more sessions, and earn an exclusive TDOL T-shirt 👕 by joining 5 or more sessions! 😊✨)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT903",
    "image": "https://attagalatta.com/admin/uploads/events/1328315502.jpeg",
    "performer": "Soundarya Balasubramani",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-08T14:00:00+05:30",
    "endDate": "2025-02-08T17:00:00+05:30"
  },
  {
    "name": "Tumhaare Baare Mein - Theatre Performance",
    "description": "This play focuses on modern relationships and the complexities and the dilemmas which come with it. It emphasises on the voids and the fantasies which come with the differences in partners and how current relationships need a therapy and social media validation to achieve a sense of completion.\nShow times are as follows:\n8th February:\n4:00PM - 6:00PM\n7:00PM - 9:00PM\n9th February:\n7:00PM - 9:00PM",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT931",
    "image": "https://attagalatta.com/admin/uploads/events/763311011.jpeg",
    "performer": "Arena Theatre Productions",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "TheatreEvent",
    "startDate": "2025-02-08T16:00:00+05:30",
    "endDate": "2025-02-08T18:00:00+05:30"
  },
  {
    "name": "New Macrame Workshop - Macrame Workshop",
    "description": "Step into the world of bohemian elegance and timeless artistry with our exclusive Macrame Workshop! Hosted in the cozy and creative space of Atta Galatta, this workshop is the perfect opportunity to explore the beauty of handcrafted decor while learning a mindful and relaxing craft. Whether you`re a complete beginner or an experienced DIY enthusiast, this hands-on session will guide you through the fundamentals of macrame knotting techniques. By the end of the workshop, you`ll walk away with your very own stunning macrame masterpiece—a unique piece to elevate your space or gift to a loved one.\nWhat’s in Store:\nExpert guidance from a seasoned macrame artist.\nLearn basic and advanced knotting techniques.\nAll materials will be provided\nA fun and creative environment to unwind and connect with like-minded individuals.\nWho Can Attend: This workshop is open to everyone—no prior experience is needed! If you love art, decor, or simply want to try something new, this is the place to be.\nWhy Attend: Indulge in a creative escape from your routine. Learn a sustainable and eco-friendly craft. Take home a beautiful macrame creation made by you. Meet and network with art enthusiasts.\nLimited spots available. Sign up now!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT955",
    "image": "https://attagalatta.com/admin/uploads/events/778556295.png",
    "performer": "Shama",
    "keywords": [
      "Arts and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-02-08T16:30:00+05:30",
    "endDate": "2025-02-08T18:30:00+05:30"
  },
  {
    "name": "But What's For Dessert?  - Book Launch",
    "description": "What happens when two friends in the cosmopolitan city make it through the city’s traffic and their “all grown up” schedules to finally sit down for a conversation? A bunch of stories make it to the table. The stories barely make sense, but who cares? Hasn't life been like that since you started adulting on some random Tuesday?\nJoin Simrran and Roshan for a candid chat as they confess awkward adulting moments, unravel the joke they drafted during a midweek meltdown, and share how fiction, storytelling & authoring became their companions in this melange of life.\nSimrran Sidhu is Bengaluru-based writer, first-time author and perpetually a curious Anecdotist. She finds the most ‘Monday’ like anecdotes great for her blogs and stories. Often spotted on long walks  finding stories, she’s later found at her desk, trying to make sense of the conundrums she’s collected. All of this unfolds with a little humour, a dash of introspection and a lot of food metaphors. If not at her desk, you will probably find her trying to untangle herself out of a Yoga posture.\nBut what’s for dessert? is her debut book, - a collection of short stories, set in the tech-savvy city of Bengaluru. The stories find life around the protagonist's friends, family, career and the flawed decisions that accompany her, but by the end of the day, she basks in the glory of having made the right dessert choice.\nRoshan C Machayya is an ultra-runner, a PhD scholar, a biker, a musician, writer, and currently an assistant professor at RV University at the School of Law, Bengaluru. An avid enthusiast for life with a penchant for chasing sunrises coupled with a passion for coffee and great food accompanied with even better company, he takes life with strides inspired by intention and contemplation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT951",
    "image": "https://attagalatta.com/admin/uploads/events/380600400.png",
    "performer": "Roshan C. Machayya, \nSimrran Sidhu,",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-08T17:30:00+05:30",
    "endDate": "2025-02-08T18:30:00+05:30"
  },
  {
    "name": "For No Reason At All: A Curious Espionage - Book Launch",
    "description": "Based on true events, For No Reason at All captures the mood of the New Delhi administration, where its new, young prime minister must make a difficult decision.\nIn a time when global trade borders are opening, the reputable Metkem Silicon and the Indian Institute of Science, Bangalore, collaborate to produce silicon metal locally. But Anand Seshadri, the powerful head of the Department of Electronics pushes to import the technology from the US.\nThe ‘silicon metal controversy’ erupts, and the prime minister must decide: Support Indian innovation? Or concede to foreign imports?\nWhen Seshadri takes drastic, underhanded measures to discredit Metkem Silicon, the task of countering him falls to Metkem’s lobbyist—a young, adroit lobbyist named Adityan ‘Solly’ Nilla.\nThings get interesting when Solly receives an unexpected call from the embassy of the Soviet Union. And then the French and the Americans, and the Indian intelligence get involved.\nSet in the New Delhi of the 1980s, this tale of espionage, intrigue, deception and sexual escapade is pacy, funny . . . and sometimes touching. Join us for a chat with the author of this enthralling book!\nRamjee Chandran is a journalist and author, and was the Editor of ‘Explocity’ magazine. He is also the host of the podcasts, The Literary City With Ramjee Chandran and the History of Bangalore. He will be in conversation with Subodh Sankar, co-founder of Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT957",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Ramjee Chandran",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-08T18:30:00+05:30",
    "endDate": "2025-02-08T19:30:00+05:30"
  },
  {
    "name": "Tumhaare Baare Mein - Theatre Performance",
    "description": "This play focuses on modern relationships and the complexities and the dilemmas which come with it. It emphasises on the voids and the fantasies which come with the differences in partners and how current relationships need a therapy and social media validation to achieve a sense of completion.\nShow times are as follows:\n8th February:\n4:00PM - 6:00PM\n7:00PM - 9:00PM\n9th February:\n7:00PM - 9:00PM",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT931",
    "image": "https://attagalatta.com/admin/uploads/events/763311011.jpeg",
    "performer": "Arena Theatre Productions",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "TheatreEvent",
    "startDate": "2025-02-08T19:00:00+05:30",
    "endDate": "2025-02-08T18:00:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT952",
    "image": "https://attagalatta.com/admin/uploads/events/316102509.png",
    "performer": "The Listener's Circle",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-02-09T11:00:00+05:30",
    "endDate": "2025-02-09T13:00:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "Join us for a cozy, creative space where you can unplug, connect, and just be. This meetup is all about chill vibes—no agenda, no pressure. 🖍️✨\nWhether it’s your first time or your fourth, come as you are—dive into your own project or simply soak up the wholesome atmosphere. Each meetup has brought inspiring moments and wonderful people, and we’re excited to share it all again! 💜\nThere are 15 spots available, and this meetup is exclusively for LGBTQIA+ folks. Neurospicy and neurotypical folks are all welcome. 🌈🎨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT878",
    "image": "https://attagalatta.com/admin/uploads/events/1136766814.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-02-09T14:00:00+05:30",
    "endDate": "2025-02-09T17:00:00+05:30"
  },
  {
    "name": "Manga Mochas - Manga and Comics Fan Meet",
    "description": "Atta Galatta and Your View on Books, Novel Club cordially invite you to the unique Manga Mochas, fans meet for Comics & Manga readers.\nAre you a Manga maven or a comic connoisseur? Have you ever wanted to share your passion, connect with like-minded enthusiasts, and debate the finer points of your favorite stories? Well, your wait is over!\nCalling all voracious readers of Manga, comics, and graphic novels! Join us for an exhilarating in-person meet-up where you can express YOUR views, discuss your beloved series, and meet fellow aficionados!\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolising the conversation.\nEvent Sections:\n1. Icebreaker Extravaganza: Kick things off with a fun game and introduce yourself. Let`s warm up the crowd!\n2. Manga Mochas: Step into the spotlight for 5-7 minutes and share your passion for your favorite Manga or comic. No slides, just pure enthusiasm!\nINTERMISSION: Chill & Chat\n3. Fun & Games: Prepare for laughs with another engaging game.\n4. What’s Next? Discuss and vote on the next Manga, comic, or graphic novel we’ll dive into!\n5. Special Surprise Activity: Stay tuned for an exciting twist!\n6. Photo Op: Say \"cheese\" for our group picture!\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT935",
    "image": "https://attagalatta.com/admin/uploads/events/1634142383.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-09T14:22:00+05:30",
    "endDate": "2025-02-09T17:55:00+05:30"
  },
  {
    "name": "Support Group - Support Group",
    "description": "Topic: Continuing discussion on the book Attached.\nPeople make up big cities but what makes up people’s lives, hopefully not loneliness. Loneliness is an intensely painful state which arises out of lack of intimacy and connectedness. People from every wake of life, even those with social contacts or pursuing successful careers can experience sadness from absence of belongingness. This painful experience is felt in a myriad of contexts such as breakups, disagreeing families, fear of rejection, unrelatability, shyness and so on.\nThis support group has been constituted to bring people struggling with disconnectedness in various contexts together for a shared experience of comfort, belongingness, laughter, guidance and above all to break the cycle of sustained loneliness.\nThe support is being organized and moderated by Nimesh George Mphil PhD who is a practicing psychologist based in Bangalore. This session will be co-moderated by Nimesh George & Gokul R, who are both practising psychologists in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT950",
    "image": "https://attagalatta.com/admin/uploads/events/1400431036.png",
    "performer": "Gokul R. , \nNimesh George,",
    "keywords": [
      "Wellness and Health",
      "Support Group"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-09T15:00:00+05:30",
    "endDate": "2025-02-09T16:00:00+05:30"
  },
  {
    "name": "1000 Days of Love - Weekly Book Reading Sessions",
    "description": "What is it? TDOL Secret Sessions is a one-of-a-kind event series to give you a front-row seat to the upcoming novel, 1000 Days of Love. In each session, the author will read two chapters and get your feedback in real time, while you get to meet like-minded people and build lifelong connections. \nWho is doing it? This event is hosted by the novel's author, Soundarya Balasubramani. She's a 2x author, founder of an American startup, renowned speaker, and influencer. Find her on LinkedIn and Instagram.\nWhy? Products have \"launches\" where they get user feedback to iterate and improve. Why not a book too? \nWhen? Ten sessions are hosted beginning January 11th, 2025 - February 9th, 2025, every Saturday and Sunday afternoon.\nWhere?  Atta Galatta- The Bookstore (178, 5th Main Rd, Indira Nagar 1st Stage, 1st Stage, Indiranagar, Bengaluru, Karnataka 560038)\nWe're only choosing 25 people per session. Spots are limited. Please apply below and we'll be in touch :) Let's create some magic together ✨\n***DETAILS***\n📅 Sessions: Every Saturday and Sunday at 2 PM IST, starting January 11, 2025\r\n🕒 Duration: 90 minutes\r\n📍 Location: Atta Galatta - The Bookstore, Bangalore, India\r\n🎟️ Cost: Free of cost + Free food and refreshments + Incentives (Receive a free copy of the book when you attend 2 or more sessions, and earn an exclusive TDOL T-shirt 👕 by joining 5 or more sessions! 😊✨)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT903",
    "image": "https://attagalatta.com/admin/uploads/events/1328315502.jpeg",
    "performer": "Soundarya Balasubramani",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-09T17:30:00+05:30",
    "endDate": "2025-02-09T17:00:00+05:30"
  },
  {
    "name": "Your February Story - Playback Theatre Performance",
    "description": "Your February Story (Playback Theatre by Threads and Tales/ Lahe Lahe Caravan) 🌸\nAfter the fresh start to the year or the overwhelming pressure to start something new in January settles, What does February mean to you? Is it a season of love and connection, a time for self-discovery, or perhaps a memory of solitude, longing, or celebration? Join us for *`Your February Story`*, a Playback Theatre experience where your stories take center stage.\nThrough live, improvised performances, we’ll bring to life the many shades of February—moments of love, reflections on relationships, the coziness of winter, the joys/sorrows of being a shorter month or memories that this special month holds for you. Whether your February feels like a tender embrace or a quiet pause, this is a space for you to share, connect, and reflect and see us perform it back for you!\nThreads and Tales is a Playback theatre group started by Lahe Lahe Caravan created to bring real life stories to life through theatre, music and movement\nArtists for the show:\nActors: Shraddha M, Shruthi V, Divyanshi G, Siddharth C, Ananya\nMusicians: Nikhil S, Arkapraba G\nFacilitator/ Conductor: Mansee S\nDon’t miss an evening of heartfelt stories, shared emotions, and the magic of storytelling!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT933",
    "image": "https://attagalatta.com/admin/uploads/events/",
    "performer": "Lahe Lahe Caravan, \nThreads and Tales,",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-09T17:30:00+05:30",
    "endDate": "2025-02-09T19:00:00+05:30"
  },
  {
    "name": "Tumhaare Baare Mein - Theatre Performance",
    "description": "This play focuses on modern relationships and the complexities and the dilemmas which come with it. It emphasises on the voids and the fantasies which come with the differences in partners and how current relationships need a therapy and social media validation to achieve a sense of completion.\nShow times are as follows:\n8th February:\n4:00PM - 6:00PM\n7:00PM - 9:00PM\n9th February:\n7:00PM - 9:00PM",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT931",
    "image": "https://attagalatta.com/admin/uploads/events/763311011.jpeg",
    "performer": "Arena Theatre Productions",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "TheatreEvent",
    "startDate": "2025-02-09T19:00:00+05:30",
    "endDate": "2025-02-09T18:00:00+05:30"
  },
  {
    "name": "Acupuncture Healing Energy Bootcamp - Wellness Workshop",
    "description": "Join us for an eye-opening and heart-opening session of healing at Atta Galatta!\nIn this session you will:\nLearn about the ancient Chinese system of healing known as Acupuncture\nUnderstand how blocked and imbalanced energies in our bodies could lead to chronic physical and emotional ailments\nGet personalized treatment to unblock and balance your energies (no needles involved)\nHave an intense guided journalling and meditation session to uncover inner wounds and heal them\nGet tips for a more balanced life\nIdeal for those who suffer from recurring physical ailments, those who seek to break recurring unhealthy behavioural patterns, those seeking relief from stress and anxiety and for curious souls looking to understand their bodies and minds better.\nParticipants are requested to wear loose and comfortable clothing as we will be doing some light stretches during the session.\nPlease bring along a pen and a bottle of water.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT880",
    "image": "https://attagalatta.com/admin/uploads/events/2045059298.png",
    "performer": "Benazir",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-02-15T11:00:00+05:30",
    "endDate": "2025-02-15T12:30:00+05:30"
  },
  {
    "name": "Mandala Circles: Unlocking Stories Within - Wellness Workshop",
    "description": "Join us for a soulful workshop where art becomes your guide to self-discovery!\nReflect, explore, and express your inner world through the captivating art of mandalas. No art experience? No worries—just bring your curiosity and creativity!\n🌟 What Awaits You:\n🖌️ A journey of reflection\n🎭 A space to explore and create\n🌈 A canvas for your untold stories\nLet’s turn patterns into possibilities. Unlock your story now!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT956",
    "image": "https://attagalatta.com/admin/uploads/events/63556000.jpg",
    "performer": "Ketki Anand, \nSunita Jose,",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-02-16T16:00:00+05:30",
    "endDate": "2025-02-16T18:00:00+05:30"
  },
  {
    "name": "Dastaan-e-Sama - An Evening of Kashmiri & Persian Poetic Traditions",
    "description": "The Dastaan-e-Sama is a captivating journey through the mystical traditions of Kashmir, blending rich storytelling, soul-stirring music, and evocative raqs. This unique event merges three forms of Kashmiri folk traditions to celebrate the spiritual and poetic legacy of Kashmiri Sufi saints and poets. The evening will feature a harmonious interplay of languages, including Urdu and English, to narrate and interpret the profound teachings and poetry of Kashmir’s Sufi heritage.\nThrough Folk Dastaan (storytelling in verse) and a Sufiyana Music Mehfil, audiences will be transported to the heart of Kashmir’s cultural and spiritual landscape. The program will include the mesmerizing melodies of Santoor and Saaz-e-Kashmir, accompanied by the singing of Sufiyana Maqams.\nThe performance will be further enriched by Tsookh Raqs and Dambali—a classical Sufi performance raqs—bringing a visual dimension to the mystical narratives. The narration, apart from the traditional styles of LadiShah and Dastaan, will also include explanations in English by the Magun (narrator), ensuring that the poetic content and the form’s nuances are communicated effectively to a diverse audience. The multimedia-enhanced ambience will provide an immersive experience, allowing the audience to deeply connect with the timeless wisdom of Kashmir’s Sufi traditions.\nKey Elements:\n\nFolk Dastaan (Storytelling in Verse): Narratives highlighting the life, teachings, and poetry of Kashmiri Sufi saints, presented in Urdu and English for wider accessibility.\nSufiyana Music Mehfil: Traditional Kashmiri music featuring Santoor and Saaz-e-Kashmir, with renditions of Sufiyana Maqams.\nMultimedia Integration: Enhanced visuals and lighting to create a transformative and immersive environment.\nNarrative Explanations: Insightful commentary to contextualize the Sufi thought, poetry, and music for the audience. The narration will incorporate traditional LadiShah and Dastaan styles, complemented by English explanations from the Magun to bridge cultural and linguistic gaps",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT958",
    "image": "https://attagalatta.com/admin/uploads/events/1317114479.jpg",
    "performer": "Maara Collective, \nPeather' Baraye' Kasheer,",
    "keywords": [
      "Sufi",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-16T18:00:00+05:30",
    "endDate": "2025-02-16T20:00:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nFebruary Read: : The Flavours of Nationalism by Nandita Haksar\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT929",
    "image": "https://attagalatta.com/admin/uploads/events/671032249.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-22T11:00:00+05:30",
    "endDate": "2025-02-22T13:00:00+05:30"
  },
  {
    "name": "Acupuncture Healing Energy Bootcamp - Wellness Workshop",
    "description": "Join us for an eye-opening and heart-opening session of healing at Atta Galatta!\nIn this session you will:\nLearn about the ancient Chinese system of healing known as Acupuncture\nUnderstand how blocked and imbalanced energies in our bodies could lead to chronic physical and emotional ailments\nGet personalized treatment to unblock and balance your energies (no needles involved)\nHave an intense guided journalling and meditation session to uncover inner wounds and heal them\nGet tips for a more balanced life\nIdeal for those who suffer from recurring physical ailments, those who seek to break recurring unhealthy behavioural patterns, those seeking relief from stress and anxiety and for curious souls looking to understand their bodies and minds better.\nParticipants are requested to wear loose and comfortable clothing as we will be doing some light stretches during the session.\nPlease bring along a pen and a bottle of water.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT880",
    "image": "https://attagalatta.com/admin/uploads/events/2045059298.png",
    "performer": "Benazir",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-02-22T11:00:00+05:30",
    "endDate": "2025-02-22T12:30:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT887",
    "image": "https://attagalatta.com/admin/uploads/events/10443690.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T07:00:00+05:30",
    "endDate": "2025-02-23T09:30:00+05:30"
  },
  {
    "name": "Find Your Voice - Theatre Performance",
    "description": "The \"Find Your Voice\" workshop is a four-hour intensive designed to help stage artists and aspiring performers discover, refine, and enhance their vocal abilities. Voice is one of the most critical tools for a performer, and this workshop delves into the essential elements of posture, breathing, sound production, and projection to equip participants with techniques for delivering powerful and sustainable performances.\nKey Sections of the Workshop\n1. Foundations of Voice and Posture\nPosture and Alignment\nWarm-Up and Body Awareness\n2. Breathing Techniques for Vocal Power\nUnderstanding Breath Control\nPractical Breathing Exercises\nBreath and Movement Coordination\n3. Unlocking Vocal Potential\nExpanding Vocal Range\nArticulation and Resonance\nVocal Health\n4. Voice Projection and Emotional Expression\nProjection Techniques\nExpressing Emotion Through Voice",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT902",
    "image": "https://attagalatta.com/admin/uploads/events/1790510852.jpg",
    "performer": "Aavirbhaav Naatya Manch",
    "keywords": [
      "Theatre",
      "Workshop"
    ],
    "@type": "TheatreEvent",
    "startDate": "2025-02-23T12:30:00+05:30",
    "endDate": "2025-02-23T16:30:00+05:30"
  },
  {
    "name": "Poetic Brew - Poetry Meetup",
    "description": "Gather, Poetic Souls, for an afternoon divine, where verses entwine and words intertwine. In this literary realm, hearts open wide, For a Poetry Meet, let passion be our guide.\nInviting all Poetry enthusiasts 📚 to an In-Person Meet where you can indulge in creative poetry writing and reading session. \nEvent Sections:\n1. Icebreaker Extravaganza - Intro yourself & let`s play an interesting fun Game to break ice cubes.\n2. Poet`s Spotlight: Write a poem based on an innovative prompt letting your thoughts engage.\n<-- INTERMISSION: CHILL & CHAT -->\n3. Recital Stage: Take center stage for 5-7 minutes, discuss the verse that`s touched your head. As you share your verse, let passion reign.\n4. Verse of the Month & What Lies Ahead - Vote for the next Poetry Book to read.\n5. Say Butter - Click that Snap button for a group picture.\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolising the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT936",
    "image": "https://attagalatta.com/admin/uploads/events/769771471.png",
    "performer": "Your View On Books",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T14:22:00+05:30",
    "endDate": "2025-02-23T17:55:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "Join us for a cozy, creative space where you can unplug, connect, and just be. This meetup is all about chill vibes—no agenda, no pressure. 🖍️✨\nWhether it’s your first time or your fourth, come as you are—dive into your own project or simply soak up the wholesome atmosphere. Each meetup has brought inspiring moments and wonderful people, and we’re excited to share it all again! 💜\nThere are 15 spots available, and this meetup is exclusively for LGBTQIA+ folks. Neurospicy and neurotypical folks are all welcome. 🌈🎨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT878",
    "image": "https://attagalatta.com/admin/uploads/events/1136766814.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-03-02T14:00:00+05:30",
    "endDate": "2025-03-02T17:00:00+05:30"
  },
  {
    "name": "Women's Sound and Art Workshop - Wellness Workshop",
    "description": "Great things happen when women connect.\nSound is the source of this entire creation.\nDid you know that the sound of the musical notes have a profoundly positive impact on our chakras?\nWhether you receive the sounds from sacred singing bowls meant for the purpose of healing or well-being, or you sing the notes yourself, they bring in a sense of balance.\nAs this balance fosters feelings of joy and peace, it can aid creative expression in many forms.\nPainting is one such creative form that is closely associated with sound and music. The choice of colours, mood and theme, sensory and emotional experience while painting gets influenced by the presence of sound and music in the environment where art is taking place impacting the artistic process and the final creation.\nInspired by this, we have a similar collaboration with artists Shilpi, Ayuushi, Priyanka and Khusbu who aspire to hold a Sound & Art Workshop for women wishing to experience such intense joy and creativity on 8th March 2025, International Women’s Day.\nIt would be a treat to observe the participants flow with the sounds and express their art.\nTake away:\nPainting to add vibrancy to your room or your living. An ideal gift that you can make, gift and surprise anyone.\nThis is a wonderful opportunity to receive encouragement from peer women.\nWhat to Bring:\n\nYoga mat.\nShawl / stole.\nDrinking water bottle.\n\nNo prior art experience is necessary.\nParticipants should come with an open mind. All other materials will be provided.\nWear comfortable, light color cotton / linen clothing as absorbing the vibrations is easier.\nRegistration: Spaces are limited, so early registration is encouraged.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT932",
    "image": "https://attagalatta.com/admin/uploads/events/895204819.jpeg",
    "performer": "Ayuushi, \nKhusbu Goyal, \nPriyanka Sinha, \nShilpi,",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-08T15:00:00+05:30",
    "endDate": "2025-03-08T18:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT887",
    "image": "https://attagalatta.com/admin/uploads/events/10443690.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T07:00:00+05:30",
    "endDate": "2025-03-09T09:30:00+05:30"
  }
]