[
  {
    "name": "Cut Nib Calligraphy - Calligraphy Workshop",
    "description": "25th & 26th January 2025 - 2-Day Workshop - 6 Hours of Training - 2 Scripts\nCut Nib Calligraphy traces its roots back centuries, to ancient civilizations such as the Greeks, Romans, and Chinese, who used vivid chisel-tipped writing instruments to inscribe their languages and artistic expressions onto various surfaces.\nFast forward to the modern era, Cut Nib Calligraphy continues to thrive as both a traditional craft and a contemporary art form. Today, artists and enthusiasts worldwide explore its expressive potential, blending traditional techniques with modern innovations to create stunning works of calligraphy art in this 2-day workshop!\nWhat you will learn from this workshop:\n-Origin of Calligraphy\n-The meaning behind this art\n-Introduction to Tools\n-Understanding Stroke Variations\n-Exploring & Learning Two Letter Forms: Roman & Gothic\n-Promoting Continued Practise post workshop\nWhether you`re a seasoned calligrapher or a curious beginner, this workshop offers an opportunity to refine your skills and discover more about Calligraphy\nWhat do you need to bring?\nWater bottle to keep you hydrated\nThis workshop includes all materials if required kindly get an Examination Pad / Paper Board",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT882",
    "image": "https://attagalatta.com/admin/uploads/events/1853531469.png",
    "performer": "Sindhoor Suryavamshi",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-25T11:00:00+05:30",
    "endDate": "2025-01-25T14:00:00+05:30"
  },
  {
    "name": "Meaning in the Moment: Exploring Logotherapy - Logotherapy Workshop",
    "description": "Atta Galatta and Dr. Divyanshi warmly invite you to embark on this fun and insightful journey of re-perception through this Logotherapy Workshop called “Meaning in the Moment”.\nLogotherapy, founded by Viktor Frankl, is not merely a therapeutic technique—it is a philosophy of living that centers around finding meaning in life, even amidst suffering. Rooted in existential analysis, it goes beyond the immediate question of “what makes me happy?” and instead asks, “what gives my life purpose?” In this Logotherapy Workshop, we’ll explore the fundamental principles of logotherapy and how they can empower you to reshape your perspective and find deeper meaning in your life experiences.\nThroughout the two-hour workshop, you’ll delve into the origins of logotherapy, key logotherapy techniques for uncovering meaning in your day-to-day life, and participate in dynamic, facilitated group games. These exercises are designed to foster reflection and may lead you to discover the clarity or ‘aha’ moments you’ve been seeking. You’ll walk away with a new lens through which to view your past and present experiences, gaining insight into how meaning can be found in all circumstances, even the most challenging ones.\nWho Should Attend?\nThis workshop is for anyone feeling a sense of stagnation, searching for a greater sense of purpose, or looking to make sense of life’s difficulties from a broader, more meaningful perspective. Open to anyone aged 16 and above, no prior background in psychology is needed—just an open mind and a curiosity to explore the deeper meaning of life.\nWorkshop Objectives:\n•⁠ ⁠To introduce participants to the core concepts of Logotherapy and Viktor Frankl’s philosophy.\n•⁠ ⁠To provide practical techniques for finding and creating meaning in daily life.\n•⁠ ⁠To encourage introspection and group sharing that can lead to moments of personal clarity and insight\n•⁠ ⁠To create a safe, supportive space for meaningful discussions and individual growth.\nCommunity Guidelines:\n•⁠ ⁠Approach the workshop with openness, curiosity, and kindness.\n•⁠ ⁠Respect each participant’s unique perspective and journey.\n•⁠ ⁠Engage in thoughtful, supportive, and constructive conversations.\nDO CARRY A NOTEBOOK AND A PEN\nWe aim to create a focused and intimate experience, allowing for personalized attention, deeper engagement, and meaningful reflection.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT921",
    "image": "https://attagalatta.com/admin/uploads/events/397135552.png",
    "performer": "Dr. Divyanshi",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-25T12:00:00+05:30",
    "endDate": "2025-01-25T15:00:00+05:30"
  },
  {
    "name": "1000 Days of Love - Weekly Book Reading Sessions",
    "description": "What is it? TDOL Secret Sessions is a one-of-a-kind event series to give you a front-row seat to the upcoming novel, 1000 Days of Love. In each session, the author will read two chapters and get your feedback in real time, while you get to meet like-minded people and build lifelong connections. \nWho is doing it? This event is hosted by the novel's author, Soundarya Balasubramani. She's a 2x author, founder of an American startup, renowned speaker, and influencer. Find her on LinkedIn and Instagram.\nWhy? Products have \"launches\" where they get user feedback to iterate and improve. Why not a book too? \nWhen? Ten sessions are hosted beginning January 11th, 2025 - February 9th, 2025, every Saturday and Sunday afternoon.\nWhere?  Atta Galatta- The Bookstore (178, 5th Main Rd, Indira Nagar 1st Stage, 1st Stage, Indiranagar, Bengaluru, Karnataka 560038)\nWe're only choosing 25 people per session. Spots are limited. Please apply below and we'll be in touch :) Let's create some magic together ✨\n***DETAILS***\n📅 Sessions: Every Saturday and Sunday at 2 PM IST, starting January 11, 2025\r\n🕒 Duration: 90 minutes\r\n📍 Location: Atta Galatta - The Bookstore, Bangalore, India\r\n🎟️ Cost: Free of cost + Free food and refreshments + Incentives (Receive a free copy of the book when you attend 2 or more sessions, and earn an exclusive TDOL T-shirt 👕 by joining 5 or more sessions! 😊✨)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT903",
    "image": "https://attagalatta.com/admin/uploads/events/1328315502.jpeg",
    "performer": "Soundarya Balasubramani",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-25T15:00:00+05:30",
    "endDate": "2025-01-25T17:00:00+05:30"
  },
  {
    "name": "Dalit Representation in South Indian Cinema - Talk",
    "description": "Ambedkar Reading Circle, Bangalore, invites you to this talk that will touch upon the history of Dalit representation in South Indian cinema, examining its evolution through various themes, including caste and Dalit issues. It will majorly delve into contemporary South Indian cinema and its portrayal of Dalit identities, highlighting the significant representation of Dalit narratives in Tamil cinema and the emerging New Wave.\nApeksha Singegol is a Research Scholar with UGC-JRF in Sociology at CHRIST (Deemed to be University), Bangalore. Her research focuses on Caste, Dalit studies, and the Sociology of Media and Popular Culture, currently working on Dalit narratives in cinema. She has published articles in The Indian Express, The Mooknayak, and The Round Table India. Apeksha has also presented at national and international conferences and interned at the Dr. Ambedkar International Centre, Delhi.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT923",
    "image": "https://attagalatta.com/admin/uploads/events/979602757.jpeg",
    "performer": "Ambedkar Reading Circle, Bangalore",
    "keywords": [
      "Academic",
      "Talk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-25T15:00:00+05:30",
    "endDate": "2025-01-25T17:00:00+05:30"
  },
  {
    "name": "Unscramble JANUARY - January Storytelling Meetup for Adults",
    "description": "The new year is here and as we fill our minds with hopes and dreams for a wonderful year ahead, BSS wishes you all a very happy new year!\nWe wanted to start off this year with a playful teaser theme! And here it is… All you have to do is Unscramble the letters of JANUARY, create as many new words from the jumbled letters, and bring a story based on any one word. \nWe loved doing this exercise and we are sure you will love it too! \nOnce you have a story and you wish to tell, write to us your storyline, and the word that triggered that story.\nWe are already excited to see the different genre that you all are going to bring this month. 🙂🙂🙂\nRemember, there is no storyteller without an audience. So if you feel like joining us as a listener, you are most welcome! \nThe meet up is FREE so don't forget to get your friends too. The more the merrier. 🥳 🎉 \nSend us the synopsis of your storyline to\nbangalorestorytellingsociety@gmail.com by 21st January.\nAbout BSS \nBSS is a not-for-profit organization established in the year 2013 by like-minded story lovers with the sole idea of reviving and promoting the oral storytelling traditions in India. The monthly meet-up for adults by the BANGALORE STORYTELLING SOCIETY, that began in 2013, aims to revive the traditional way of sharing tales amidst a gathering.  This is one of the longest running meetups in India.\nAny questions? We are glad to help. WhatsApp: 9845680816",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT911",
    "image": "https://attagalatta.com/admin/uploads/events/1863643285.png",
    "performer": "Bangalore Storytelling Society",
    "keywords": [
      "Storytelling",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-25T15:30:00+05:30",
    "endDate": "2025-01-25T17:00:00+05:30"
  },
  {
    "name": "BWW Short Story Community - Literary Meetup",
    "description": "The BWW Short Story Community\nThis month we will discuss The Woman Who Lost Her Head by Madhavi Mahadevan from Hell Hath No Fury (ed. Shinie Antony). \nWhat this is:\nThis is a ticketed, curated literary and community event, presented by Bhumika Anand from the Bangalore Writers Workshop, where we will do a deep-dive analysis and discussion of a short story.\nYou get to join a reading community where you will get to read a pre-chosen short story a month.\nYou get to examine the story in terms of its literary merit, yes, but also in terms of writing craft and context, which will be very useful if you are an aspiring storyteller or writer.\nWho should join:\nIf you are above 18 years old, interested in storytelling, literature, or are an aspiring or published author, this is for you.\nIf you are new in the city and want to be part of a community and make friends over writing,storytelling, and literature, then this is for you.\nWhat does it entail:\nReading the prescribed story.\nParticipating in the curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT912",
    "image": "https://attagalatta.com/admin/uploads/events/376232090.png",
    "performer": "Bhumika Anand",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-01-25T16:00:00+05:30",
    "endDate": "2025-01-25T18:00:00+05:30"
  },
  {
    "name": "Woman and the Moon - Book Launch",
    "description": "The moon is worshipped as a living goddess across many cultures, be in Greek, Roman, Chinese, or Egyptian. In the Greco-Roman tradition, the moon is known by various names, such as Cynthia, Diana, and Selene, whereas Egyptians prayed to Isis as the moon goddess. Isis is also the mother of the ancient religion of Wicca, a philosophy Jagari was deeply influenced by, in the form in which it is practised in India. She was introduced to Wicca by poet Rajorshi Patranabis, a senior Wiccan whom she fondly calls Rajorshi Da. Subsequently, she attended classes taught by the Wiccan High Priestess, Ipsita Roy Chakraverti. She was drawn to this ideal, at the core of which lies the honoring of the feminine energy, or Shakti. Needless to add, she was smitten by the moon goddess.\nIn November 2023, Rajorshi Da tagged Jagari in a social media post challenging her to complete 10 poems in 10 days. The fates conspired and her first poem was titled \"Woman and the Moon.\" Once she started writing, she found that she could not stop. Hence, were born these 70 poems with the moon at the center. However, other than the woman and the moon, there is a third character—the \"you\" or the (male) lover whom the woman addresses. These three characters come together in a symphony in each of the poems. The woman is the “I” of the poem, the man is the “you”, and the moon is a omniscient presence. The tenor of every poem varies according to the lights and shadows of the woman's moods.\nAnd so, dear reader, we welcome you to enjoy the shimmering pageant of  \"Woman and the Moon.\"",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT919",
    "image": "https://attagalatta.com/admin/uploads/events/1418245186.jpeg",
    "performer": "Jagari Mukherjee",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-25T18:00:00+05:30",
    "endDate": "2025-01-25T19:00:00+05:30"
  },
  {
    "name": "Cut Nib Calligraphy - Calligraphy Workshop",
    "description": "25th & 26th January 2025 - 2-Day Workshop - 6 Hours of Training - 2 Scripts\nCut Nib Calligraphy traces its roots back centuries, to ancient civilizations such as the Greeks, Romans, and Chinese, who used vivid chisel-tipped writing instruments to inscribe their languages and artistic expressions onto various surfaces.\nFast forward to the modern era, Cut Nib Calligraphy continues to thrive as both a traditional craft and a contemporary art form. Today, artists and enthusiasts worldwide explore its expressive potential, blending traditional techniques with modern innovations to create stunning works of calligraphy art in this 2-day workshop!\nWhat you will learn from this workshop:\n-Origin of Calligraphy\n-The meaning behind this art\n-Introduction to Tools\n-Understanding Stroke Variations\n-Exploring & Learning Two Letter Forms: Roman & Gothic\n-Promoting Continued Practise post workshop\nWhether you`re a seasoned calligrapher or a curious beginner, this workshop offers an opportunity to refine your skills and discover more about Calligraphy\nWhat do you need to bring?\nWater bottle to keep you hydrated\nThis workshop includes all materials if required kindly get an Examination Pad / Paper Board",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT882",
    "image": "https://attagalatta.com/admin/uploads/events/1853531469.png",
    "performer": "Sindhoor Suryavamshi",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-26T11:00:00+05:30",
    "endDate": "2025-01-26T14:00:00+05:30"
  },
  {
    "name": "1000 Days of Love - Weekly Book Reading Sessions",
    "description": "What is it? TDOL Secret Sessions is a one-of-a-kind event series to give you a front-row seat to the upcoming novel, 1000 Days of Love. In each session, the author will read two chapters and get your feedback in real time, while you get to meet like-minded people and build lifelong connections. \nWho is doing it? This event is hosted by the novel's author, Soundarya Balasubramani. She's a 2x author, founder of an American startup, renowned speaker, and influencer. Find her on LinkedIn and Instagram.\nWhy? Products have \"launches\" where they get user feedback to iterate and improve. Why not a book too? \nWhen? Ten sessions are hosted beginning January 11th, 2025 - February 9th, 2025, every Saturday and Sunday afternoon.\nWhere?  Atta Galatta- The Bookstore (178, 5th Main Rd, Indira Nagar 1st Stage, 1st Stage, Indiranagar, Bengaluru, Karnataka 560038)\nWe're only choosing 25 people per session. Spots are limited. Please apply below and we'll be in touch :) Let's create some magic together ✨\n***DETAILS***\n📅 Sessions: Every Saturday and Sunday at 2 PM IST, starting January 11, 2025\r\n🕒 Duration: 90 minutes\r\n📍 Location: Atta Galatta - The Bookstore, Bangalore, India\r\n🎟️ Cost: Free of cost + Free food and refreshments + Incentives (Receive a free copy of the book when you attend 2 or more sessions, and earn an exclusive TDOL T-shirt 👕 by joining 5 or more sessions! 😊✨)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT903",
    "image": "https://attagalatta.com/admin/uploads/events/1328315502.jpeg",
    "performer": "Soundarya Balasubramani",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-26T15:00:00+05:30",
    "endDate": "2025-01-26T17:00:00+05:30"
  },
  {
    "name": "Mindful Moves - Movement Workshop",
    "description": "Mindful Moves is a unique practice founded by Sreya Ridhiban, offering dance movement therapy that focuses on mind-body connection and trauma healing. It provides a safe space to unwind, learn, unlearn, and destress. Each session incorporates sound healing, card pulling, and somatic practices, delivering a holistic approach to mental and physical well-being.\nIn today’s world, prioritizing mental health is as important as physical health. Movement plays a significant role in releasing trauma stored in the body, and Mindful Moves embraces this philosophy. You don’t have to be a dancer to move—this space is for everyone.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT905",
    "image": "https://attagalatta.com/admin/uploads/events/1882834152.png",
    "performer": "Sreya Ridhiban",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-26T15:00:00+05:30",
    "endDate": "2025-01-26T16:00:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Reflection Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other`s experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT922",
    "image": "https://attagalatta.com/admin/uploads/events/561899809.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-26T17:00:00+05:30",
    "endDate": "2025-01-26T19:00:00+05:30"
  },
  {
    "name": "1000 Days of Love - Weekly Book Reading Sessions",
    "description": "What is it? TDOL Secret Sessions is a one-of-a-kind event series to give you a front-row seat to the upcoming novel, 1000 Days of Love. In each session, the author will read two chapters and get your feedback in real time, while you get to meet like-minded people and build lifelong connections. \nWho is doing it? This event is hosted by the novel's author, Soundarya Balasubramani. She's a 2x author, founder of an American startup, renowned speaker, and influencer. Find her on LinkedIn and Instagram.\nWhy? Products have \"launches\" where they get user feedback to iterate and improve. Why not a book too? \nWhen? Ten sessions are hosted beginning January 11th, 2025 - February 9th, 2025, every Saturday and Sunday afternoon.\nWhere?  Atta Galatta- The Bookstore (178, 5th Main Rd, Indira Nagar 1st Stage, 1st Stage, Indiranagar, Bengaluru, Karnataka 560038)\nWe're only choosing 25 people per session. Spots are limited. Please apply below and we'll be in touch :) Let's create some magic together ✨\n***DETAILS***\n📅 Sessions: Every Saturday and Sunday at 2 PM IST, starting January 11, 2025\r\n🕒 Duration: 90 minutes\r\n📍 Location: Atta Galatta - The Bookstore, Bangalore, India\r\n🎟️ Cost: Free of cost + Free food and refreshments + Incentives (Receive a free copy of the book when you attend 2 or more sessions, and earn an exclusive TDOL T-shirt 👕 by joining 5 or more sessions! 😊✨)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT903",
    "image": "https://attagalatta.com/admin/uploads/events/1328315502.jpeg",
    "performer": "Soundarya Balasubramani",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-01T13:30:00+05:30",
    "endDate": "2025-02-01T17:00:00+05:30"
  },
  {
    "name": "1000 Days of Love - Weekly Book Reading Sessions",
    "description": "What is it? TDOL Secret Sessions is a one-of-a-kind event series to give you a front-row seat to the upcoming novel, 1000 Days of Love. In each session, the author will read two chapters and get your feedback in real time, while you get to meet like-minded people and build lifelong connections. \nWho is doing it? This event is hosted by the novel's author, Soundarya Balasubramani. She's a 2x author, founder of an American startup, renowned speaker, and influencer. Find her on LinkedIn and Instagram.\nWhy? Products have \"launches\" where they get user feedback to iterate and improve. Why not a book too? \nWhen? Ten sessions are hosted beginning January 11th, 2025 - February 9th, 2025, every Saturday and Sunday afternoon.\nWhere?  Atta Galatta- The Bookstore (178, 5th Main Rd, Indira Nagar 1st Stage, 1st Stage, Indiranagar, Bengaluru, Karnataka 560038)\nWe're only choosing 25 people per session. Spots are limited. Please apply below and we'll be in touch :) Let's create some magic together ✨\n***DETAILS***\n📅 Sessions: Every Saturday and Sunday at 2 PM IST, starting January 11, 2025\r\n🕒 Duration: 90 minutes\r\n📍 Location: Atta Galatta - The Bookstore, Bangalore, India\r\n🎟️ Cost: Free of cost + Free food and refreshments + Incentives (Receive a free copy of the book when you attend 2 or more sessions, and earn an exclusive TDOL T-shirt 👕 by joining 5 or more sessions! 😊✨)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT903",
    "image": "https://attagalatta.com/admin/uploads/events/1328315502.jpeg",
    "performer": "Soundarya Balasubramani",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-02T13:30:00+05:30",
    "endDate": "2025-02-02T17:00:00+05:30"
  },
  {
    "name": "1000 Days of Love - Weekly Book Reading Sessions",
    "description": "What is it? TDOL Secret Sessions is a one-of-a-kind event series to give you a front-row seat to the upcoming novel, 1000 Days of Love. In each session, the author will read two chapters and get your feedback in real time, while you get to meet like-minded people and build lifelong connections. \nWho is doing it? This event is hosted by the novel's author, Soundarya Balasubramani. She's a 2x author, founder of an American startup, renowned speaker, and influencer. Find her on LinkedIn and Instagram.\nWhy? Products have \"launches\" where they get user feedback to iterate and improve. Why not a book too? \nWhen? Ten sessions are hosted beginning January 11th, 2025 - February 9th, 2025, every Saturday and Sunday afternoon.\nWhere?  Atta Galatta- The Bookstore (178, 5th Main Rd, Indira Nagar 1st Stage, 1st Stage, Indiranagar, Bengaluru, Karnataka 560038)\nWe're only choosing 25 people per session. Spots are limited. Please apply below and we'll be in touch :) Let's create some magic together ✨\n***DETAILS***\n📅 Sessions: Every Saturday and Sunday at 2 PM IST, starting January 11, 2025\r\n🕒 Duration: 90 minutes\r\n📍 Location: Atta Galatta - The Bookstore, Bangalore, India\r\n🎟️ Cost: Free of cost + Free food and refreshments + Incentives (Receive a free copy of the book when you attend 2 or more sessions, and earn an exclusive TDOL T-shirt 👕 by joining 5 or more sessions! 😊✨)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT903",
    "image": "https://attagalatta.com/admin/uploads/events/1328315502.jpeg",
    "performer": "Soundarya Balasubramani",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-08T14:00:00+05:30",
    "endDate": "2025-02-08T17:00:00+05:30"
  },
  {
    "name": "Find Your Voice - Theatre Performance",
    "description": "The \"Find Your Voice\" workshop is a four-hour intensive designed to help stage artists and aspiring performers discover, refine, and enhance their vocal abilities. Voice is one of the most critical tools for a performer, and this workshop delves into the essential elements of posture, breathing, sound production, and projection to equip participants with techniques for delivering powerful and sustainable performances.\nKey Sections of the Workshop\n1. Foundations of Voice and Posture\nPosture and Alignment\nWarm-Up and Body Awareness\n2. Breathing Techniques for Vocal Power\nUnderstanding Breath Control\nPractical Breathing Exercises\nBreath and Movement Coordination\n3. Unlocking Vocal Potential\nExpanding Vocal Range\nArticulation and Resonance\nVocal Health\n4. Voice Projection and Emotional Expression\nProjection Techniques\nExpressing Emotion Through Voice",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT902",
    "image": "https://attagalatta.com/admin/uploads/events/1790510852.jpg",
    "performer": "Aavirbhaav Naatya Manch",
    "keywords": [
      "Theatre",
      "Workshop"
    ],
    "@type": "TheatreEvent",
    "startDate": "2025-02-09T12:30:00+05:30",
    "endDate": "2025-02-09T16:30:00+05:30"
  },
  {
    "name": "1000 Days of Love - Weekly Book Reading Sessions",
    "description": "What is it? TDOL Secret Sessions is a one-of-a-kind event series to give you a front-row seat to the upcoming novel, 1000 Days of Love. In each session, the author will read two chapters and get your feedback in real time, while you get to meet like-minded people and build lifelong connections. \nWho is doing it? This event is hosted by the novel's author, Soundarya Balasubramani. She's a 2x author, founder of an American startup, renowned speaker, and influencer. Find her on LinkedIn and Instagram.\nWhy? Products have \"launches\" where they get user feedback to iterate and improve. Why not a book too? \nWhen? Ten sessions are hosted beginning January 11th, 2025 - February 9th, 2025, every Saturday and Sunday afternoon.\nWhere?  Atta Galatta- The Bookstore (178, 5th Main Rd, Indira Nagar 1st Stage, 1st Stage, Indiranagar, Bengaluru, Karnataka 560038)\nWe're only choosing 25 people per session. Spots are limited. Please apply below and we'll be in touch :) Let's create some magic together ✨\n***DETAILS***\n📅 Sessions: Every Saturday and Sunday at 2 PM IST, starting January 11, 2025\r\n🕒 Duration: 90 minutes\r\n📍 Location: Atta Galatta - The Bookstore, Bangalore, India\r\n🎟️ Cost: Free of cost + Free food and refreshments + Incentives (Receive a free copy of the book when you attend 2 or more sessions, and earn an exclusive TDOL T-shirt 👕 by joining 5 or more sessions! 😊✨)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT903",
    "image": "https://attagalatta.com/admin/uploads/events/1328315502.jpeg",
    "performer": "Soundarya Balasubramani",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-09T17:30:00+05:30",
    "endDate": "2025-02-09T17:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT887",
    "image": "https://attagalatta.com/admin/uploads/events/10443690.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T07:00:00+05:30",
    "endDate": "2025-02-23T09:30:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT887",
    "image": "https://attagalatta.com/admin/uploads/events/10443690.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T07:00:00+05:30",
    "endDate": "2025-03-09T09:30:00+05:30"
  }
]