[
  {
    "name": "Creative Passage - Art Therapy Workshop",
    "description": "Creative Passage: Moving Through Emotional Darkness with Bridging Art Activity\nA transformative workshop \nWhether you're facing personal or professional stress, anxiety, difficulty letting go, or uncertainty about the future — you're not alone. Creative Passage offers a safe, reflective space to explore your emotional landscape and move through it with intention, using the powerful, intuitive medium of expressive art.\nWhat is Creative Passage?\r\nThis workshop is grounded in the Bridging Art Activity — a guided creative process that supports emotional release, personal insight, and transformation. Through simple artistic expression, you'll gently explore what’s holding you back, and begin to build a path forward — from emotional darkness towards clarity and light.\nWho is this for? This experience is open to anyone aged 18 and above who may be:\n\nFeeling overwhelmed or anxious\nStruggling with life transitions or decisions\nHolding onto past pain or uncertainty\nHaving difficulty moving on or letting go\n\nNo art experience is needed. This is about the process, not the product.\nWhat you can expect:\n\nA guided expressive arts session using colour, shape, and symbolism\nMindful reflection to deepen insight and reconnect with your inner strength\nA supportive, non-judgmental space for emotional exploration\n\nBenefits: Participants often leave with:\n\nA greater sense of emotional relief and clarity\nFeeling more grounded, present, and empowered\nA deeper understanding of what’s holding you back — and what’s possible ahead\n\n___________________________________________________________________________\nFacilitator: Deepika Gupta\nCounselling Psychologist, Certified NLP Practitioner, Certified Life Coach\nDance Movement and Art Therapy Practitioner, Certified Grief Counsellor\nBharatanatyam Performer and Teacher",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1327",
    "image": "https://attagalatta.com/admin/uploads/events/1183736310.jpg",
    "performer": "Deepika Gupta",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-08-16T11:30:00+05:30",
    "endDate": "2025-08-16T13:00:00+05:30"
  },
  {
    "name": "In The Name of Love - A Gathering of Resistance & Freeedom",
    "description": "This Independence Week, we gather to speak of love — love as defiance, as protest, as political memory.\nIn a time when love is regulated, criminalised, and turned into evidence through laws, surveillance, and moral policing, we come together to ask:\nWhat does it mean to love freely?\nWhat does it mean to resist in the name of love?\nOrganised by The Philosophy Project, this is an open space to think through love and freedom beyond the vocabulary of the nation-state.\nPanel Discussion: Love, Law & Resistance\nArvind Narrain and Vinay Kumar joins Naina Bhargava (Founder, The Philosophy Project) in a powerful conversation on how the law has shaped, policed, and also enabled forms of love and freedom.\nArvind is the author of India’s Undeclared Emergency and co-editor of Law Like Love. He was part of the legal team that challenged Section 377.\nVinay is the founder of #ReclaimConstitution and a public intellectual whose work spans innovation, heritage, and constitutional activism.\n \nReading Circle: bell hooks on Love & Freedom\nA quiet reading and reflection session exploring love as a political and transformative force.\nModerated by: Naina Bhargava and Lakshmi Nambiar (COO, Outlawed India)\nReading material will be shared with all registered participants beforehand.\nZine Making + Letters to the Nation\nJoin one or all of our collective making tables:\n– Zine Making Station\n– Letter Writing Table (write to a past lover, your younger self, or the country)\n– Wall of Love — where you can share anything you think of as love: notes, pictures, quotes.\nPlease bring your own materials (magazines, pens, paper, photos). We will have a limited supply available.\nIf you can’t be there in person, you’re welcome to email us your letter and we will include it anonymously in our archive.\nPlease Note:\nWe are a small, independent collective with no institutional funding. This event is free and open to all. However, seating is limited and entry will be on a first-come, first-served basis.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1336",
    "image": "https://attagalatta.com/admin/uploads/events/2121124724.jpg",
    "performer": "The Philosophy Project",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-08-16T14:00:00+05:30",
    "endDate": "2025-08-16T17:30:00+05:30"
  },
  {
    "name": "Script A Solo - Actor's Script Writing Workshop",
    "description": "1. Transform Ideas into Performances\nDiscover how to turn your ideas, personal experiences, or abstract concepts into impactful solo performances that can work for theatre or short films.\n2. Actor’s Perspective on Writing\nLearn how an actor approaches a script, enabling you to write with performance in mind – creating stories that are both stage-ready and emotionally gripping.\n3. Unlock the Art of Solo Performance\nParticipants will create powerful, character-driven monologues and solo pieces that resonate with audiences, blending the skills of acting and writing to develop a compelling one-person narrative.\nAlong with the mentioned, tools for script writing will be shared and how to register a script for copyright will be shared.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1341",
    "image": "https://attagalatta.com/admin/uploads/events/334542629.jpeg",
    "performer": "Tathagata Chowdhury",
    "keywords": [
      "Film",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-08-16T17:00:00+05:30",
    "endDate": "2025-08-16T18:30:00+05:30"
  },
  {
    "name": "The Corporate - Solo-Act",
    "description": "Experience a different kind of theatre, one where you are a part of the act!\nAngry. Defiant. Noir-soaked.\nTHE CORPORATE.\nFinalist at Bharat Rang Mahotsav 2025 – Thespis 4 National Micro Drama Festival, this solo act written, directed and performed by internationally acclaimed thespian Tathagata Chowdhury plays this August in Bengaluru.\nThe experience comprises two parts and you may choose to attend one or both of the offerings of the evening.\n\nPerformance: THE CORPORATE, an Immersive Psychological Thriller, 7.30 PM – 8.30 PM\nWorkshop: SCRIPT A SOLO, an Actor’s Script Writing Workshop, 5.00 PM – 6.30 PM\nTHE CORPORATE – An Immersive Psychological Thriller\n\nLet this sharp satirical psychological thriller dazzle and challenge you. The powerful mono act examines the perisl that accompany the path to success on the corporate ladder. Packed with twisted humor and unforgettable insight, this one-person tour de force promises a night of theatre you won’t soon forget.\nExperiment in performance demands experiment in space. \nIn the whiplash narrative structure, the audience will also be part of the performance, and maximise the minimal setting with their own belongings. Laugh and squirm at the same time as you question whether it’s a tie or really, a stylish noose.\n\nSCRIPT A SOLO – an actor’s script writing workshop\nTransform Ideas into Performances\n\nDiscover how to turn your ideas, personal experiences, or abstract concepts into impactful solo performances that can work for theatre or short films.\nActor’s Perspective on Writing\nLearn how an actor approaches a script, enabling you to write with performance in mind – creating stories that are both stage-ready and emotionally gripping.\nUnlock the Art of Solo Performance\nParticipants will create powerful, character-driven monologues and solo pieces that resonate with audiences, blending the skills of acting and writing to develop a compelling one-person narrative.\nAlong with the mentioned, tools for script writing will be shared and how to register a script for copyright will be shared.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1337",
    "image": "https://attagalatta.com/admin/uploads/events/986215569.jpeg",
    "performer": "Tathagata Chowdhury",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-16T19:30:00+05:30",
    "endDate": "2025-08-16T20:30:00+05:30"
  },
  {
    "name": "Finding Freedom - Workshop",
    "description": "Finding Freedom: for those tired of fitting into boxes.\nThis is for anyone who’s ever felt stuck in an old version of themselves — the overachiever, the always-nice one, the fixer, the dependable friend.\nYou may not relate to those roles anymore, but they still follow you around.\nThis workshop is a chance to pause and ask: Who am I now? And what do I want to leave behind?\nWe’ll talk, write, and reflect. It’s not heavy therapy stuff — but it is honest, vulnerable, and maybe a little uncomfortable in the best way.\nYou’ll leave with a clearer sense of what you`re ready to outgrow, and what kind of freedom you`re craving next — at work, in relationships, in how you show up every day.\n✨ This session is built on an exercise from my upcoming book on insecurities — so you`re getting early access to one of the most powerful tools I’ve created.\nCome alone, or bring a friend. You`ll meet others in the middle of their own ‘figuring it out’ — and you just might feel less alone in yours.\nNo pressure. Just presence. Come as you are. No journaling experience needed.\n🪑 Limited seats only (15 max)\n🎟️ INR 350 & INR 250 (early bird offer)\n📔 Please bring a notebook and pen along\nFacilitator: Sonali Dutta, Founder of Youmanize.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1338",
    "image": "https://attagalatta.com/admin/uploads/events/495163157.png",
    "performer": "Sonali Dutta",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-08-17T11:00:00+05:30",
    "endDate": "2025-08-17T13:00:00+05:30"
  },
  {
    "name": "Making My Storybook - Workshop for Children",
    "description": "Colors for the characters, words for the story, plain white pages to be filled with your child’s creativity.\n“Making My Storybook” is a hands-on book-making workshop for parents and their 3-5 year olds. This isn’t just doodles and colors, it’s a peek into your child’s world. A world shaped by everyday observations and experiences. This workshop opens up space for open-ended conversations with your child that may reveal cues about their interests, thoughts, and needs.\nSo, join us for an hour filled with colors, conversation, and creativity - and walk away with a storybook that’s uniquely yours.\nTakeaways from this workshop:\n- A storybook illustrated and authored by your child\n- An hour of conversational creativity\n- Insight into your child’s current interests and needs\n- Moments of bonding and joy with your child",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1339",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Shloka K.",
    "keywords": [
      "Kids",
      "Workshop"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2025-08-17T16:00:00+05:30",
    "endDate": "2025-08-17T17:00:00+05:30"
  },
  {
    "name": "Oil Painting Workshop - Art Workshop",
    "description": "Come, join me for an oil painting workshop. If this is your first dabble with paints, this fun and interactive step by step session is sure to keep you entertained, and provide the guidance for a canvas of your own creation. All the necessary materials will be provided. The only thing that you’re expected to bring along is your enthusiasm and art vibes.\nArt is an expression of the inner self and the world around us as we perceive it. Oil paints provide beautiful rich textures and add depth and substance to the subject.\nThe essence of this session is to get together and create artistic strokes that unite us in a bond of communal love and creativity.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1340",
    "image": "https://attagalatta.com/admin/uploads/events/332351157.png",
    "performer": "Lavaniya Deepak",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-08-17T17:30:00+05:30",
    "endDate": "2025-08-17T19:30:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-19T17:00:00+05:30",
    "endDate": "2025-08-19T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-19T19:00:00+05:30",
    "endDate": "2025-08-19T18:00:00+05:30"
  },
  {
    "name": "Letters to Dadu: A Storytime for Hearts Big and Small - Storytelling",
    "description": "Join author Aprajita Singh for a warm and engaging storytelling session based on her picture book Summers with Dadu. Set in the world of mangoes, memories, and mischief, this session invites children (and grown-ups!) to relive the magic of holidays spent with grandparents and heartwarming connections across generations.\r\nCome be part of a fun-filled morning of stories, art and writing for the grandparents near and far!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1323",
    "image": "https://attagalatta.com/admin/uploads/events/1700706381.png",
    "performer": "Aprajita Singh",
    "keywords": [
      "Books",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-23T11:00:00+05:30",
    "endDate": "2025-08-23T12:00:00+05:30"
  },
  {
    "name": "We Fed the Whale A Greenhouse - Book Discussion",
    "description": "The AG Lit Sisters invite you to an intimate evening with award-winning journalist and debut author Sonali Prasad, as we dive into her lyrical and poignant novel Glass Bottom, a story of two pairs of mothers and daughters who reside by the sea, navigating the silent intensity of love, loss, legacy, and everything in between.\nSet against the shifting tides of the coastline, Glass Bottom offers a tender meditation on relationships, memory, and healing. In this special session, Sonali will read a short excerpt from the novel, followed by a heartfelt Q&A and book discussion with readers.\n📚 Hosted by AG Lit Sisters\r\n🎤 In collaboration with Pan Macmillan India\nWhether you're drawn to stories that stir your soul or conversations that linger long after they end, this is a session you won’t want to miss.\nSONALI PRASAD was born and raised in New Delhi, India. Her journalism has appeared in publications such as the Guardian, Washington Post, Hakai Magazine, Quartz and Esquire Singapore. She has been awarded a Pulitzer Traveling Fellowship, Global TED Fellowship, MIT Knight Science Journalism\r\nFellowship, Logan Science Journalism Fellowship and a Jan Michalski Writing Residency, among other grants and honours.\nGlass Bottom is her first book.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1308",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Dr. Chhavi Gandhi Juneja, \nSonali Prasad,",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-23T18:00:00+05:30",
    "endDate": "2025-08-23T20:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-26T17:00:00+05:30",
    "endDate": "2025-08-26T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-26T19:00:00+05:30",
    "endDate": "2025-08-26T18:00:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nAugust Read: Eating Women, Telling Tales by Bulbul Sharma\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1342",
    "image": "https://attagalatta.com/admin/uploads/events/1806174759.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-30T11:00:00+05:30",
    "endDate": "2025-08-30T13:00:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "The next dates for Queer Quiet Hours are here!  \nQueer Quiet Hours is back — a cozy space to rest, make art, and just be. No pressure to talk, no need to perform. Just soft community vibes and gentle company. Bring your own project or come as you are. We'll have plenty of art stuff for you to use.\n✨ For LGBTQIA+ folks only. We haven't opened it up to allies yet.\n\r\n🆓 Free to join. Limited spots.\n\r\n📸 No photos taken without clear consent.\n\r\nSpots are limited - Sign up!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1275",
    "image": "https://attagalatta.com/admin/uploads/events/99240190.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-07T14:00:00+05:30",
    "endDate": "2025-09-07T17:00:00+05:30"
  }
]