[
  {
    "name": "Poetic Brew 1.0 - Poetry Meetup",
    "description": "Gather, Poetic Souls, for an afternoon divine, where verses entwine and words intertwine. In this literary realm, hearts open wide, For a Poetry Meet, let passion be our guide.\nInviting all Poetry enthusiasts 📚 to an In-Person Meet where you can indulge in creative poetry writing and reading session. \nEvent Sections:\n1. Icebreaker Extravaganza - Intro yourself & let’s play an interesting fun Game to break ice cubes.\n2. Poet`s Spotlight: Write a poem based on an innovative prompt letting your thoughts engage.\n<-- INTERMISSION: CHILL & CHAT -->\n3. Recital Stage: Take center stage for 5-7 minutes, discuss the verse that`s touched your head. As you share your verse, let passion reign.\n4. Verse of the Month & What Lies Ahead - Vote for the next Poetry Book to read.\n \n5. Say Butter - Click that Snap button for a group picture.\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolising the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT849",
    "image": "https://attagalatta.com/admin/uploads/events/2044689334.png",
    "performer": "Maddy",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-07T11:11:00+05:30",
    "endDate": "2024-12-07T14:22:00+05:30"
  },
  {
    "name": "Atta Galatta Book Club - Monthly Book Club",
    "description": "What have you been reading? Come, discuss your latest read. Each member gets 5-7 minutes to talk about the book, theme, plot, with 2 minutes to answer any questions others might have. This month’s special focus will be on the classics.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT850",
    "image": "https://attagalatta.com/admin/uploads/events/677065040.jpeg",
    "performer": "Palgun KJ",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-07T15:00:00+05:30",
    "endDate": "2024-12-07T17:00:00+05:30"
  },
  {
    "name": "Narratives of Familiar Spaces - Writing Workshop",
    "description": "Join Kritika Arya for a writing workshop inspired by her memoir, Citizen by Descent. This workshop explores the profound impact of spaces on our lives and how they unintentionally shape our identities. Through a series of guided exercises, we'll delve into the interconnectedness of our physical, intellectual, and emotional experiences within a specific space of your choosing. We’ll recall the little details such as sights, sensations, textures and memories that are associated with the space, which will serve as the foundation for your piece.\nWhether you're a seasoned writer or just starting out, this workshop offers a supportive and inspiring environment to express yourself.\nWhat you’ll need:\nA notebook\nPens/Pencils – anything you’re comfortable writing with\nWriter Bio\nKritika Arya is an author, screenwriter, playwright and content writer. She is currently working on a mental health documentary called I Hope This Helps. She independently published her memoir called Citizen by Descent, a collection of illustrated autobiographical essays about home, identity, mental health and being a third culture kid. Each essay takes place in a different home that she has lived in and each essay has been illustrated by a different artist from around the world.\nWith an MA in Dramatic Writing from Drama Centre at Central Saint Martins (UAL), she has extensive experience in writers' rooms, mentoring, and facilitating which has honed her writing and listening skills. You can follow Kritika Arya on instagram @wordsbykritika",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT852",
    "image": "https://attagalatta.com/admin/uploads/events/301682969.jpg",
    "performer": "Krtika Arya",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-12-07T16:00:00+05:30",
    "endDate": "2024-12-07T18:00:00+05:30"
  },
  {
    "name": "Banned Gals of Lore - Stand-Up Comedy Show",
    "description": "Banned Gals of Lore! An evening filled with laughter where Anamika, Amruta, Shivangi, and Spatica take over the stage in their times and do their best for you in the Live audience. It’s an evening of great laughs at a great price! Come on down!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT851",
    "image": "https://attagalatta.com/admin/uploads/events/1023606340.png",
    "performer": "Amruta Bendre, \nAnamika Haridas, \nShivangi Srivatsava, \nSpatica Ramanujam,",
    "keywords": [
      "Standup Comedy",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-07T19:00:00+05:30",
    "endDate": "2024-12-07T20:00:00+05:30"
  },
  {
    "name": "Datsan-e-Akhtari - Dastangoi Performance",
    "description": "Akhtari Bai Faizabadi, also known as Begum Akhtar was a unique singer of her time. In her unique voice and andaz, she produced such hauntingly sweet notes, coupled with her spontaneity, that the audience were immediately captivated. Beginning at the age of Seven, Begum Akhtar kept her audience spellbound for almost six decades.\nThis was Begum Akhtar, the Singer; but her personal journey is equally captivating and inspiring. She was a brave, fiercely independent-minded person, who drew her life path herself amidst the struggles that life threw at her. At a time when the social and political landscape of the country was gradually changing, she set her own standards of life and arts, not withstanding the constraints of times and emerged as a stronger person and better singer by living upto those standards.\nWith all its highs and lows and awws and wows, Dastan-e-Akhtari is the story of the life of the legend of her time and beyond, Begum Akhtar. In this performance, the story of her life will be told by Kafeel Jafri – a Dastango (‘storyteller’ in Urdu), interspersed with rendition of her songs – Ghazals & Thumris by Yusra Naqvi, a trained Hindustani Classical Singer.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT853",
    "image": "https://attagalatta.com/admin/uploads/events/264633393.png",
    "performer": "Kafeel Jafri, \nYusra Naqvi,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-07T19:00:00+05:30",
    "endDate": "2024-12-07T20:45:00+05:30"
  },
  {
    "name": "Hale Bottle Hosa Wine - Kannada Literature Program with Vasudendra, Kusuma, Guruprasad, and Gangappa",
    "description": "Experience the Blend of Old and New at \"Hale Botle and Hosa Wine\" on Sunday, 08th December 2024 at 11:00 AM.\n \nKannada literature has always stood out with its collection of fascinating and unique novels. These works are not just stories to read; they draw readers in, immersing them fully into their world through compelling narratives and unforgettable characters.\n \nIn this episode, we delve into \"The Golden Era of Kannada Novels\", a time when literary brilliance flourished. Guiding us through this journey is our mentor, Vasudendra sir, a celebrated figure in Kannada literature known for his impactful novels. Joining him in this insightful discussion are contemporary writers Kusuma, Guruprasad, and Gangappa, each bringing their unique perspectives to the conversation.\n \nStay tuned for an enriching exploration of timeless classics and the evolving world of Kannada storytelling!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT854",
    "image": "https://attagalatta.com/admin/uploads/events/1055705578.png",
    "performer": "Gangappa, \nGuruprasad, \nKusuma, \nVasudhendra,",
    "keywords": [
      "Literary Discussion",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-08T11:00:00+05:30",
    "endDate": "2024-12-08T13:00:00+05:30"
  },
  {
    "name": "Lahe Lahe Caravan presents Harry Potter Book Discussion - Meetup by Sonali Bhatia",
    "description": "For hard-core Potterheads age 12 and above!\n \nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\n \nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\n \nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.\nAge 12+",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT856",
    "image": "https://attagalatta.com/admin/uploads/events/1051395025.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Books and Literature",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-08T11:00:00+05:30",
    "endDate": "2024-12-08T12:00:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup by The Listeners Circle",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT859",
    "image": "https://attagalatta.com/admin/uploads/events/1414124840.png",
    "performer": "The Listeners Circle",
    "keywords": [
      "Wellness and Health",
      "Community Event"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-08T11:00:00+05:30",
    "endDate": "2024-12-08T13:00:00+05:30"
  },
  {
    "name": "Mythology Marvels - Storytime for Children and Families by Lavanya Prasad and Meenu Sivaramakrishnan",
    "description": "Indic Mythology is full of answers to the many whys of our culture. Join Lavanya Prasad and Meenu Sivaramakrishnan, as they explore and bring forth the marvellous stories from Indic mythology through music, dance and theatre.\n \nDid you know that the month of December in India is synonymous with celebrating art and art forms? You would have heard about the famous Music and dance season in December that brings in front the many traditional and folk-art forms of India. Artists and art lovers throng in sabas to witness the magic and immerse themselves in music, dance and theatre, Keeping that in mind, this month in Mythology Marvels we bring to you unheard stories from Indian Mythology related to art, through traditional and folk storytelling artforms of India. This is a not to be missed session for children and adults alike!\n \nGet to know more about India through its art forms the musical way! See you all soon!\n \nAbout the Storytellers: \n \nLavanya Prasad & Meenu Sivaramakrishnan are passionate professional storytellers with mutual love for Music and Mythology. Mythology Marvels is their humble attempt to bring to light the treasures from Indian mythology (this time from around the world too) to the children and Families of Bengaluru through music, dance and theatre. Both Lavanya and Meenu run their respective storytelling ventures.\n \nLavanya Prasad : www.talescope.in \nMeenu Sivaramakrishnan : www.kathagalatta.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT858",
    "image": "https://attagalatta.com/admin/uploads/events/1710266508.png",
    "performer": "Lavanya Prasad, \nMeenu Sivaramakrishnan,",
    "keywords": [
      "Mythology",
      "Storytelling"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-12-08T14:30:00+05:30",
    "endDate": "2024-12-08T15:30:00+05:30"
  },
  {
    "name": "Meehrr’s Candle Making Workshop - Candle Making Workshop by Rameet Kaur",
    "description": "Have You wondered, How Beautiful Scented Candles are made ⁉️\n \nWhether you`re A seasoned Artist or a Budding Art enthusiast, this workshop offers something for Everyone interested in learning the Art & Science of Candlemaking!!\n \nWith my 3 decades of experience in crafting gorgeous candles, I share the Tips & Tricks to craft the most beautiful candles in the easiest & safest way!\n \nIn this Scent-sational \"Meehrr’s Candlemaking Workshop\" we shall make :-\n \nTheme - Xmas 🎄\n \n1) Xmas Votive Candle\n \n2) Yummylicious Cupcake Candle\n \n3) Floating Star Candle\n \n❤️Spread the Light n Love ❤️\n \nAll the Raw material is provided. You make and take your creations home.\n \nThese Handcrafted Aromatic candles make Beautiful gifts for oneself but also for your near n dear ones !!\n \nMeehrr’s Candlemaking workshops are all about Taking a unique concept, Wiggling up a few things, Sprinkling a bit of fairy dust, and Adding our own special touches to create Exotic Masterpieces\n \nClass size is small so fills up fast. Register now!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT857",
    "image": "https://attagalatta.com/admin/uploads/events/547074257.jpg",
    "performer": "Rameet Kaur",
    "keywords": [
      "Candle Making",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-12-08T17:00:00+05:30",
    "endDate": "2024-12-08T19:00:00+05:30"
  },
  {
    "name": "Dastan Tilism-e-Hoshruba - Dastangoi Performance by Kafeel Jafri",
    "description": "Dastan Tilism-e-Hoshruba is a classic Dastangoi performance, narrating one of the stories from the most extensive Urdu literature to exist: Tilism-e-Hoshruba, also known as Dastan-e-Ameer Hamza. \n \nDastangoi as a performing art is said to have originated in the Persian world and in Indian subcontinent it arrived in around 12-13th Century and eventually became a popular narrative performing art form. It was at its peak during 18th and 19th Century. Its popularity started declining in the early 20th Century and ultimately it went completely extinct until mid-2000s when it was revived, thanks to the hard work and resilience of Janab Shamsur-Rehman Farooqui and his companions.\n \nIn these stories, there is a group of Aiyaars or tricksters led by Amar Aiyaar and on the other hand there's an army of magicians, under their king, Afraasiyab. Afrasiyaab keeps sending his magicians to create magical places to trap the Aiyaars and the ensuing battle between the Magician and tricksters is what forms an entertaining mix of magic, fantasy narrated, with some poetry. The language is Urdu-Hindi mix, along with some other Indian languages and accents spoken by various characters.\n \nDastango Kafeel Jafri will be performing one such episode from the epic.\n \nKafeel Jafri, is a Lucknowi based in Bangalore. He is a trained theatre artist, Dastango/storyteller and trainer. As an actor he has done about 20 plays with various theatre groups in Bangalore, 1 feature film and numerous ad films and short films. \n \nKafeel specialises in the theatrical storytelling form in Urdu Dastangoi. Along with performing classical Dastans, he has also written and performed new Dastans (Dastan-e-Seetayana, Dastan-e-Maseeha and Dastan Anekta mein Ekta ki) and shows around life and works of famous Urdu literature personalities like Ghalib, Faiz and Manto. \n \nHe also utilises his learnings in Drama and Storytelling to design and facilitate workshops around- Diversity and Inclusion, Storytelling and Sales- in various organisations across the country.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT855",
    "image": "https://attagalatta.com/admin/uploads/events/812376222.png",
    "performer": "Kafeel Jafri",
    "keywords": [
      "Dastangoi",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-08T19:00:00+05:30",
    "endDate": "2024-12-08T20:00:00+05:30"
  },
  {
    "name": "All-In: The Moments - Improv Comedy Show",
    "description": "9 improvisers take over the stage without any script. A few prompts from the audience are all that they want. Can they make things funny? Can they even come up with a story? They have 1.5 hours to prove.\nWhat is improv?\nImprov is not a play, there’s no script. It is also not standup, there are no tried and tested jokes. It is somewhere in between these two things. You’ll have to come to find out!\nWhy should you attend?\n\nYou are part of the script - your prompts will decide where the show will go\nYou can bring a date for a cool show\nYou can tell your Instagram friends that you attended a cool show",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT821",
    "image": "https://attagalatta.com/admin/uploads/events/1795373959.png",
    "performer": "All In Improv",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-21T17:30:00+05:30",
    "endDate": "2024-12-21T19:00:00+05:30"
  }
]