[
  {
    "name": "Design Thinking - Workshop",
    "description": "Design Thinking is a human-centred approach to problem solving applied by top corporations, entrepreneurs and leaders from all spheres.\nIn this workshop, you`ll learn:\nThe five-step design thinking process: Empathize, Define, Ideate, Prototype, and Test.\nHow to apply design thinking to real-world challenges.\nPractical tools and techniques for brainstorming and problem-solving.\nJoin us and discover how design thinking can help you:\n- Innovate more effectively.\n- Collaborate with others.\n- Create solutions that truly meet the needs of users.\n- Don`t miss this opportunity to ignite your creativity and drive innovation.\nBrought to you by Primate Advisory (Design Thinking consulting and training firm)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT846",
    "image": "https://attagalatta.com/admin/uploads/events/1011226336.png",
    "performer": "Gokul Ganesan",
    "keywords": [
      "Upskill",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-12-01T11:00:00+05:30",
    "endDate": "2024-12-01T13:30:00+05:30"
  },
  {
    "name": "Unashamed - Meet and Greet",
    "description": "Dive into a transformative journey with Neha Bhat, the insightful mind behind @indiansextherapist on Instagram, as she fearlessly tackles the intricacies of sex, sexuality, trauma and shame in her groundbreaking book, Unashamed.\nIn a society that often hushes discussions on the most fundamental aspects of human existence, Neha invites readers to explore the uncharted territories of their own desires. With a unique blend of empathy, humor, reflection and unwavering expertise, she dismantles the stigma surrounding sexuality, in turn, asking readers to embrace the full spectrum of their desires without reservation.\nUnashamed delves deep into the psychological landscape of shame, unravelling the roots that bind individuals and communities to outdated norms. Through engaging anecdotes, relatable case studies, and her own experiences as a sex therapist, Neha provides a roadmap for individuals seeking to understand, accept, and celebrate their unique sexual identities. Exercises, quizzes, and journalling prompts in the book gives readers practical tools to break free from the shackles of shame and embark on a liberating journey towards self-discovery.\nJoin us at Atta Galatta to meet the author of this path-breaking book, on 1st December at 2 PM!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT847",
    "image": "https://attagalatta.com/admin/uploads/events/2076379236.png",
    "performer": "Neha Bhat",
    "keywords": [
      "Books",
      "Meet and Greet"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-01T14:00:00+05:30",
    "endDate": "2024-12-01T15:30:00+05:30"
  },
  {
    "name": "Support Group - Support Group",
    "description": "Topic: A discussion on chapter 1 & 2 from the book \"Attached\"; Decoding relationship behavior, Dependency is not a bad word.\nThe book \"Attached” will be available at the bookstore for purchase.\nPeople make up big cities but what makes up people’s lives, hopefully not loneliness. Loneliness is an intensely painful state which arises out of lack of intimacy and connectedness. People from every wake of life, even those with social contacts or pursuing successful careers can experience sadness from absence of belongingness. This painful experience is felt in a myriad of contexts such as breakups, disagreeing families, fear of rejection, unrelatability, shyness and so on.\nThis support group has been constituted to bring people struggling with disconnectedness in various contexts together for a shared experience of comfort, belongingness, laughter, guidance and above all to break the cycle of sustained loneliness.\nThe support is being organized and moderated by Nimesh George Mphil PhD who is a practicing psychologist based in Bangalore.This session will be co-moderated by Nimesh George & Gokul R, who are both practising psychologists in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT848",
    "image": "https://attagalatta.com/admin/uploads/events/810910466.jpeg",
    "performer": "Gokul R. , \nNimesh George,",
    "keywords": [
      "Wellness and Health",
      "Support Group"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-01T16:00:00+05:30",
    "endDate": "2024-12-01T17:00:00+05:30"
  },
  {
    "name": "Sip Coffee & Stroke - Art Workshop for Women",
    "description": "Good things happen when women connect.\nLooking for a fun way to spending your Sunday with a warm cup of coffee and connect?\nCome join us to paint on canvas - Timeless beauty and tranquillity of the Sunset\nTake away:\nPainting to add vibrancy to your room or your living.  An ideal gift that you can make, gift and surprise anyone.\nThis is a wonderful opportunity to receive encouragement from peer women.\nWhat to Bring:\nNo prior art experience is necessary! Participants should an open mind. All other materials will be provided.\nRegistration:\nSpaces are limited, so early registration is encouraged. For women only!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT845",
    "image": "https://attagalatta.com/admin/uploads/events/1216650427.jpeg",
    "performer": "Khusbu Goyal",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-12-01T17:00:00+05:30",
    "endDate": "2024-12-01T19:00:00+05:30"
  },
  {
    "name": "All-In: The Moments - Improv Comedy Show",
    "description": "9 improvisers take over the stage without any script. A few prompts from the audience are all that they want. Can they make things funny? Can they even come up with a story? They have 1.5 hours to prove.\nWhat is improv?\nImprov is not a play, there’s no script. It is also not standup, there are no tried and tested jokes. It is somewhere in between these two things. You’ll have to come to find out!\nWhy should you attend?\n\nYou are part of the script - your prompts will decide where the show will go\nYou can bring a date for a cool show\nYou can tell your Instagram friends that you attended a cool show",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT821",
    "image": "https://attagalatta.com/admin/uploads/events/1795373959.png",
    "performer": "All In Improv",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-21T17:30:00+05:30",
    "endDate": "2024-12-21T19:00:00+05:30"
  }
]