[
  {
    "name": "Coffee and Conversations - Group Meetup",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT952",
    "image": "https://attagalatta.com/admin/uploads/events/316102509.png",
    "performer": "The Listener's Circle",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-02-09T11:00:00+05:30",
    "endDate": "2025-02-09T13:00:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "Join us for a cozy, creative space where you can unplug, connect, and just be. This meetup is all about chill vibes—no agenda, no pressure. 🖍️✨\nWhether it’s your first time or your fourth, come as you are—dive into your own project or simply soak up the wholesome atmosphere. Each meetup has brought inspiring moments and wonderful people, and we’re excited to share it all again! 💜\nThere are 15 spots available, and this meetup is exclusively for LGBTQIA+ folks. Neurospicy and neurotypical folks are all welcome. 🌈🎨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT878",
    "image": "https://attagalatta.com/admin/uploads/events/1136766814.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-02-09T14:00:00+05:30",
    "endDate": "2025-02-09T17:00:00+05:30"
  },
  {
    "name": "Manga Mochas - Manga and Comics Fan Meet",
    "description": "Atta Galatta and Your View on Books, Novel Club cordially invite you to the unique Manga Mochas, fans meet for Comics & Manga readers.\nAre you a Manga maven or a comic connoisseur? Have you ever wanted to share your passion, connect with like-minded enthusiasts, and debate the finer points of your favorite stories? Well, your wait is over!\nCalling all voracious readers of Manga, comics, and graphic novels! Join us for an exhilarating in-person meet-up where you can express YOUR views, discuss your beloved series, and meet fellow aficionados!\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolising the conversation.\nEvent Sections:\n1. Icebreaker Extravaganza: Kick things off with a fun game and introduce yourself. Let`s warm up the crowd!\n2. Manga Mochas: Step into the spotlight for 5-7 minutes and share your passion for your favorite Manga or comic. No slides, just pure enthusiasm!\nINTERMISSION: Chill & Chat\n3. Fun & Games: Prepare for laughs with another engaging game.\n4. What’s Next? Discuss and vote on the next Manga, comic, or graphic novel we’ll dive into!\n5. Special Surprise Activity: Stay tuned for an exciting twist!\n6. Photo Op: Say \"cheese\" for our group picture!\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT935",
    "image": "https://attagalatta.com/admin/uploads/events/1634142383.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-09T14:22:00+05:30",
    "endDate": "2025-02-09T17:55:00+05:30"
  },
  {
    "name": "Support Group - Support Group",
    "description": "Topic: Continuing discussion on the book Attached.\nPeople make up big cities but what makes up people’s lives, hopefully not loneliness. Loneliness is an intensely painful state which arises out of lack of intimacy and connectedness. People from every wake of life, even those with social contacts or pursuing successful careers can experience sadness from absence of belongingness. This painful experience is felt in a myriad of contexts such as breakups, disagreeing families, fear of rejection, unrelatability, shyness and so on.\nThis support group has been constituted to bring people struggling with disconnectedness in various contexts together for a shared experience of comfort, belongingness, laughter, guidance and above all to break the cycle of sustained loneliness.\nThe support is being organized and moderated by Nimesh George Mphil PhD who is a practicing psychologist based in Bangalore. This session will be co-moderated by Nimesh George & Gokul R, who are both practising psychologists in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT950",
    "image": "https://attagalatta.com/admin/uploads/events/1400431036.png",
    "performer": "Gokul R. , \nNimesh George,",
    "keywords": [
      "Wellness and Health",
      "Support Group"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-09T15:00:00+05:30",
    "endDate": "2025-02-09T16:00:00+05:30"
  },
  {
    "name": "Your February Story - Playback Theatre Performance",
    "description": "Your February Story (Playback Theatre by Threads and Tales/ Lahe Lahe Caravan) 🌸\nAfter the fresh start to the year or the overwhelming pressure to start something new in January settles, What does February mean to you? Is it a season of love and connection, a time for self-discovery, or perhaps a memory of solitude, longing, or celebration? Join us for *`Your February Story`*, a Playback Theatre experience where your stories take center stage.\nThrough live, improvised performances, we’ll bring to life the many shades of February—moments of love, reflections on relationships, the coziness of winter, the joys/sorrows of being a shorter month or memories that this special month holds for you. Whether your February feels like a tender embrace or a quiet pause, this is a space for you to share, connect, and reflect and see us perform it back for you!\nThreads and Tales is a Playback theatre group started by Lahe Lahe Caravan created to bring real life stories to life through theatre, music and movement\nArtists for the show:\nActors: Shraddha M, Shruthi V, Divyanshi G, Siddharth C, Ananya\nMusicians: Soumyadeep, Utsav, Arkapraba G\nFacilitator/ Conductor: Mansee S\nDon’t miss an evening of heartfelt stories, shared emotions, and the magic of storytelling!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT933",
    "image": "https://attagalatta.com/admin/uploads/events/",
    "performer": "Lahe Lahe Caravan, \nThreads and Tales,",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-09T17:30:00+05:30",
    "endDate": "2025-02-09T19:00:00+05:30"
  },
  {
    "name": "1000 Days of Love - Weekly Book Reading Sessions",
    "description": "What is it? TDOL Secret Sessions is a one-of-a-kind event series to give you a front-row seat to the upcoming novel, 1000 Days of Love. In each session, the author will read two chapters and get your feedback in real time, while you get to meet like-minded people and build lifelong connections. \nWho is doing it? This event is hosted by the novel's author, Soundarya Balasubramani. She's a 2x author, founder of an American startup, renowned speaker, and influencer. Find her on LinkedIn and Instagram.\nWhy? Products have \"launches\" where they get user feedback to iterate and improve. Why not a book too? \nWhen? Ten sessions are hosted beginning January 11th, 2025 - February 9th, 2025, every Saturday and Sunday afternoon.\nWhere?  Atta Galatta- The Bookstore (178, 5th Main Rd, Indira Nagar 1st Stage, 1st Stage, Indiranagar, Bengaluru, Karnataka 560038)\nWe're only choosing 25 people per session. Spots are limited. Please apply below and we'll be in touch :) Let's create some magic together ✨\n***DETAILS***\n📅 Sessions: Every Saturday and Sunday at 2 PM IST, starting January 11, 2025\r\n🕒 Duration: 90 minutes\r\n📍 Location: Atta Galatta - The Bookstore, Bangalore, India\r\n🎟️ Cost: Free of cost + Free food and refreshments + Incentives (Receive a free copy of the book when you attend 2 or more sessions, and earn an exclusive TDOL T-shirt 👕 by joining 5 or more sessions! 😊✨)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT903",
    "image": "https://attagalatta.com/admin/uploads/events/1328315502.jpeg",
    "performer": "Soundarya Balasubramani",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-09T17:30:00+05:30",
    "endDate": "2025-02-09T17:00:00+05:30"
  },
  {
    "name": "Tumhaare Baare Mein - Theatre Performance",
    "description": "This play focuses on modern relationships and the complexities and the dilemmas which come with it. It emphasises on the voids and the fantasies which come with the differences in partners and how current relationships need a therapy and social media validation to achieve a sense of completion.\nShow times are as follows:\n8th February:\n4:00PM - 6:00PM\n7:00PM - 9:00PM\n9th February:\n7:00PM - 9:00PM",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT931",
    "image": "https://attagalatta.com/admin/uploads/events/763311011.jpeg",
    "performer": "Arena Theatre Productions",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "TheatreEvent",
    "startDate": "2025-02-09T19:00:00+05:30",
    "endDate": "2025-02-09T18:00:00+05:30"
  },
  {
    "name": "Qu for Quiz - Quiz",
    "description": "The Qu for Quiz is based on a grid format with the grids formed by topics on one axis and level of difficulty (and hence the points) on the other. The topics could be varied like History, Sports, Music, Literature, Movies and more. A team of two members would get to choose a topic and the level of difficulty and the question would be revealed. The rest of the teams can go for the buzzer if they know the answer. Depending on the number of teams registering, the size of the grid would be decided. \nSAMPLE Qu: 2. The name is inspired by the traditional malt whisky distillation process in which malted barley was mixed by hand with shovels. This labor-intensive process often caused a shoulder injury to workers, causing their arms to hang low. Which brand is named thus?\nGanesh Balakrishnan is an entrepreneur, marketer and creator of terrible dad jokes. His claim to fame is attempting to sell shoes during the pandemic, culminating in a viral Shark Tank \"Down But Not Out\" appearance. He is a collector of useless facts since childhood, and has dabbled in trivia quiz circuits since college. ganesh.flatheads@gmail.com\nKarthik Srinivasan is a pseudo-retired software leader by choice, specializing in innovative ideas to spend time that include organizing cricket leagues at the scale of IPL but for free, staying up to date on latest debates in virtual social groups helmed by family and friends and more on similar lines. emailkarth@gmail.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT971",
    "image": "https://attagalatta.com/admin/uploads/events/626493470.png",
    "performer": "Ganesh Balakrishnan, \nKarthik Srinivasan,",
    "keywords": [
      "Quiz",
      "Quiz"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-14T19:00:00+05:30",
    "endDate": "2025-02-14T20:30:00+05:30"
  },
  {
    "name": "Acupuncture Healing Energy Bootcamp - Wellness Workshop",
    "description": "Join us for an eye-opening and heart-opening session of healing at Atta Galatta!\nIn this session you will:\nLearn about the ancient Chinese system of healing known as Acupuncture\nUnderstand how blocked and imbalanced energies in our bodies could lead to chronic physical and emotional ailments\nGet personalized treatment to unblock and balance your energies (no needles involved)\nHave an intense guided journalling and meditation session to uncover inner wounds and heal them\nGet tips for a more balanced life\nIdeal for those who suffer from recurring physical ailments, those who seek to break recurring unhealthy behavioural patterns, those seeking relief from stress and anxiety and for curious souls looking to understand their bodies and minds better.\nParticipants are requested to wear loose and comfortable clothing as we will be doing some light stretches during the session.\nPlease bring along a pen and a bottle of water.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT880",
    "image": "https://attagalatta.com/admin/uploads/events/2045059298.png",
    "performer": "Benazir",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-02-15T11:00:00+05:30",
    "endDate": "2025-02-15T12:30:00+05:30"
  },
  {
    "name": "Book Idea to Success - Writing Workshop",
    "description": "Do you have a book idea but don’t know where to start?\nHave you been dreaming of writing a book but feel stuck?\nOr maybe you have a strong gut feeling that your book can be successful—but you`re unsure how to make it happen amidst the messy market?\nJoin \"Book Idea to Success\"—an interactive, activity-based workshop designed to help you craft a winning strategy and turn your book idea into a publishing success!\nIn this workshop, you`ll get introduced to six key areas that will make your book a success. You`ll also go through a proven five-step process to achieve your goal. By the end of this workshop, you’ll have a clear direction and a solid plan to start writing your book with confidence to make it successful.\nReady to break through your doubts and create a winning strategy for your first book?\n👉 Register now and take the first step toward your author journey. Experience success alongside other aspiring authors as you unlock the strategies, tools, and confidence to turn your ‘Book Idea into Success’.\nLet’s make your book dream a reality!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT966",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Rudresh Jayaram",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-15T17:00:00+05:30",
    "endDate": "2025-02-15T19:00:00+05:30"
  },
  {
    "name": "How To Sleep Better - Book Launch",
    "description": "Did you know that 10-30 per cent of adults struggle with chronic insomnia?\nIn her book How to Sleep Better, Allied Functional Medicine and Ayurvedic health counsellor Deepa Kannan explores the root causes of poor sleep and provides expert tips and advice that will enhance the quality and duration of your resting hours and rejuvenate your life. She explains how and why we sleep, what our body does while we rest, and the reasons behind many common sleep problems. She also enlightens us on how to use each of our ten senses or indriyas mentioned in the Upanishads--the eyes, ears, nose, skin, tongue, rectum, genitals, legs, hands and mouth--effectively to enjoy a restful night. This comprehensive guide offers an easy-to-adapt, prescriptive lifestyle programme that will empower us with incredible tools for a healthier life.\nJoin us for a session with the author on 15th February! She will be in conversation with Subodh Sankar, co-founder of Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT968",
    "image": "https://attagalatta.com/admin/uploads/events/1418834376.jpg",
    "performer": "Deepa Kannan",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-15T18:00:00+05:30",
    "endDate": "2025-02-15T19:00:00+05:30"
  },
  {
    "name": "Conflict Alchemy - Wellness Workshop",
    "description": "Do you have a difficult conflict with someone in your life — maybe a partner, friend or family member? Perhaps it`s an explosive fight, or it could be an entirely unspoken one. Want to discover ways of turning that conflict into something positive? Come explore Conflict Alchemy, a tool that can turn conflict into the `gold` of: deeper understanding and connection, solutions that work for everyone, clearing up assumptions or misunderstandings, and even emotional healing. We will learn practical tools with a balance of theory and practice. Note that this workshop is for everyone, not just those with very difficult conflicts. It can help prevent minor conflicts from becoming huge, unmanageable ones.\n“Roy made me realise that conflict is an opportunity to understand the other person better. The very fact that 2 people are open to resolving a conflict says volumes about their intention to keep the relationship at the center. Roy’s mediation made me feel like he could see through the conflict and look directly at my core needs. Once I had awareness of that I could respond better to the situation with more empathy.” - Rishabh Khaneja\nAbout the Trainer: Roy Jacob is a facilitator, trainer, mediator, and founder of the Conscious Communication Academy. He has been facilitating retreats for the past 13 years, including Conscious Communication, the India Youth Jam, the EcoJam, Authentic Relating, and team retreats for NGO`s and companies. Roy grew up in the U.S. before finding his calling and coming to India (where his roots are) in 2003. Apart from facilitating, he enjoys farming, simple living, and watching the stars at night.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT977",
    "image": "https://attagalatta.com/admin/uploads/events/985901107.png",
    "performer": "Roy Jacob",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-02-16T11:00:00+05:30",
    "endDate": "2025-02-16T13:00:00+05:30"
  },
  {
    "name": "Great Eastern Hotel - Book Reading",
    "description": "The world is at war. And at the Great Eastern, Calcutta's most luxurious hotel, amidst the feasting, dancing and laughter, we witness the metropolis in the last moments before multiple disasters strike.\nThe story begins in August 1941, on the day Rabindranath Tagore dies. The city has come to a standstill as thousands of people line the streets to pay their respects. Among them are: Nirupama, a student of history and a volunteer with the Communist Party of India; Imogen, a young Englishwoman whose father is an official with the Raj; Kedar, the scion of a wealthy family, who dreams of painting like Cezanne; and Gopal, a young but experienced pickpocket, who finds himself promoted into a dark, dangerous world.\nTheir lives intertwine with those at the hotel: an American soldier who plays jazz at the nightclub; a genius French chef; an heiress fleeing from the nightmare in Europe; and a group of military officers running a secret intelligence operation.\nSingularly ambitious and attentive, Ruchir Joshi's Great Eastern Hotel maps this simmering pause at a crucial juncture in history, and offers new contexts to the upheavals of our present, raising vital questions about political commitment, nationalism, love and art.\nJoin us for a session with the author on 16th February, where he will be reading from portions of his book and signing copies.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT975",
    "image": "https://attagalatta.com/admin/uploads/events/461909112.jpg",
    "performer": "Ruchir Joshi",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-16T12:00:00+05:30",
    "endDate": "2025-02-16T13:00:00+05:30"
  },
  {
    "name": "LGBTQIA+ Therapists Meet Up! (Bangalore) - Queer Therapists Meet Up",
    "description": "LGBTQIA+ Therapists Meet up is a call for community. \n\"Are you a queer therapist? Omg can you be my therapist\" OH NO. Going to queer pride events, I often find myself working even outside of work. As soon as I reveal that I am a therapist, people want to talk to me about work. \"You're probably psychoanalyzing me right now.\" \"Girl I have so much trauma, let me tell you...\" and then it is unsolicited story time oof. \nLGBTQIA+ Therapists Meet up is a call for community. Whether you're a seasoned therapist or just starting out in the field, come join us for some good vibes, connection, and support.\nWe are creating a compassionate space for LGBTQIA+ therapists to let loose over coffee and conversations. Let's wind down and take a break from our therapist side. Let's be a part of a safe space where there are no run-ins with a client or awkward encounters with info dumping. We can play games, exchange reading recommendations, and connect over shared music.\nDate- 16th February (Sunday)\nTime- 2 to 5pm\nLocation- Atta Galatta \nNOTE: Please fill this form only if you're interested to be a part of this event. Kindly note that this is a free of cost venture and we would really appreciate if you can ensure your availability at the event. If there is a cancellation from your end, please WhatsApp us at +91 6397671791 in advance.\nNo pressure, no judgment—just a chance to kick back, share stories, and build friendships with folks who get what it's like to navigate both the therapy world and the rainbow spectrum of identities.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT963",
    "image": "https://attagalatta.com/admin/uploads/events/1216112575.png",
    "performer": "Here Hear Therapy",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-16T14:00:00+05:30",
    "endDate": "2025-02-16T17:00:00+05:30"
  },
  {
    "name": "Mandala Circles: Unlocking Stories Within - Wellness Workshop",
    "description": "Join us for a soulful workshop where art becomes your guide to self-discovery!\nReflect, explore, and express your inner world through the captivating art of mandalas. No art experience? No worries—just bring your curiosity and creativity!\n🌟 What Awaits You:\n🖌️ A journey of reflection\n🎭 A space to explore and create\n🌈 A canvas for your untold stories\nLet’s turn patterns into possibilities. Unlock your story now!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT956",
    "image": "https://attagalatta.com/admin/uploads/events/63556000.jpg",
    "performer": "Ketki Anand, \nSunita Jose,",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-02-16T16:00:00+05:30",
    "endDate": "2025-02-16T18:00:00+05:30"
  },
  {
    "name": "Dastaan-e-Sama - An Evening of Kashmiri & Persian Poetic Traditions",
    "description": "The Dastaan-e-Sama is a captivating journey through the mystical traditions of Kashmir, blending rich storytelling, soul-stirring music, and evocative raqs. This unique event merges three forms of Kashmiri folk traditions to celebrate the spiritual and poetic legacy of Kashmiri Sufi saints and poets. The evening will feature a harmonious interplay of languages, including Urdu and English, to narrate and interpret the profound teachings and poetry of Kashmir’s Sufi heritage.\nThrough Folk Dastaan (storytelling in verse) and a Sufiyana Music Mehfil, audiences will be transported to the heart of Kashmir’s cultural and spiritual landscape. The program will include the mesmerizing melodies of Santoor and Saaz-e-Kashmir, accompanied by the singing of Sufiyana Maqams.\nThe performance will be further enriched by Tsookh Raqs and Dambali—a classical Sufi performance raqs—bringing a visual dimension to the mystical narratives. The narration, apart from the traditional styles of LadiShah and Dastaan, will also include explanations in English by the Magun (narrator), ensuring that the poetic content and the form’s nuances are communicated effectively to a diverse audience. The multimedia-enhanced ambience will provide an immersive experience, allowing the audience to deeply connect with the timeless wisdom of Kashmir’s Sufi traditions.\nKey Elements:\n\nFolk Dastaan (Storytelling in Verse): Narratives highlighting the life, teachings, and poetry of Kashmiri Sufi saints, presented in Urdu and English for wider accessibility.\nSufiyana Music Mehfil: Traditional Kashmiri music featuring Santoor and Saaz-e-Kashmir, with renditions of Sufiyana Maqams.\nMultimedia Integration: Enhanced visuals and lighting to create a transformative and immersive environment.\nNarrative Explanations: Insightful commentary to contextualize the Sufi thought, poetry, and music for the audience. The narration will incorporate traditional LadiShah and Dastaan styles, complemented by English explanations from the Magun to bridge cultural and linguistic gaps",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT958",
    "image": "https://attagalatta.com/admin/uploads/events/1317114479.jpg",
    "performer": "Maara Collective, \nPeather' Baraye' Kasheer,",
    "keywords": [
      "Sufi",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-16T18:00:00+05:30",
    "endDate": "2025-02-16T20:00:00+05:30"
  },
  {
    "name": "This Place I've Never Been - An Evening of Spoken Word to Raise Awareness about Suicide and Mental Health",
    "description": "The Non-Aligned Poets Collective is collaborating with Atta Galatta for an event dedicated to raising awareness about suicide and mental health. Through poetry and shared stories, we aim to create an event for healing and understanding. Let’s break the silence, start meaningful conversations, and remind each other that help is always available. Together, we can support one another and empower those who need it most.\nVenue: Theater @ Atta Galatta\nDATE: 16 February 2025\nTicket: 499₹ (includes free copy of This Place I’ve Never Been)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT976",
    "image": "https://attagalatta.com/admin/uploads/events/2111191557.png",
    "performer": "Non-Aligned Poets Collective",
    "keywords": [
      "Poetry",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-16T18:00:00+05:30",
    "endDate": "2025-02-16T20:00:00+05:30"
  },
  {
    "name": "Grandma's Tale / Nani ki Kahani - Puppet Show",
    "description": "'The Puppetarians' - famous Puppeteers from Mumbai are bringing their beloved Puppet Show 'Grandma's Tale' to Atta Galatta!\nEnter the wondrous world of puppets as Puppet Granny tells a fabulous folktale with her shadow puppets and delivers an important message too. An interactive puppet show with audio-visual clues that'll keep children guessing and laughing. A story filled with animals and a mischievous thief. And also filled with messages of love, compassion, kindness, sharing and co-existence. Walk-around and shadow puppets projection make this enchanting folktale a great hit among children, teachers, parents and even grandparents!\nTotal Duration: 35 min\nLanguage: English\nFor Ages: 4 Years and Above\nAbout The Puppetarians\nThe Puppetarians is a unique Puppet Performance Initiative based in Mumbai. Famous for its live shows, puppetry workshops and TV/video works with puppets, The Puppetarians have earned a special place in the hearts of children, parents and teachers alike. From 'Mogambo-Zogambo' in DID Lil Masters to 'Honey-Bunny' on SonyYay and 'Devi-Sajjan' in Kaun Banega Crorepati - The Puppetarians' puppet characters are loved by everyone.\nIts founders Sangya Ojha and Hashim Haider have also been puppeteers for Sesame Street India (also known as Galli Galli Sim Sim, on-air Cartoon Network, POGO, DD1) and are authors and TEDx speaker as well. The Puppetarians have been awarded the Awareness Warriors Award, and the prestigious mBillionth Award for their Puppet Video Series - 'Tara Hai Taiyar' created with UNICEF. The Puppetarians have been creating educational and entertaining content with puppets, presenting hundreds of shows worldwide and training innumerable puppeteers too.. They believe that Puppets are for all ages and their impact could be life-changing!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT979",
    "image": "https://attagalatta.com/admin/uploads/events/746520093.png",
    "performer": "The Puppetarians",
    "keywords": [
      "Puppetry",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-21T17:00:00+05:30",
    "endDate": "2025-02-21T17:35:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nFebruary Read: : The Flavours of Nationalism by Nandita Haksar\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT929",
    "image": "https://attagalatta.com/admin/uploads/events/671032249.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-22T11:00:00+05:30",
    "endDate": "2025-02-22T13:00:00+05:30"
  },
  {
    "name": "Acupuncture Healing Energy Bootcamp - Wellness Workshop",
    "description": "Join us for an eye-opening and heart-opening session of healing at Atta Galatta!\nIn this session you will:\nLearn about the ancient Chinese system of healing known as Acupuncture\nUnderstand how blocked and imbalanced energies in our bodies could lead to chronic physical and emotional ailments\nGet personalized treatment to unblock and balance your energies (no needles involved)\nHave an intense guided journalling and meditation session to uncover inner wounds and heal them\nGet tips for a more balanced life\nIdeal for those who suffer from recurring physical ailments, those who seek to break recurring unhealthy behavioural patterns, those seeking relief from stress and anxiety and for curious souls looking to understand their bodies and minds better.\nParticipants are requested to wear loose and comfortable clothing as we will be doing some light stretches during the session.\nPlease bring along a pen and a bottle of water.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT880",
    "image": "https://attagalatta.com/admin/uploads/events/2045059298.png",
    "performer": "Benazir",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-02-22T11:00:00+05:30",
    "endDate": "2025-02-22T12:30:00+05:30"
  },
  {
    "name": "T-Party: Ways of Queer(ing) - Storytelling Through Drag",
    "description": "A collaborative art exhibition and drag performance, where we undertake a political experiment that explores what it means to be queer in the world today.\nOur T-party is an artistic endeavour in stretching the meaning of “queer”. As you wind your way through our exhibition, we invite you to touch and feel the materials of our closet. Talk to one another, or experience in privacy. Engage yourself with the drag performances. With candour and imperfection, we share our world with you and invite you to share your world with us.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT970",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Khusboo",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-22T18:00:00+05:30",
    "endDate": "2025-02-22T20:00:00+05:30"
  },
  {
    "name": "Panchatantra for Adults - Object Based Storytelling Performance",
    "description": "Timeless tales from one of the most travelled Indian lores created for adults but over time diluted and forgotten, that speaks about human psychology, emotional strength, decision making, relationships, strategy and administration. Peppered with folk songs, miniature indigenous crafts objects on flora and fauna from various parts of the country, the performance travels through the many tantras chapter by chapter touching on the wisdom and timeless. Elephants, Tigers, Donkeys etc: Humans Animals and Metaphors.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT962",
    "image": "https://attagalatta.com/admin/uploads/events/73009116.jpeg",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-22T19:00:00+05:30",
    "endDate": "2025-02-22T20:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT887",
    "image": "https://attagalatta.com/admin/uploads/events/10443690.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T07:00:00+05:30",
    "endDate": "2025-02-23T09:30:00+05:30"
  },
  {
    "name": "Once Upon A Brunch - Sunday Morning Brunch and Stories",
    "description": "Late weekend morning, brunch, stories like the ones from the olden times, meeting new people – what if they all come together?\nWeekend and late morning Brunch is an emotion. On the other hand, Stories have always been an emotion too. What’s common between the two is the rich heritage of food and stories. What if they come together?\nListen to these stories of the food as you enjoy your weekend Brunch set at a cozy location that has its own stories. A beautiful day starts with a lovely breakfast. And a morning with breakfast and stories. Every food we eat has a story to share… Idli, Vada, bread, Paratha etc. Every breakfast comes after a long break and eager to be eaten.\nThis event has 3 aspects to it: A simple Weekend morning Brunch put together by Atta Galatta; storytelling around the food lores by Vikram Sridhar; and meet new people with similar interest over culture and art.\nThe Brunch and the Stories will be suitable for adults and children alike. Children 13 and above\nOnce upon a Brunch is a morning to experience food in all its senses, watching them unfold as you enjoy the yummy meal on a late weekend morning at Atta Galatta. The ticket price is inclusive of a simple Brunch and the Storytelling Performance at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT973",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance and Menu Tasting"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T10:00:00+05:30",
    "endDate": "2025-02-23T12:00:00+05:30"
  },
  {
    "name": "Find Your Voice - Theatre Performance",
    "description": "The \"Find Your Voice\" workshop is a four-hour intensive designed to help stage artists and aspiring performers discover, refine, and enhance their vocal abilities. Voice is one of the most critical tools for a performer, and this workshop delves into the essential elements of posture, breathing, sound production, and projection to equip participants with techniques for delivering powerful and sustainable performances.\nKey Sections of the Workshop\n1. Foundations of Voice and Posture\nPosture and Alignment\nWarm-Up and Body Awareness\n2. Breathing Techniques for Vocal Power\nUnderstanding Breath Control\nPractical Breathing Exercises\nBreath and Movement Coordination\n3. Unlocking Vocal Potential\nExpanding Vocal Range\nArticulation and Resonance\nVocal Health\n4. Voice Projection and Emotional Expression\nProjection Techniques\nExpressing Emotion Through Voice",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT902",
    "image": "https://attagalatta.com/admin/uploads/events/1790510852.jpg",
    "performer": "Aavirbhaav Naatya Manch",
    "keywords": [
      "Theatre",
      "Workshop"
    ],
    "@type": "TheatreEvent",
    "startDate": "2025-02-23T12:30:00+05:30",
    "endDate": "2025-02-23T16:30:00+05:30"
  },
  {
    "name": "Poetic Brew - Poetry Meetup",
    "description": "Gather, Poetic Souls, for an afternoon divine, where verses entwine and words intertwine. In this literary realm, hearts open wide, For a Poetry Meet, let passion be our guide.\nInviting all Poetry enthusiasts 📚 to an In-Person Meet where you can indulge in creative poetry writing and reading session. \nEvent Sections:\n1. Icebreaker Extravaganza - Intro yourself & let`s play an interesting fun Game to break ice cubes.\n2. Poet`s Spotlight: Write a poem based on an innovative prompt letting your thoughts engage.\n<-- INTERMISSION: CHILL & CHAT -->\n3. Recital Stage: Take center stage for 5-7 minutes, discuss the verse that`s touched your head. As you share your verse, let passion reign.\n4. Verse of the Month & What Lies Ahead - Vote for the next Poetry Book to read.\n5. Say Butter - Click that Snap button for a group picture.\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolising the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT936",
    "image": "https://attagalatta.com/admin/uploads/events/769771471.png",
    "performer": "Your View On Books",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T14:22:00+05:30",
    "endDate": "2025-02-23T17:55:00+05:30"
  },
  {
    "name": "Chali Kahaani - A Curated Storytelling Show",
    "description": "✨ An enchanting storytelling extravaganza showcasing tales that tug at your heartstrings and tickle your funny bone.\n🎤 Immerse yourself in narratives spun with love laughter and life as seasoned storytellers craft an unforgettable experience. Envision a night where every word spoken weaves a tapestry of emotions that linger long after the curtains close.\n💫 Let the magic of storytelling transport you to realms where imagination knows no bounds. Be part of a narrative journey that promises to ignite your soul and stir your senses.\nStep into a world where stories reign supreme and let Chali Kahaani enchant you with narratives that transcend time and space. Indulge your spirit ignite your imagination and revel in the sheer joy of storytelling at its finest.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT967",
    "image": "https://attagalatta.com/admin/uploads/events/726822889.png",
    "performer": "Haseeb, \nJyotika, \nSuman, \nVikram,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T16:00:00+05:30",
    "endDate": "2025-02-23T18:00:00+05:30"
  },
  {
    "name": "H.E.A.R.T.B.E.A.T Improv Show - Improv Comedy Show",
    "description": "Imagine comedy where the jokes are made up on the spot, the scenes are created in seconds, and the only limit is the audience`s imagination. That`s improv 🎭 \nGet ready for the debut of the HeartBeat Improv Show at Atta Galatta! From the same folks who bring you the weekly improv jams at Cubbon Park, comes a brand new stage show! Improv, short for improvisation, is exactly what it sounds like: comedy created in the moment, spontaneously, without any scripts or preparation. Experience the thrill of unscripted comedy as our talented improvisers create hilarious scenes, skits, and jokes on the spot, all fueled by YOUR suggestions. Watch them take your ideas and turn them into side-splitting characters and stories right before your eyes. No two shows are ever the same!\nIt`s interactive, it`s spontaneous, and it`s guaranteed to make you laugh. Don`t miss out – grab your tickets today for a night of unpredictable laughter :)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT980",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Heartbeat Improv",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T18:45:00+05:30",
    "endDate": "2025-02-23T19:45:00+05:30"
  },
  {
    "name": "Books, Brews and Poetry - Book Launch",
    "description": "Calling all poetic souls for an afternoon immersed in verses, books and coffee. Join us for a soulful reading session with authors Ankita and Chinchu. Share your thoughts, laugh, connect with the authors as they sign your book copies, participate in some fun literary games and win some cute goodies. All of this and more over steaming cups of coffee.\nLimited seats – Register to attend for free!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT972",
    "image": "https://attagalatta.com/admin/uploads/events/1194696520.jpg",
    "performer": "Chinchu Mathew",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-01T14:30:00+05:30",
    "endDate": "2025-03-01T17:00:00+05:30"
  },
  {
    "name": "Bounce, Hop, Raaga, Pop - Musical Tale for Young Minds",
    "description": "Author and music educator brings her bestselling book, Bounce Hop Raaga Pop to Atta Galatta. Get ready to be mesmerized as she intertwines math and music and takes you through a hopscotch game of raagas. The evening will be made more special, by a live classical performance by her students, accompanied by tabla.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT978",
    "image": "https://attagalatta.com/admin/uploads/events/485733855.jpg",
    "performer": "Shyama Panikkar",
    "keywords": [
      "Kids",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-01T16:00:00+05:30",
    "endDate": "2025-03-01T17:00:00+05:30"
  },
  {
    "name": "Poor Vanya - A Clown Re-imagination of Anton Chekhov's 'Uncle Vanya'",
    "description": "The only thing more comical than clowns in a Chekhov play is a Chekhov play in the clowns' hands!\nWitness the chaos as a troupe of silly and stupid clowns attempts to take on Anton Chekhov’s 'Uncle Vanya' – where personal rivalries (and romances), forgotten dreams (and lines), and a whole lot of backstage drama (that’s honestly more dramatic than the play itself) threaten to derail the entire production.\nWill they ever manage to get through a single rehearsal? Come find out in this uproarious and touching reimagining of a Chekhovian classic.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT964",
    "image": "https://attagalatta.com/admin/uploads/events/1756135228.png",
    "performer": "What If Productions",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-01T19:30:00+05:30",
    "endDate": "2025-03-01T21:00:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "Join us for a cozy, creative space where you can unplug, connect, and just be. This meetup is all about chill vibes—no agenda, no pressure. 🖍️✨\nWhether it’s your first time or your fourth, come as you are—dive into your own project or simply soak up the wholesome atmosphere. Each meetup has brought inspiring moments and wonderful people, and we’re excited to share it all again! 💜\nThere are 15 spots available, and this meetup is exclusively for LGBTQIA+ folks. Neurospicy and neurotypical folks are all welcome. 🌈🎨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT878",
    "image": "https://attagalatta.com/admin/uploads/events/1136766814.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-03-02T14:00:00+05:30",
    "endDate": "2025-03-02T17:00:00+05:30"
  },
  {
    "name": "Women's Sound and Art Workshop - Wellness Workshop",
    "description": "Great things happen when women connect.\nSound is the source of this entire creation.\nDid you know that the sound of the musical notes have a profoundly positive impact on our chakras?\nWhether you receive the sounds from sacred singing bowls meant for the purpose of healing or well-being, or you sing the notes yourself, they bring in a sense of balance.\nAs this balance fosters feelings of joy and peace, it can aid creative expression in many forms.\nPainting is one such creative form that is closely associated with sound and music. The choice of colours, mood and theme, sensory and emotional experience while painting gets influenced by the presence of sound and music in the environment where art is taking place impacting the artistic process and the final creation.\nInspired by this, we have a similar collaboration with artists Shilpi, Ayuushi, Priyanka and Khusbu who aspire to hold a Sound & Art Workshop for women wishing to experience such intense joy and creativity on 8th March 2025, International Women’s Day.\nIt would be a treat to observe the participants flow with the sounds and express their art.\nTake away:\nPainting to add vibrancy to your room or your living. An ideal gift that you can make, gift and surprise anyone.\nThis is a wonderful opportunity to receive encouragement from peer women.\nWhat to Bring:\n\nYoga mat.\nShawl / stole.\nDrinking water bottle.\n\nNo prior art experience is necessary.\nParticipants should come with an open mind. All other materials will be provided.\nWear comfortable, light color cotton / linen clothing as absorbing the vibrations is easier.\nRegistration: Spaces are limited, so early registration is encouraged.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT932",
    "image": "https://attagalatta.com/admin/uploads/events/895204819.jpeg",
    "performer": "Ayuushi, \nKhusbu Goyal, \nPriyanka Sinha, \nShilpi,",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-08T15:00:00+05:30",
    "endDate": "2025-03-08T18:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT887",
    "image": "https://attagalatta.com/admin/uploads/events/10443690.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T07:00:00+05:30",
    "endDate": "2025-03-09T09:30:00+05:30"
  },
  {
    "name": "Love Stories from Indian Heritage - Storytelling",
    "description": "Love stories aren’t only about the hero and heroine for love can rarely exist in isolation. Zealous messengers, art and music as mood enhancers, food as aphrodisiacs, taboos and mores – all play a pivotal role in shaping stories of love. Vikram Sridhar and Aparna Jaishankar rummage through the passages of time to bring you various hues of love etched in our heritage through literature, architecture, songs and poetry through the all- encompassing art form of oral storytelling.\nAbout Aparna Jaishankar\nAparna Jaishankar is a Storyteller with a penchant for Indic mythology. She believes that there is no ONE version of any story. Her storytelling performances take a contemporary view of ancient tales. Aparna also works with educators in developing learning perspectives in the classroom and with organisations in building internal narratives.\nAbout Vikram Sridhar \nVikram Sridhar is a Performance Storyteller and theatre practitioner who believes in Storytelling as a strong medium for Conservation and Conversation, which is highly relevant in the modern context. Vikram combines his work and interest in Theatre, Social Work, and Conservation in his Storytelling and has performed for audience of various age groups across India.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT974",
    "image": "https://attagalatta.com/admin/uploads/events/1610460200.png",
    "performer": "Aparna Jaishankar, \nVikram Sridhar,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T19:00:00+05:30",
    "endDate": "2025-03-09T20:00:00+05:30"
  }
]