[
  {
    "name": "A Letter For You - A slow evening with readings, journaling, & connection",
    "description": "Sometimes the smallest pause shifts the most.\nA Letter For You is a slow, intentional evening centered around readings from the Inner Child Journal, gentle reflections, and unhurried conversations. A space to sit with words, notice what’s been moving quietly inside you, and return to yourself without pressure.\nThere’s nothing to fix here. No need to arrive feeling creative or expressive. You’re welcome to show up low-energy, slightly tired, or just as you are. This is an evening designed to be soft on you.\nYou’ll receive a Glow Mail on arrival - a letter, small keepsakes, and simple reflection prompts you can take home and return to whenever you need a pause.\n \nTwo calm hours to slow down, feel a little lighter, and let the evening hold you for a bit.\n \nEvent Details\n🗓 27th February\n📍 Atta Galatta\n⏰ 6:00 PM - 8:00 PM\n \nWhat’s included\n•⁠ ⁠Glow Mail - letter, stickers, keepsakes & reflection prompts\n•⁠ ⁠Readings from the Inner Child Journal\n•⁠ ⁠Light journaling + reflection exercises\n•⁠ ⁠A calm, intimate space to unwind\n \nCome as you are.\nLeave a little lighter.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1702",
    "image": "https://attagalatta.com/admin/uploads/events/1592353554.jpg",
    "performer": "Women in the hood",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-27T18:00:00+05:30",
    "endDate": "2026-02-27T20:00:00+05:30"
  },
  {
    "name": "Food In Literature - Book Club with Prachi Grover",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well. \nSo, if viewing the world through the lens of food and literature interests you, then join us for a dialogue on “Food in Literature” and to celebrate those stories and their diversity. \nEach month with Prachi Grover, we read our way through several powerful (and delicious) narratives.\nFebruary Read: The Food of Paradise by Khalid Jawed\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available. \nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who love to read and eat!\nWhen: Saturday, 28th February, 2026 at 11 a.m.\nWhere: Atta Galatta Bookstore, Indira Nagar\nAges: 18+\nRegistration is mandatory (link in bio)\nCopies of the book are available at the store.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1669",
    "image": "https://attagalatta.com/admin/uploads/events/433836189.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-28T11:00:00+05:30",
    "endDate": "2026-02-28T13:00:00+05:30"
  },
  {
    "name": "Love Quotient - An immersive exploration of love, self-worth, and inner clarity",
    "description": "“Love is like the wind, you can’t see it, but you can feel it.” – Nicholas Sparks\n \nJust like the wind, we very often give away love too easily. \nFilling others' cups of emotions needs, while leaving one's own completely drained.\nWondering where all the energy went?\nConstantly available while compromising on one's own needs.\n \nIf you’ve ever felt “too much,” done with love, or unsure of who you are beneath expectations… we hear you.\nIt’s time to reclaim your worth.\n \nThis immersive gathering invites you into a space of curiosity, awareness, and honest self-exploration. Through thought-provoking conversations and engaging reflective activities, you’ll reconnect with your inner voice and experience love beyond surface affirmations.\n \nNot performative love.\nNot social-media love.\nBut grounded, embodied self-worth.\n \nExpect insight.\nExpect depth.\nExpect moments that stay with you long after you leave.\n \nYou’ll walk away clearer, informed, impacted — and wanting to go deeper.\n✨ Be part of the beginning that starts with you!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1699",
    "image": "https://attagalatta.com/admin/uploads/events/1935353651.jpg",
    "performer": "Shreya Salian",
    "keywords": [
      "Wellness and Health",
      "Support Group"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-28T16:00:00+05:30",
    "endDate": "2026-02-28T17:00:00+05:30"
  },
  {
    "name": "Atta Galatta presents “Let Poetry Be” - Poetry Open Mic by Palgun K. J.",
    "description": "This monthly gathering will see poetry coming to life, through reading, music, art and any other forms of artistic expression, at Atta Galatta. Listeners and performers are all welcome!\n \nDate: 28th February\nTime: 4pm \nVenue: Atta Galatta, Indiranagar\n \nEvent specifics & submission guidelines –\n1. Theme - Free Verse (any original work)\n2. Works can be original or of other poets, performed live\n3. All languages welcome\n4. Participants can read to music (acoustic instrument/s), dramatise, use props & costumes\n5. Each participant will enjoy 5 minutes of reading time\n6. Kindly submit your poem and name to letpoetrybe@gmail.com on or before 26th Feb midnight. WE WILL NOT ACCEPT ATTACHMENTS OR LINKS. SUBJECT OF YOUR MAIL MUST READ AS 'Entry for-February LPB meet-up'\n7. You may also send entries that are not related to the theme\n8. The event will begin at 4pm sharp and will be held at Atta Galatta. Participants to report not later than 3:45 pm to hear about performance order and meet the host\n9. For any further clarifications, write to us at letpoetrybe@gmail.com\n \nYou are now welcome to flood our inbox!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1670",
    "image": "https://attagalatta.com/admin/uploads/events/1667357541.png",
    "performer": "Palgun KJ",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-28T16:00:00+05:30",
    "endDate": "2026-02-28T18:00:00+05:30"
  },
  {
    "name": "Atta Galatta presents “The BWW Short Story Community” - Literary Meetup by Bhumika Anand",
    "description": "The BWW Short Fiction Community at Atta Galatta will discuss \nA Child’s Smile By Jadd Hilal\nTranslated from French by Lara Vergnaud\nIn short but powerful vignettes, Jadd Hilal interweaves the lives of four generations of women from a family that has fled to Lebanon after a violent invasion of their Palestinian city by the Haganah.\nRead the text and come for the event.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1671",
    "image": "https://attagalatta.com/admin/uploads/events/2055372860.png",
    "performer": "Bhumika Anand",
    "keywords": [
      "Literary Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-28T16:00:00+05:30",
    "endDate": "2026-02-28T18:00:00+05:30"
  },
  {
    "name": "Weaving A Story - A curated exploration of Classical Dance & Textile through stories by Aparna Jaishankar",
    "description": "Join us for a curated storytelling evening - Weaving a story. Whether you're a lover of textiles, history, or just fascinated by Indian heritage and Classical Dance, this event will wrap you in the magic of tradition.\nThis event is organized in partnership with Janani Murali, renowned Bharatanatyam practitioner and Shruthi Kezhakepuram Purushotham, Mohiniyattam exponent.\nAbout Janani Murali: \nJanani Murali is a performer, researcher, educator and writer based in Bangalore who uses Bharatanatyam to access and address socio-cultural complexities. She trained under her mother, Guru Smt. Padma Murali, and serves as Associate Artistic Director of Padmalaya Dance Foundation and Executive Member of the International Dance Alliance, Bangalore Chapter. An A Grade artist of Doordarshan Kendra and empanelled artist of ICCR, Murali traverses traditional and contemporary formats of performance and dance education. Her work has earned titles including Nalanda Nrutya Nipuna, Padmavati Puraskar and Narthana Shironmani. Her work and research into “Creative Processes” under the UNBOXED series aims at using performing arts to add value in interdisciplinary environments. Murali is also a biologist with corporate experience in the pharmaceutical industry. She continues to publish clinical and medical research and holds leadership roles at Young Indians.\n\nAbout Shruti:\n\r\nShruthi Kezhakepuram Purushotham is a distinguished traditional dancer renowned for her mastery and innovative approach to Mohiniyattam. Her work reflects a deep understanding of Indian traditional dance as a movement form enriched by its historical and regional roots. Shruthi's artistry uniquely blends contemporary themes and self-expression, making her performances timeless and relevant.\nAbout Aparna:\nAparna Jaishankar is a Storyteller, Educator and Corporate Trainer.\nAparna’s passion lies in exploring Indic Mythology with a contemporary lens. She enjoys the various versions of these stories found in the nooks and crannies of the Indian subcontinent in the form of songs, theatre, dance, weaving, rituals and practices. She incorporates these rich sources in her Storytelling performances.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1687",
    "image": "https://attagalatta.com/admin/uploads/events/1885420530.png",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "History",
      "Community Event"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-28T18:30:00+05:30",
    "endDate": "2026-02-28T19:30:00+05:30"
  },
  {
    "name": "Zara Sa Yaad Rakhna Hai - An Evening of Ghazals",
    "description": "We scroll past everything.\nA war.\r\nA wedding reel.\r\nA protest.\r\nA discount code.\r\nSmoke over a city.\r\nA poem we almost read.\nAnd somewhere between all of it, our heart doesn’t get enough time to feel.\nZara Sa Yaad Rakhna Hai is an evening of ghazals that refuses to hurry.\nSeven stories, seven moments we choose not to swipe past.\nFrom Ghalib’s unanswered wounds in Ibn-e-Mariam\r\nto Mir’s lingering question - Yeh dhuan kahan se uthta hai?\r\nfrom Faiz’s dignified defiance in Aaj Bazaar Mein\nto a deeply personal new composition being released that evening!\nthis is not just a mehfil.\r\nIt is a pause.\nWith tabla, harmonium, electric guitar and voice, we sit with stories of loss, desire, forgiveness, protest, memory  and allow music to stretch time.\nIn a world that rewards speed, come choose stillness.\nScroll. Stop. Stay.\n📍 Atta Galatta\r\n🗓 Saturday, 28 February\r\n🕖 7:00 PM",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1698",
    "image": "https://attagalatta.com/admin/uploads/events/515651843.png",
    "performer": "by Muqtalif",
    "keywords": [
      "Live Music",
      "Ghazal"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-28T19:00:00+05:30",
    "endDate": "2026-02-28T20:00:00+05:30"
  },
  {
    "name": "Emotional hygiene: The skill that no one taught us - An Interactive Workshop",
    "description": "Every day, we practise physical hygiene without thinking.\nWe brush our teeth.\nWe wash our hands.\nWe clean our homes.\nBecause we know small build-ups, if ignored, turn into bigger problems.\nBut what about emotional build-up?\nThe argument you replay.\nThe message you overthink.\nThe stress that lingers in your body.\n \nEmotional hygiene is learning how to clear these feelings before they pile up.\nIt helps you notice what’s bothering you, calm your system, and let go — instead of carrying everything forward.\nSo you don’t bring yesterday into today.\nSo you respond, instead of react.\nSo you feel lighter inside.\nBecause peace isn’t accidental.\nIt’s practised.\nThis is an invitation to care for your inner world as intentionally as you care for everything else.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1693",
    "image": "https://attagalatta.com/admin/uploads/events/223774710.png",
    "performer": "Mihika Rajesh, \nMuskan Siyal,",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-03-01T11:00:00+05:30",
    "endDate": "2026-03-01T13:00:00+05:30"
  },
  {
    "name": "Lahe Lahe Caravan presents “Harry Potter Book Discussion” - Meetup by Sonali Bhatia",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1703",
    "image": "https://attagalatta.com/admin/uploads/events/1022088727.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Books and Literature",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-03-01T14:30:00+05:30",
    "endDate": "2026-03-01T16:00:00+05:30"
  },
  {
    "name": "Lahe Lahe Caravan presents “Harry Potter Book Discussion - Meetup by Sonali Bhatia",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1691",
    "image": "https://attagalatta.com/admin/uploads/events/926885313.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-03-01T14:30:00+05:30",
    "endDate": "2026-03-01T16:00:00+05:30"
  },
  {
    "name": "Science Café - A celebration of National Science Day",
    "description": "On the eve of National Science Day we are hosting free wheeling conversations about stories, poems and books related to science and scientific discoveries over a cuppa of coffee. Do bring in your favourite anecdotes, stories, poems and books. It is time to celebrate Science and the role it plays in shaping our culture and imagination.\nThe aim of the Café Scientifique is, according to author and neurologist Oliver Sacks \"to bring science back into culture\". Whereas science is often seen as boring, difficult and mathematical, the aim of the Café Scientifique is to make science relevant, powerful and important.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1704",
    "image": "https://attagalatta.com/admin/uploads/events/757067972.png",
    "performer": "Ste=mc² and AG",
    "keywords": [
      "Science and Technology",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-03-01T16:00:00+05:30",
    "endDate": "2026-03-01T18:00:00+05:30"
  },
  {
    "name": "Voices We Ignore: Playback Theatre and storytelling - Stories from the Mahabharata",
    "description": "What are the whispers we silence?\nThe truths we avoid?\nThe intuitions we override?\nThe people we fail to hear?\nThrough the powerful format of Playback Theatre, we will listen to your personal, real-life stories of the unheard voices . Interwoven with this will be storytelling from the Mahabharata where unheard voices often shape destinies. Come, be there to witness, reflect, and listen - to each other, and to ourselves.\nThis unique blend of Playback Theatre and oral storytelling is something First Drop Theatre has been exploring and presenting over the last several years. India has a rich and deep tradition of oral storytelling, and when it combines with Playback Theatre, it creates a wondrous amalgamation with a uniquely Indian touch.\n1st March | Sunday | 5:30 PM | Atta Galatta, Indira Nagar\nTicket Price  -  INR 300/-\nBook tickets - https://tinyurl.com/42zr6j5a or scan the code on the poster or gpay +91 9886185008",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1692",
    "image": "https://attagalatta.com/admin/uploads/events/1648933495.jpeg",
    "performer": "Aparna Jaishankar, \nFirst Drop Theatre,",
    "keywords": [
      "Theatre",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-03-01T17:30:00+05:30",
    "endDate": "2026-03-01T19:00:00+05:30"
  },
  {
    "name": "The Bengal Reader - Book Discussion by Arunava Sinha",
    "description": "Join us at Atta Galatta for an evening celebrating The Bengal Reader, the most expansive anthology of Bengali writing in translation published in a single volume. Edited and translated by Arunava Sinha—one of the most prolific translators of our time—this landmark collection opens up two centuries of Bengali literary thought to both Bengali and non-Bengali readers alike.\nArunava Sinha will be in conversation with writer and editor Shinie Antony on 6 March, 5 PM to 7 PM, in a wide-ranging discussion on the making of the anthology, the evolution of Bengali literature, and the politics and possibilities of translation. Together, they will explore how the book traces the intellectual, social, and literary currents of Bengal—from reformist voices like Rammohun Roy and Bankim Chandra Chattopadhyay, through Rabindranath Tagore and Sarat Chandra Chattopadhyay, to revolutionary and contemporary writers engaging with caste, media, consumerism, and identity.\nThe Bengal Reader reflects the literary life of Bengal across two centuries—its arguments, revolutions, and reinventions—and brings together voices that have shaped Indian literature and society. This conversation will offer readers an opportunity to engage with the book’s expansive vision and the rich histories it carries, as well as with the craft of translation that makes these works accessible across languages and generations.\nJoin us for an engaging evening of literary history, translation, and conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1700",
    "image": "https://attagalatta.com/admin/uploads/events/1420529759.jpeg",
    "performer": "Arunava Sinha , \nShinie Antony,",
    "keywords": [
      "Book Discussion",
      "Meet and Greet"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-03-06T17:00:00+05:30",
    "endDate": "2026-03-06T19:00:00+05:30"
  },
  {
    "name": "Windows & Mirrors: An Interactive Session by Gayatri  - A session for Adults to read children's books, look out & look within",
    "description": "Should adults read children's books? How can these books spark conversations about diversity, inclusion, and privilege? 'Windows and Mirrors' is a space where adults can reconnect with the joy and curiosity that children's books often evoke. \nDuring the session, participants will:\n\nExplore Indian children’s literature in print through Rudine Sims Bishop’s framework of “Mirrors, Windows, and Sliding Glass Doors.”\nReflect on their own reading habits and social location using The Indian Wheel of Power and Powerlessness as a lens.\nBrowse and read a curated selection of children’s books. \nParticipate in a facilitated learning circle with guided reflection prompts.\n\nThe session blends quiet reading, critical inquiry, and shared dialogue to examine how the stories we consume shape our understanding of identity, belonging, and power.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1694",
    "image": "https://attagalatta.com/admin/uploads/events/649756692.png",
    "performer": "Gayatri",
    "keywords": [
      "Reading Circle",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-03-07T11:00:00+05:30",
    "endDate": "2026-03-07T12:30:00+05:30"
  },
  {
    "name": "Ode to Broken Things - Book Launch",
    "description": "Join us to celebrate Shruti Kulkarni’s debut poetry collection and reading from her book Ode to Broken Things. The poet will be in conversation with Vinutha Mallya.\nOde to Broken Things is a reflection on what it means to be human, to be a living repository of timestamps of our individual and collective struggles and celebrations and of rebellions and failures. These poems are a quiet observation of our responses to the passing of these events and of our efforts to understand this world that offers experiences of duality — of wars and peacetime, abundance and poverty, of love and hate. Ode to Broken Things is also a prayer and an earnest dream for a peaceful world for everyone, where all hearts are warm and borders are always open.\nIn Ode to Broken Things, we are taken to the heart of matter — to observe the atomic, the molecular, the granular parts of our inner and outer worlds that we miss amid the unsettling busyness. Ode to Broken Things invites us to feel, see, think and wonder about all that surrounds us. Raw and uncut, these poetic expressions draw us towards hope.\n – Vinutha Mallya [Journalist, editor and lecturer]",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1695",
    "image": "https://attagalatta.com/admin/uploads/events/47072900.png",
    "performer": "by Shruti Kulkarni",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-03-07T17:00:00+05:30",
    "endDate": "2026-03-07T18:00:00+05:30"
  },
  {
    "name": "That’s What She Said - A Playback Theatre Performance by Threads and Tales",
    "description": "On the occasion of Women’s Day, we ask a simple question:\nWhy should women be celebrated only on one day?\nWomen are powerful, complex, and extraordinary every single day—yet too often treated like second-hand citizens the rest of the year. This performance begins right there, challenging the idea of limiting celebration to a date on the calendar.\nInstead, we open a space for real stories.\nStories of being a woman.\nStories of loving, learning from, and living alongside women.\nStories of mothers, teachers, mothers-in-law, partners, sisters, daughters, friends, bosses, colleagues, daughters-in-law—and everything in between.\nStories of how men see the women in their lives.\nStories of embracing the feminine within.\nWhat to Expect\nThis unique Playback Theatre experience invites the audience to share personal moments and lived experiences. In real time, our performers will transform these stories into spontaneous theatre using movement, music, and dialogue—honest, unscripted, and deeply human.\nThreads and Tales is an Applied theater initiative by Lahe Lahe Caravan \r\n \n⏱️ When: 8th March | 5:30 – 7:00 PM\n📍 Where: Atta Galata, Indiranagar\n🎟 Tickets: 300 rs per person",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1689",
    "image": "https://attagalatta.com/admin/uploads/events/1806851849.jpg",
    "performer": "Threads and Tales",
    "keywords": [
      "Theatre",
      "Interactive Theatre Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-03-08T17:30:00+05:30",
    "endDate": "2026-03-08T19:00:00+05:30"
  },
  {
    "name": "Between the Pages: A Crochet Bookmark Workshop - A Workshop by Lakshitha",
    "description": "Spend your Saturday evening slowly creating something special with your hands.\nIn this beginner-friendly workshop, we’ll learn how to crochet a handmade bookmark — a small, meaningful piece you can tuck between the pages of your favourite book or gift to someone who loves to read.\nThis session is designed by Slip Stitch for complete beginners as well as anyone who simply wants to sit, unwind, and make something beautiful in a warm, book-filled space.\nYou’ll learn:\n• Basic crochet techniques\n• How to read a simple pattern\n• How to finish and neatly assemble your bookmark\nAll materials will be provided — just bring yourself (and maybe your current read).\nWhere: Atta Galatta\nWhen: 14th March\nTime: 4:00 PM – 6:00 PM\nPrice: ₹1100\nAn evening of yarn, stories, and slow creativity.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1684",
    "image": "https://attagalatta.com/admin/uploads/events/1144059379.png",
    "performer": "Lakshitha",
    "keywords": [
      "Crochet",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-03-14T16:00:00+05:30",
    "endDate": "2026-03-14T18:00:00+05:30"
  },
  {
    "name": "Come Sit With Us - A Meetup by My Divorce Guide",
    "description": "It is an intimate, offline gathering designed for those navigating separation, relationship transitions, or quiet personal reinvention. It is a gentle, held space where stories will be shared across the room — without performance, without spotlight, without the pressure to “have it all figured out.”\nSome stories will be read aloud. Some will simply be witnessed.\nYou are welcome to speak, or just sit and listen.\nWhy this room?\nBecause separation can feel isolating.\nBecause being heard can be healing.\nBecause stories soften shame.\nBecause sometimes, you just need a space where you can exhale.\nWhether you are going through it, supporting someone who is, or reflecting on your own journey — this evening is an invitation to pause, connect, and remember that you are not alone.\nDate: March 15, 2026\nLocation: Atta Galatta, Bangalore\nDuration: 2 hours",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1690",
    "image": "https://attagalatta.com/admin/uploads/events/752673141.jpg",
    "performer": "My Divorce Guide",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-03-15T12:30:00+05:30",
    "endDate": "2026-03-15T14:30:00+05:30"
  },
  {
    "name": "A STORY WALK through INDIRANAGAR - History Walk",
    "description": "On a Saturday morning , Walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore , Heritage and Ecology of the area . The walk will begin and culminate at ATTA GALATTA . The tales will revolve around historical , mythical and personal narratives weaved as we discover the area through the walk .\n Date : 21st March ( Saturday)   \n Time : 7 AM\n Starting Point : Atta Galatta\nRegistration : 349/ per person \nTicket:https://in.bookmyshow.com/plays/a-story-walk-through-indiranagar-bangalore/ET00387939 \n(or) \nDetails and GPAY : 9945799224",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1696",
    "image": "https://attagalatta.com/admin/uploads/events/54822265.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-03-21T07:00:00+05:30",
    "endDate": "2026-03-21T09:00:00+05:30"
  },
  {
    "name": "A STORY WALK through DOMLUR  - Story Walk by Vikram Sridhar",
    "description": "On a Sunday morning , Walk through the lanes of DOMLUR , from lores dating back in time from the Madras Presidency , Mysore State to the current IT , Banking and Retail sectors with Vikram Sridhar discovering the lanes through the Folklore , Heritage and Ecology of the rich area which is identified as a village. The walk will begin from Bhandutvas , a theatre collective , and culminate at the Bangalore International Centre . The tales will revolve around historical , mythical and personal narratives weaved as we discover the area through the walk .\nThe Story walk is supported by Atta Galatta\n *Date* : 22nd March  (Sunday)  2026\n *Time* : 7 AM\n *Starting Point* : Bhandutvas , Domlur\nRegistration : 349/ per person \nTicket Link : https://in.bookmyshow.com/plays/a-story-walk-through-domlur-bangalore/ET00465609\n(or) \nDetails and GPAY : 9945799224",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1697",
    "image": "https://attagalatta.com/admin/uploads/events/1749312293.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-03-22T07:00:00+05:30",
    "endDate": "2026-03-22T09:00:00+05:30"
  }
]