[
  {
    "name": "Grandma's Tale / Nani ki Kahani - Puppet Show",
    "description": "'The Puppetarians' - famous Puppeteers from Mumbai are bringing their beloved Puppet Show 'Grandma's Tale' to Atta Galatta!\nEnter the wondrous world of puppets as Puppet Granny tells a fabulous folktale with her shadow puppets and delivers an important message too. An interactive puppet show with audio-visual clues that'll keep children guessing and laughing. A story filled with animals and a mischievous thief. And also filled with messages of love, compassion, kindness, sharing and co-existence. Walk-around and shadow puppets projection make this enchanting folktale a great hit among children, teachers, parents and even grandparents!\nTotal Duration: 35 min\nLanguage: English\nFor Ages: 4 Years and Above\nAbout The Puppetarians\nThe Puppetarians is a unique Puppet Performance Initiative based in Mumbai. Famous for its live shows, puppetry workshops and TV/video works with puppets, The Puppetarians have earned a special place in the hearts of children, parents and teachers alike. From 'Mogambo-Zogambo' in DID Lil Masters to 'Honey-Bunny' on SonyYay and 'Devi-Sajjan' in Kaun Banega Crorepati - The Puppetarians' puppet characters are loved by everyone.\nIts founders Sangya Ojha and Hashim Haider have also been puppeteers for Sesame Street India (also known as Galli Galli Sim Sim, on-air Cartoon Network, POGO, DD1) and are authors and TEDx speaker as well. The Puppetarians have been awarded the Awareness Warriors Award, and the prestigious mBillionth Award for their Puppet Video Series - 'Tara Hai Taiyar' created with UNICEF. The Puppetarians have been creating educational and entertaining content with puppets, presenting hundreds of shows worldwide and training innumerable puppeteers too.. They believe that Puppets are for all ages and their impact could be life-changing!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT979",
    "image": "https://attagalatta.com/admin/uploads/events/746520093.png",
    "performer": "The Puppetarians",
    "keywords": [
      "Puppetry",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-21T17:00:00+05:30",
    "endDate": "2025-02-21T17:35:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nFebruary Read: : The Flavours of Nationalism by Nandita Haksar\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT929",
    "image": "https://attagalatta.com/admin/uploads/events/671032249.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-22T11:00:00+05:30",
    "endDate": "2025-02-22T13:00:00+05:30"
  },
  {
    "name": "Acupuncture Healing Energy Bootcamp - Wellness Workshop",
    "description": "Join us for an eye-opening and heart-opening session of healing at Atta Galatta!\nIn this session you will:\nLearn about the ancient Chinese system of healing known as Acupuncture\nUnderstand how blocked and imbalanced energies in our bodies could lead to chronic physical and emotional ailments\nGet personalized treatment to unblock and balance your energies (no needles involved)\nHave an intense guided journalling and meditation session to uncover inner wounds and heal them\nGet tips for a more balanced life\nIdeal for those who suffer from recurring physical ailments, those who seek to break recurring unhealthy behavioural patterns, those seeking relief from stress and anxiety and for curious souls looking to understand their bodies and minds better.\nParticipants are requested to wear loose and comfortable clothing as we will be doing some light stretches during the session.\nPlease bring along a pen and a bottle of water.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT880",
    "image": "https://attagalatta.com/admin/uploads/events/2045059298.png",
    "performer": "Benazir",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-02-22T11:00:00+05:30",
    "endDate": "2025-02-22T12:30:00+05:30"
  },
  {
    "name": "Business Buzz - Quiz",
    "description": "Join us for this quiz on Business & Technology with some questions on Startups and Entrepreneurship.\nNumber of members per team – 2\nThis event is part of the build up to the Biztech StartUp Quiz presented by Bengal Chamber of Commerce at ISI Bengaluru on 1st of March",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT988",
    "image": "https://attagalatta.com/admin/uploads/events/882792779.jpeg",
    "performer": "Gyaan Space, \nTitash Banerjea,",
    "keywords": [
      "Business",
      "Quiz"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-22T11:30:00+05:30",
    "endDate": "2025-02-22T13:30:00+05:30"
  },
  {
    "name": "Let Poetry Be - Poetry Open Mic",
    "description": "This monthly gathering will see poetry coming to life, through reading, music, art and any other forms of artistic expression, at Atta Galatta. Listeners and performers are all welcome!\nDate: 22nd feb\nTime: 4pm\nVenue: Atta Galatta, Indiranagar\nEvent specifics & submission guidelines --\n1. Theme - “A place called home”\n2. Works can be original or of other poets, performed live\n3. All languages welcome\n4. Participants can read to music (acoustic instrument/s), dramatise, use props & costumes\n5. Each participant will enjoy 5 minutes of reading time\n6. Kindly submit your poem and name to letpoetrybe@gmail.com on or before 20th Feb, midnight. WE WILL NOT ACCEPT ATTACHMENTS OR LINKS. SUBJECT OF YOUR MAIL MUST READ AS 'Entry for - a place called home'\n7. You may also send entries that are not related to the theme\n8. The event will begin at 4pm sharp and will be held at Atta Galatta. Participants to report not later than 3:45 pm to hear about performance order and meet the host\n9. For any further clarifications, write to us at letpoetrybe@gmail.com\nYou are now welcome to flood our inbox!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT986",
    "image": "https://attagalatta.com/admin/uploads/events/1057300231.png",
    "performer": "Palgun KJ",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-22T16:00:00+05:30",
    "endDate": "2025-02-22T18:00:00+05:30"
  },
  {
    "name": "Super-power or Super-stuck? India at 100 - Talk",
    "description": "We are excited to invite you to an engaging discussion with renowned Development Economist Prof. A.K. Shiva Kumar as he delves into India's future in his talk:\nSuper-power or Super-stuck: India@100\nIndia @2047 is a topic that should be on everyone’s mind—young, old, and maybe even your pet! A.K. Shiva Kumar (or Shiv, for those who like to keep it casual), an economist with over four decades of wisdom, has dedicated his life to figuring out how to make India shine brighter than a Bollywood star. Unlike astrologers, who guess what the future holds with tea leaves, Shiv’s got actual data and insights to back up his vision. So, let’s hear what needs to be done to make India truly incredible!\nJoin us as he unpacks the growth potential, challenges, and what it will take to make India truly incredible.\nDate & Time: 22nd February | 5:30 PM\nVenue: Atta Galatta Bookstore, Bangalore\nSeats are limited, so register soon!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT993",
    "image": "https://attagalatta.com/admin/uploads/events/356790171.jpg",
    "performer": "A. K. Shivakumar",
    "keywords": [
      "Economics",
      "Talk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-22T17:30:00+05:30",
    "endDate": "2025-02-22T18:30:00+05:30"
  },
  {
    "name": "T-Party: Ways of Queer(ing) - Storytelling Through Drag",
    "description": "A collaborative art exhibition and drag performance, where we undertake a political experiment that explores what it means to be queer in the world today.\nOur T-party is an artistic endeavour in stretching the meaning of “queer”. As you wind your way through our exhibition, we invite you to touch and feel the materials of our closet. Talk to one another, or experience in privacy. Engage yourself with the drag performances. With candour and imperfection, we share our world with you and invite you to share your world with us.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT970",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Khusboo",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-22T18:00:00+05:30",
    "endDate": "2025-02-22T20:00:00+05:30"
  },
  {
    "name": "Panchatantra for Adults - Object Based Storytelling Performance",
    "description": "Timeless tales from one of the most travelled Indian lores created for adults but over time diluted and forgotten, that speaks about human psychology, emotional strength, decision making, relationships, strategy and administration. Peppered with folk songs, miniature indigenous crafts objects on flora and fauna from various parts of the country, the performance travels through the many tantras chapter by chapter touching on the wisdom and timeless. Elephants, Tigers, Donkeys etc: Humans Animals and Metaphors.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT962",
    "image": "https://attagalatta.com/admin/uploads/events/73009116.jpeg",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-22T19:00:00+05:30",
    "endDate": "2025-02-22T20:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT887",
    "image": "https://attagalatta.com/admin/uploads/events/10443690.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T07:00:00+05:30",
    "endDate": "2025-02-23T09:30:00+05:30"
  },
  {
    "name": "Once Upon A Brunch - Sunday Morning Brunch and Stories",
    "description": "Late weekend morning, brunch, stories like the ones from the olden times, meeting new people – what if they all come together?\nWeekend and late morning Brunch is an emotion. On the other hand, Stories have always been an emotion too. What’s common between the two is the rich heritage of food and stories. What if they come together?\nListen to these stories of the food as you enjoy your weekend Brunch set at a cozy location that has its own stories. A beautiful day starts with a lovely breakfast. And a morning with breakfast and stories. Every food we eat has a story to share… Idli, Vada, bread, Paratha etc. Every breakfast comes after a long break and eager to be eaten.\nThis event has 3 aspects to it: A simple Weekend morning Brunch put together by Atta Galatta; storytelling around the food lores by Vikram Sridhar; and meet new people with similar interest over culture and art.\nThe Brunch and the Stories will be suitable for adults and children alike. Children 13 and above\nOnce upon a Brunch is a morning to experience food in all its senses, watching them unfold as you enjoy the yummy meal on a late weekend morning at Atta Galatta. The ticket price is inclusive of a simple Brunch and the Storytelling Performance at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT973",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance and Menu Tasting"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T10:00:00+05:30",
    "endDate": "2025-02-23T12:00:00+05:30"
  },
  {
    "name": "Comic Workshop - Comic Workshop",
    "description": "Join Asha and Jeev for an engaging Comic Workshop where creativity meets storytelling! The workshop will begin with an introduction to their latest book, Pandu, offering participants a glimpse into the story, characters, and the inspiration behind its creation. The session will have a focus on the fundamentals of making comics, from creating unique characters to crafting compelling narratives, followed by an exclusive behind-the-scenes look at their creative process. The workshop will conclude with a fun, hands-on activity where participants can create their very own comic strip. Whether you're a budding artist, an aspiring storyteller, or simply curious about comics, this workshop is the perfect opportunity to explore the art of comics and bring your ideas to life!\nJeevanath Viswanath: \nJeev is an illustrator and animator from Kerala, currently based in Bangalore and is the creator of the self-published comic book Cleaning Day and has also illustrated for Studio Niyet's anthology comic book, Pandu. Growing up during the golden age of animated kids' shows, Jeev brings that sense of nostalgia into his work, trying to capture the warmth of those childhood memories. \nAsha Theres:\nAsha Theres is an author and illustrator originally from Calicut, Kerala. She is the creator behind ‘Ashante comics’ and has self-published comic books like Ponni and Goat, Blackman, Majeedka & Spacemackerel, and Girl in the New City. Asha enjoys telling stories through comics, illustrations and animations. With a background in architecture and design, she brings fresh perspective to her work. She believes the world is filled with stories waiting to be shared; we just need to listen!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT992",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Asha Theres, \nJeevanath Vishwanath,",
    "keywords": [
      "Comics",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-02-23T11:00:00+05:30",
    "endDate": "2025-02-23T12:30:00+05:30"
  },
  {
    "name": "Tales of Phulkari - Storytelling and Tote Bag Making Workshop",
    "description": "Dori Stori, an artisanal clothing brand that celebrates India's rich cultural heritage, is thrilled to announce an upcoming event that merges creativity with cultural storytelling. Founded by Shristi Sareen, an entrepreneur, artist, stylist, and poetess, Dori Stori was established in 2024 with a vision to promote artisanal and sustainable techniques of natural and organic handblock printing. Shristi's passion for wearable art and her dedication to sharing the beauty of India's textiles, art forms, and literature are at the heart of Dori Stori's mission.\nJoin us on February 23, 2025, at 11:30 AM for a unique workshop at Atta Galatta - The Bookstore, located at 178, 5th Main Rd, Indira Nagar 1st Stage, Bengaluru, Karnataka. This event will feature a Storytelling Session on Phulkari embroidery, where participants will delve into the rich history and personal narratives inspired by the craft of Phulkari, as shared by our founder, Shristi Sareen. Following this engaging session, attendees will have the opportunity to participate in a hands-on Tote Bag Workshop, allowing them to create their own designs while embracing the beauty of Phulkari.\nThis workshop is designed for anyone interested in exploring their creativity and learning about traditional Indian crafts. Whether you are a seasoned artist or a curious beginner, this event is perfect for individuals looking to connect with their cultural roots through art.\nAttending this workshop offers a dual opportunity: participants will not only gain insights into the art of Phulkari weaving but also develop practical skills in designing their own tote bags. This experience fosters creativity and appreciation for India's textile heritage, making it a valuable addition to anyone's artistic journey.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1006",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Shristi Sareen",
    "keywords": [
      "Arts and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-02-23T11:30:00+05:30",
    "endDate": "2025-02-23T13:30:00+05:30"
  },
  {
    "name": "Poetic Brew - Poetry Meetup",
    "description": "Gather, Poetic Souls, for an afternoon divine, where verses entwine and words intertwine. In this literary realm, hearts open wide, For a Poetry Meet, let passion be our guide.\nInviting all Poetry enthusiasts 📚 to an In-Person Meet where you can indulge in creative poetry writing and reading session. \nEvent Sections:\n1. Icebreaker Extravaganza - Intro yourself & let`s play an interesting fun Game to break ice cubes.\n2. Poet`s Spotlight: Write a poem based on an innovative prompt letting your thoughts engage.\n<-- INTERMISSION: CHILL & CHAT -->\n3. Recital Stage: Take center stage for 5-7 minutes, discuss the verse that`s touched your head. As you share your verse, let passion reign.\n4. Verse of the Month & What Lies Ahead - Vote for the next Poetry Book to read.\n5. Say Butter - Click that Snap button for a group picture.\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolising the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT936",
    "image": "https://attagalatta.com/admin/uploads/events/769771471.png",
    "performer": "Your View On Books",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T14:22:00+05:30",
    "endDate": "2025-02-23T17:55:00+05:30"
  },
  {
    "name": "Flowers - February Storytelling Meetup for Adults",
    "description": "With February comes a weather change, and blooms of different kinds.  For this edition of the meetup, we have the theme as FLOWERS.\nEvery flower has a tale that can go back in time or a contemporary narrative to a folktale. \nIf you would like to share one do write to us at bangalorestorytellingsociety@gmail.com\nIf you feel like joining us as a listener, you are most welcome! Do bring along a friend who loves Stories and Storytelling    \nRemember, there is no storyteller without an audience. So if you feel like joining us as a listener, you are most welcome! \nThe meet up is FREE so don't forget to get your friends too. The more the merrier. 🥳 🎉 \nAbout BSS \nBSS is a not-for-profit organization established in the year 2013 by like-minded story lovers with the sole idea of reviving and promoting the oral storytelling traditions in India. The monthly meet-up for adults by the BANGALORE STORYTELLING SOCIETY, that began in 2013, aims to revive the traditional way of sharing tales amidst a gathering.  This is one of the longest running meetups in India.\nAny questions? We are glad to help. WhatsApp: 9845680816",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT995",
    "image": "https://attagalatta.com/admin/uploads/events/214399554.jpeg",
    "performer": "Bangalore Storytelling Society",
    "keywords": [
      "Storytelling",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T15:00:00+05:30",
    "endDate": "2025-02-23T16:30:00+05:30"
  },
  {
    "name": "Chali Kahaani - A Curated Storytelling Show",
    "description": "✨ An enchanting storytelling extravaganza showcasing tales that tug at your heartstrings and tickle your funny bone.\n🎤 Immerse yourself in narratives spun with love laughter and life as seasoned storytellers craft an unforgettable experience. Envision a night where every word spoken weaves a tapestry of emotions that linger long after the curtains close.\n💫 Let the magic of storytelling transport you to realms where imagination knows no bounds. Be part of a narrative journey that promises to ignite your soul and stir your senses.\nStep into a world where stories reign supreme and let Chali Kahaani enchant you with narratives that transcend time and space. Indulge your spirit ignite your imagination and revel in the sheer joy of storytelling at its finest.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT967",
    "image": "https://attagalatta.com/admin/uploads/events/726822889.png",
    "performer": "Haseeb, \nJyotika, \nSuman, \nVikram,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T16:00:00+05:30",
    "endDate": "2025-02-23T18:00:00+05:30"
  },
  {
    "name": "Creative Writing & Clay Sculpting Workshop for Kids! - Workshop",
    "description": "Join us for a fun, hands-on creative writing and clay sculpting workshop at Atta Galatta, Bangalore, on Sunday, 23rd February, from 5:30 PM to 7:30 PM. Designed for young storytellers aged 8 and above, this interactive session will spark imagination and bring stories to life!\nUsing the Write It Out creative writing kit, kids will craft their own unique stories with the help of engaging flashcards and then sculpt their main characters using air-dry clay. Each participant will take home a free Write It Out kit, which includes flashcards, a notepad, and clay—so the creativity doesn’t stop when the workshop ends!\nLed by Vidhi, founder of CleverBox, this session blends storytelling with hands-on crafting to make writing an exciting and immersive experience.\n📅 Date: Sunday, 23rd February\n🕠 Time: 5:30 PM - 7:30 PM\n📍 Venue: Atta Galatta, Bangalore\n👧 Age Group: 8+\n💰 Fee: ₹500 (Includes a FREE Write It Out kit!)\nSpaces are limited! Sign up now and let your child’s imagination soar.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT999",
    "image": "https://attagalatta.com/admin/uploads/events/1092342115.jpg",
    "performer": "Vidhi Golchha",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-02-23T17:00:00+05:30",
    "endDate": "2025-02-23T19:00:00+05:30"
  },
  {
    "name": "H.E.A.R.T.B.E.A.T Improv Show - Improv Comedy Show",
    "description": "Imagine comedy where the jokes are made up on the spot, the scenes are created in seconds, and the only limit is the audience`s imagination. That`s improv 🎭 \nGet ready for the debut of the HeartBeat Improv Show at Atta Galatta! From the same folks who bring you the weekly improv jams at Cubbon Park, comes a brand new stage show! Improv, short for improvisation, is exactly what it sounds like: comedy created in the moment, spontaneously, without any scripts or preparation. Experience the thrill of unscripted comedy as our talented improvisers create hilarious scenes, skits, and jokes on the spot, all fueled by YOUR suggestions. Watch them take your ideas and turn them into side-splitting characters and stories right before your eyes. No two shows are ever the same!\nIt`s interactive, it`s spontaneous, and it`s guaranteed to make you laugh. Don`t miss out – grab your tickets today for a night of unpredictable laughter :)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT980",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Heartbeat Improv",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T18:45:00+05:30",
    "endDate": "2025-02-23T19:45:00+05:30"
  },
  {
    "name": "Books, Brews and Poetry - Book Launch",
    "description": "Calling all poetic souls for an afternoon immersed in verses, books and coffee. Join us for a soulful reading session with authors Ankita and Chinchu. Share your thoughts, laugh, connect with the authors as they sign your book copies, participate in some fun literary games and win some cute goodies. All of this and more over steaming cups of coffee.\nLimited seats – Register to attend for free!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT972",
    "image": "https://attagalatta.com/admin/uploads/events/1194696520.jpg",
    "performer": "Chinchu Mathew",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-01T14:30:00+05:30",
    "endDate": "2025-03-01T17:00:00+05:30"
  },
  {
    "name": "Bounce, Hop, Raaga, Pop - Musical Tale for Young Minds",
    "description": "Author and music educator brings her bestselling book, Bounce Hop Raaga Pop to Atta Galatta. Get ready to be mesmerized as she intertwines math and music and takes you through a hopscotch game of raagas. The evening will be made more special, by a live classical performance by her students, accompanied by tabla.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT978",
    "image": "https://attagalatta.com/admin/uploads/events/485733855.jpg",
    "performer": "Shyama Panikkar",
    "keywords": [
      "Kids",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-01T16:00:00+05:30",
    "endDate": "2025-03-01T17:00:00+05:30"
  },
  {
    "name": "No Place to Call My Own - Book Release",
    "description": "An intimate, arresting portrait of millennial angst in a mercurial, volatile world.\nFeeling trapped in a society that’s quick to undermine her—constantly making assumptions about her religion, sexuality, ambition, worth—Sophia plunges headlong into a journey of questionable decisions through her twenties. We follow her through cities and towns as she tries to make sense of the old while confronting the new. But each move trails chaos in its wake.\nRestless and acerbic, she struggles to come to terms with the disintegration of her parents’ marriage, eerily mirrored in the political turmoil of twenty-first-century India. And crucial to Sophia’s story—which unfolds against the backdrop of the #MeToo movement, the 2020 Delhi riots and a global pandemic—is her complex, thorny friendship with Medha, a queer artist with travails of her own.\nHow does one even begin to fit in when apathy becomes a mode of survival? How is it possible to truly belong when one feels estranged from oneself? Sophia’s journey is not just her own but that of any young woman who finds herself caught ‘in between’—unable to back down and refusing to conform—and who doesn’t quite feel rooted to one place or identity.\nNo Place to Call My Own is an intimate, arresting portrait of millennial disquiet in a mercurial, volatile world. Join us for the Bangalore release of this book with the author, who will be in conversation with acclaimed poet Jeet Thayil,",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT987",
    "image": "https://attagalatta.com/admin/uploads/events/1539311763.jpg",
    "performer": "Alina Gufran, \nJeet Thayil,",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-01T18:00:00+05:30",
    "endDate": "2025-03-01T19:30:00+05:30"
  },
  {
    "name": "Poor Vanya - A Clown Re-imagination of Anton Chekhov's 'Uncle Vanya'",
    "description": "The only thing more comical than clowns in a Chekhov play is a Chekhov play in the clowns' hands!\nWitness the chaos as a troupe of silly and stupid clowns attempts to take on Anton Chekhov’s 'Uncle Vanya' – where personal rivalries (and romances), forgotten dreams (and lines), and a whole lot of backstage drama (that’s honestly more dramatic than the play itself) threaten to derail the entire production.\nWill they ever manage to get through a single rehearsal? Come find out in this uproarious and touching reimagining of a Chekhovian classic.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT964",
    "image": "https://attagalatta.com/admin/uploads/events/1756135228.png",
    "performer": "What If Productions",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-01T19:30:00+05:30",
    "endDate": "2025-03-01T21:00:00+05:30"
  },
  {
    "name": "Harry Potter Book Discussion - Meetup",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1003",
    "image": "https://attagalatta.com/admin/uploads/events/1536512166.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-02T11:00:00+05:30",
    "endDate": "2025-03-02T12:30:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "Join us for a cozy, creative space where you can unplug, connect, and just be. This meetup is all about chill vibes—no agenda, no pressure. 🖍️✨\nWhether it’s your first time or your fourth, come as you are—dive into your own project or simply soak up the wholesome atmosphere. Each meetup has brought inspiring moments and wonderful people, and we’re excited to share it all again! 💜\nThere are 15 spots available, and this meetup is exclusively for LGBTQIA+ folks. Neurospicy and neurotypical folks are all welcome. 🌈🎨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT878",
    "image": "https://attagalatta.com/admin/uploads/events/1136766814.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-03-02T14:00:00+05:30",
    "endDate": "2025-03-02T17:00:00+05:30"
  },
  {
    "name": "how long is february? - A Fantasy in Three Parts - Digital Play Screening",
    "description": "how long is february? a fantasy in three parts.\nWritten and directed by Nisha Abdulla\nDuration of digital play: 60 mins\nIn English, Hindi, Malayalam (with English subs)\nSuitable for ages 14+\n15 years after the brutal events of February 2020 in Delhi, a nation reckons with the truth of what really happened. In parallel, there is the urgent matter of 72 arrested goats and an unfolding conspiracy.\n\"That which is denied must be imagined\" (Sartre)\nSet in an imagined future and based on real events, this is a project in narrative justice delivered via the performative. Using a satirical lens, the play questions the complicity and inaction of various groups involved in the denial of justice.\nSupported by The Edinburgh Festival Fringe Society and Pickle Factory Dance Foundation, Calcutta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT994",
    "image": "https://attagalatta.com/admin/uploads/events/86977376.jpg",
    "performer": "Qabila",
    "keywords": [
      "Social Awareness",
      "Screening"
    ],
    "@type": "ScreeningEvent",
    "startDate": "2025-03-02T14:00:00+05:30",
    "endDate": "2025-03-02T17:00:00+05:30"
  },
  {
    "name": "The Perfect Ending: A Yogi's Fairytale - Book Launch",
    "description": "We are pleased to invite you to the story-telling discussion and book launch of 'The Perfect Ending, A Yogi's Fairytale'. For those on a journey of growth, this is a genre-bending novel at the intersection of romance, fantasy and transformational, spiritual, self-help. It is a fairytale about the Ultimate Reality that delves into the scientific principles of the Vedas, while also re-imagining the real ending of the French classic, 'Beauty and the Beast'.\nThe launch will be accompanied by a story-telling discussion for those embarking on their own writing quests. Where do you begin, if you want to write a book? We begin at the beginning, much like Dickens' Oliver Twist. A discussion on the key elements of storytelling: How to start and how to finish fulfilling your dream. A group of writers share their best insights. Join us!'",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1005",
    "image": "https://attagalatta.com/admin/uploads/events/731917317.png",
    "performer": "Anu Kalgudi",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-02T14:00:00+05:30",
    "endDate": "2025-03-02T15:00:00+05:30"
  },
  {
    "name": "Support Group - Support Group",
    "description": "Topic: Helplessness in Relationships\nPeople make up big cities but what makes up people’s lives, hopefully not loneliness. Loneliness is an intensely painful state which arises out of lack of intimacy and connectedness. People from every wake of life, even those with social contacts or pursuing successful careers can experience sadness from absence of belongingness. This painful experience is felt in a myriad of contexts such as breakups, disagreeing families, fear of rejection, unrelatability, shyness and so on.\nThis support group has been constituted to bring people struggling with disconnectedness in various contexts together for a shared experience of comfort, belongingness, laughter, guidance and above all to break the cycle of sustained loneliness.\nThe support is being organized and moderated by Nimesh George Mphil PhD who is a practicing psychologist based in Bangalore. This session will be co-moderated by Nimesh George & Gokul R, who are both practising psychologists in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1001",
    "image": "https://attagalatta.com/admin/uploads/events/1574923051.png",
    "performer": "Gokul R. , \nNimesh George,",
    "keywords": [
      "Wellness and Health",
      "Support Group"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-02T17:00:00+05:30",
    "endDate": "2025-03-02T18:30:00+05:30"
  },
  {
    "name": "Fevicol - An Improv Show",
    "description": "Fevicol - An Improv Show by the Reluctant Hustlers\nKitna bhi zor laga lo - tootega nahi! \nThe Reluctant Hustlers invite you to Fevicol — an improv show that celebrates the strong, magical bonds of friendship that tie us together!\nNo matter how unpredictable or wild life gets, friends are the glue that holds it all together. Friendships are messy, joyful, silly, and real — and so is this show that explores this unbreakable connection in a way only improv can - with humor, spontaneity, and heart. So gather your friends, come prepared to laugh till it hurts. Because, after all, some bonds are unbreakable!\nThe Reluctant Hustlers are a team of improvisers, actors, storytellers and movement artists who are passionate about Improv. Members of erstwhile Improv Comedy Bangalore, India’s leading Improv group in the pre-covid era, the Hustlers have performed at international improv festivals including Singapore, Manila, Thailand, Ireland and Bangalore as part of multiple ensembles.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1002",
    "image": "https://attagalatta.com/admin/uploads/events/1439103682.png",
    "performer": "The Reluctant Hustlers",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-02T18:30:00+05:30",
    "endDate": "2025-03-02T19:30:00+05:30"
  },
  {
    "name": "Pen & Latte - Story Writing Workshop",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.\nDisclaimer on Event Coverage:\nEvent highlights will be captured through photos and videos for showcasing the event in our social media accounts. All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT989",
    "image": "https://attagalatta.com/admin/uploads/events/1866651.png",
    "performer": "Aristotle's Writers Club",
    "keywords": [
      "Writing Workshop",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-08T11:11:00+05:30",
    "endDate": "2025-03-08T14:22:00+05:30"
  },
  {
    "name": "Women's Sound and Art Workshop - Wellness Workshop",
    "description": "Great things happen when women connect.\nSound is the source of this entire creation.\nDid you know that the sound of the musical notes have a profoundly positive impact on our chakras?\nWhether you receive the sounds from sacred singing bowls meant for the purpose of healing or well-being, or you sing the notes yourself, they bring in a sense of balance.\nAs this balance fosters feelings of joy and peace, it can aid creative expression in many forms.\nPainting is one such creative form that is closely associated with sound and music. The choice of colours, mood and theme, sensory and emotional experience while painting gets influenced by the presence of sound and music in the environment where art is taking place impacting the artistic process and the final creation.\nInspired by this, we have a similar collaboration with artists Shilpi, Ayuushi, Priyanka and Khusbu who aspire to hold a Sound & Art Workshop for women wishing to experience such intense joy and creativity on 8th March 2025, International Women’s Day.\nIt would be a treat to observe the participants flow with the sounds and express their art.\nTake away:\nPainting to add vibrancy to your room or your living. An ideal gift that you can make, gift and surprise anyone.\nThis is a wonderful opportunity to receive encouragement from peer women.\nWhat to Bring:\n\nYoga mat.\nShawl / stole.\nDrinking water bottle.\n\nNo prior art experience is necessary.\nParticipants should come with an open mind. All other materials will be provided.\nWear comfortable, light color cotton / linen clothing as absorbing the vibrations is easier.\nRegistration: Spaces are limited, so early registration is encouraged.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT932",
    "image": "https://attagalatta.com/admin/uploads/events/895204819.jpeg",
    "performer": "Ayuushi, \nKhusbu Goyal, \nPriyanka Sinha, \nShilpi,",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-08T15:00:00+05:30",
    "endDate": "2025-03-08T18:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT887",
    "image": "https://attagalatta.com/admin/uploads/events/10443690.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T07:00:00+05:30",
    "endDate": "2025-03-09T09:30:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1004",
    "image": "https://attagalatta.com/admin/uploads/events/100251032.png",
    "performer": "The Listeners Circle",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-03-09T11:00:00+05:30",
    "endDate": "2025-03-09T13:00:00+05:30"
  },
  {
    "name": "Chapters Unsealed - Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nSharing your views on favorite books.\nParticipating in the curated discussion.\nVoting for a Monthly Book Read.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT990",
    "image": "https://attagalatta.com/admin/uploads/events/2142861459.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T14:22:00+05:30",
    "endDate": "2025-03-09T17:55:00+05:30"
  },
  {
    "name": "Gond Art Workshop - Art Workshop",
    "description": "India has a rich tradition of folk arts. The custodians of which are the many tribes that live in the interiors of various states. The Gonds, are the largest Adivasi Community in India and are Dravidian's whose origin can be traced to the pre-Aryan era. They are mainly found in Madhya Pradesh and its surrounding States. The word Gond comes from the Dravidian expression kond, meaning green mountain. In the Gond belief system, besides Bara Deo (Great God), every hill, river, lake, tree, and rock is inhabited by a spirit and therefore sacred. Gond paintings are fascinating, where the artists express their faiths and beliefs, world view, their visual expression and sense of identity, both as a collective, and as individuals. The motifs are further associated with the rich repertoire of the community and strongly show the interactions with the cosmic, natural and social worlds of humans at multiple levels and contexts. Participate in the Gond Painting Workshop, get a chance to appreciate the art form and create you very own Gond Art masterpiece on cartridge sheets with acrylic colours.\nTake away: One complete painting A3 size",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT985",
    "image": "https://attagalatta.com/admin/uploads/events/401686507.png",
    "performer": "Trishna Patnaik",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-09T16:00:00+05:30",
    "endDate": "2025-03-09T19:00:00+05:30"
  },
  {
    "name": "Loud Women - One Minute Theatre Festival 2025",
    "description": "Loud Women is a collection of 35 one-minute pieces performed by 25 women.\nPrepare to ponder, laugh and be entertained!\nCome celebrate Women’s Day with us!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1007",
    "image": "https://attagalatta.com/admin/uploads/events/1379779768.png",
    "performer": "Anita Mithra",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T18:00:00+05:30",
    "endDate": "2025-03-09T19:30:00+05:30"
  },
  {
    "name": "Love Stories from Indian Heritage - Storytelling",
    "description": "Love stories aren’t only about the hero and heroine for love can rarely exist in isolation. Zealous messengers, art and music as mood enhancers, food as aphrodisiacs, taboos and mores – all play a pivotal role in shaping stories of love. Vikram Sridhar and Aparna Jaishankar rummage through the passages of time to bring you various hues of love etched in our heritage through literature, architecture, songs and poetry through the all- encompassing art form of oral storytelling.\nAbout Aparna Jaishankar\nAparna Jaishankar is a Storyteller with a penchant for Indic mythology. She believes that there is no ONE version of any story. Her storytelling performances take a contemporary view of ancient tales. Aparna also works with educators in developing learning perspectives in the classroom and with organisations in building internal narratives.\nAbout Vikram Sridhar \nVikram Sridhar is a Performance Storyteller and theatre practitioner who believes in Storytelling as a strong medium for Conservation and Conversation, which is highly relevant in the modern context. Vikram combines his work and interest in Theatre, Social Work, and Conservation in his Storytelling and has performed for audience of various age groups across India.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT974",
    "image": "https://attagalatta.com/admin/uploads/events/1610460200.png",
    "performer": "Aparna Jaishankar, \nVikram Sridhar,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T19:00:00+05:30",
    "endDate": "2025-03-09T20:00:00+05:30"
  },
  {
    "name": "Poetic Brew - Poetry Meetup",
    "description": "Gather, Poetic Souls, for an afternoon divine, where verses entwine and words intertwine. In this literary realm, hearts open wide, For a Poetry Meet, let passion be our guide.\nInviting all Poetry enthusiasts 📚 to an In-Person Meet where you can indulge in creative poetry writing and reading session. \nEvent Sections:\n1. Icebreaker Extravaganza - Intro yourself & let`s play an interesting fun Game to break ice cubes.\n2. Poet`s Spotlight: Write a poem based on an innovative prompt letting your thoughts engage.\n<-- INTERMISSION: CHILL & CHAT -->\n3. Recital Stage: Take center stage for 5-7 minutes, discuss the verse that`s touched your head. As you share your verse, let passion reign.\n4. Verse of the Month & What Lies Ahead - Vote for the next Poetry Book to read.\n5. Say Butter - Click that Snap button for a group picture.\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolising the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT936",
    "image": "https://attagalatta.com/admin/uploads/events/769771471.png",
    "performer": "Your View On Books",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-15T11:11:00+05:30",
    "endDate": "2025-03-15T17:55:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "Join us for a cozy, creative space where you can unplug, connect, and just be. This meetup is all about chill vibes—no agenda, no pressure. 🖍️✨\nWhether it’s your first time or your fourth, come as you are—dive into your own project or simply soak up the wholesome atmosphere. Each meetup has brought inspiring moments and wonderful people, and we’re excited to share it all again! 💜\nThere are 15 spots available, and this meetup is exclusively for LGBTQIA+ folks. Neurospicy and neurotypical folks are all welcome. 🌈🎨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT878",
    "image": "https://attagalatta.com/admin/uploads/events/1136766814.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-03-16T14:00:00+05:30",
    "endDate": "2025-03-16T17:00:00+05:30"
  },
  {
    "name": "Chapter Carnival - Library Meetup",
    "description": "Atta Galatta and Your View On Books, A Novel Club cordially invite you to the latest Library Meetup in town.\nJoin us for a innovative Library Meet wherein there`s over hundreds of books and you could pick a book in random and start reading together.\nHave an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nCome along with Empty Minds and fill it with rich literature from Atta Galatta’s Reading Section.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nReading minimum one chapter from a random book that you choose from the libary.\nParticipating in the ensuing curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT991",
    "image": "https://attagalatta.com/admin/uploads/events/830714749.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-23T11:11:00+05:30",
    "endDate": "2025-03-23T14:22:00+05:30"
  },
  {
    "name": "Thus Spake Shoorpanakha, So Said Shakuni - Theatre Performance",
    "description": "The protagonists, a man and a woman, are both waiting for a delayed flight in a small-town airport lounge. The woman provokes the man into conversation, setting of a series of narratives that feature two characters from the Ramayana and the Mahabharata: Shoorpanakha and Shakuni. Their lives and experiences are set in the context of this century, indicating that the stories of power, ambition and revenge span history and myth.\nThis script was found in The Drama Library by the Bhasha Centre.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT997",
    "image": "https://attagalatta.com/admin/uploads/events/704698497.jpg",
    "performer": "Jimmy Xavier, \nPoile Sengupta, \nSamragni Dasgupta, \nUrvashi H. V. ,",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "TheatreEvent",
    "startDate": "2025-04-06T19:00:00+05:30",
    "endDate": "2025-04-06T20:00:00+05:30"
  }
]