[
  {
    "name": "Alchemy with Art - Art Workshop by Harshitha",
    "description": "Atta Galatta presents 'Alchemy with Art' - a creative healing workshop guided by Harshitha on Sunday 28 December 2025 at 11:00 AM. \nIn this second episode of Alchemy with Art, you will be guided through a transformative art session, balancing creative expression and inner work, with the intention of turning your personal pain into power. If this is meant for you, come join and leave empowered for the New Year. \n#AlchemywithArt #creativity #innerwholeness #healingcircle #Bengaluruevents #attagalatta",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1576",
    "image": "https://attagalatta.com/admin/uploads/events/507481152.jpeg",
    "performer": "Harshitha",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-12-28T11:00:00+05:30",
    "endDate": "2025-12-28T13:00:00+05:30"
  },
  {
    "name": "Read A Kitaab - Book club",
    "description": "✨Grab your coffee, your mood, and your 2025 reading wrapup!\nJoin us for Read A Kitaab’s Book Club Meetup — this time, we’re diving in books you’ve read this year. 💭💥\n📍 Atta Galatta, Indira Nagar, Bangalore\n🗓 28 December| Sunday | 5–7 PM\nCentered around a 2025 reading wrap-up, the session invites readers to share, listen, and reflect on the books that shaped their year. 🌈📚",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1575",
    "image": "https://attagalatta.com/admin/uploads/events/1533897228.jpeg",
    "performer": "Read a Kitaab",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-28T17:00:00+05:30",
    "endDate": "2025-12-28T19:00:00+05:30"
  },
  {
    "name": "Soul Climate - Book Launch by Inez Baranay",
    "description": "Atta Galatta is delighted to host the launch of Soul Climate, the latest novel by acclaimed writer Inez Baranay. Inventive in form and rich with historical texture, Soul Climate reimagines the idea of India through the perspective of Turkish intellectual and freedom fighter Halide Edib, who visited Delhi in 1935 to deliver a series of lectures.\nThe novel deftly blends fact and fiction. Edib’s encounters with figures of India’s independence movement, including her conversations with Mahatma Gandhi, unfold alongside the fictional journeys of three young women whose lives are shaped by her words. Through these intertwined narratives, Soul Climate explores enduring questions of nationhood, communalism, idealism, and the ties that connect and divide us.\nInez Baranay, author of nine novels, has long been celebrated for her globally engaged and stylistically innovative work. Her earlier books Neem Dreams and With the Tiger were first published in India to critical acclaim.\nThe launch event will be hosted by Bhumika Anand, Founder and Director of the Bangalore Writers Workshop.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1577",
    "image": "https://attagalatta.com/admin/uploads/events/1586375288.jpg",
    "performer": "Inez Baranay",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-28T18:00:00+05:30",
    "endDate": "2025-12-28T19:00:00+05:30"
  },
  {
    "name": "My Life Closed Twice - Book Launch by Subhashini Kaligotla",
    "description": "Author Subhashini Kaligotla launches her new poetry collection My Life Closed Twice (Copper Coin, 2025), with Jeet Thayil.\nIn My Life Closed Twice, Subhashini Kaligotla charts the long aftermath of grief, and its recursive, obsessive cadences. Drawing on premodern India’s art, literature, and history, through invented forms and received ones, in fragments, litanies, lists, and queries, the poems in this spare volume embody the psychological terrain of the grieving. Two premature deaths are at the heart of the book. Kaligotla writes of their immediate aftereffects and their enduring impact. She braids her voice with voices from India’s past—from the unknown bards of the Sanskrit epics who counsel equanimity in the face of catastrophe to the laments of Ashoka, Bilhana, and Jahangir.\r\n \nAuthor Bio\nSubhashini Kaligotla is a poet and an art historian of ancient and medieval South Asia. She is author of the poetry collection Bird of the Indian Subcontinent and the monograph Shiva’s Waterfront Temples. She teaches at Columbia, dividing her time between New York City and Hyderabad.\r\n \nAdvance Praise for My Life Closed Twice\nSubhashini Kaligotla’s ingeniously fashioned poetic structures—which are light, flexible, delicate yet possessed of remarkable tensile strength and architectural clarity and integrity—aren’t just beautiful in themselves. They’re also vessels for deep imaginative feeling and thinking and wondering and longing. She has a unique, compelling lyric voice and a distinguished twenty-first century consciousness.\n- Vijay Seshadri\nAnger, denial, bargaining, despair, all the stages of grief except acceptance, each stage overlaid with the forensic precision generated by love when it has nowhere to go. These enraged, laceratingly plainspoken poems burn with the singular self-awareness that is the writer's curse, and the writer's gift. Two deaths enclose the book like 'two dates // enclosed / by parentheses'. It is impossible to read, say, 'Only Your Brother Will You Lose' – its fifty shards hammered into the flesh like fifty nine-inch nails – and come away unscathed. \n- Jeet Thayil",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1573",
    "image": "https://attagalatta.com/admin/uploads/events/537483135.jpg",
    "performer": "Subhashini Kaligotla",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-28T18:30:00+05:30",
    "endDate": "2025-12-28T19:30:00+05:30"
  },
  {
    "name": "Food & Beverage Founder's Meet - Meetup by Bindu Rao",
    "description": "Calling all the Founders, Creators and Innovators in the Healthy eating space. This meet-up is designed exclusively to forge meaningful collaborations and connections worth your time.\nEvent Schedule:\n1) Introductions: 3 minutes per brand and it must cover your name, designation, brand name & how can you help others? (60 minutes)\n2) Snacks Break and Networking (30 minutes)\n3) Guided knowledge sharing about flea markets, getting connects for packaging, food consultants, recipe developers, sourcing candidates and collaborating on content and curations for mutual growth on social media. (35 minutes)\n4) Photography, Videography for Social Media (25 minutes)\nBindu Rao is a stand-up comedian turned food content creator and event coordinator who has conducted more than 1200 events across stand-up comedy, performance arts, food walks, founders only meets for the health conscious and beverage walks with Drickle Coffee (formerly Bonomi).\n- Ticket is inclusive of veg & gluten free food, we start and end on time for the event.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1578",
    "image": "https://attagalatta.com/admin/uploads/events/529755518.png",
    "performer": "Bindu Rao",
    "keywords": [
      "Business",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-03T11:00:00+05:30",
    "endDate": "2026-01-03T13:00:00+05:30"
  },
  {
    "name": "The Star - A performance by Bangalore Little Theatre Foundation",
    "description": "A heartwarming story about forgotten dreams and the magic of second chances. Based on the short story \"Patol Babu- Film Star\" by Satyajit Ray.\nRamesh Babu once dreamed of seeing his name on movie posters. Today, he lives a quiet, ordinary life with a dusty ceiling fan and a patient wife. When fate unexpectedly casts him in a film, the world he left behind flickers back to life. Is this his long-awaited moment of recognition—or merely a fleeting illusion?\nSet against the lively chaos of a film shoot and the warmth of home, the play gently reminds us that even the smallest moments can illuminate an entire life.\nBlending humour, nostalgia, and emotional depth, this high energy play, The Star celebrates rediscovering one’s passion and reminds us that it is never too late to dream again.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1585",
    "image": "https://attagalatta.com/admin/uploads/events/2098019472.png",
    "performer": "Bangalore Little Theatre Foundation",
    "keywords": [
      "Theatre",
      "Theatre Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-03T19:00:00+05:30",
    "endDate": "2026-01-03T20:15:00+05:30"
  },
  {
    "name": "Lahe Lahe Caravan presents “Harry Potter Book Discussion - Meetup by Sonali Bhatia",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1581",
    "image": "https://attagalatta.com/admin/uploads/events/1879395234.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-04T14:30:00+05:30",
    "endDate": "2026-01-04T16:00:00+05:30"
  },
  {
    "name": "Vanilla Hour - Book Launch with Neer Ya",
    "description": "Join us at Atta Galatta for the launch of Vanilla Hour by Neer Ya on 9 January, from 2:00PM – 5:00 PM. The author will be present to launch the book and speak about the writing and themes behind the novel.\nVanilla Hour follows Dr. Nandini Yadav, a geochemist and single mother who has rebuilt her life after years of trauma. When an unexpected reunion takes her back to Goa and to a relationship she thought she had left behind, she is forced to confront memories and choices she has long avoided.\nMoving between Delhi, Goa, and Tokyo, the novel explores love, loss, forgiveness, and the ways the past continues to shape the present. Blending elements of romantic suspense and literary fiction, Vanilla Hour is a thoughtful, emotionally grounded story about mothers and daughters, memory, and learning how to live without fear.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1583",
    "image": "https://attagalatta.com/admin/uploads/events/935278778.jpeg",
    "performer": "Neer Ya",
    "keywords": [
      "Book Discussion",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-09T14:00:00+05:30",
    "endDate": "2026-01-09T17:00:00+05:30"
  },
  {
    "name": "THE HORSE DID FLY: AND OTHER SHORT STORIES - Book Reading Balakrishna Adiga",
    "description": "Atta Galatta is excited to host a book reading by Balakrishna Adiga for his latest collection, The Horse Did Fly, on 9th January 2026, from 5:30 PM to 7:00 PM at our bookstore.\nThe Horse Did Fly is an incisive collection of urban tales, bringing everyday characters—teachers, clerks, and neighbours caught in hilarious and surprising twists—to life. Each story, inspired by true incidents, offers a sharp and unfiltered look at the ingenuity required to navigate modern life. From the absurdities of petty corruption to the challenges of 21st-century matchmaking, these stories promise to make readers laugh, reflect, and linger on the moments long after the final page.\nJoin us at Atta Galatta for an evening of reading, conversation, and storytelling with Balakrishna Adiga.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1586",
    "image": "https://attagalatta.com/admin/uploads/events/1300079943.jpeg",
    "performer": "Balakrishna Adiga",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-09T17:30:00+05:30",
    "endDate": "2026-01-09T19:00:00+05:30"
  },
  {
    "name": "Qu for Quiz - Quiz by Karthik Srinivasan and Ganesh Balakrishnan",
    "description": "The Qu for Quiz is based on a grid format with the grids formed by topics on one axis and level of difficulty (and hence the points) on the other. The topics could be varied like History, Sports, Music, Literature, Movies and more. A team of two members would get to choose a topic and the level of difficulty and the question would be revealed. The rest of the teams can go for the buzzer if they know the answer. Depending on the number of teams registering, the size of the grid would be decided. \nSAMPLE Qu: 2. The name is inspired by the traditional malt whisky distillation process in which malted barley was mixed by hand with shovels. This labor-intensive process often caused a shoulder injury to workers, causing their arms to hang low. Which brand is named thus? \nGanesh Balakrishnan is an entrepreneur, marketer and creator of terrible dad jokes. His claim to fame is attempting to sell shoes during the pandemic, culminating in a viral Shark Tank \"Down But Not Out\" appearance. He is a collector of useless facts since childhood, and has dabbled in trivia quiz circuits since college. ganesh.flatheads@gmail.com\r\nKarthik Srinivasan is a pseudo-retired software leader by choice, specializing in innovative ideas to spend time that include organizing cricket leagues at the scale of IPL but for free, staying up to date on latest debates in virtual social groups helmed by family and friends and more on similar lines. emailkarth@gmail.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1587",
    "image": "https://attagalatta.com/admin/uploads/events/165083966.png",
    "performer": "Karthik Srinivasan",
    "keywords": [
      "Quiz",
      "Quiz"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-09T19:00:00+05:30",
    "endDate": "2026-01-09T20:30:00+05:30"
  },
  {
    "name": "Meenu the Meemi - Book Launch by Dr.Sreelekha Kopparambil",
    "description": "A dream dialogue with a little fish, Meenu, changes Nandu's life and gives him a purpose. As he decides to champion a rare cause with grit and determination, he faces many hurdles. Will Nandu succeed in his mission? What is this mission that Nandu has taken up? Who helps him on the way? To know more read, Meenu the Meemi, a dream fantasy about how a little fish befriends a little boy and how it changes lives of many others. \n* Free entry so no tickets to the event.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1580",
    "image": "https://attagalatta.com/admin/uploads/events/1876509479.jpeg",
    "performer": "Dr.Sreelekha Kopparambil",
    "keywords": [
      "Book Discussion",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-10T11:00:00+05:30",
    "endDate": "2026-01-10T12:30:00+05:30"
  },
  {
    "name": "Make Your Own Comic - A Doodling Workshop",
    "description": "A fun, beginner-friendly doodling and comic-making workshop open to all ages. Participants will learn the basics of creating cute doodles, developing their own comic character, and understanding how to frame a simple comic strip. No prior drawing experience is needed — this workshop is all about exploring ideas and enjoying the process.\r\nAll materials will be provided. Just bring a fresh mind and curiosity.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1588",
    "image": "https://attagalatta.com/admin/uploads/events/1452954094.png",
    "performer": "Sowbarnika S",
    "keywords": [
      "Comics",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-10T11:00:00+05:30",
    "endDate": "2026-01-10T13:00:00+05:30"
  },
  {
    "name": "I’m Buzzin’: A Zine-Making Workshop - Workshop by Bazinega",
    "description": "A playful and powerful zine-making + storytelling workshop exploring the joy of independent publishing and self-expression through folded pages and storytelling. Open to everyone — whether you’re a seasoned artist, a curious beginner, or simply someone with something to say.\nWhat to expect:\n\n\nA short introduction to zines and their cultural, political, and artistic history\n\n\nInspiring examples of zines from around the world\n\n\nFun prompts to help you get started\n\n\nHands-on time to create your own 8-page zine\n\n\nGuidance on folding, layout, storytelling, and collage\n\n\nAn optional space to share your zine with others\n\n\nParticipants take home their own zine — and maybe make a few new friends.\nWhat to carry (optional):\r\nAny personal writing, poems, sketches, or images you’d like to include.\nAll materials will be provided. No prior experience needed.\n\nNote: Please arrive 10 minutes early. Tickets once purchased are non-refundable.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1589",
    "image": "https://attagalatta.com/admin/uploads/events/1324987960.png",
    "performer": "Bazinega",
    "keywords": [
      "Zine Making",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-10T17:00:00+05:30",
    "endDate": "2026-01-10T19:00:00+05:30"
  },
  {
    "name": "Let’s Walk - Book launch by Prakash Kannan",
    "description": "Join us for an intimate evening at Atta Galatta as we celebrate the launch of \"Let’s Walk\" by Prakash Kannan. This is more than just a book release; it is an invitation to explore the quiet, lingering moments that define our lives.\nThe Story: \"Let’s Walk\" is a poignant tale of two strangers brought together by chance. Set against the rhythmic backdrop of city life, the story explores the beauty of timing, the weight of unspoken words, and the type of love that stays with you long after the final page.\n \nThe Event Experience:\n· A Sneak Peek: Get an exclusive look into the heart of the story.\n· Meet the Author: Hear Prakash Kannan share his creative journey and the deep emotions that inspired this book.\n· Q&A: A chance to ask the author about the themes of timing and connection.\nLocation: Atta Galatta, Indira Nagar, Bengaluru Date: January 10, 2026 Time: 05:30 PM",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1579",
    "image": "https://attagalatta.com/admin/uploads/events/1849422911.jpg",
    "performer": "Prakash Kannan",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-10T17:30:00+05:30",
    "endDate": "2026-01-10T19:00:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup by The Listeners Circle",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1592",
    "image": "https://attagalatta.com/admin/uploads/events/2113108856.jpg",
    "performer": "The Listeners Circle",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-11T11:00:00+05:30",
    "endDate": "2026-01-11T13:00:00+05:30"
  },
  {
    "name": "BaggIt Yourself: A Finger Knitting Workshop - A Finger Knitting Workshop",
    "description": "A cozy and creative finger knitting workshop where participants will learn how to craft their own stylish bag, no needles required.\r\nAll materials will be provided, and participants will take home their finished bag along with any leftover yarn to continue creating.\r\nNo prior experience needed, just bring your fingers and your creativity.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1590",
    "image": "https://attagalatta.com/admin/uploads/events/563897385.png",
    "performer": "the crochet girl",
    "keywords": [
      "Knitting",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-11T14:00:00+05:30",
    "endDate": "2026-01-11T16:00:00+05:30"
  },
  {
    "name": " Hello 2026, Be Nice: An Art Journaling Workshop - An Art Journaling Workshop",
    "description": "A gentle, creative space for real and tired thoughts. This is not a goal-setting or resolution workshop. Instead, we slow down, talk, create, and document thoughts as they are, using art journaling to make 2026 feel a little less overwhelming and a lot more humane.\nWhat to expect:\n\n\nA brand-new journal for yourself\n\n\nCraft materials to explore junk journaling\n\n\nA pack of crayons\n\n\nGuided prompts and grounding activities\n\n\nTime to create, reflect, and have fun without pressure\n\n\nThis workshop is for you, whether you journal every day or have never journaled before. No experience or skills needed, just a little curiosity and the willingness to make 2026 feel less scary in your head.\nAll materials, including the journal, will be provided.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1591",
    "image": "https://attagalatta.com/admin/uploads/events/1846390207.png",
    "performer": "Your Journal Project",
    "keywords": [
      "Art Journaling",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-11T17:00:00+05:30",
    "endDate": "2026-01-11T19:00:00+05:30"
  },
  {
    "name": "Quiet Joys: A Gratitude Zine–Making Workshop - Workshop by Nitya Menon",
    "description": "Join us for an afternoon of quiet creativity. This workshop invites you to slow down, reflect on the small joys that often go unnoticed, and turn those moments into an 8-page gratitude zine. Through gentle prompts and simple illustration exercises, you’ll create a personal keepsake that captures what grounded you, moved you, or made you smile. It’s a reflective, hands-on session for anyone seeking a pause through creativity and mindful noticing. All materials will be provided, and no prior art experience is required.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1584",
    "image": "https://attagalatta.com/admin/uploads/events/1074968289.jpg",
    "performer": "Nitya Menon",
    "keywords": [
      "Zine Making",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-17T15:00:00+05:30",
    "endDate": "2026-01-17T16:30:00+05:30"
  },
  {
    "name": "Food In Literature - Book Club with Prachi Grover",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.  So, if viewing the world through the lens of food and literature interests you, then join us for a dialogue on “Food in Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we read our way through several powerful (and delicious) narratives.\nJanuary Read: In the Beginning there was Bombay Duck by Pronoti Datta\nWe assure you that you will enjoy every single bite! The session is free but registration is a must as we have limited spots available. \n \nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who love to read and eat!\nWhen: Saturday, 31st January, 2026 at 11 a.m.\nWhere: Atta Galatta Bookstore, Indira Nagar\nAges: 18+\nRegistration is mandatory (link in bio)\nCopies of the book are available at the store.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1582",
    "image": "https://attagalatta.com/admin/uploads/events/1865055897.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Literature",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-31T11:00:00+05:30",
    "endDate": "2026-01-31T13:00:00+05:30"
  }
]