[
  {
    "name": "Love Stories from Indian Heritage - A Storytelling Performance by Aparna Jaishankar and Vikram Sridhar",
    "description": "Love stories aren’t only about the hero and heroine, for love can rarely exist in isolation. Zealous messengers, art and music as mood enhancers, food as aphrodisiacs, taboos and mores – all play a pivotal role in shaping stories of love. Vikram Sridhar and Aparna Jaishankar rummage through the passages of time to bring you various hues of love etched in our heritage through literature, architecture, songs and poetry through the all- encompassing art form of oral storytelling.\n\nAbout Aparna Jaishankar\r\nAparna Jaishankar is a Storyteller with a penchant for Indic mythology. She believes that there is no ONE version of any story. Her storytelling performances take a contemporary view of ancient tales.Aparna also works with educators in developing learning perspectives in the classroom and with organisations in building internal narratives.\n\nAbout Vikram Sridhar\r\nVikram Sridhar is a Performance Storyteller, Theatre Practitioner.and a Narrative based Facilitator .  His Stories , Performance and Workshops for Children , Students , Adults and Families are rooted in Heritage , Ecology and Folklore deeply inspired from various communities of the soil . Based in Chennai and Bangalore , he travels the country extensively with his  Desi way of Storytelling",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1604",
    "image": "https://attagalatta.com/admin/uploads/events/1180907729.png",
    "performer": "Aparna Jaishankar, \nVikram Sridhar,",
    "keywords": [
      "Folklore",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-06T19:00:00+05:30",
    "endDate": "2026-02-06T20:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk by Vikram Sridhar",
    "description": "On a Saturday morning , Walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore , Heritage and Ecology of the area . The walk will begin and culminate at ATTA GALATTA . The tales will revolve around historical , mythical and personal narratives weaved as we discover the area through the walk .\n Date : 7th February ( Saturday)  2025\n Time : 10 AM\n Starting Point : Atta Galatta",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1608",
    "image": "https://attagalatta.com/admin/uploads/events/1890938241.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-07T07:00:00+05:30",
    "endDate": "2026-02-07T09:00:00+05:30"
  },
  {
    "name": "Gond Art - Workshop by Hues by Sindhoor",
    "description": "Our Gond Art workshop is your passport to explore the colorful tapestry of this ancient Indian folk tradition. Dive deep into the intricate techniques and whimsical motifs that define Gond art. Unleash your inner creativity as you paint your own vibrant masterpiece, infused with the spirit of tribal storytelling. \r\nTickets priced at INR 999/- 3 hours of workshop with Inclusive of all materials.\r\nContact +91 9513544920 for tickets & more details.\r\nGet ready for a joyous fusion of tradition and imagination that promises to ignite your artistic spark!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1603",
    "image": "https://attagalatta.com/admin/uploads/events/1582965496.jpeg",
    "performer": "Hues by Sindhoor",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-02-07T11:00:00+05:30",
    "endDate": "2026-02-07T14:00:00+05:30"
  },
  {
    "name": "Who started the fire? - Murder mystery by Varun Gwalani",
    "description": "Have you ever wanted to solve a crime? Believed that you can do better than fictional detectives? Well, you’re in luck!\nThe bestselling author of The Only Way Out is Death and A Deadly Faith, Varun Gwalani brings you a unique experience, played by a thousand people across the country!\nHe will take you through an original murder mystery where you are the detective! Uncover clues, find evidence and deduce the theory to help you find the murderer among you!\nVarun Gwalani, the bestselling author of The Only Way Out is Death and A Deadly Faith, has created a unique murder mystery experience! He has created and personally hosts an interactive murder mystery, where participants are the characters within the story, and one of them is the culprit. Using a combination of storytelling, improv and immersive theatre, Varun adds a personal touch to his murder mystery games, one that has captivated people across the country.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1648",
    "image": "https://attagalatta.com/admin/uploads/events/632162035.jpg",
    "performer": "Varun Gwalani",
    "keywords": [
      "Mystery",
      "Murder Mystery"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-07T11:00:00+05:30",
    "endDate": "2026-02-07T13:00:00+05:30"
  },
  {
    "name": "Blackout Poetry & Haiku - A Creative Workshop with Dr. Vaishnavi Pusapati",
    "description": "I am so pleased to invite interested participants to an inspiring poetry workshop led by internationally published poet and physician Dr. Vaishnavi Pusapati. Scheduled for 7th February 2026 from 2:30 PM to 3:30 PM, the event will explore the art and craft of Blackout Poetry and Haiku, inviting participants to creatively reimagine text and discover poetic expression in unexpected places. Blackout is a form of erasure and found poetry where existing text material such as newspaper clippings and journal pages are used as raw material and the phrases that stand out to a poet, are highlighted to form a new, often unrelated to the text in meaning, poem. It is a technique used to overcome writer's block as well. Haiku is a short form of Japanese poetry focused on attention and detail. In this workshop we will also explore haiku techniques such as the cut word and season word and how to edit your haiku better, through examples and worksheet exercises.\nDr. Vaishnavi Pusapati is a distinguished physician-writer whose poetry and micro-fiction have appeared in numerous prestigious literary journals and anthologies around the world. Her work has been featured in publications such as Cold Moon Journal, Autumn Moon Journal, Heron’s Nest Journal, Poetry Pea Journal, Haikuniverse, Under the Bashō, and many others, earning recognition for its lyrical precision and contemplative depth. She is also the winner of the Beyond Words micro-fiction contest and her haiku have been anthologized in the Living Haiku Anthology and the Haiku Registry. Her haiku book, Afterlife:haikus is forthcoming from Hawakal Publishers. Her creative practice spans haiku, free verse, monostich, and other forms that illuminate the subtle moments of lived experience. Through her work, she invites readers and writers alike to engage deeply with language, memory, and the transformational possibilities of brevity.\nThe Blackout Poetry & Haiku Workshop will provide attendees with hands-on exercises, guided techniques, and creative prompts designed to nurture individual expression and literary play. Art supplies and refreshments will be provided. Whether you are a seasoned writer or a curious beginner, the session promises to unlock new ways of seeing, connecting and writing.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1653",
    "image": "https://attagalatta.com/admin/uploads/events/595623461.jpg",
    "performer": "Dr. Vaishnavi Pusapati",
    "keywords": [
      "Poetry",
      "Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-07T14:30:00+05:30",
    "endDate": "2026-02-07T15:30:00+05:30"
  },
  {
    "name": "Making Sense of Creative Contracts - A Workshop by arts-lawyer Manojna Yeluri",
    "description": "Are you an illustrator or artist? Would you like to meet a community of your peers over a cup of tea, and learn sector specific skills together? Welcome to Common Lines Illustrator' Circle! \nYou are invited to our first ever event: Making Sense of Creative Contracts, a workshop by arts-lawyer Manojna Yeluri. \nThis interactive workshop blends anecdotal learning with scenario- based exercises, encouraging independent illustrators and visual artists to better understand contracts and copyright, alongside advocating for their creative rights. Led by Manojna Yeluri (@artistiklicense), an artist-rights and intellectual property lawyer, this session unpacks common contract challenges and clauses, offering some ways to approach them without feeling overwhelmed. Read more about her work here: https://www.artistiklicense.com/\nEvent Details:\n📅 Date: 7th Feb 2026\n🕚 Time: 3:00-5:00 PM\n📍 Venue: Atta Galatta, Indiranagar, Bengaluru\n🖌️Open only to illustrators and artists\nREGISTRATION LINK: https://forms.gle/yfTYEDPtbUmMxcz46\nCommon Lines: Illustrators' Circle is a series of events hosted by Current Conservation magazine. Created for freelance illustrators and artists, Common Lines offers a space to learn together, share experiences, and simply spend time with peers. Through workshops, jams, or conversations over tea, the series aims to nurture connection, and a sense of belonging within the illustration community. \nFor any questions, please write to editor.ccmagazine@gmail.com.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1652",
    "image": "https://attagalatta.com/admin/uploads/events/517461320.png",
    "performer": "Manojna Yeluri",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-02-07T15:00:00+05:30",
    "endDate": "2026-02-07T17:00:00+05:30"
  },
  {
    "name": "The Bougainvillea Circle - Connection Circle by Radhika Ghose",
    "description": "\"Sawubona\" a Zulu Greeting meaning, \"We See You\". At Bougainvillea Circles you are offered a space to be heard, seen, welcomed as you are. A non-judgmental, safe, trusted space where you are free to be all that you want to be. Nothing More, Nothing less. No Restrictions, no judgements, just an intimate group of people looking for a space to be real. A space where we`re all less alone for a little while. Where we are seen, how we want to be seen. Conversations, Connections, Community of Compassion. All that makes the world go round, after Love of course!\nRemember - Sawubona: We See You.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1655",
    "image": "https://attagalatta.com/admin/uploads/events/37299969.png",
    "performer": "Radhika Ghose",
    "keywords": [
      "Wellness and Health",
      "Support Group"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-07T16:00:00+05:30",
    "endDate": "2026-02-07T17:30:00+05:30"
  },
  {
    "name": "A Story Walk Through Domlur - Story Walk by Vikram Sridhar",
    "description": "On a Sunday morning , Walk through the lanes of DOMLUR , from lores dating back in time from the Madras Presidency , Mysore State to the current IT , Banking and Retail sectors with Vikram Sridhar discovering the lanes through the Folklore , Heritage and Ecology of the rich area which is identified as a village. The walk will begin from Bhandutvas , a theatre collective , and culminate at the Bangalore International Centre . The tales will revolve around historical , mythical and personal narratives weaved as we discover the area through the walk . \nDate : 8th February  (Sunday)  2025\n Time : 7 AM\n Starting Point : Bhandutvas , Domlur\nDetails and GPAY : 9945799224",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1607",
    "image": "https://attagalatta.com/admin/uploads/events/1735873685.jpeg",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T07:00:00+05:30",
    "endDate": "2026-02-08T09:00:00+05:30"
  },
  {
    "name": "Once Upon a Brunch - Sunday morning brunch and stories by Vikram Sridhar",
    "description": "Late weekend morning , brunch , stories like the ones from the olden times , meeting new people\nWhat if they all come together ?\nWeekend and late morning Brunch is an emotion . On the other hand Stories have always been an emotion too . What's common between the two is the rich heritage of food and stories. What if they come together ? .\nListen to these stories of the food as you enjoy your weekend Brunch set at a cozy location that has its own stories . A beautiful day starts with a lovely breakfast . And a morning with breakfast and stories . Every food we eat has a story to share .. Idli , Vada , bread , Paratha etc . Every breakfast comes after a long break and is eager to be eaten . A simple Weekend morning Brunch put together by Atta Galatta\nStorytelling around the food lores by Vikram Sridhar",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1642",
    "image": "https://attagalatta.com/admin/uploads/events/860324237.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Food",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T10:00:00+05:30",
    "endDate": "2026-02-08T12:00:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup by The Listeners Circle",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.\n\nCoffee and tea included.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1664",
    "image": "https://attagalatta.com/admin/uploads/events/1516788208.jpg",
    "performer": "The Listeners Circle",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T11:00:00+05:30",
    "endDate": "2026-02-08T13:00:00+05:30"
  },
  {
    "name": "Divine Delicacies: Storytelling and Menu Tasting Session - Storytelling and Menu Tasting Session by Aparna Jaishankar",
    "description": "Food is such an integral part of our lives that we cannot imagine any worship without food. Keeping this in mind, we welcome you to a unique experience where we shall serve you samples of prasadams from various temples and share stories of places of worship and the perceived food preferences of the divine. Join Aparna Jaishankar for Divine Delicacies, only at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1656",
    "image": "https://attagalatta.com/admin/uploads/events/1016440629.png",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "Food and Menu Tasting",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T12:30:00+05:30",
    "endDate": "2026-02-08T14:30:00+05:30"
  },
  {
    "name": "Ventriloquism Show & Workshop - Ventriloquism workshop by M. Santhosh Kumar",
    "description": "Mr. M. Santhosh Kumar is a qualified Company Secretary by Profession yet a  passionate Ventriloquism  Artiste. He  is an International Ventriloquism Artiste, a TEDX Speaker, Voice Coach. He is the only Indian Ventriloquism artiste attending the International  Ventriloquism Convention in the USA since 2012. He has performed & enthralled both Kids & Adults in various Countries like USA, UAE, UK, Germany & all over India.  He specialises in presenting our Indian Values Culture blending humour and learning using the Ventriloquism Art. He is the Winner of Outstanding Ventriloquism Artiste award for 2021. Awardee for exemplary work in puppetry and storytelling from Early Childhood Association of India.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1599",
    "image": "https://attagalatta.com/admin/uploads/events/1546739439.jpg",
    "performer": "M. Santhosh Kumar",
    "keywords": [
      "Puppetry",
      "Workshop + Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T16:00:00+05:30",
    "endDate": "2026-02-08T17:00:00+05:30"
  },
  {
    "name": "SHAAM-E-BAAZGASHT | Bengaluru Diaries - An Evening of Poetry, Conversations & Healing by Krishnendu Chatterjee",
    "description": "Shaam-e-Baazgasht is an intimate, cosy, and immersive poetry experience drawn from Baazgasht – Echoes of Words & Silence, a bilingual Hindi–English collection that journeys through unrequited love, longing, heartbreak, queerness, healing, and the quiet courage of letting go.\nMore than a performance, it is a gathering that invites presence.\nThrough selected poems from the Baazgasht series, the evening unfolds alongside the stories that birthed them — gentle, honest conversations with the poet on his own journey, interwoven with brief guided moments of breathing, mindfulness, and emotional reflection. Together, these elements create a space where words are not merely heard, but felt — allowing the audience to touch closure, clarity, and a softer, steadier kind of inner peace.\nShaam-e-Baazgasht | Bengaluru Diaries offers an evening of listening, pausing, and returning — to oneself.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1621",
    "image": "https://attagalatta.com/admin/uploads/events/983215955.png",
    "performer": "Krishnendu Chatterjee",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T17:30:00+05:30",
    "endDate": "2026-02-08T19:30:00+05:30"
  },
  {
    "name": "Trial by Water - Book Signing with Uttam Kumar Sinha",
    "description": "Join us at Atta Galatta for a book signing with Uttam Kumar Sinha, author of Trial by Water, a timely and incisive exploration of the rivers that lie at the heart of India–Pakistan relations.\nIn this book, Uttam Kumar Sinha traces the turbulent history of the Indus Basin, once a shared lifeline of the subcontinent and later a fractured landscape shaped by Partition, politics, and conflict. Beginning with 1947 and moving through the signing of the Indus Waters Treaty in 1960, the narrative examines how cooperation over water emerged even amidst deep hostility—and why it has remained fragile. With the treaty’s suspension by India in April 2025 following the Pahalgam terror attack, the book asks urgent questions about its future and the possibility of a new, more resilient framework.\nWritten with clarity and analytical depth, Trial by Water looks at the role of political leadership, regional tensions, and global pressures in shaping one of the world’s most significant transboundary water agreements. By following the flow of the Indus rivers, the book offers a powerful lens through which to understand conflict, compromise, and survival in South Asia.\nDate: Tuesday, 10 February\nTime: 3:00 PM - 5:00 PM\nVenue: Atta Galatta, Bengaluru",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1645",
    "image": "https://attagalatta.com/admin/uploads/events/1316920228.jpg",
    "performer": "Uttam Kumar Sinha",
    "keywords": [
      "Books and Literature",
      "Book Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-10T15:00:00+05:30",
    "endDate": "2026-02-10T17:00:00+05:30"
  },
  {
    "name": "Petals and Pavement:  A Story Walk - A Story walk through Love , flowers and Secrets by Vikram Sridhar",
    "description": "Valentine and Flowers, Coffee and Roses, Betel leaves and Strawberries, as we look around there is a love tale behind everything that blooms around us. The Story walk explores the many tales of Love through Flora, Nature, people, mythology and time. Over the 90 minute slow walk, the walk explores Loves through Heritage, Folklore and Ecology.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1657",
    "image": "https://attagalatta.com/admin/uploads/events/",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-14T08:00:00+05:30",
    "endDate": "2026-02-14T09:30:00+05:30"
  },
  {
    "name": "Tea-rapy - With Dr. Gokul Ratakonda & Kvira Organics",
    "description": "Get ready to pour a cup of clarity at Tea-rapy—a soulful blend of clinical insight and sensory mindfulness. This isn't your average therapy session; it’s an immersive experience designed to help you navigate the complexities of connection while grounding your senses.\nWe’re bringing in Dr. Gokul Ratakonda, a practicing clinical psychologist, to lead a deep dive into the heart of modern dating and long-term partnerships. Alongside a curated tea ceremony and tasting by Kvira Organics, this event offers a serene space to explore the internal and external facets of love.\nWhat to Expect:\nThe Deep Dive: An open forum to ask Dr. Ratakonda your most pressing questions about relationship dynamics and emotional health.\nMindful Moments: Experience guided meditations to center your thoughts and calm the nervous system.\nSetting the Standard: Learn practical tools for establishing healthy boundaries and defining your relationship goals for the year ahead.\nSensory Soothing: Sip and savor premium blends from Kvira Organics as you learn the art of the tea ceremony.\nWhether you’re looking to heal, grow, or simply find balance, come prepared to sip, speak, and set your intentions. It’s restorative, it’s enlightening, and it’s exactly the \"me-time\" your heart deserves.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1659",
    "image": "https://attagalatta.com/admin/uploads/events/1782277217.png",
    "performer": "Dr. Gokul Ratakonda , \nKvira Organics,",
    "keywords": [
      "Wellness and Health",
      "Support Group"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-14T11:00:00+05:30",
    "endDate": "2026-02-14T13:00:00+05:30"
  },
  {
    "name": "A Right Royal Affair - A Book Talk with Prajwal Hegde and Shinie Antony",
    "description": "What happens when an eco-warrior prince meets a coffee-obsessed entrepreneur?\nWe’re hosting Prajwal Hegde to talk about her new book, You Can’t Be Serious! She’ll be joined by Shinie Antony for a chat about the chaos of North-meets-South romances, royal scandals, and why we’re all still suckers for a good rom-com.\nWhat better way to spend Galentines day than live out our Royal fantasies!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1658",
    "image": "https://attagalatta.com/admin/uploads/events/1054650329.png",
    "performer": "Prajwal Hegde, \nShinie Antony,",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-14T14:15:00+05:30",
    "endDate": "2026-02-14T15:00:00+05:30"
  },
  {
    "name": "Atta Galatta presents “AG Book Club” - Monthly Book Club with Palgun KJ",
    "description": "What have you been reading? Come, discuss your latest read. Each member gets 5-7 minutes to talk about the book, theme, plot, with 2 minutes to answer any questions others might have. This month’s special focus will be translations- come tell us what you've been reading.\nFebruary’s special focus will be on Romance and Erotica",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1660",
    "image": "https://attagalatta.com/admin/uploads/events/1364428833.png",
    "performer": "Palgun KJ",
    "keywords": [
      "Book Club",
      "Book Talk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-14T15:00:00+05:30",
    "endDate": "2026-02-14T17:00:00+05:30"
  },
  {
    "name": "Steeped in Scandal - An intimate tea-time session with Anuja Chadramouli",
    "description": "Known for her sweeping tales of mythology and history, Anuja is stepping away from the epic battles to indulge in some delicious, modern-day gossip with us. This isn’t your average literary talk—this is your chance to play investigator. We’re inviting you to submit your most \"gossipy\" questions for Anuja to answer live. Whether you're curious about the scandals behind her stories or want her to take on a provocative prompt, no topic is too bold and no secret is safe over a cup of chai.\nCome for the tea, stay for the revelations!\n\nBio:\nAnuja Chandramouli is a bestselling author and new age Indian classicist widely regarded as one of the finest writers in mythology, historical fiction and fantasy. Her highly acclaimed debut novel, Arjuna: Saga of a Pandava Warrior-Prince, was named as one of the top 5 sellers in the Indian writing category for the year 2012 by Amazon India. Her book, Mohini: The Enchantress was the winner of the JK Papers and Times of India Popular Choice Author award for the year 2021. Her books are also available as audiobooks and have been translated into Hindi. Abhimanyu: Son of Arjuna has been shortlisted for the Atta Galatta – Bangalore Literature Festival Book Prize. GIRL TALK and THE WIFE AND THE DANCING GIRL are her latest books. \nAn accomplished TEDx speaker and storyteller, Anuja Chandramouli, regularly conducts workshops on creative writing, mythology and empowerment in schools and colleges across the country. Her Mahabharata and Ramayana with Anuja storytelling series is now available on YouTube, Spotify, TuneIn Alexa, Apple Podcasts. She is a trained Bharatanatyam dancer and a columnist for The New Indian Express. This mother of two little girls lives in Sivakasi, Tamil Nadu.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1663",
    "image": "https://attagalatta.com/admin/uploads/events/42706023.png",
    "performer": "Anuja Chadramouli",
    "keywords": [
      "Community",
      "Discussion"
    ],
    "@type": "SocialEvent",
    "startDate": "2026-02-14T17:30:00+05:30",
    "endDate": "2026-02-14T18:30:00+05:30"
  },
  {
    "name": "Shiva in the Mahabharata - Storytelling by Aparna Jaishankar",
    "description": "The Mahabharata is often read as the tale of Krishna and dharma but running parallel to its grand narrative is another presence: Shiva. Elusive, ascetic, fierce, compassionate, and unsettling.\nThis storytelling session for adults explores Shiva’s appearances in the Mahabharata . The session weaves together the many Shivas through multiple lenses like regional retellings, Puranic expansions, classical and folk art, temple narratives, poetry, and oral traditions.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1650",
    "image": "https://attagalatta.com/admin/uploads/events/1988790881.png",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "History",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-14T19:00:00+05:30",
    "endDate": "2026-02-14T20:00:00+05:30"
  },
  {
    "name": "Madonna: Women’s Stories in the Modern Heart - A Galentine’s Day Play",
    "description": "Directed by Pritesh Bhandary, Atta Galatta brings you Madonna.\nThis bold, darkly funny and deeply intimate two-part play explores female desire, emotional neglect, sexual shame, and the search for pleasure and self-worth—in a world that constantly teaches women to stay silent.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1662",
    "image": "https://attagalatta.com/admin/uploads/events/940392655.png",
    "performer": "Pritesh Bhandary",
    "keywords": [
      "Theatre",
      "Interactive Theatre Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-14T20:00:00+05:30",
    "endDate": "2026-02-14T21:00:00+05:30"
  },
  {
    "name": "Brand Basics for First-Time Entrepreneurs - Sudhir Kiran",
    "description": "A conversation-led space for people who want to start something of their own but feel stuck at the very beginning, unsure of what they’re really building, how to explain it, or where to begin.\n\r\nThis workshop is about slowing down, asking better questions, and finding the right words before you promote, market, or invest further. The focus is on clarity, in thought, language, and direction, so everything that comes later feels more intentional and less overwhelming.\n\nWho is this for?\r\nFirst-time entrepreneurs, professionals exploring a side venture, freelancers seeking clarity in how they present their work, MSME owners who want to make sense of branding without jargon, and students or anyone considering starting something of their own.\n\nWhat will participants take away?\r\n1. Greater clarity on what they’re really building and why it matters\r\n2. A simple way to articulate their idea with confidence and intention\r\n3. A clearer understanding of how branding, marketing, and storytelling fit together, before execution begins\nPlease complete the registration form after booking. It helps us understand what you’re working on so the session can be shaped around the room. https://forms.gle/vescHTWDZhn722Jz6",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1661",
    "image": "https://attagalatta.com/admin/uploads/events/657860632.png",
    "performer": "Sudhir Kiran",
    "keywords": [
      "Business",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-02-22T11:00:00+05:30",
    "endDate": "2026-02-22T13:00:00+05:30"
  }
]