[
  {
    "name": "Fungal Connections - Documentary Screening, Reishi Tea Ceremony and Creative Group Activity by Current Conservation Magazine and Fungi Foundation India",
    "description": "Join us for a very special event between Fungi Foundation India and Current Conservation magazine, featuring a documentary screening of \"The Mushroom Keepers\" – an evocative short film that unveils the profound relationships between fungi and the Khasi and Garo communities of Meghalaya, India.\nThe film explores how fungi shape spiritual and cultural worldviews through intimate conversations with community elders, revealing the intertwined loss of biodiversity and ancestral knowledge as old-growth forests dwindle.\nCurrent Conservation is a not-for-profit quarterly print and online magazine that works with scientists, researchers and artists across the world to tell stories from the field of conservation.\nThis FREE event will begin with a welcome reishi tea ceremony, followed by presentations and discussions that bridge mycology, culture and conservation. After the film, we'll transition to an art-based activity inspired by the latest edition of Current Conservation.\nBeyond the formal program, there will be plenty of mycological wisdom shared through laughter and conversation. It's a chance to connect with like-minded enthusiasts while exploring the fascinating world of fungi through cultural storytelling and creativity.\nCome share in this unique opportunity to learn, create, and connect!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1019",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Current Conservation Magazine, \nFungi Foundation India,",
    "keywords": [
      "Mycology",
      "Discussion"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-03-08T11:00:00+05:30",
    "endDate": "2025-03-08T13:00:00+05:30"
  },
  {
    "name": "Pen & Latte - Story Writing Workshop",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.\nDisclaimer on Event Coverage:\nEvent highlights will be captured through photos and videos for showcasing the event in our social media accounts. All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT989",
    "image": "https://attagalatta.com/admin/uploads/events/1866651.png",
    "performer": "Aristotle's Writers Club",
    "keywords": [
      "Writing Workshop",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-08T11:11:00+05:30",
    "endDate": "2025-03-08T14:22:00+05:30"
  },
  {
    "name": "Mythology Marvels - Storytime for Children and Families",
    "description": "Indic Mythology is full of answers to the many whys of our culture and things around us, Join Lavanya Prasad and Meenu Sivaramakrishnan as they explore these stories through music, dance and theatre.\nIt so happened that this month’s Mythology Marvels is scheduled on International Women’s Day - MARCH 8th. And we did not want to miss this opportunity to tell you all the stories of the wonder women from our Vedic times! The stories that we have chosen to tell you will only want to make you find more. Brace yourself to travel into the world of women from the vedic times and bring along a strong woman from your life. We have a “Small special something\" planned for you all at the end of the session. See you all soon!\nAbout the Storytellers:\nLavanya Prasad & Meenu Sivaramakrishnan are passionate professional storytellers with mutual love for Music and Mythology. Mythology Marvels is their humble attempt to bring to light the treasures from Indian mythology (this time from around the world too) to the children and Families of Bengaluru through music, dance and theatre. Both Lavanya and Meenu run their respective storytelling ventures.\nPlease find more about them here.\nLavanya Prasad : www.talescope.in\nMeenu Sivaramakrishnan : www.kathagalatta.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1024",
    "image": "https://attagalatta.com/admin/uploads/events/680595661.png",
    "performer": "Lavanya Prasad, \nMeenu Sivaramakrishnan,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2025-03-08T14:30:00+05:30",
    "endDate": "2025-03-08T15:30:00+05:30"
  },
  {
    "name": "AG Book Club - Monthly Book Club",
    "description": "What have you been reading? Come, discuss your latest read. Each member gets 5-7 mins to talk about the book, theme, plot with 2 mins to answer any question others might have.\nSpecial Theme: historical fiction",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1020",
    "image": "https://attagalatta.com/admin/uploads/events/581796442.jpeg",
    "performer": "Palgun KJ",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-08T15:00:00+05:30",
    "endDate": "2025-03-08T17:00:00+05:30"
  },
  {
    "name": "Women's Sound and Art Workshop - Wellness Workshop",
    "description": "Great things happen when women connect.\nSound is the source of this entire creation.\nDid you know that the sound of the musical notes have a profoundly positive impact on our chakras?\nWhether you receive the sounds from sacred singing bowls meant for the purpose of healing or well-being, or you sing the notes yourself, they bring in a sense of balance.\nAs this balance fosters feelings of joy and peace, it can aid creative expression in many forms.\nPainting is one such creative form that is closely associated with sound and music. The choice of colours, mood and theme, sensory and emotional experience while painting gets influenced by the presence of sound and music in the environment where art is taking place impacting the artistic process and the final creation.\nInspired by this, we have a similar collaboration with artists Shilpi, Ayuushi, Priyanka and Khusbu who aspire to hold a Sound & Art Workshop for women wishing to experience such intense joy and creativity on 8th March 2025, International Women’s Day.\nIt would be a treat to observe the participants flow with the sounds and express their art.\nTake away:\nPainting to add vibrancy to your room or your living. An ideal gift that you can make, gift and surprise anyone.\nThis is a wonderful opportunity to receive encouragement from peer women.\nWhat to Bring:\n\nYoga mat.\nShawl / stole.\nDrinking water bottle.\n\nNo prior art experience is necessary.\nParticipants should come with an open mind. All other materials will be provided.\nWear comfortable, light color cotton / linen clothing as absorbing the vibrations is easier.\nRegistration: Spaces are limited, so early registration is encouraged.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT932",
    "image": "https://attagalatta.com/admin/uploads/events/895204819.jpeg",
    "performer": "Ayuushi, \nKhusbu Goyal, \nPriyanka Sinha, \nShilpi,",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-08T15:00:00+05:30",
    "endDate": "2025-03-08T18:00:00+05:30"
  },
  {
    "name": "Ups and Downs, and Everything in Between - Playback Theatre Performance",
    "description": "First Drop Theatre presents Ups and Downs, and Everything in Between - stories of resilience , a Playback Theatre performance on 8th March 2025 (Saturday, 4:30 PM) at Atta Galatta, Indira Nagar\nUps and Downs - the flow of life. We have all been through this flow and have our stories to share; of the moments when we looked for the resilience to work through this phase. Sometimes, the resilience could be found, and sometimes, it was elusive.\nCome, let`s get together and share our life moments, of the ups and downs, and everything in between. And watch our actors bring the stories alive on stage, on-the-spot!\nPlayback Theatre - Magical, creative, thought-provoking, reflective, unscripted...just like life itself. A format of improvisational, interactive theatre where the actors will play back your real-life stories on-the-spot, in an authentic and respectful manner, using text, poetry, movement, metaphors, music and more!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1010",
    "image": "https://attagalatta.com/admin/uploads/events/1827607451.png",
    "performer": "First Drop Theatre",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-08T16:30:00+05:30",
    "endDate": "2025-03-08T18:00:00+05:30"
  },
  {
    "name": "The AG Lit Sisters - Monthly Book Club",
    "description": "This International Women’s Day, Bengaluru’s literary landscape is set to welcome a unique and empowering initiative—The AG Lit Sisters, a women’s-only, theme-based book club that fosters meaningful conversations, diverse narratives, and a strong sense of sisterhood through literature.\nThe club’s inaugural session will take place on March 8, 2025, from 5-7 PM at Atta Galatta, Bengaluru. The launch theme, \"Women Who Inspire,\" will spotlight books featuring remarkable women—both real and fictional—whose stories have shaped history and literature.\nWhy Join The AG Lit Sisters?\n📚 Curated Themes: Every month, the club explores a new theme that resonates with women’s voices and experiences.\n💬 Engaging Discussions: Going beyond the pages, members will engage in deep, thought-provoking conversations.\n👭 A Literary Sisterhood: A safe, welcoming space for women to connect, share, and grow through books.\n🌍 Diverse Narratives: From contemporary fiction to memoirs and classics, the club embraces varied literary voices.\nJoin the Movement\nThe AG Lit Sisters is more than a book club—it’s a celebration of literature, empowerment, and community. Whether you're looking to expand your reading list, engage in meaningful conversations, or simply connect with fellow book lovers, this is your space.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1021",
    "image": "https://attagalatta.com/admin/uploads/events/934020261.png",
    "performer": "Dr. Chhavi Gandhi Juneja",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-08T17:00:00+05:30",
    "endDate": "2025-03-08T19:00:00+05:30"
  },
  {
    "name": "Open Mic Nights at Atta Galatta - Open Mic",
    "description": "Join us for Open Mic Nights with Pritesh Bhandary, only at Atta Galatta, Indiranagar from 7 PM onwards. 🎙\nEntry Ticket: 250 INR, spot tickets also available!\nFor those of you who wish to perform, please reach the venue 30 minutes ahead of time to register!\nWe are super excited to see you there. 😍",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1022",
    "image": "https://attagalatta.com/admin/uploads/events/188276925.jpeg",
    "performer": "Prithesh Bhandary",
    "keywords": [
      "Performance",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-08T19:00:00+05:30",
    "endDate": "2025-03-08T20:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT887",
    "image": "https://attagalatta.com/admin/uploads/events/10443690.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T07:00:00+05:30",
    "endDate": "2025-03-09T09:30:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1004",
    "image": "https://attagalatta.com/admin/uploads/events/100251032.png",
    "performer": "The Listeners Circle",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-03-09T11:00:00+05:30",
    "endDate": "2025-03-09T13:00:00+05:30"
  },
  {
    "name": "Mindful Moves - Movement Workshop",
    "description": "Mindful Moves is a unique practice founded by Sreya Ridhiban, offering dance movement therapy that focuses on mind-body connection and trauma healing. It provides a safe space to unwind, learn, unlearn, and destress. Each session incorporates sound healing, card pulling, and somatic practices, delivering a holistic approach to mental and physical well-being.\nIn today’s world, prioritizing mental health is as important as physical health. Movement plays a significant role in releasing trauma stored in the body, and Mindful Moves embraces this philosophy. You don’t have to be a dancer to move—this space is for everyone.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1018",
    "image": "https://attagalatta.com/admin/uploads/events/1563966243.png",
    "performer": "Sreya Ridhiban",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-09T12:30:00+05:30",
    "endDate": "2025-03-09T14:00:00+05:30"
  },
  {
    "name": "Chapters Unsealed - Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nSharing your views on favorite books.\nParticipating in the curated discussion.\nVoting for a Monthly Book Read.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT990",
    "image": "https://attagalatta.com/admin/uploads/events/2142861459.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T14:22:00+05:30",
    "endDate": "2025-03-09T17:55:00+05:30"
  },
  {
    "name": "Women of Mahabharata - Storytelling for Children",
    "description": "Women of Mahabharat: A Special Women’s Day Discussion for Children!\nThis Women’s Day, dive into the world of the Mahabharat and explore the fascinating stories of its incredible women! From Draupadi’s fearless defiance to Kunti’s quiet wisdom and Gandhari’s silent strength—these women weren’t just part of the epic, they shaped its course in powerful ways.\nIn this interactive session, we’ll discuss their choices, challenges, and influence on one of the greatest stories ever told. Perfect for all audiences, especially kids above 10, this is a fun and insightful way to celebrate Women’s Day through the lens of mythology!\nCome enjoy your Sunday with us, as we bring these legendary women to life through stories and conversations.\nAnkita, an IIM Kozhikode alumna, is a passionate storyteller with a love for mythology. She enjoys bringing ancient tales to life in a way that’s engaging, thought-provoking, and fun!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1023",
    "image": "https://attagalatta.com/admin/uploads/events/520309364.png",
    "performer": "Ankita Aggarwal",
    "keywords": [
      "Storytelling",
      "Interactive Session"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2025-03-09T14:30:00+05:30",
    "endDate": "2025-03-09T15:30:00+05:30"
  },
  {
    "name": "Gond Art Workshop - Art Workshop",
    "description": "India has a rich tradition of folk arts. The custodians of which are the many tribes that live in the interiors of various states. The Gonds, are the largest Adivasi Community in India and are Dravidian's whose origin can be traced to the pre-Aryan era. They are mainly found in Madhya Pradesh and its surrounding States. The word Gond comes from the Dravidian expression kond, meaning green mountain. In the Gond belief system, besides Bara Deo (Great God), every hill, river, lake, tree, and rock is inhabited by a spirit and therefore sacred. Gond paintings are fascinating, where the artists express their faiths and beliefs, world view, their visual expression and sense of identity, both as a collective, and as individuals. The motifs are further associated with the rich repertoire of the community and strongly show the interactions with the cosmic, natural and social worlds of humans at multiple levels and contexts. Participate in the Gond Painting Workshop, get a chance to appreciate the art form and create you very own Gond Art masterpiece on cartridge sheets with acrylic colours.\nTake away: One complete painting A3 size",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT985",
    "image": "https://attagalatta.com/admin/uploads/events/401686507.png",
    "performer": "Trishna Patnaik",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-09T16:00:00+05:30",
    "endDate": "2025-03-09T19:00:00+05:30"
  },
  {
    "name": "Inheriting Shadows: Children of the Atom - Spoken Word and Performance Poetry",
    "description": "One story. Nine perspectives. Told entirely through poetry.\nHistory is never just one truth. This event brings together nine powerful voices to tell the story of invention, destruction, and inheritance—from the birth of the atomic bomb to the shadows it left behind.\nEinstein hated guns, yet his work led to the deadliest weapon ever.\nOppenheimer built the bomb—but Germany was building one too.\nA pilot sat alone for 12 hours with the bomb. What went through his mind?\nChildren born of radiation—who do they blame? Their ancestors or their enemies?\n9 perspectives. 9 haunting truths.\nSome of Bangalore’s best poets bring them to life.\nTickets cost less than a burger. The story you’ll witness is priceless.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1017",
    "image": "https://attagalatta.com/admin/uploads/events/153247925.png",
    "performer": "Non-Aligned Poets Collective",
    "keywords": [
      "Poetry",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T16:00:00+05:30",
    "endDate": "2025-03-09T18:00:00+05:30"
  },
  {
    "name": "Loud Women - One Minute Theatre Festival 2025",
    "description": "Loud Women is a collection of 35 one-minute pieces performed by 25 women.\nPrepare to ponder, laugh and be entertained!\nCome celebrate Women’s Day with us!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1007",
    "image": "https://attagalatta.com/admin/uploads/events/1379779768.png",
    "performer": "Anita Mithra",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T18:00:00+05:30",
    "endDate": "2025-03-09T19:30:00+05:30"
  },
  {
    "name": "Love Stories from Indian Heritage - Storytelling",
    "description": "Love stories aren’t only about the hero and heroine for love can rarely exist in isolation. Zealous messengers, art and music as mood enhancers, food as aphrodisiacs, taboos and mores – all play a pivotal role in shaping stories of love. Vikram Sridhar and Aparna Jaishankar rummage through the passages of time to bring you various hues of love etched in our heritage through literature, architecture, songs and poetry through the all- encompassing art form of oral storytelling.\nAbout Aparna Jaishankar\nAparna Jaishankar is a Storyteller with a penchant for Indic mythology. She believes that there is no ONE version of any story. Her storytelling performances take a contemporary view of ancient tales. Aparna also works with educators in developing learning perspectives in the classroom and with organisations in building internal narratives.\nAbout Vikram Sridhar \nVikram Sridhar is a Performance Storyteller and theatre practitioner who believes in Storytelling as a strong medium for Conservation and Conversation, which is highly relevant in the modern context. Vikram combines his work and interest in Theatre, Social Work, and Conservation in his Storytelling and has performed for audience of various age groups across India.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT974",
    "image": "https://attagalatta.com/admin/uploads/events/1610460200.png",
    "performer": "Aparna Jaishankar, \nVikram Sridhar,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T19:00:00+05:30",
    "endDate": "2025-03-09T20:00:00+05:30"
  },
  {
    "name": "Qu For Quiz - Quiz",
    "description": "The Qu for Quiz is based on a grid format with the grids formed by topics on one axis and level of difficulty (and hence the points) on the other. The topics could be varied like History, Sports, Music, Literature, Movies and more. A team of two members would get to choose a topic and the level of difficulty and the question would be revealed. The rest of the teams can go for the buzzer if they know the answer. Depending on the number of teams registering, the size of the grid would be decided. \nSAMPLE Qu: 2. The name is inspired by the traditional malt whisky distillation process in which malted barley was mixed by hand with shovels. This labor-intensive process often caused a shoulder injury to workers, causing their arms to hang low. Which brand is named thus?\nGanesh Balakrishnan is an entrepreneur, marketer and creator of terrible dad jokes. His claim to fame is attempting to sell shoes during the pandemic, culminating in a viral Shark Tank \"Down But Not Out\" appearance. He is a collector of useless facts since childhood, and has dabbled in trivia quiz circuits since college. ganesh.flatheads@gmail.com\nKarthik Srinivasan is a pseudo-retired software leader by choice, specializing in innovative ideas to spend time that include organizing cricket leagues at the scale of IPL but for free, staying up to date on latest debates in virtual social groups helmed by family and friends and more on similar lines. emailkarth@gmail.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1026",
    "image": "https://attagalatta.com/admin/uploads/events/1124654186.jpeg",
    "performer": "Ganesh Balakrishnan, \nKarthik Srinivasan,",
    "keywords": [
      "Quiz",
      "Quiz"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-14T19:00:00+05:30",
    "endDate": "2025-03-14T20:00:00+05:30"
  },
  {
    "name": "Poetic Brew - Poetry Meetup",
    "description": "Gather, Poetic Souls, for an afternoon divine, where verses entwine and words intertwine. In this literary realm, hearts open wide, For a Poetry Meet, let passion be our guide.\nInviting all Poetry enthusiasts 📚 to an In-Person Meet where you can indulge in creative poetry writing and reading session. \nEvent Sections:\n1. Icebreaker Extravaganza - Intro yourself & let`s play an interesting fun Game to break ice cubes.\n2. Poet`s Spotlight: Write a poem based on an innovative prompt letting your thoughts engage.\n<-- INTERMISSION: CHILL & CHAT -->\n3. Recital Stage: Take center stage for 5-7 minutes, discuss the verse that`s touched your head. As you share your verse, let passion reign.\n4. Verse of the Month & What Lies Ahead - Vote for the next Poetry Book to read.\n5. Say Butter - Click that Snap button for a group picture.\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolising the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT936",
    "image": "https://attagalatta.com/admin/uploads/events/769771471.png",
    "performer": "Your View On Books",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-15T11:11:00+05:30",
    "endDate": "2025-03-15T17:55:00+05:30"
  },
  {
    "name": "Book Idea to Success - Writing Workshop",
    "description": "Do you have a book idea but don’t know where to start?\nHave you been dreaming of writing a book but feel stuck?\nOr maybe you have a strong gut feeling that your book can be successful—but you`re unsure how to make it happen amidst the messy market?\nJoin \"Book Idea to Success\"—an interactive, activity-based workshop designed to help you craft a winning strategy and turn your book idea into a publishing success!\nIn this workshop, you`ll get introduced to six key areas that will make your book a success. You`ll also go through a proven five-step process to achieve your goal. By the end of this workshop, you’ll have a clear direction and a solid plan to start writing your book with confidence to make it successful.\n📆 Date: 15th March\n⏰ Time: 4:00 - 6:00 PM\n📍 Location: Atta Galatta, Indiranagar\n💰 Investment: 399 Rupees\nRegister now to secure your spot—link is in bio!\nReady to break through your doubts and create a winning strategy for your first book?\nResearch suggests that 81% of people want to write a book, but only 3% start writing, and less than 0.1% successfully publish and sell significant copies.\n👉 Register now and take the first step toward your successful author journey. Experience success alongside other aspiring authors as you unlock the strategies, tools, and confidence to turn your ‘Book Idea into Success’.\nLet’s make your book dream a reality!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1015",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Rudresh Jayaram",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-15T16:00:00+05:30",
    "endDate": "2025-03-15T18:00:00+05:30"
  },
  {
    "name": "TechnoCats - Special Rough Cut Screening",
    "description": "You are cordially invited to a special rough-cut screening of TechnoCats, a documentary that delves into a personal journey of ambition, competition, and the high-stakes in the world of the Indian Institute of Technology (IIT) and the relentless pursuit of success in a fiercely competitive system.\nAt India’s most elite engineering college, ambition is everything—but so is survival. TechnoCats follows 7 students over 7 years, chasing success in a high-stakes environment where winner takes all. Layered with the perspective of an IIT alumnus from 35 years ago, the film paints a portrait of an institution that shapes not just careers, but identities and futures.\nThis is an opportunity to see the film in its rough-cut stage. We’re looking for fresh perspectives—your feedback will help shape the final version. We’re also seeking support to complete the film, whether through funding, studio time, or connections that can help bring TechnoCats to a wider audience.\nYour presence, thoughts, and support—of any kind—would mean a lot to us. Looking forward to sharing this journey with you!\nGautam Sonti is an independent documentary filmmaker, who attempts to unearth stories that are hidden below the surface. Whether it’s the subversion of democracy in a city government, the absurdity of food politics in the country, or the narrowing of young minds in our educational system, his films quietly capture life as it unfolds.  They don’t shout for attention, but invite audiences to pause, observe, and reconsider their positions. You can find out more about his work at gautamsonti.com\nOver the last 4 decades or so, Tara Rao graduated from being an architect to working on climate justice and human rights with various organisations, including Amnesty and WWF in Asia, Africa and Europe. As a campaigner though, the visual side of communication became more critical and exciting for her. That experience served her well when she led GoodPitch Karnataka - a process involving multiple people and initiatives shaping impactful communication through film to further a cause. Today the richness of possibilities and the deepening challenges keep her on her toes and buzzing.  www.ourgroundworks.org",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1027",
    "image": "https://attagalatta.com/admin/uploads/events/1648779447.jpeg",
    "performer": "Gautam Sonti, \nTara Rao,",
    "keywords": [
      "Film",
      "Screening"
    ],
    "@type": "ScreeningEvent",
    "startDate": "2025-03-15T18:00:00+05:30",
    "endDate": "2025-03-15T19:00:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "Join us for a cozy, creative space where you can unplug, connect, and just be. This meetup is all about chill vibes—no agenda, no pressure. 🖍️✨\nWhether it’s your first time or your fourth, come as you are—dive into your own project or simply soak up the wholesome atmosphere. Each meetup has brought inspiring moments and wonderful people, and we’re excited to share it all again! 💜\nThere are 15 spots available, and this meetup is exclusively for LGBTQIA+ folks. Neurospicy and neurotypical folks are all welcome. 🌈🎨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT878",
    "image": "https://attagalatta.com/admin/uploads/events/1136766814.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-03-16T14:00:00+05:30",
    "endDate": "2025-03-16T17:00:00+05:30"
  },
  {
    "name": "Beat by Beat - Music Based Wellness Workshop",
    "description": "🎶 Beat by Beat 🎶\nA rhythmic journey of self-discovery, reflection, and celebration!\nJoin a Happiness Coach, Life Coach and a Music Facilitator for a fun, immersive musical experience designed to ignite self-awareness and joy. Feel the rhythm, embrace the moment, and walk away with renewed energy and clarity.\nNo musical skills needed—just bring your enthusiasm and an open mind!\n✨ Limited spots available—confirm yours now✨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1028",
    "image": "https://attagalatta.com/admin/uploads/events/410486648.jpg",
    "performer": "Ketki Anand, \nSunita Jose,",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-16T16:00:00+05:30",
    "endDate": "2025-03-16T18:00:00+05:30"
  },
  {
    "name": "Art Jamming with Little Boto Project - Group Meetup",
    "description": "Art Jamming with Little Boto Project – A Creative Escape!\nStep into a world of colors, creativity, and conversations at Little Boto Project’s Art Jamming Event! \nWhether you’re a seasoned artist or just love to doodle, this event is designed for everyone to relax, explore, and express themselves through art.\nAbout Little Boto Project & Vishwa Sindhuri\nFounded by Vishwa Sindhuri, artist at heart and a textile designer (NID alumna) and creative educator with experience in India and the US, Little Boto Project is a brand that celebrates coloring as a mindful and joyful experience. Known for its beautifully illustrated coloring books for kids and adults, the brand encourages creativity, self-expression, and relaxation through art. Sindhuri`s passion for design and teaching makes this event more than just an art session—it’s an immersive experience in creativity and fun.\nWhat to Expect?\nChoose from three exclusive themes—find the one that inspires you!\nExperiment with watercolors, pencils, and crayons—mix and match as you like!\nNo rules, no judgment—just pure fun, creativity, and self-expression!\nMeet like-minded people, share stories, and create something beautiful together.\nTAKE AWAY: Coloring book you choose and a beginner watercolor set.\nThis isn’t just about art—it’s about living the moment, making memories, and having a great time with colors, conversations, and creativity.\nJoin us for a fun-filled session where art meets joy. Let’s color, gossip, and create magic! 🌈🎨✨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1012",
    "image": "https://attagalatta.com/admin/uploads/events/1431361921.png",
    "performer": "Little Boto Project, \nSindhu Nethi,",
    "keywords": [
      "Art",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-16T17:45:00+05:30",
    "endDate": "2025-03-16T19:15:00+05:30"
  },
  {
    "name": "Fresh Violence - Stand-Up Special",
    "description": "Our country is as beautiful as it is brutal. Punit Pania takes an unflinching look at the violence and apathy that seem to be as much a part of our identities as our diversity.\nIn this latest stand-up special, Punit takes the audience on a tour across our great land through the eyes of a hopeful artist and a veteran writer.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1025",
    "image": "https://attagalatta.com/admin/uploads/events/327247044.png",
    "performer": "Punit Pania",
    "keywords": [
      "Standup Comedy",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-16T18:00:00+05:30",
    "endDate": "2025-03-16T19:00:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nMarch Read: Mangifera indica by Sopan Joshi\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1016",
    "image": "https://attagalatta.com/admin/uploads/events/1368683893.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-23T11:00:00+05:30",
    "endDate": "2025-03-23T13:00:00+05:30"
  },
  {
    "name": "Chapter Carnival - Library Meetup",
    "description": "Atta Galatta and Your View On Books, A Novel Club cordially invite you to the latest Library Meetup in town.\nJoin us for a innovative Library Meet wherein there`s over hundreds of books and you could pick a book in random and start reading together.\nHave an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nCome along with Empty Minds and fill it with rich literature from Atta Galatta’s Reading Section.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nReading minimum one chapter from a random book that you choose from the libary.\nParticipating in the ensuing curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT991",
    "image": "https://attagalatta.com/admin/uploads/events/830714749.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-23T11:11:00+05:30",
    "endDate": "2025-03-23T14:22:00+05:30"
  },
  {
    "name": "Thus Spake Shoorpanakha, So Said Shakuni - Theatre Performance",
    "description": "The protagonists, a man and a woman, are both waiting for a delayed flight in a small-town airport lounge. The woman provokes the man into conversation, setting of a series of narratives that feature two characters from the Ramayana and the Mahabharata: Shoorpanakha and Shakuni. Their lives and experiences are set in the context of this century, indicating that the stories of power, ambition and revenge span history and myth.\nThis script was found in The Drama Library by the Bhasha Centre.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT997",
    "image": "https://attagalatta.com/admin/uploads/events/704698497.jpg",
    "performer": "Jimmy Xavier, \nPoile Sengupta, \nSamragni Dasgupta, \nUrvashi H. V. ,",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "TheatreEvent",
    "startDate": "2025-04-06T19:00:00+05:30",
    "endDate": "2025-04-06T20:00:00+05:30"
  }
]