[
  {
    "name": "Let Poetry Be - Poetry Open Mic by Palgun K. J.",
    "description": "This monthly gathering will see poetry coming to life, through reading, music, art and any other forms of artistic expression, at Atta Galatta. Listeners and performers are all welcome!\nDate: 27th December\nTime: 4pm \nVenue: Atta Galatta, Indiranagar\n \nEvent specifics & submission guidelines –\n1. Theme - Free Verse (any original work)\n2. Works can be original or of other poets, performed live\n3. All languages welcome\n4. Participants can read to music (acoustic instrument/s), dramatise, use props & costumes\n5. Each participant will enjoy 5 minutes of reading time\n6. Kindly submit your poem and name to letpoetrybe@gmail.com on or before 25th Dec midnight. WE WILL NOT ACCEPT ATTACHMENTS OR LINKS. SUBJECT OF YOUR MAIL MUST READ AS 'Entry for-December LPB meet-up'\n7. You may also send entries that are not related to the theme\n8. The event will begin at 4pm sharp and will be held at Atta Galatta. Participants to report not later than 3:45 pm to hear about performance order and meet the host\n9. For any further clarifications, write to us at letpoetrybe@gmail.com\nYou are now welcome to flood our inbox!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1562",
    "image": "https://attagalatta.com/admin/uploads/events/271944344.png",
    "performer": "Palgun KJ",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-27T16:00:00+05:30",
    "endDate": "2025-12-27T18:00:00+05:30"
  },
  {
    "name": "Alchemy with Art - Art Workshop by Harshitha",
    "description": "Atta Galatta presents 'Alchemy with Art' - a creative healing workshop guided by Harshitha on Sunday 28 December 2025 at 11:00 AM. \nIn this second episode of Alchemy with Art, you will be guided through a transformative art session, balancing creative expression and inner work, with the intention of turning your personal pain into power. If this is meant for you, come join and leave empowered for the New Year. \n#AlchemywithArt #creativity #innerwholeness #healingcircle #Bengaluruevents #attagalatta",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1576",
    "image": "https://attagalatta.com/admin/uploads/events/507481152.jpeg",
    "performer": "Harshitha",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-12-28T11:00:00+05:30",
    "endDate": "2025-12-28T13:00:00+05:30"
  },
  {
    "name": "Read A Kitaab - Book club",
    "description": "✨Grab your coffee, your mood, and your 2025 reading wrapup!\nJoin us for Read A Kitaab’s Book Club Meetup — this time, we’re diving in books you’ve read this year. 💭💥\n📍 Atta Galatta, Indira Nagar, Bangalore\n🗓 28 December| Sunday | 5–7 PM\nCentered around a 2025 reading wrap-up, the session invites readers to share, listen, and reflect on the books that shaped their year. 🌈📚",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1575",
    "image": "https://attagalatta.com/admin/uploads/events/1533897228.jpeg",
    "performer": "Read a Kitaab",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-28T17:00:00+05:30",
    "endDate": "2025-12-28T19:00:00+05:30"
  },
  {
    "name": "Soul Climate - Book Launch by Inez Baranay",
    "description": "Atta Galatta is delighted to host the launch of Soul Climate, the latest novel by acclaimed writer Inez Baranay. Inventive in form and rich with historical texture, Soul Climate reimagines the idea of India through the perspective of Turkish intellectual and freedom fighter Halide Edib, who visited Delhi in 1935 to deliver a series of lectures.\nThe novel deftly blends fact and fiction. Edib’s encounters with figures of India’s independence movement, including her conversations with Mahatma Gandhi, unfold alongside the fictional journeys of three young women whose lives are shaped by her words. Through these intertwined narratives, Soul Climate explores enduring questions of nationhood, communalism, idealism, and the ties that connect and divide us.\nInez Baranay, author of nine novels, has long been celebrated for her globally engaged and stylistically innovative work. Her earlier books Neem Dreams and With the Tiger were first published in India to critical acclaim.\nThe launch event will be hosted by Bhumika Anand, Founder and Director of the Bangalore Writers Workshop.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1577",
    "image": "https://attagalatta.com/admin/uploads/events/1586375288.jpg",
    "performer": "Inez Baranay",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-28T18:00:00+05:30",
    "endDate": "2025-12-28T19:00:00+05:30"
  },
  {
    "name": "My Life Closed Twice - Book Launch by Subhashini Kaligotla",
    "description": "Author Subhashini Kaligotla launches her new poetry collection My Life Closed Twice (Copper Coin, 2025), with Jeet Thayil.\nIn My Life Closed Twice, Subhashini Kaligotla charts the long aftermath of grief, and its recursive, obsessive cadences. Drawing on premodern India’s art, literature, and history, through invented forms and received ones, in fragments, litanies, lists, and queries, the poems in this spare volume embody the psychological terrain of the grieving. Two premature deaths are at the heart of the book. Kaligotla writes of their immediate aftereffects and their enduring impact. She braids her voice with voices from India’s past—from the unknown bards of the Sanskrit epics who counsel equanimity in the face of catastrophe to the laments of Ashoka, Bilhana, and Jahangir.\r\n \nAuthor Bio\nSubhashini Kaligotla is a poet and an art historian of ancient and medieval South Asia. She is author of the poetry collection Bird of the Indian Subcontinent and the monograph Shiva’s Waterfront Temples. She teaches at Columbia, dividing her time between New York City and Hyderabad.\r\n \nAdvance Praise for My Life Closed Twice\nSubhashini Kaligotla’s ingeniously fashioned poetic structures—which are light, flexible, delicate yet possessed of remarkable tensile strength and architectural clarity and integrity—aren’t just beautiful in themselves. They’re also vessels for deep imaginative feeling and thinking and wondering and longing. She has a unique, compelling lyric voice and a distinguished twenty-first century consciousness.\n- Vijay Seshadri\nAnger, denial, bargaining, despair, all the stages of grief except acceptance, each stage overlaid with the forensic precision generated by love when it has nowhere to go. These enraged, laceratingly plainspoken poems burn with the singular self-awareness that is the writer's curse, and the writer's gift. Two deaths enclose the book like 'two dates // enclosed / by parentheses'. It is impossible to read, say, 'Only Your Brother Will You Lose' – its fifty shards hammered into the flesh like fifty nine-inch nails – and come away unscathed. \n- Jeet Thayil",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1573",
    "image": "https://attagalatta.com/admin/uploads/events/537483135.jpg",
    "performer": "Subhashini Kaligotla",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-28T18:30:00+05:30",
    "endDate": "2025-12-28T19:30:00+05:30"
  },
  {
    "name": "Food & Beverage Founder's Meet - Meetup by Bindu Rao",
    "description": "Calling all the Founders, Creators and Innovators in the Healthy eating space. This meet-up is designed exclusively to forge meaningful collaborations and connections worth your time.\nEvent Schedule:\n1) Introductions: 3 minutes per brand and it must cover your name, designation, brand name & how can you help others? (60 minutes)\n2) Snacks Break and Networking (30 minutes)\n3) Guided knowledge sharing about flea markets, getting connects for packaging, food consultants, recipe developers, sourcing candidates and collaborating on content and curations for mutual growth on social media. (35 minutes)\n4) Photography, Videography for Social Media (25 minutes)\nBindu Rao is a stand-up comedian turned food content creator and event coordinator who has conducted more than 1200 events across stand-up comedy, performance arts, food walks, founders only meets for the health conscious and beverage walks with Drickle Coffee (formerly Bonomi).\n- Ticket is inclusive of veg & gluten free food, we start and end on time for the event.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1578",
    "image": "https://attagalatta.com/admin/uploads/events/529755518.png",
    "performer": "Bindu Rao",
    "keywords": [
      "Business",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-03T11:00:00+05:30",
    "endDate": "2026-01-03T13:00:00+05:30"
  }
]