[
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nNovember Read: Whose Samosa is it Anyway? The Story of Where “Indian” Food Really Came From by Sonal Ved\nWe assure you that you will relish every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT794",
    "image": "https://attagalatta.com/admin/uploads/events/1512218646.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-23T11:00:00+05:30",
    "endDate": "2024-11-23T13:00:00+05:30"
  },
  {
    "name": "Pawsitive Pals - 3 Day Animal Welfare Bootcamp",
    "description": "Are you ready to make a difference in the lives of animals while having an unforgettable experience? EnvokeSR, in collaboration with Nexus Consulting—the brilliant minds behind the research for Kaun Banega Crorepati (KBC)—and Second Chance Sanctuary-an NGO doing tremendous work in the field of rescue and rehabilitation in Bangalore, invites you to a transformative 3-day Animal Welfare Bootcamp!\nWhy You Shouldn`t Miss This Event\nInteractive Learning\nDay 1: Dive into engaging games and puzzles crafted by Nexus Consulting. Explore vital topics like responsible pet parenting, human-animal conflict, and more in a fun, interactive setting.\nMeet members of the experienced SCS Team\nDay 2: Connect with the team at Second Chance Sanctuary. Learn about the challenges in animal welfare and unleash your creativity with DIY activities—craft toys and accessories for shelter dogs!\nBe the Change Maker\nDay 3: Roll up your sleeves! Organize an adoption drive, groom and walk the dogs, and add a splash of color by painting their kennels.\nFull Schedule\n23rd November, Saturday - 11 AM to 1 PM at Atta Galatta\n24th November, Sunday - 2 PM to 4 PM at Atta Galatta\n30th November, Saturday - 11 AM onwards at Second Chance Sanctuary\nWhat You`ll Gain\nLeadership & Teamwork: Collaborate with like-minded peers.\nEmpathy & Social Awareness: Understand the nuances of animal welfare, build empathy, and increase social awareness.\nCommunity Service Hours: Enhance your portfolio for future endeavors.\nPLEASE NOTE: One ticket purchased entitles you to attend all three sessions on 23rd, 24th and 30th November. Please call 9632510126 in case you have any queries!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT828",
    "image": "https://attagalatta.com/admin/uploads/events/809729830.png",
    "performer": "EnvokeSR, \nNexus Consulting, \nSecond Chance Sanctuary,",
    "keywords": [
      "Animals",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-23T11:00:00+05:30",
    "endDate": "2024-11-23T13:00:00+05:30"
  },
  {
    "name": "Chapters Unsealed 5.0 - Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nBring along your favorite book and delve into a shared reading experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nSharing your views on favorite books.\nParticipating in the curated discussion.\nVoting for a Monthly Book Read.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT830",
    "image": "https://attagalatta.com/admin/uploads/events/2010494229.jpeg",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-23T11:11:00+05:30",
    "endDate": "2024-11-23T14:22:00+05:30"
  },
  {
    "name": "Mohiniyattam X - Fusion Dance Performance",
    "description": "Calling all lovely people , from the youngest to eldest! join us for Mohiniyattam X! It is to eXperince, eXplore and eXpress Mohiniyattam! get ready for an unforgettable adventure with Mohiniyattam X! The city’s finest Mohiniyattam school, Taamara dance centre & its mentor Shruthi KP bring to you a uniquely crafted event of Mohiniyattam\nHere’s what’s in store:\nStorytelling\nClassical Dance Performances\nInteractive Demonstration\nMaking a souvenir\nDon`t miss out – join us!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT835",
    "image": "https://attagalatta.com/admin/uploads/events/1951514718.png",
    "performer": "Shruthi K.P.",
    "keywords": [
      "Dance",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-23T13:30:00+05:30",
    "endDate": "2024-11-23T14:30:00+05:30"
  },
  {
    "name": "The Write Step - Writers Group",
    "description": "The Write Step is a writers’ support group that hopes to foster and grow a community of writers who meet once a month to talk about the myriad aspects of writing. Writers in the making who haven’t published or written yet are most welcome. The aim is to devise a support group that sparks creativity.\nWhile each meeting will be around a certain predefined subject matter pertaining to the craft, there will be time set aside for the group to address individual queries.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT834",
    "image": "https://attagalatta.com/admin/uploads/events/784492195.png",
    "performer": "Nandita Bose",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-23T14:00:00+05:30",
    "endDate": "2024-11-23T16:00:00+05:30"
  },
  {
    "name": "Let Poetry Be - Poetry Open Mic",
    "description": "This monthly gathering will see poetry coming to life, through reading, music, art and any other forms of artistic expression, at Atta Galatta. Listeners and performers are all welcome!\n \nDate: 23rd November\nTime: 4pm sharp\nVenue: Atta Galatta, Indiranagar\nEvent specifics & submission guidelines –\n1. Theme - “We Are Our Memories”\n2. Works can be original or of other poets, performed live\n3. All languages welcome\n4. Participants can read to music (acoustic instrument/s), dramatise, use props & costumes\n5. Each participant will enjoy 5 minutes of reading time\n6. Kindly submit your poem and name to letpoetrybe@gmail.com on or before 20th November, midnight. WE WILL NOT ACCEPT ATTACHMENTS OR LINKS. SUBJECT OF YOUR MAIL MUST READ AS 'Entry for - We Are Our Memories'\n7. You may also send entries that are not related to the theme\n8. The event will begin at 4pm sharp and will be held at Atta Galatta. Participants to report not later than 3:45 pm to hear about performance order and meet the host\n9. For any further clarifications, write to us at letpoetrybe@gmail.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT833",
    "image": "https://attagalatta.com/admin/uploads/events/188151063.jpeg",
    "performer": "Palgun KJ",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-23T16:00:00+05:30",
    "endDate": "2024-11-23T18:00:00+05:30"
  },
  {
    "name": "No Pride In Genocide - Film Screening",
    "description": "About the Screening: Join us for Filmistin’s \"No Pride in Genocide\". A screening of short films that bring to light the lives of queer Palestinians while also exposing the reality of Israel’s pinkwashing. This will be the first time this screening is being held in India, after having travelled through six countries. \nThe screening will be followed by a fundraiser and discussion, the panel for which includes Arvind Narrain and Collective's Twisha Mehta.\nAbout the Films:\nSultana’s Reign by Hadi Moussally\nSynopsis: This film introduces Sultana of New York, a Palestinian drag queen, performer, and artist. It opens with Sultana in conversation with Jordanian artist RIDIKKULUZ as she is being painted. Reflecting on her journey through Jordan, Egypt, Lebanon, and finally to New York, Sultana shares her experiences of performing drag in conservative societies, her nostalgia for the glamour of Egyptian cinema, and her unwavering commitment to embracing her identity as a performer.\n\r\nBleeding By Moaad Ghadir\nDuring the director’s childhood, he experienced heavy bleeding that felt like an abortion. His parents took him to a specialist and that was that. All these years the memory remained. Did it really happen?\n\r\nClosing Documentary Pinkwashing Exposed: Seattle Fights Back! by Dean Spade\nSynopsis: This documentary examines the term \"pinkwashing,\" a strategy used by countries with serious human rights violations to promote themselves as \"gay-friendly.\" Focusing on Israel's efforts to distract from its abuses against Palestinians, the film delves into the response from Pacific Northwestern activists to a pinkwashing tour funded by the Israeli Consulate. It highlights the significant backlash against this propaganda and the activism that emerged in Seattle to counter these narratives.\n\r\nAbout Filmistin Collective:\nFilmistin is a collective founded in March 2024 dedicated to organizing screenings of short films by Palestinian filmmakers and artists. The founding members and core organizers until today are Deena Arouk, Mahdi Baraghithi, and Alexander Ephrussi, and together they have organized 13 events in the first 5 months of our collective alone spanning over 6 countries (US, France, Germany, Switzerland, Belgium, Italy). Their purpose is double, to create a space for Palestinian film, a medium that they consider essential both for its artistic and informative value and to raise money for families in Gaza. This screening is being organised in collaboration with the coalition Bengaluru For Justice and Peace.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT836",
    "image": "https://attagalatta.com/admin/uploads/events/1785354273.jpeg",
    "performer": "Filmistin",
    "keywords": [
      "Film",
      "Screening"
    ],
    "@type": "ScreeningEvent",
    "startDate": "2024-11-23T16:00:00+05:30",
    "endDate": "2024-11-23T19:00:00+05:30"
  },
  {
    "name": "Nearly Nice Guy - Stand-Up Comedy Show",
    "description": "After touring all over the country with his \"Pure Veg Jokes\", India’s most viral English standup comic Saikiran is back with his brand new Stand-up comedy solo “NEARLY NICE GUY”. In this show he explores Why am I like this? Is it the genes or the lack of means? This show will spill the beans.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT826",
    "image": "https://attagalatta.com/admin/uploads/events/1818669170.png",
    "performer": "Sai Kiran",
    "keywords": [
      "Standup Comedy",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-23T18:00:00+05:30",
    "endDate": "2024-11-23T19:00:00+05:30"
  },
  {
    "name": "The Wonderful Calligraphy of Poosapati Parameshwar Raju - Exclusive Meet and Greet",
    "description": "Atta Galatta invites you to a Meet-and-Greet - The Wonderful Calligraphy of Poosapati Parameshwar Raju Authored by Koeli Mukherjee Ghose\nJoin us for an intimate gathering with the artist and the author as they unveil their journey into the world of calligraphy and art. Discover the intricacies of blending tradition and modernity, captured beautifully in this remarkable book.\n📅 Date: Sunday, 24th November 2024\n🕚 Time: 11:00 AM\n📍 Venue: Atta Galatta, Bengaluru\nEnjoy engaging conversations, personalized interactions, and an exclusive opportunity to own a signed copy of this limited-edition book.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT837",
    "image": "https://attagalatta.com/admin/uploads/events/1193928872.jpg",
    "performer": "Koeli Mukherjee Ghose, \nPoosapati Parameshwar Raju,",
    "keywords": [
      "Books",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-24T11:00:00+05:30",
    "endDate": "2024-11-24T13:00:00+05:30"
  },
  {
    "name": "Claim Your Space: Expand Your Personal Space - Wellness Workshop",
    "description": "We nonverbally send signals that tell others how comfortable we are in our bodies and in our surroundings.\nOur level of confidence is on display for all to see and feel. One way we convey confidence or lack of it is by CLAIMING OUR SPACE.\nThis workshop is to expand your power and awareness beyond your own personal space and fill the area around you with your presence to open yourself to deeper connection with yourself and the world outside.\nWe will be using tools and techniques of life coaching like body and mind work, embodiment and how to set boundaries for one serve for owning our power and expanding our potential.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT831",
    "image": "https://attagalatta.com/admin/uploads/events/1107470015.jpg",
    "performer": "Rachana Nagranee",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-24T12:00:00+05:30",
    "endDate": "2024-11-24T14:00:00+05:30"
  },
  {
    "name": "Pawsitive Pals - 3 Day Animal Welfare Bootcamp",
    "description": "Are you ready to make a difference in the lives of animals while having an unforgettable experience? EnvokeSR, in collaboration with Nexus Consulting—the brilliant minds behind the research for Kaun Banega Crorepati (KBC)—and Second Chance Sanctuary-an NGO doing tremendous work in the field of rescue and rehabilitation in Bangalore, invites you to a transformative 3-day Animal Welfare Bootcamp!\nWhy You Shouldn`t Miss This Event\nInteractive Learning\nDay 1: Dive into engaging games and puzzles crafted by Nexus Consulting. Explore vital topics like responsible pet parenting, human-animal conflict, and more in a fun, interactive setting.\nMeet members of the experienced SCS Team\nDay 2: Connect with the team at Second Chance Sanctuary. Learn about the challenges in animal welfare and unleash your creativity with DIY activities—craft toys and accessories for shelter dogs!\nBe the Change Maker\nDay 3: Roll up your sleeves! Organize an adoption drive, groom and walk the dogs, and add a splash of color by painting their kennels.\nFull Schedule\n23rd November, Saturday - 11 AM to 1 PM at Atta Galatta\n24th November, Sunday - 2 PM to 4 PM at Atta Galatta\n30th November, Saturday - 11 AM onwards at Second Chance Sanctuary\nWhat You`ll Gain\nLeadership & Teamwork: Collaborate with like-minded peers.\nEmpathy & Social Awareness: Understand the nuances of animal welfare, build empathy, and increase social awareness.\nCommunity Service Hours: Enhance your portfolio for future endeavors.\nPLEASE NOTE: One ticket purchased entitles you to attend all three sessions on 23rd, 24th and 30th November. Please call 9632510126 in case you have any queries!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT828",
    "image": "https://attagalatta.com/admin/uploads/events/809729830.png",
    "performer": "EnvokeSR, \nNexus Consulting, \nSecond Chance Sanctuary,",
    "keywords": [
      "Animals",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-24T14:00:00+05:30",
    "endDate": "2024-11-24T13:00:00+05:30"
  },
  {
    "name": "Chapter Carnival 3.0 - Library Meetup",
    "description": "Atta Galatta and Your View On Books, A Novel Club cordially invite you to the latest Library Meetup in town.\nJoin us for a innovative Library Meet wherein there`s over hundreds of books and you could pick a book in random and start reading together.\nHave an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nCome along with Empty Minds and fill it with rich literature from Atta Galatta’s Reading Section.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nReading minimum one chapter from a random book that you choose from the libary.\nParticipating in the ensuing curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT832",
    "image": "https://attagalatta.com/admin/uploads/events/357711138.jpeg",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-24T14:22:00+05:30",
    "endDate": "2024-11-24T17:55:00+05:30"
  },
  {
    "name": "The Colony Brats - Book Launch",
    "description": "Experience the Exclusive Launch of The Colony Brats, a Coming-of-Age Comedy-Drama by Vineed P Menon!\nHi, I’m Niv, though my parents named me Nivrutti Nandan Nedumpilly Nair—yeah, I know, what a ridiculous name. But trust me, the name is nothing compared to the ridiculousness of my life. And here’s why we call ourselves brats in Sawalpur, a town dominated by the cement plant:\n\nAs children of wage board workers, we faced injustice and weren’t allowed to enter the officers’ colony. But I had the guts to sneak into my girlfriend’s quarters—don’t ask why.\nMy best friend, Baiju, had the audacity to have an affair—sorry, a relationship—with the colony’s schoolteacher.\nOur so-called ordinary life was filled with mischief, adventures, and escapades.\nOur shift to an ultra-ordinary life came with reckless schemes and acts of revenge, making the lives of the factory officers, who took their privilege a bit too literally, a living hell—just to prove our worth.\nMy problem? I take things to heart and always make sure to get back at those who hurt me. This time, it was the cement company that wronged me, and I made sure to give back royally.\n\nRead The Colony Brats to learn how not to screw up your life—and everyone else's—with vengeance. Get ready to laugh, cry, and rethink everything as you follow our journey from innocent kids to not-so-innocent troublemaking adults. Outrage can turn your world upside down, and our story is living proof of that.\nThe Invite\nHey there! Niv here. Curious about me, my best friend Baiju, and the chaotic world of our cement colony in Sawalpur? Join us at Atta Galatta on 30th November at 6:30 pm. Trust me—you won’t want to miss the laughs, the drama, and all the mayhem in between.\nAnd here’s the kicker: you’ll meet the mastermind behind all this—our storyteller and certified troublemaker, Vineed P. Menon! He’s more than just a writer, let me tell you. He’s written and directed over eight original plays, including That Night and Family Ke Side Effects, along with short films like First Sin, Interfere, and Ring Road that even made the Dadasaheb Phalke Awards take notice. Oh, and he’s also the co-writer of the Assamese film Birangana Xaadhani (currently in post-production). And if that’s not enough, he’s also a seasoned Training Manager—though I’ve got a few “training” stories of my own he wouldn’t dare share!\nSo, whether you're here for the stories, the laughs, or just to see what kind of madness unfolds, be there. You won’t regret it—well, at least not as much as the cement company regrets messing with me!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT827",
    "image": "https://attagalatta.com/admin/uploads/events/1907161670.png",
    "performer": "Vineedh Menon",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-30T18:30:00+05:30",
    "endDate": "2024-11-30T19:30:00+05:30"
  },
  {
    "name": "All-In: The Moments - Improv Comedy Show",
    "description": "9 improvisers take over the stage without any script. A few prompts from the audience are all that they want. Can they make things funny? Can they even come up with a story? They have 1.5 hours to prove.\nWhat is improv?\nImprov is not a play, there’s no script. It is also not standup, there are no tried and tested jokes. It is somewhere in between these two things. You’ll have to come to find out!\nWhy should you attend?\n\nYou are part of the script - your prompts will decide where the show will go\nYou can bring a date for a cool show\nYou can tell your Instagram friends that you attended a cool show",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT821",
    "image": "https://attagalatta.com/admin/uploads/events/1795373959.png",
    "performer": "All In Improv",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-21T17:30:00+05:30",
    "endDate": "2024-12-21T19:00:00+05:30"
  }
]