[
  {
    "name": "Gypsy's Run on Wednesday - Book Reading",
    "description": "Enjoy a book reading and interactive session with author May Zareah. She is the author of Vodka Sambar and her second book ‘Gypsy’s Run on Wednesday’ has just been launched. Do come for an insightful session on how to get your bread, butter and biriyani, and relish a world of books!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT651",
    "image": "https://attagalatta.com/admin/uploads/events/2097929669.jpg",
    "performer": "Mary Zareah",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-10T17:30:00+05:30",
    "endDate": "2024-08-10T18:30:00+05:30"
  },
  {
    "name": "Kuch Kehta Hai Yeh Saawan - Kannada, Hindi and Marathi Music Performance",
    "description": "The Trio singing group will present an evening of soulful woven tunes, film compositions celebrating monsoon season, infused with poetry through this curated concert providing a holistic and culturally enriching experience. They will be accompanied by Rohit Kumar, leading Keyboard artist.        \nWatch the best of field perform live, feel the vibrations of music being in the same space as the performers and witnessing the expressions create a thrilling experience for all. Listen to the unheard gems featuring monsoon songs, anecdotes, trivia and poetry and immerse yourselves in a captivating musical experience, that showcases talent and artistry of featured musicians. This group showcases the versatility and creativity of musicians who skilfully incorporate freshness in their singing, bringing a new perspective to familiar/unheard tunes. It's an artistic exploration and a deeper understanding of the interplay between tradition and innovation in music.\nPratibha Kulkarni - is an Indian playback singer and a voice over artist. She is a trained Hindustani artist and has rendered several Kannada film songs and has recorded songs for many albums in multiple Indian languages including Hindi, Marathi, Kannada, Gujrati, Rajasthani and Sanskrit. \nRajeev Anand - is a professional singer and a performer. He has performed over 400+ shows in and around Bangalore till date.\nKunal Kushwaha - is a popular singer among club gigs and has been regularly performing all over Bangalore since many years.\nRohit Kumar - Leading Keyboard Artist who has delivered fantastic music across all concerts in Bangalore music circuit today.\nDr. Kavita - Anchor, Actress by passion and Doctor by profession who's been anchoring several leading concerts and events.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT509",
    "image": "https://attagalatta.com/admin/uploads/events/410636282.png",
    "performer": "Kunal Kushwaha, \nPratibha Kulkarni, \nRajeev Anand, \nRohit Kumar,",
    "keywords": [
      "Music",
      "Performance"
    ],
    "@type": "MusicEvent",
    "startDate": "2024-08-10T19:00:00+05:30",
    "endDate": "2024-08-10T21:00:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Listener's Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other's experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT644",
    "image": "https://attagalatta.com/admin/uploads/events/507165536.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Wellness and Health",
      "Support Group"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-11T17:00:00+05:30",
    "endDate": "2024-08-11T19:00:00+05:30"
  },
  {
    "name": "Chapter Carnival 2.0 - Literary Meetup",
    "description": "Atta Galatta and Your View On Books, A Novel Club cordially invite you to the latest Library Meetup in town.\nJoin us for a innovative Library Meet wherein there`s over hundreds of books and you could pick a book in random and start reading together.\nHave an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nCome along with Empty Minds and fill it with rich literature from Atta Galatta’s Reading Section.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nReading minimum one chapter from a random book that you choose from the libary.\nParticipating in the ensuing curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT645",
    "image": "https://attagalatta.com/admin/uploads/events/1677113111.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-17T11:11:00+05:30",
    "endDate": "2024-08-17T14:22:00+05:30"
  },
  {
    "name": "Don't Stop Acting 1.0 - Acting Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Acting Workshop in town. \nJoin fellow aspiring actors and actresses for an inspiring session of learning acting through basics at our Writers Club Meet event in the cozy ambiance of the library cafe. Our Acting workshop is designed for aspiring artists who wish to explore the fundamentals of acting and develop their performance skills in a supportive and engaging environment. This immersive workshop offers participants a thorough grounding in acting techniques, character development, and scene work, providing them with the tools needed to bring authenticity and depth to their performances.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no acting experience, as well as intermediate actors looking to refresh their skills. It is also suitable for anyone interested in improving their public speaking and presentation abilities.\nWorkshop Objectives:\n- To introduce participants to the basic principles of acting.\n- To develop participants` abilities to create believable and compelling characters.\n- To enhance participants` skills in scene study and script analysis.\n- To build participants` confidence in performing in front of an audience.\nKey Components involves learning theory and practicals of: \n- Acting Techniques\n- Character Development and Analysis\n- SCript Analysis and Interpretation\n- Understanding Director`s Vision\n- Conveying Emotions\n- Physicality and Movement of Camera\n- Improvization and Spontaneity\n- Voice and Diction\n- Working with Props and Costumes\n- Rehearsals and Performances\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Participating in workshop with enthusiasm.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT646",
    "image": "https://attagalatta.com/admin/uploads/events/219029336.png",
    "performer": "MWM Movies",
    "keywords": [
      "Theatre",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-08-24T11:11:00+05:30",
    "endDate": "2024-08-24T14:22:00+05:30"
  },
  {
    "name": "Keepsake: A Short Story Collection - Book Signing",
    "description": "Join us for author Neha Gupta's book signing at Atta Galatta on 24th August, Saturday, at 3.30 PM, where she will be signing copies of her short story collection, Keepsake.\n“Life gives us stories to tell!”\nOld photographs, cherished letters, museums, flea markets and heirlooms. From the pressed flowers between the pages of a forgotten book to the humming of a vintage song, from nostalgic daydreams to soulful conversations, the art of keeping memories forever. Just like moments in life, some stories are light-hearted and some intense, each having a heart of its own. Keepsake is a beautiful collection of memories lived and remembered. \nCelebrating nostalgia and storytelling with a cup of tea and conversations.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT654",
    "image": "https://attagalatta.com/admin/uploads/events/1694388288.jpeg",
    "performer": "Neha Gupta",
    "keywords": [
      "Books",
      "Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-24T15:30:00+05:30",
    "endDate": "2024-08-24T16:30:00+05:30"
  }
]