[
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nOctober Read: A Touch of Salt by Anita Agnihotri. Translated by Arunava Sinha\nWe assure you that you will relish every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT758",
    "image": "https://attagalatta.com/admin/uploads/events/1722056.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-19T11:00:00+05:30",
    "endDate": "2024-10-19T13:00:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT772",
    "image": "https://attagalatta.com/admin/uploads/events/1137465516.jpeg",
    "performer": "The Listeners Circle",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-10-19T11:00:00+05:30",
    "endDate": "2024-10-19T13:00:00+05:30"
  },
  {
    "name": "Don't Stop Acting 2.0 - Acting Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Acting Workshop in town. \nJoin fellow aspiring actors and actresses for an inspiring session of learning acting through basics at our Writers Club Meet event in the cozy ambiance of the library cafe. Our Acting workshop is designed for aspiring artists who wish to explore the fundamentals of acting and develop their performance skills in a supportive and engaging environment. This immersive workshop offers participants a thorough grounding in acting techniques, character development, and scene work, providing them with the tools needed to bring authenticity and depth to their performances.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no acting experience, as well as intermediate actors looking to refresh their skills. It is also suitable for anyone interested in improving their public speaking and presentation abilities.\nWorkshop Objectives:\n- To introduce participants to the basic principles of acting.\n- To develop participants` abilities to create believable and compelling characters.\n- To enhance participants` skills in scene study and script analysis.\n- To build participants` confidence in performing in front of an audience.\nKey Components involves learning theory and practicals of: \n- Acting Techniques\n- Character Development and Analysis\n- SCript Analysis and Interpretation\n- Understanding Director`s Vision\n- Conveying Emotions\n- Physicality and Movement of Camera\n- Improvization and Spontaneity\n- Voice and Diction\n- Working with Props and Costumes\n- Rehearsals and Performances\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Participating in workshop with enthusiasm.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT737",
    "image": "https://attagalatta.com/admin/uploads/events/217366545.png",
    "performer": "MWM Movies",
    "keywords": [
      "Film",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-19T11:11:00+05:30",
    "endDate": "2024-10-19T14:22:00+05:30"
  },
  {
    "name": "Mythology Marvels – Simply Shakti; Tales of the fiercely feminine from Indic Mythology - Storytime for Children and Families",
    "description": "Indic Mythology is full of answers to the many whys of our culture. Join Lavanya Prasad and Meenu Sivaramakrishnan, as they explore and bring forth the marvellous stories from the Indic Mythology through music, dance and theatre.\nThe mother Goddess visits every household in India this October. She is you, she is me, she is us -The fiercely feminine. Join Lavanya Prasad and Meenu Sivaramakrishnan, as they explore this \" Shakhi\" through lesser-known stories from India. Shakthi is celebrated in many ways, of which one is dance. We will end the beautiful story session with a dance from one of the states in India. Join us to get awed at \" Simply Shakthi\" and dance to the joyous tune.\nLooking forward to meeting you all!\nAbout the Storytellers:\nLavanya Prasad & Meenu Sivaramakrishnan are passionate professional storytellers with mutual love for Music and Mythology. Mythology Marvels is their humble attempt to bring to light the treasures from Indian mythology (this time from around the world too) to the children and Families of Bengaluru through music, dance and theatre. Both Lavanya and Meenu run their respective storytelling ventures.\nPlease find more about them here.\nLavanya Prasad : www.talescope.in\nMeenu Sivaramakrishnan : www.kathagalatta.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT773",
    "image": "https://attagalatta.com/admin/uploads/events/2090178962.png",
    "performer": "Lavanya Prasad, \nMeenu Sivaramakrishnan,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-10-19T14:30:00+05:30",
    "endDate": "2024-10-19T15:30:00+05:30"
  },
  {
    "name": "Mehfil 2.0 - Celebrating Gulzar - Poetry Circle",
    "description": "Join us for the second edition of MEHFIL, a monthly event from Aavirbhaav Kaavya Manch, to celebrate the timeless art of poetry. This special afternoon will feature heartfelt recitations and engaging discussions centered around the works of GULZAR. If you are an admirer of Gulzar's verses, this event promises to be a delightful journey through the rich tapestry of poetic expression.\nWe also invite you to share your own (self-written poems), offering a platform for emerging and seasoned poets alike to showcase their talent and creativity. Come, be a part of an afternoon filled with lyrical beauty, thoughtful conversations, and the shared love for the written word. Let your words find a home at this event\nNote: Poetries from languages other than Hindi/Urdu are also welcome",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT774",
    "image": "https://attagalatta.com/admin/uploads/events/1366204967.png",
    "performer": "Aavirbhaav Kaavya Manch",
    "keywords": [
      "Poetry",
      "Poetry Circle"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-19T15:00:00+05:30",
    "endDate": "2024-10-19T17:00:00+05:30"
  },
  {
    "name": "Noor - Theatre Performance",
    "description": "The play - Noor is a reconstruction of the story of Noor Inayat Khan, a direct descendant of Tipu Sultan, who served in Britain’s Special Operations during World War II. It is an extraordinary tale of devotion to duty, resilience in the face of Nazi oppression in France. A fascinating life of a woman who defied all labels in her own quiet way - daughter of a Sufi pacifist who joined the war yet didn`t want to kill anyone, an Indian origin woman who served a country that colonised India, a demure looking woman with extraordinary inner strength. Her story is brought to life as a ‘Courtyard Theatre’ production, a format developed by BLT. A team of two actors who play different characters with very minimal props and sets, lights and sounds.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT759",
    "image": "https://attagalatta.com/admin/uploads/events/621271238.png",
    "performer": "Bangalore Little Theatre",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "TheatreEvent",
    "startDate": "2024-10-19T16:30:00+05:30",
    "endDate": "2024-10-19T17:30:00+05:30"
  },
  {
    "name": "Gallery of Unspoken Tales - Curated Monologue Performances",
    "description": "The Gallery of Unspoken Words is an evening of English monologue performances curated by Bangalore Little Theatre under the mentorship and guidance of Abhay Toshniwal.\nThe theme Unspoken Tales stems from something very internal that we all experience - the things we wished we said in any situation. Many times we hold our silence because of fear, confusion, anger or sadness and often leads to that internal voice which gets trapped in our mind.\nThese monologue performances are to help set those voices and stories free.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT775",
    "image": "https://attagalatta.com/admin/uploads/events/614622114.jpg",
    "performer": "Abhay Toshniwal, \nBangalore Little Theatre,",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-19T19:00:00+05:30",
    "endDate": "2024-10-19T20:30:00+05:30"
  },
  {
    "name": "Dear Me - Inner Child Letter Writing Workshop",
    "description": "Atta Galatta and Dr. Divyanshi warmly invite you to a transformative Inner Child Letter Writing Workshop called \"Dear Me\". \nImagine a time, when you were a kid and felt carefree and full of wonder, unburdened by the weight of the world. We all carry pieces of our childhood within us. We all are simply children with responsibilities. However, sometimes, life experiences can hold us back.\nThrough inner child work you can uncover buried emotions and release old wounds. This Inner Child Letter Writing Workshop is designed to help you reconnect with that part of yourself, guiding you through self-reflection and emotional healing. Learn to let go of the past, embrace self-compassion, and unlock your full potential. Leave feeling lighter, empowered, and ready to move forward with confidence. Our Inner Child Letter Writing Workshop is a unique and nurturing program designed to help participants reconnect with their inner child through the powerful medium of letter writing. This workshop aims to foster self-compassion, inner growth, and a deeper understanding of one`s past experiences, providing a safe space for personal reflection and healing.\nWho Should Attend?\nThis workshop is perfect for anyone above 16 years of age seeking to heal past wounds, foster self-compassion, or explore their inner emotional landscape. It is also suitable for anyone interested in the therapeutic benefits of letter writing. You don`t need any sort of prior experience. \nWorkshop Objectives:\n- To guide participants in reconnecting with their inner child.\n- To develop participants` skills in reflective and expressive writing.\n- To enhance participants` abilities to identify and articulate past experiences.\n- To foster a supportive and compassionate community for personal growth.\nKey Components:\n- Understanding the Inner Child: Delving into the concept and significance of the inner child in healing.\n- Reflective Writing: Techniques and exercises to help participants access and express their inner thoughts and feelings.\n- Guided Letter Writing: Step-by-step guidance on writing compassionate and healing letters to one`s inner child.\n- Sharing and Feedback: Creating a safe space for participants to share their letters and receive supportive feedback.\nWhat Does It Entail:\n- Ice Breaker Activity: Engaging in an introductory exercise to foster connection and openness among participants.\n- Guided Meditation & Visualization: A short session to help participants access a reflective and relaxed state.\n- Letter Writing Session: Composing a heartfelt letter to one`s inner child.\n- Curated Feedback Discussion: Participating in a supportive group discussion to share insights and experiences.\n- Following Community Guidelines: Ensuring a respectful and nurturing environment for all participants.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nONLY 7 SEATS AVAILABLE. The intention is to keep the space as intimate as possible for exclusive experience, comfortable sharing, enhanced space for self-reflection, and personalised attention. \nPlease bring your own journals and pens!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT776",
    "image": "https://attagalatta.com/admin/uploads/events/249848463.png",
    "performer": "Dr. Divyanshi",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-20T11:00:00+05:30",
    "endDate": "2024-10-20T13:00:00+05:30"
  },
  {
    "name": "Hale Bottle Hosa Wine - Kannada Literature Program",
    "description": "Experience the Blend of Old and New at \"Hale Botle and Hosa Wine\" on Sunday, 20th October 2024 at 11:00 AM.\nGet ready to witness a surreal blend of contemporary and senior writers from Kalyana Karnataka. Discover the art of storytelling in the distinctive Kalyana Karnataka style, as these writers captivate readers with their vibrant narratives. This event promises to deliver an unparalleled experience, showcasing the unique vibe of Kannada literature.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT778",
    "image": "https://attagalatta.com/admin/uploads/events/413249747.png",
    "performer": "Hale Bottle Hosa Wine",
    "keywords": [
      "Literary Discussion",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-20T11:00:00+05:30",
    "endDate": "2024-10-20T13:00:00+05:30"
  },
  {
    "name": "Art therapy: Explore your inner universe through art - Art Therapy Workshop",
    "description": "Leaning into creative activities is a proven way to boost our mental wellbeing. Immersing ourselves in activities like drawing, painting, or other creative pursuits enables us to enter a meditative and focused state which calms our heart rate.\nHow about bringing in some calm through art therapy?\nWe invite you to join Vimala MV, an Art Therapist, Mental Health Advocate, and Caregiver Coach, in this in-person session in Bangalore where she helps you explore your inner world through art.\nArt therapy feels like a new language you’ve learned to connect with yourself. It’s like self-talk,” says Vimala.\nWhat to expect in this session:\nArt can permeate the very deepest part of us, where no words exist.\nThis session invites you to have a conversation with yourself through art by visualizing with intent. You will be provided with crayons and sheets of paper. Explore storytelling through a new language of colors and shapes that enriches the process of experiencing emotions in a safe space. \nUntangle your experiences and create unique and meaningful art. Art therapy allows you to practice self-care, grow and heal. \nWhat should I bring to the event?\nCarry an object from home you connect with. Example: an eraser, keys, a comb, a tennis ball, etc.\nThe benefits of art therapy:\nResearch has shown art therapy to \n\nreduce anxiety\nboost self-esteem \nresolve complex emotions\npromote positivity\nimprove connections with loved ones\n\nCome, join in. Paint your world the way you want it to be.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT777",
    "image": "https://attagalatta.com/admin/uploads/events/786244590.png",
    "performer": "MyndStories, \nVimala MV,",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-20T14:00:00+05:30",
    "endDate": "2024-10-20T16:00:00+05:30"
  },
  {
    "name": "Manga Mochas 1.0 - Manga and Comics Fan Meet",
    "description": "Atta Galatta and Your View on Books, Novel Club cordially invite you to the unique Manga Mochas, a fans meet for Comics & Manga readers.\nAre you a Manga maven or a comic connoisseur? Have you ever wanted to share your passion, connect with like-minded enthusiasts, and debate the finer points of your favorite stories? Well, your wait is over!\nCalling all voracious readers of Manga, comics, and graphic novels! Join us for an exhilarating in-person meet-up where you can express YOUR views, discuss your beloved series, and meet fellow aficionados!\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\n \nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolising the conversation.\nEvent Sections:\n1. Icebreaker Extravaganza: Kick things off with a fun game and introduce yourself. Let`s warm up the crowd!\n2. Manga Mochas: Step into the spotlight for 5-7 minutes and share your passion for your favorite Manga or comic. No slides, just pure enthusiasm!\nINTERMISSION: Chill & Chat\n3. Fun & Games: Prepare for laughs with another engaging game.\n4. What’s Next? Discuss and vote on the next Manga, comic, or graphic novel we’ll dive into!\n5. Special Surprise Activity: Stay tuned for an exciting twist!\n6. Photo Op: Say \"cheese\" for our group picture!\nCurated Books for Discussion on Monthly Reads:\n- The Maus Chapter I (Graphic Novel) by Art Spigelman\n- Batman Year One (Comics) by Frank Miller\n- Rave Master (Manga) by Hiro Mashima\n- Saga Volume One (Comics) by Brian K. Vaughan\n- Palestine (Graphic Novel) by Joe Sacco\n- Noragami Volume 1 (Manga) by Adachitoka\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT739",
    "image": "https://attagalatta.com/admin/uploads/events/329144806.png",
    "performer": "MWM Movies",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-20T14:22:00+05:30",
    "endDate": "2024-10-20T17:55:00+05:30"
  },
  {
    "name": "Read A Kitaab - Monthly Book Club",
    "description": "Read A Kitaab is an unbiased community of Readers, Booklovers, writers and artists. We strive to provide the community an ecosystem with an online library, book discussions, author meet, book of the month, monthly meets, newsletters & much more...\nRead A Kitaab is a calm & comfort space to be yourself, to discuss books and life with no bars on age/gender/ethnicity/political views etc.\nJoin us for the August meet on Sunday 20th to discuss what you’re reading, and to swap books! Entry free.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT780",
    "image": "https://attagalatta.com/admin/uploads/events/984013201.jpeg",
    "performer": "Anurag Kothari, \nEkta Bhandari,",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-20T16:00:00+05:30",
    "endDate": "2024-10-20T18:00:00+05:30"
  },
  {
    "name": "Junior Detectives: Mystery Hunters - Session",
    "description": "So you want to be a detective? Do you love reading mystery books? Then put on your thinking caps and get your magnifying glasses ready!\n- Create your own secret codes\n- Learn about fingerprints\n- Test your observation skills\n-Find clues and solve a mystery\nAll participants get one free copy of The Egghead Detective Agency Vol. 1!\nPika Nani is a children’s author based in Bengaluru. Her popular titles include, The Egghead Detective Agency Vol 1 and 2, an interactive chapter book with two little girls and a ghost detective. The Adventures of Shrilok Homeless Vol 1 & 2, an Indian version of Sherlock Holmes set in Mumbai. Little Indians: Stories from across the country, a bestselling fact plus fiction book. Five of her stories appear in school text books by Orient Blackswan and Macmillan.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT754",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Pika Nani",
    "keywords": [
      "Books",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-20T16:30:00+05:30",
    "endDate": "2024-10-20T17:30:00+05:30"
  },
  {
    "name": "Oil Painting Workshop - Painting Workshop",
    "description": "Come, join me for an oil painting workshop. If this is your first dabble with paints, this fun and interactive step by step session is sure to keep you entertained, and provide the guidance for a canvas of your own creation. All the necessary materials will be provided. The only thing that you’re expected to bring along is your enthusiasm and art vibes.\nArt is an expression of the inner self and the world around us as we perceive it. Oil paints provide beautiful rich textures and add depth and substance to the subject.\nThe essence of this session is to get together and create artistic strokes that unite us in a bond of communal love and creativity.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT779",
    "image": "https://attagalatta.com/admin/uploads/events/1580658157.jpeg",
    "performer": "Lavaniya Deepak",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-20T17:00:00+05:30",
    "endDate": "2024-10-20T19:00:00+05:30"
  },
  {
    "name": "Pichwai Art Workshop - Art Workshop",
    "description": "Come, let’s celebrate Krishna and his Leelas through the beautiful art form of Pichwai Paintings. It is a traditional art form that dates back to the 16th century from the city of Nathdwara, Rajasthan. These paintings portray Krishna (Srinath ji) and his leelas through bright and vivid colours.\nPichwai means backdrops, these paintings were used as backdrops mainly in Srinathji Temple at Nathdwara. The paintings are a way for us to connect with the Lord Krishna.\nThis art is soul-satisfying and divine, another art form to start with your basic art skill. You need no prior knowledge of drawing or painting in order to attend this workshop.\nNO TRACING OR COPYING, you will be drawing on your own.\nSrinathji will be taught in this workshop and some of the required basic pichwai motifs.\nNote: All the materials will be provided by the host.\nWhat will you take home?\nKnowledge of Indian Art Culture\nLearn an ancient art form\nCompleted piece of artwork done by yourself\nWhat do you need to bring?\nWater bottle to keep you hydrated.\nThis workshop includes all materials, if required kindly get an Examination Pad / Paper Board also maybe a pro circle if available.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT761",
    "image": "https://attagalatta.com/admin/uploads/events/395599221.png",
    "performer": "Sindhoor Suryavamshi",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-26T11:00:00+05:30",
    "endDate": "2024-10-26T14:00:00+05:30"
  },
  {
    "name": "Gallery of Unspoken Tales - Curated Monologue Performances",
    "description": "The Gallery of Unspoken Words is an evening of English monologue performances curated by Bangalore Little Theatre under the mentorship and guidance of Abhay Toshniwal.\nThe theme Unspoken Tales stems from something very internal that we all experience - the things we wished we said in any situation. Many times we hold our silence because of fear, confusion, anger or sadness and often leads to that internal voice which gets trapped in our mind.\nThese monologue performances are to help set those voices and stories free.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT775",
    "image": "https://attagalatta.com/admin/uploads/events/614622114.jpg",
    "performer": "Abhay Toshniwal, \nBangalore Little Theatre,",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-26T19:00:00+05:30",
    "endDate": "2024-10-26T20:30:00+05:30"
  },
  {
    "name": "Secrets of  Sari Storytelling - Immersive Styling Workshop",
    "description": "Like Bill Waterson-Calvin’s SpaceMan Spiff, if you too nurture an alter ego of becoming a sari storyteller, attend this session. It discusses tips and techniques to refine your sari styling and fashion storytelling. Okay, it does not promise to turn you into a chic sensation overnight, but it can make you mindful of telling your sari style story by managing your fashion image for the world. You can apply the learning to daily life. NOTE: The workshop is for a limited number of participants. We request you to register accordingly. Please carry a sari you love or dislike, your fave journal, and a pen.\nOBJECTIVES\n\nTo help you express your sari fashion identity in a safe circle of listeners.\nTo help you know the ground rules of mindful sari styling for SELF.\nTo help you learn the basics of sari story writing for SELF (read: for social media).\n\nFACILITATOR\nThe session is conducted by Bhawana Pingali, former Fashion Features Editor of FEMINA (Worldwide Media Ltd.—Times of India / BBC Magazines). She is a mother of a teen, has been an editor-educator for the last 19+ years, and is currently authoring a book with PENGUIN. Her articles have appeared in The Hindu, Hindustan Times-Mint Lounge, Time Out, Lonely Planet, Travel + Leisure, Maxim, Orissa Post, Signature-Oman, among others. She has taught at NIFT, Pearl Academy, Symbiosis Institute of Design, CEPT-Ahmedabad, IIM-A, British Council (TEFL-certified trainer), GD Goenka and Ansal Universities. Her heart now lies in teaching yoga, and reviving saris and rituals through fashion research lab REVASTRA.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT764",
    "image": "https://attagalatta.com/admin/uploads/events/583020367.png",
    "performer": "Bhawana Pingali",
    "keywords": [
      "Fashion",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-09T17:00:00+05:30",
    "endDate": "2024-11-09T19:00:00+05:30"
  }
]