[
  {
    "name": "Chapter Carnival 2.0 - Literary Meetup",
    "description": "Atta Galatta and Your View On Books, A Novel Club cordially invite you to the latest Library Meetup in town.\nJoin us for a innovative Library Meet wherein there`s over hundreds of books and you could pick a book in random and start reading together.\nHave an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nCome along with Empty Minds and fill it with rich literature from Atta Galatta’s Reading Section.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nReading minimum one chapter from a random book that you choose from the libary.\nParticipating in the ensuing curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT645",
    "image": "https://attagalatta.com/admin/uploads/events/1677113111.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-17T11:11:00+05:30",
    "endDate": "2024-08-17T14:22:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nAugust Read: Bhog Naivedya: Food Offerings to the Gods by Sujata Shukla Rajan\nWe assure you that you will relish every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT659",
    "image": "https://attagalatta.com/admin/uploads/events/577505300.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books and Literature",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-24T11:00:00+05:30",
    "endDate": "2024-08-24T13:00:00+05:30"
  },
  {
    "name": "Don't Stop Acting 1.0 - Acting Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Acting Workshop in town. \nJoin fellow aspiring actors and actresses for an inspiring session of learning acting through basics at our Writers Club Meet event in the cozy ambiance of the library cafe. Our Acting workshop is designed for aspiring artists who wish to explore the fundamentals of acting and develop their performance skills in a supportive and engaging environment. This immersive workshop offers participants a thorough grounding in acting techniques, character development, and scene work, providing them with the tools needed to bring authenticity and depth to their performances.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no acting experience, as well as intermediate actors looking to refresh their skills. It is also suitable for anyone interested in improving their public speaking and presentation abilities.\nWorkshop Objectives:\n- To introduce participants to the basic principles of acting.\n- To develop participants` abilities to create believable and compelling characters.\n- To enhance participants` skills in scene study and script analysis.\n- To build participants` confidence in performing in front of an audience.\nKey Components involves learning theory and practicals of: \n- Acting Techniques\n- Character Development and Analysis\n- SCript Analysis and Interpretation\n- Understanding Director`s Vision\n- Conveying Emotions\n- Physicality and Movement of Camera\n- Improvization and Spontaneity\n- Voice and Diction\n- Working with Props and Costumes\n- Rehearsals and Performances\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Participating in workshop with enthusiasm.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT646",
    "image": "https://attagalatta.com/admin/uploads/events/219029336.png",
    "performer": "MWM Movies",
    "keywords": [
      "Theatre",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-08-24T11:11:00+05:30",
    "endDate": "2024-08-24T14:22:00+05:30"
  },
  {
    "name": "Keepsake: A Short Story Collection - Book Signing",
    "description": "Join us for author Neha Gupta's book signing at Atta Galatta on 24th August, Saturday, at 3.30 PM, where she will be signing copies of her short story collection, Keepsake.\n“Life gives us stories to tell!”\nOld photographs, cherished letters, museums, flea markets and heirlooms. From the pressed flowers between the pages of a forgotten book to the humming of a vintage song, from nostalgic daydreams to soulful conversations, the art of keeping memories forever. Just like moments in life, some stories are light-hearted and some intense, each having a heart of its own. Keepsake is a beautiful collection of memories lived and remembered. \nCelebrating nostalgia and storytelling with a cup of tea and conversations.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT654",
    "image": "https://attagalatta.com/admin/uploads/events/1694388288.jpeg",
    "performer": "Neha Gupta",
    "keywords": [
      "Books",
      "Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-24T15:30:00+05:30",
    "endDate": "2024-08-24T16:30:00+05:30"
  }
]