[
  {
    "name": "Journal with Art – to Unwind for the Week - Journaling Workshop by Yukti Gtover",
    "description": "Step into a gentle Friday evening space where words and colours come together to help you slow down, play, and reflect—without the weight of overthinking. In this 2-hour workshop, we’ll explore simple journaling prompts, mix in colours and doodles, and create pages that feel like breathing room on paper.\nThis isn’t about being “good” at art or journaling; it’s about showing up for yourself, expressing freely, and discovering how a blend of writing and art can lighten your week. All materials are included—bringing your own journal will make it extra special. You’ll carry home not just pages, but reflections that feel light yet precious, like tiny treasures of clarity.\n📅 Friday, 19th September 2024\n🕔 5:00 – 7:00 p.m.\n📍 Atta Galatta, Indiranagar, Bangalore\n💸 ₹449 (all fun art materials included)\nCome as you are, unwind as you wish. ✨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1407",
    "image": "https://attagalatta.com/admin/uploads/events/695738051.png",
    "performer": "Yukti",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-09-19T17:00:00+05:30",
    "endDate": "2025-09-19T19:00:00+05:30"
  },
  {
    "name": "Food In Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well. So, if viewing the world through the lens of food and literature interests you, then join us for a dialogue on “Food in Literature” and to celebrate those stories and their diversity.\nEach month with Prachi Grover, we read our way through several powerful (and delicious) narratives.\nSeptember Read: India’s Most Legendary Restaurants by Ruth Dsouza Prabhu\nWe assure you that you will enjoy every single bite!\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1388",
    "image": "https://attagalatta.com/admin/uploads/events/2037735032.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-20T11:00:00+05:30",
    "endDate": "2025-09-20T13:00:00+05:30"
  },
  {
    "name": "Leave it to PG - Book Discussion with Lakshmi Sankar and Balu Ambedkar",
    "description": "Sir Pelham Grenville Wodehouse, KBE, was a comic writer who enjoyed enormous popular success during a career of more than seventy years and continues to be widely read. P.GWodehouse is the master of taking things to a painful extreme in terms of humour. \n Let's meet up and create a haven for like- minded souls. The idea is simply to discuss the Blanding series and share our reading anecdotes & enjoyment of it together. A nobleman excessively devoted to a pig is funny enough. But what about if the pig was to be stolen to protect it from another crazy nobleman who likes to throw eggs at the gardener? Let's add to the mayhem and literary chaos . Join us on 20th sept to discuss pigs, tea, peculiar family members and the eccentricities of aristocracy.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1401",
    "image": "https://attagalatta.com/admin/uploads/events/1790814589.jpg",
    "performer": "Lakshmi Sankar",
    "keywords": [
      "Book Discussion",
      "Book Talk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-20T11:00:00+05:30",
    "endDate": "2025-09-20T12:00:00+05:30"
  },
  {
    "name": "Once Upon a Laugh - Storytelling with Vivero Preschool",
    "description": "Get ready for a day of stories and glee, 'ONCE UPON A LAUGH where fun is the key!\r\nKids can enjoy-\n\nCreative Art Corner\nFunky Photobooths\nMusic and Movement\nAnd lots of Storytelling fun!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1417",
    "image": "https://attagalatta.com/admin/uploads/events/1867177367.jpg",
    "performer": "Vivero Preschool",
    "keywords": [
      "Music and Storytelling",
      "Kids"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-20T11:00:00+05:30",
    "endDate": "2025-09-20T12:00:00+05:30"
  },
  {
    "name": "UnBridled - Book Launch by Divya K Unni",
    "description": "UnBridled, a collection of 73 poems, is a compelling narrative that explores the depths of personal and collective freedom and the courage to break boundaries. It is a cocktail of love, lust, longing, belonging, bereavement, betrayal, acceptance, childhood, nostalgia, and homecoming expressed in an unbridled female voice anchored on raw emotions and lyrical prowess. The poet serenades the readers into a world where strength is born from vulnerability.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1416",
    "image": "https://attagalatta.com/admin/uploads/events/1676559892.png",
    "performer": "Divya K Unni",
    "keywords": [
      "Books",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-20T13:30:00+05:30",
    "endDate": "2025-09-20T15:30:00+05:30"
  },
  {
    "name": "The Bougainvillea Circle - Connection Circle by Radhika Ghose",
    "description": "\"Sawubona\" a Zulu Greeting meaning, \"We See You\". At Bougainvillea Circles you are offered a space to be heard, seen, welcomed as you are. A non-judgmental, safe, trusted space where you are free to be all that you want to be. Nothing More, Nothing less. No Restrictions, no judgements, just an intimate group of people looking for a space to be real. A space where we`re all less alone for a little while. Where we are seen, how we want to be seen. Conversations, Connections, Community of Compassion. All that makes the world go round, after Love of course!\nRemember - Sawubona: We See You.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1400",
    "image": "https://attagalatta.com/admin/uploads/events/1919365758.png",
    "performer": "Radhika Ghose",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-20T16:00:00+05:30",
    "endDate": "2025-09-20T17:30:00+05:30"
  },
  {
    "name": "An Evening of Verse and Voice - A celebration of Srividya Sivakumar’s Work",
    "description": "Join us for an intimate celebration of a collection that Rochelle Potkar calls \"a poetic vision that is simultaneously philosophical, political, and deeply personal,\" and that Vinita Agrawal says is \"effulgent with some deep knowledge filtered from a profound wisdom about love, intimacy, womanhood, relationships and parting.\" \nWe are talking about Srividya Sivakumar's new book of poetry, The Soundtrack of My Life - Side B.\nListen in as the poet reads from her work, shares some new pieces, and discusses the whys and why-nots of poetry. \nAbout the poets:\nPoornima Laxmeshwar resides in Bangalore, India. Her books of poetry include ‘Anything but Poetry’ (Writers Workshop), ‘Thirteen’ - a chapbook, (Yavanika Press) and 'Strings Attached', (Red River). She is currently working on fiction and an upcoming prose poetry collection.\nPoet, columnist, and speaker, Dr. Srividya Sivakumar has been a teacher-trainer for twenty-six years, and has published three collections of poetry – The Soundtrack of My Life – Side B, The Blue Note, and The Heart is an Attic.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1394",
    "image": "https://attagalatta.com/admin/uploads/events/1542845358.jpg",
    "performer": "Srividya Sivakumar",
    "keywords": [
      "Book Discussion",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-20T16:30:00+05:30",
    "endDate": "2025-09-20T18:30:00+05:30"
  },
  {
    "name": "Dadi, Dantkatha and the Djinns - Book Launch by Avanti Sopory",
    "description": "Enter a world where winter nights in Kashmir came alive with stories—where grandmothers spun magic through folktales of witches and fairies, wise villagers and wandering djinns. In Dadi, Dantkatha and the Djinns, Avanti Sopory gathers these timeless folktales, preserving the essence of Kashmiri culture and memory. Layered with wisdom and wonder, the collection ensures that the songs of the valley are never lost to silence. As Anupam Kher writes, this book is “worth reading to know about Kashmiri ethos and culture.”",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1419",
    "image": "https://attagalatta.com/admin/uploads/events/1488354147.jpg",
    "performer": "Readomania",
    "keywords": [
      "Book Discussion",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-20T17:00:00+05:30",
    "endDate": "2025-09-20T18:00:00+05:30"
  },
  {
    "name": "AG Lit Sisters - Meetup by Dr. Chhavi",
    "description": "Step into an afternoon of thrill, thought, and storytelling with Manu J, the author of the gripping new psychological thriller The Artist.\nBorn in Thiruvananthapuram, the capital of Kerala (God’s Own Country), Manu grew up fascinated by the world of stories, whether on the pages of books or on the silver screen. A voracious reader and lifelong movie buff, his imagination was shaped by everything from murder mysteries and science fiction to drama and fantasy.\nBy profession, Manu is one of India’s Top 40 Under 40 Data Scientists, teaching machines to do his job and uncover the hidden mysteries that numbers whisper. He often likens it to being a detective; solving puzzles and bringing clarity out of complexity. But when the screens dim, his creative world takes over. The Artist is his foray into weaving psychological suspense with the sharp instincts of a storyteller trained to observe patterns in both life and data.\nAway from data sets and dark plotlines, Manu finds rhythm in music, joy in books, and balance in the company of friends and family. His unique perspective (part scientist, part artist) makes him a rare new voice in Indian literature.\nAt this AG Lit Sisters gathering, Manu will share:\n\nThe making of The Artist and his journey from data science to fiction writing.\nHow reading, cinema, and real-life mysteries shape his storytelling.\nWhat it means to live between two worlds: logic and imagination.\nJoin us at Atta Galatta for an intimate, inspiring conversation with a storyteller who reminds us that both numbers and narratives hold secrets waiting to be uncovered",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1415",
    "image": "https://attagalatta.com/admin/uploads/events/1346113076.png",
    "performer": "Dr. Chhavi Gandhi Juneja",
    "keywords": [
      "Book Discussion",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-21T02:00:00+05:30",
    "endDate": "2025-09-21T04:00:00+05:30"
  },
  {
    "name": "Draw Yourself as a Cartoon Character! - Character Drawing Workshop for Kids",
    "description": "What if your child could see themselves… as a cartoon? 🎨👦👧\nThis fun and interactive workshop is perfect for kids above 5 years. Guided step-by-step, children will learn how to draw a cartoon version of themselves in a playful, creative environment. It’s not about being perfect—it’s about self-expression, imagination, and a whole lot of fun!\nAnd here’s the best part: every child will receive a surprise gift—a personalized caricature badge of themselves to take home! 🎁 A keepsake they’ll cherish and proudly show off.\nNo prior drawing experience needed. Just bring your little artist with crayons or colour pencils (papers will be provided by us) and let them enjoy two hours of creativity and joy.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1370",
    "image": "https://attagalatta.com/admin/uploads/events/2114469178.jpg",
    "performer": "Shruthi Kulkarni, \nTimb,",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-09-21T11:00:00+05:30",
    "endDate": "2025-09-21T13:00:00+05:30"
  },
  {
    "name": "Let's Take up S-P-A-C-E - The Body Banter Club by Vimala",
    "description": "We live in this world\nFat women are just lazy binge-eaters. Skinny men get called twigs. Muscular women get called manly. Shapely men are called feminine. Women with no visible curves are not desirable. It never ends, does it? No matter how we exist, someone will find a way to make you feel wrong. The Body Banter Club would like to address this problem, body shaming.\nWe invite you to offload your cringe stories in a trusting environment on a Sunday afternoon before your lunch plans.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1410",
    "image": "https://attagalatta.com/admin/uploads/events/765799318.jpg",
    "performer": "Vimala",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-21T12:30:00+05:30",
    "endDate": "2025-09-21T13:30:00+05:30"
  },
  {
    "name": "Read a Kitaab - Book Club by Ekta",
    "description": "Join us at Atta Galatta for the Bangalore Book Meetup of Read a Kitaab. The theme for this month is books that feel like a warm hug.\nRegistration is mandatory, please whatsapp the listed number.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1423",
    "image": "https://attagalatta.com/admin/uploads/events/164411702.jpeg",
    "performer": "Ekta Bhandari",
    "keywords": [
      "Books",
      "Book Talk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-21T15:30:00+05:30",
    "endDate": "2025-09-21T17:30:00+05:30"
  },
  {
    "name": "stE=mc - Stem Workshop with Madhuri Katti",
    "description": "Join in for an interactive experiment-led science session by physics educator and writer Madhuri Katti and some of her students. The goal of the session is to show young students and adults a different and engaging way of thinking about science, history of scientific ideas and its effects on everyday life, by exploring fundamental topics via simple home-experiments. The experiments will be of three parts:\n- Fun with Forces: Explanation of the four fundamental forces of nature, and their effects. Demonstration of experiments with gravity and static electricity. \n- Magnets and Motors : construction of a simple motor with a battery, magnet, and copper wire. Discussion of electricity and magnetism.\n- Playing with fluids: demonstrations of dynamics of fluids involving surface tension, and diffusion.\nAt the end, we hope to inspire the participants to be boldly curious and to recognise the importance of science in our everyday lives.\nAge: 10+, with children under 12 needing to be accompanied by a parent",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1402",
    "image": "https://attagalatta.com/admin/uploads/events/1136652504.png",
    "performer": "Madhuri Katti",
    "keywords": [
      "Children",
      "STEM"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-21T16:00:00+05:30",
    "endDate": "2025-09-21T18:00:00+05:30"
  },
  {
    "name": "Bandana Upcycling Meetup - A soft circle by Surili",
    "description": "Slow Fashion meets Mental Wellbeing\nJoin us for a Bandana Upcycling Meetup hosted by Soft Matter at Atta Galatta. A warm space to create, connect, and care. Together, we’ll customise our own bandanas using fabric, patches, colours, beads, and more. Whether you paint, embroider, or experiment freely, all materials will be provided. Alongside making, we’ll gently reflect on what habits we’re currently “upcycling” in our lives, and end by envisioning the kind of community we want to nurture. A Soft Circle to slow down, make friends, and grow healthy habits through creativity and care.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1412",
    "image": "https://attagalatta.com/admin/uploads/events/206565275.png",
    "performer": "Surili",
    "keywords": [
      "Art and Craft",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-21T17:30:00+05:30",
    "endDate": "2025-09-21T19:30:00+05:30"
  },
  {
    "name": "An Evening of Magic - Magic Show by Nakul Shenoy and Friends",
    "description": "An Evening of Magic is a most amazing magic show presented by `Nakul Shenoy & Friends’, featuring top entertainers and magic acts. Curated and hosted by the internationally-acclaimed mentalist Nakul Shenoy, each event in this series brings unique acts and performances by nationally and internationally acclaimed magicians, alongside some of the most notable up-and-coming stars of magic. This is an evening that is truly magical, and one you will want to experience many times over.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1396",
    "image": "https://attagalatta.com/admin/uploads/events/1052556707.jpeg",
    "performer": "Nakul Shenoy",
    "keywords": [
      "magic",
      "Interactive Showcase"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-21T18:00:00+05:30",
    "endDate": "2025-09-21T20:00:00+05:30"
  },
  {
    "name": "Indie Ink 2025 - Bazinega’s Annual ZineFest",
    "description": "Join us for Bazinega’s Annual ZineFest – Indie Ink 2025. Explore zines from across India and the world, join hands-on workshops, listen to artist readings and learn from their creative walkthroughs, dive into panel discussions on independent publishing, and cast your vote at the Indie Ink Zine Awards.\n \nA celebration of creativity, community, and independent voices — this is where stories come alive!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1420",
    "image": "https://attagalatta.com/admin/uploads/events/1254736616.png",
    "performer": "Bazinega",
    "keywords": [
      "Day Long Festival",
      "Day Long Festival"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-26T11:00:00+05:30",
    "endDate": "2025-09-26T19:00:00+05:30"
  },
  {
    "name": "Indie Ink 2025 - Bazinega’s Annual ZineFest",
    "description": "Join us for Bazinega’s Annual ZineFest – Indie Ink 2025. Explore zines from across India and the world, join hands-on workshops, listen to artist readings and learn from their creative walkthroughs, dive into panel discussions on independent publishing, and cast your vote at the Indie Ink Zine Awards.\nA celebration of creativity, community, and independent voices — this is where stories come alive!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1421",
    "image": "https://attagalatta.com/admin/uploads/events/671837236.png",
    "performer": "Bazinega",
    "keywords": [
      "Day Long Festival",
      "Day Long Festival"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-27T11:00:00+05:30",
    "endDate": "2025-09-27T19:00:00+05:30"
  },
  {
    "name": "Redefining Queerscapes — Rhyme and Reclaim - Queerscapes Circle",
    "description": "Hi friend,\nAre you tired of events that force you to perform queerness that doesn't sit with you. Are you forced to enact this day-to-day?  Join us as we play with words and bring stories of self. Come as you are. No performativity.\nit's a circle for reclaiming ourselves—our bodies, our stories, our truths—using the fierce magic of poetry and play.\nHere’s how we’ll move:\n• Listening Circle: Bring your whole self—everything about your bodies you’ve been holding close or wrestling with. We hold space with care, not judgment.\n• Blackout Poetry Ritual: Grab a page, cross out the noise, and uncover the words your body wants you to hear.\n• Found Poetry Collage: Piece together fragments of your experience—untold, unsaid—and turn them into art.\nThis space is trauma-informed, anti-caste and queer-affirming, a sanctuary where bodies marked by caste, gender, and history can feel seen and experience safety. \nBring a pen and your stories—whether scribbled or silent.\nCome ready to write poems that hold your complexity, your messiness, your power.\nRSVP now or share with someone who needs a space to reclaim their story.\nWith care and solidarity,",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1424",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Raju Behara",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-27T14:30:00+05:30",
    "endDate": "2025-09-27T16:30:00+05:30"
  },
  {
    "name": "Let Poetry Be - Monthly Poetry Open Mic",
    "description": "This monthly gathering will see poetry coming to life, through reading, music, art and any other forms of artistic expression, at Atta Galatta. Listeners and performers are all welcome\nEvent specifics & submission guidelines –\n1. Theme - Free verse (any original work)\n2. Works can be original or of other poets, performed live\n3. All languages welcome\n4. Participants can read to music (acoustic instrument/s), dramatise, use props & costumes\n5. Each participant will enjoy 5 minutes of reading time\n6. Kindly submit your poem and name to letpoetrybe@gmail.com on or before 24th July midnight. WE WILL NOT ACCEPT ATTACHMENTS OR LINKS. SUBJECT OF YOUR MAIL MUST READ AS 'Entry for -July LPB meet-up '\n7. You may also send entries that are not related to the theme\n8. The event will begin at 4pm sharp and will be held at Atta Galatta. Participants to report not later than 3:45 pm to hear about performance order and meet the host\n9. For any further clarifications, write to us at letpoetrybe@gmail.com\n \nYou are now welcome to flood our inbox!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1404",
    "image": "https://attagalatta.com/admin/uploads/events/2130777169.jpg",
    "performer": "Palgun KJ",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-27T15:00:00+05:30",
    "endDate": "2025-09-27T17:00:00+05:30"
  },
  {
    "name": "Sandhya Swaranjali - A Musical Offering at Dusk",
    "description": "An Enchanting Evening of Ragas, Bollywood & Soulful Fusion\n✨ As the sun sets, let the music rise.\nJoin us for an unforgettable evening where tradition meets contemporary, in Sandhya Swaranjali, a soulful musical offering at dusk. This unique concert features a captivating presentation of Evening Ragas blended beautifully with timeless Bollywood tunes and soul-stirring Coke Studio favorites.\n🎤 Featuring:\nSimran Senani on Vocals\nRam Mohan Rao on Harmonium\nPrahlad Deshpande on Tabla\nRavi Teja on Guitar\nBringing together classical finesse and modern flair\n🎼 What to Expect:\n• Mesmerizing Evening Ragas performed live\n• Iconic Bollywood melodies reimagined\n• Powerful Coke Studio fusion tracks\n• A serene ambiance to experience music at its purest",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1395",
    "image": "https://attagalatta.com/admin/uploads/events/1547531007.png",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-27T18:00:00+05:30",
    "endDate": "2025-09-27T20:00:00+05:30"
  },
  {
    "name": "Surfing Solo - Mixer by Pause to Begin",
    "description": "Are you between the ages of 25-45? What are your thoughts on singlehood?\nRegardless of age, join us at the fourth edition of Surfing Solo—an intimate group of single folks where we will engage in guided activity-based sharing. Fostering friendship, support, empowerment, it is designed for modern daters to make sense of the chaos. Whether you are divorced, never married, or bereaved; recently broke up, swimming in the dating pool, or taking a break from it, Surfing Solo is for you.\nWhat to Expect:\n- Sharing circle: An opportunity to share your current singlehood journey in a non-judgemental safe space of people with similar experiences.\n- Exploring themes: Small-group discussions as you deep dive with our facilitators holding space for banter, insight, and discovery. Together, we'll explore the unique advantages and hurdles of singlehood acknowledging the moments of uncertainty or loneliness.\n- Conversations and snacks: Informal chats and snacks, bond with other single people, and ask the facilitators, Anu and Prerna, any questions about therapy and coaching. They believe in offering compassionate care rooted in integrity and expertise.\nTakeaways\n● Keepsakes: This unique and first-of-its-kind group will leave you feeling seen and heard. You’ll go back not only with a fresh energy but also with goodies created by and for you.\n● Synergy: Through stories of shared struggles and experiences, make a friend or two and feel less isolated\n● Perspective: Create a lens that fosters joy and ease as modern dating, and singlehood can be daunting and exhausting at times.\n \nAll materials for the activities, as well as a beverage and snacks, are included in the ticket price. Please bring your curiosity, presence, and sense of humour!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1425",
    "image": "https://attagalatta.com/admin/uploads/events/1127419819.png",
    "performer": "Prerna Gupta",
    "keywords": [
      "mixer",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-27T18:30:00+05:30",
    "endDate": "2025-09-27T20:30:00+05:30"
  },
  {
    "name": "Indie Ink 2025 - Bazinega’s Annual ZineFest",
    "description": "Join us for Bazinega’s Annual ZineFest – Indie Ink 2025. Explore zines from across India and the world, join hands-on workshops, listen to artist readings and learn from their creative walkthroughs, dive into panel discussions on independent publishing, and cast your vote at the Indie Ink Zine Awards.\nA celebration of creativity, community, and independent voices — this is where stories come alive!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1422",
    "image": "https://attagalatta.com/admin/uploads/events/1340496481.png",
    "performer": "Bazinega",
    "keywords": [
      "Day Long Festival",
      "Day Long Festival"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-28T11:00:00+05:30",
    "endDate": "2025-09-28T19:00:00+05:30"
  },
  {
    "name": "Literary Meet - Meetup by White Falcon Publishing",
    "description": "This free event promises a day full of Word Games, a Quiz on Literature, Wall Art Making, a Panel Discussion, an Award Ceremony, and exciting Giveaways!\nRegistration is mandatory, so please RSVP by emailing marketing@whitefalconpublishing.com or filling out the form in bio.\n Don't miss this opportunity to network with fellow writers and readers who love the written word!\nLooking forward to seeing you there!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1403",
    "image": "https://attagalatta.com/admin/uploads/events/288978004.jpeg",
    "performer": "White Falcon Publishing",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-28T14:00:00+05:30",
    "endDate": "2025-09-28T16:00:00+05:30"
  },
  {
    "name": "Career Edge - Signing with Kaushik Mitra",
    "description": "Kaushik Mitra is the vice president and CFO at PepsiCo India with over 30 years of experience across Tata group, GE, and Reckitt Benckiser. Drawing from a rich, three-decade-long global career, this book is a practical, no-nonsense guide to building a sustainable and fulfilling professional journey. Through relatable stories and hard-earned wisdom, the author demystifies the complexities of corporate life, offering insights across three pivotal areas of self-development, collaboration and building resilience to deliver results.\nJoin us for a meet and greet and get copies of the book signed!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1418",
    "image": "https://attagalatta.com/admin/uploads/events/1896925600.jpg",
    "performer": "Penguin",
    "keywords": [
      "Books",
      "Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-28T15:30:00+05:30",
    "endDate": "2025-09-28T16:00:00+05:30"
  },
  {
    "name": "Atta Galatta presents “Support Group” - Support Group by Nimesh George and Gokul R.",
    "description": "Topic: Engagement in Loneliness\nPeople make up big cities but what makes up people’s lives, hopefully not loneliness. Loneliness is an intensely painful state which arises out of lack of intimacy and connectedness. People from every walk2 of life, even those with social contacts or pursuing successful careers can experience sadness from absence of belongingness. This painful experience is felt in a myriad of contexts such as breakups, disagreeing families, fear of rejection, unrelatability, shyness and so on.\nThis support group has been constituted to bring people struggling with disconnectedness in various contexts together for a shared experience of comfort, belongingness, laughter, guidance and above all to break the cycle of sustained loneliness.\nThe support is being organized and moderated by Nimesh George Mphil PhD who is a practicing psychologist based in Bangalore. This session will be co-moderated by Nimesh George & Gokul R, who are both practising psychologists in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1406",
    "image": "https://attagalatta.com/admin/uploads/events/1739175200.png",
    "performer": "Nimesh George",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-28T17:00:00+05:30",
    "endDate": "2025-09-28T18:30:00+05:30"
  },
  {
    "name": "UTOPIA - A Debut Standup Comedy Solo Show - A Comedy Show by Ravi Gaikwad",
    "description": "With a unique voice, as tongue-in-cheek as it is full of heart, in his debut solo, Ravi plans to take us all on a deeply personal journey through the messy, hilarious and strange realities of growing up Dalit, in and around Mumbai.\nBy blending sharp and unapologetic observational humour and unfiltered storytelling, the show tackles themes of caste, class, sex, love, feminism and more in the most hilarious and heartfelt ways imaginable.\nSo it's really a love letter to the complexities of life and with every punchline, emerges a version of the world as only Ravi can see it in his colourful imagination; and for one evening, you are all invited to drop by!”",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1414",
    "image": "https://attagalatta.com/admin/uploads/events/959994457.png",
    "performer": "Ravi Gaikwad",
    "keywords": [
      "Standup Comedy",
      "show"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-28T19:00:00+05:30",
    "endDate": "2025-09-28T20:30:00+05:30"
  },
  {
    "name": "Turn Books into Glowing Memories – Diwali Special Workshop - Book Lamp Making Workshop",
    "description": "Turn Books into Glowing Memories – Diwali Special Workshop \nThis Diwali, swap screens for stories and craft your own glowing Book Lamp! \nWith every fold, flip, and sparkle, you’ll bring light to life—literally. \nWhy join? \nExperience mindful making in a cozy bookstore atmosphere \nLaughter, bonding & creativity with family or friends — or enjoy soulful me-time \nRelish the warm smell of books, and unwind at the adjoining café — the perfect nook for rainy weather ☕🌧️📚 \nTake home a handmade lamp to brighten your space (or gift someone you love!) \n🌿 All materials provided \n✨ Limited seats — book yours now and let your stories shine! \nMindful making, the fragrance of books & a cozy café corner await you ☕📚🌧️",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1426",
    "image": "https://attagalatta.com/admin/uploads/events/1078833056.png",
    "performer": "Deepti Krishna",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-04T15:00:00+05:30",
    "endDate": "2025-10-04T17:00:00+05:30"
  },
  {
    "name": "Lahe Lahe Caravan presents “Harry Potter Book Discussion” - Meetup by Sonali Bhatia",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1433",
    "image": "https://attagalatta.com/admin/uploads/events/1110208384.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-05T11:00:00+05:30",
    "endDate": "2025-10-05T12:30:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup by ADHD Queeple",
    "description": "The next dates for Queer Quiet Hours are here!  Register here - http://bit.ly/adhdqueeple\r\nQueer Quiet Hours is back — a cozy space to rest, make art, and just be. No pressure to talk, no need to perform. Just soft community vibes and gentle company. Bring your own project or come as you are. We'll have plenty of art stuff for you to use.\n✨ For LGBTQIA+ folks only. We haven't opened it up to allies yet.\n📅 5th October\nSunday, 3 - 6 PM\n📍 @attagalatta, Indiranagar, Bangalore\n🆓 Free to join. Limited spots ( Sign up )\n📸 No photos taken without clear consent.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1434",
    "image": "https://attagalatta.com/admin/uploads/events/508895446.png",
    "performer": "Jade",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-05T15:00:00+05:30",
    "endDate": "2025-10-05T18:00:00+05:30"
  },
  {
    "name": "Madhubani Art - Workshop by Trishna Patnaik",
    "description": "India has a rich tradition of folk arts. The custodians of which are the many tribes that live in the interiors of various states. Madhubani or Mithila painting is a folk art form, originated from Mithila region of Bihar.\nThe paintings are traditionally based on mythological, folk themes and pastoral symbols. The designs announce the occasion of the celebration and solicit good fortune and divine blessings.\nParticipate in the Madhubani Art Workshop, get a chance to appreciate the art form and create your very own Madhubani Art masterpiece with acrylic colours on cartridge sheets.\nDate: 9th October, 2025 (Thursday)\nTimings:  1:30 to 3:30  pm\nAge Group: Teens and Adults\nFees: 1300 INR per person including Art Material \nVenue: Atta Galatta, Bengaluru \nTakeaway: One Complete Painting (A3 size)\nFor registrations please contact Trishna Patnaik on 9867982075 (Whatsapp).",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1427",
    "image": "https://attagalatta.com/admin/uploads/events/1112984503.png",
    "performer": "Trishna Patnaik",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-10-09T13:30:00+05:30",
    "endDate": "2025-10-09T15:30:00+05:30"
  },
  {
    "name": "It’s All in Your Mind - Book Reading by Trishna Patnaik",
    "description": "Your mind is your most powerful tool—are you using it to lift yourself up or hold yourself back?\nIt’s All in Your Mind is the latest book release, here to help you break free from negative thought loops, build mental toughness, and create a mindset wired for growth and success.\nThis book is your guide to mastering your thoughts, developing emotional intelligence, and cultivating the confidence and resilience you need to move forward. If your inner voice has been holding you back, now’s the time to take control and reclaim your power.\nThe shift begins within. Are you ready to train your mind and transform your life?\nJoin us for a Book Reading Session with Trishna Patnaik, celebrated fine artist, art therapist, and wellness author, as she brings to life her latest work,“It’s All in Your Mind,” to your world.\nThis isn’t just a reading, it’s a journey into the world of healing, emotions, creativity, and inner transformation.\nAbout the Author:\nA self-taught artist and healer, Trishna moved on from corporate life to follow her passion for painting and wellness. With over 14 years of experience, she now helps people reconnect with themselves through art and therapy.\nReserve your spot and be part of a memorable conversation.\nTickets are Rs 250 at the door\nRSVP: 9867982075",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1428",
    "image": "https://attagalatta.com/admin/uploads/events/298406400.png",
    "performer": "Trishna Patnaik",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-11T18:00:00+05:30",
    "endDate": "2025-10-11T19:00:00+05:30"
  },
  {
    "name": "Vrindaban, Present Please  - An Interactive play written and performed by Somudranil Sarkar",
    "description": "About the play \"Vrindaban, Present Please\" is an immersive, one-man interactive play set in a rural Indian village, where Samiran Banerjee, a Kolkata teacher, is transferred to a village school after a Supreme Court ruling. Assigned to a chaotic school once led by the mysteriously absent Salma Khatoon, Samiran's efforts to restore order only lead him deeper into unsettling events. From a water shortage to a snake in his room, his attempts to connect with the eccentric villagers only intensify his isolation. But behind it all, Samiran harbors a secret—someone named Vrindaban. Why does he hide this figure? Is it the only refuge in a world that refuses to understand him? The play unravels questions about isolation, hidden truths, and the blurred lines between personal and professional life.\nAbout the artist:  Somudranil Sarkar, a theatre maker from kolkata. He has over 25 years of experience in theatre and has had the privilege of training under some of the most respected names in the Bengali theatre circuit, including Rudraprasad Sengupta, Swatilekha Sengupta, Debshankar Halder, Sohini Sengupta, and Goutam Halder in Nandikar. He has also trained in mime under the guidance of mime guru Jogesh Dutta. Over the years, he has directed and acted in over 100 plays and curated various theatre workshops for diverse groups. Somudranil has received the Azhar Alam Young Director’s Award for his contribution to the field.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1431",
    "image": "https://attagalatta.com/admin/uploads/events/2101294310.png",
    "performer": "Somudranil Sarkar",
    "keywords": [
      "Theatre",
      "Interactive Play"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-17T19:00:00+05:30",
    "endDate": "2025-10-17T20:00:00+05:30"
  },
  {
    "name": "Bhang and Beyond - Book Signing by Akshaya Bahibala",
    "description": "We’re delighted to host an engaging session with Akshaya Bahibala, author of Bhang Journeys, a book that is part cultural history, part social commentary, and is also shaped by his own tryst with bhang. \nJoin us for an open and interactive conversation where you can chat with him, hear about his journey, and of course, get your copies signed",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1429",
    "image": "https://attagalatta.com/admin/uploads/events/2143283007.jpg",
    "performer": "Akshaya Bahibala",
    "keywords": [
      "Books",
      "Book signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-28T18:30:00+05:30",
    "endDate": "2025-10-28T19:30:00+05:30"
  },
  {
    "name": "Tara Goes Aahhhhh! - Book Reading by Garima Gupta",
    "description": "Facing Fears with Roars and Giggles! Ready for a story that doesn’t need words—just your eyes, your imagination, and all those big, bold feelings? Join Tara and her dino buddy on a wild, wordless adventure as they tackle their fears in the pop-up book Tara Goes Aahhhhh! with author Garima Gupta. It's a roar-some ride through emotions, courage, and friendship.\nAge: 4-8, accompanied by a parent.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1430",
    "image": "https://attagalatta.com/admin/uploads/events/338996915.jpg",
    "performer": "Garima Gupta",
    "keywords": [
      "Books",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-08T11:00:00+05:30",
    "endDate": "2025-11-08T12:30:00+05:30"
  }
]