[
  {
    "name": "Time to Imagine - Book Signing",
    "description": "‘TIME’ is the name of the Apartment Complex in Indiranagar Bangalore where the Author lived for nearly 18 years from 2004 to 2022, and ‘IMAGINE’ is the name of the campus in Whitefield, Bangalore where his office (TOTAL ENVIRONMENT) is located.\nMost of the short pieces in this book were conceptualized during the author`s travel times from ‘TIME TO IMAGINE’.\nThere is something for everyone and for all ages. The topics covered are wide-ranging, on Science, Philosophy including religious philosophy, Quantum Physics and its Philosophical impacts, Teleology and Intelligent Field, Enlightenment in meditation, Geopolitics, The Doomsday Clock, American Presidential Election, Stock Markets, Horse racing, Time Form Ratings, Pure mathematics, Randomness, Construction Engineering, Slip Forms, Family matters, Interesting Small World, the game of Scrabble, not forgetting Quiz Time, etc.\nThe central theme of the book suggests a mysterious and intelligent link between the unique variety and colourfulness of the earth and the vastness and sameness of the universe. Join us for a book signing by the author at Atta Galatta on 6th September at 6 PM!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT729",
    "image": "https://attagalatta.com/admin/uploads/events/1735772887.jpg",
    "performer": "Surendra Kumar Sagar",
    "keywords": [
      "Books",
      "Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-06T18:00:00+05:30",
    "endDate": "2024-09-06T19:00:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT719",
    "image": "https://attagalatta.com/admin/uploads/events/1798805485.png",
    "performer": "The Listeners Circle",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-09-08T11:00:00+05:30",
    "endDate": "2024-09-08T13:00:00+05:30"
  },
  {
    "name": "The Brave Space - Writing Workshop",
    "description": "The Brave Space: A queer and neurodivergent affirmative writing workshop to tap into collective and individual expression, craft authenticity, and build community through compassionate critique. Facilitated by Rheea Mukherjee and Indu Manohar. Writers and readers of all levels and experience are welcome. All that is needed is a fierce curiosity and a love for words! This is a free community workshop presented and supported by Jotter, a reader-writer community platform that unlocks the power of social publishing.\nBring your laptops and your weirdest selves. Art supplies and plant-based snacks provided. Limited to 25 participants.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT727",
    "image": "https://attagalatta.com/admin/uploads/events/1907085746.jpg",
    "performer": "Jotter",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-08T12:30:00+05:30",
    "endDate": "2024-09-08T15:30:00+05:30"
  },
  {
    "name": "Pages and Perspectives - Reading Circle",
    "description": "We’re thrilled to invite you to 📚 Pages and Perspectives 📚—a cozy and insightful mental health reading circle.\nBring along your favourite mental health book and share the insights you've gained in an intimate circle of fellow book lovers. Our incredible facilitators, *Khushi Kansal (Counselling Psychologist & Instructional Designer) and Sampada Fotedar (Trauma-informed, queer affirmative psychotherapist, sexuality educator) *, will be guiding the discussions. 🙌\n*Please help us avoid food and drink wastage by registering only if you’re truly interested in attending! *\nRSVP at the earliest- slots are filling up fast! Don’t miss out on this insightful experience 🌸\nWe can’t wait to see you there and hear your perspectives! 😊",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT731",
    "image": "https://attagalatta.com/admin/uploads/events/667771173.jpeg",
    "performer": "Khushi Kansal, \nSampada Fotedar,",
    "keywords": [
      "Wellness and Health",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-08T13:00:00+05:30",
    "endDate": "2024-09-08T14:30:00+05:30"
  },
  {
    "name": "Support Group - Support Group",
    "description": "Topic of Discussion - Are you angry?\nPeople make up big cities but what makes up people’s lives, hopefully not loneliness. Loneliness is an intensely painful state which arises out of lack of intimacy and connectedness. People from every wake of life, even those with social contacts or pursuing successful careers can experience sadness from absence of belongingness. This painful experience is felt in a myriad of contexts such as breakups, disagreeing families, fear of rejection, unrelatability, shyness and so on.\nThis support group has been constituted to bring people struggling with disconnectedness in various contexts together for a shared experience of comfort, belongingness, laughter, guidance and above all to break the cycle of sustained loneliness.\nThe support is being organized and moderated by Nimesh George Mphil PhD who is a practicing psychologist based in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT713",
    "image": "https://attagalatta.com/admin/uploads/events/1578871419.png",
    "performer": "Nimesh George",
    "keywords": [
      "Wellness and Health",
      "Support Group"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-08T16:00:00+05:30",
    "endDate": "2024-09-08T17:00:00+05:30"
  },
  {
    "name": "Texture Painting Workshop - Workshop",
    "description": "Creative Unblock brings to you an immersive Texture Painting Workshop dedicated to the unique art of impasto painting! This session focuses exclusively on creating stunning floral designs using thick, textured strokes that bring your canvas to life. \nWe will guide you through the impasto technique, where you`ll learn how to apply paint in thick layers to achieve a three-dimensional effect. You`ll explore different tools, from palette knives to brushes, to create rich, vibrant florals that pop right off the canvas.\nWhether you`re a beginner or an experienced artist, this workshop offers a unique opportunity to dive deep into the world of impasto. All supplies will be provided, and you`ll leave with your very own floral masterpiece ready to hang.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT716",
    "image": "https://attagalatta.com/admin/uploads/events/577175783.jpeg",
    "performer": "Creative Unblock",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-08T16:00:00+05:30",
    "endDate": "2024-09-08T18:00:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Reflection Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other`s experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT682",
    "image": "https://attagalatta.com/admin/uploads/events/2080566301.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Social",
      "Support Group"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-09-08T17:00:00+05:30",
    "endDate": "2024-09-08T19:00:00+05:30"
  },
  {
    "name": "Returning Home - Workshop",
    "description": "How do I break free from the deep-rooted conditioning of shame, self-doubt and self-judgment and embrace my authenticity? How do I align with my life`s essence and emerge as a whole?\nIf you find yourself grappling with these questions,\nIf you are someone finding it challenging to navigate through your emotions and aspire to lead a harmonious life.\nOr a curious explorer willing to discover the mysteries of our bodies. We invite you to join the Audacious Circle where we dive deep into understanding life essence, the concept of audacious love and return to our bodies.\nThe Audacious Circle is an initiative by Yashika CG, an educator, author and yoga practitioner who is on a forever journey into the great unknown.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT669",
    "image": "https://attagalatta.com/admin/uploads/events/138855616.jpg",
    "performer": "Yashika C. G.",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-14T11:00:00+05:30",
    "endDate": "2024-09-14T14:00:00+05:30"
  },
  {
    "name": "Creative Writing Kids Workshop - Writing Workshop for Children",
    "description": "Does your child bring home entertaining stories about their day in school? Make up clever excuses for why they didn’t do their homework? Or ask you imaginative questions about dinosaurs, superheroes and outer space that you have no answers to?\nIf yes, your child might just be a born storyteller!\nThis Sunday, join us for a workshop that will help your kid/s present their innate creativity and original thinking onto paper.\nThe workshop will be conducted by an experienced writer who has her work published in Femina, Mid-Day, ScoopWhoop, and Fork Media Group, among other renowned content brands. She will share - in kid-friendly language - lessons from her childhood days that helped her develop a flair for creative expression and develop a unique writing style.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT720",
    "image": "https://attagalatta.com/admin/uploads/events/1559148826.png",
    "performer": "Ritu Ailani",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-09-14T11:00:00+05:30",
    "endDate": "2024-09-14T13:00:00+05:30"
  },
  {
    "name": "Mythology Marvels - Storytime for Children and Families",
    "description": "Indic Mythology is full of answers to the many whys of our culture. Join Lavanya Prasad and Meenu Sivaramakrishnan, as they explore and bring forth the marvellous stories from the Indic Mythology through music, dance and theatre.\nThe month of September is festivals Galore. Join the storytellers as they bring to you unique and lesser-known tales from our very own Indic Mythology. Know the actual meaning behind celebrating the festivals. Be prepared to heat stories that would make you go wow, tales that make you think, tales that move your heart, they have it all. Apart from the gift of stories there is a beautiful activity that has been planned. Let`s make September more colourful with all of you!\nLooking forward to meeting you all!\nAbout the Storytellers:\nLavanya Prasad & Meenu Sivaramakrishnan are passionate professional storytellers with mutual love for Music and Mythology. Mythology Marvels is their humble attempt to bring to light the treasures from Indian mythology ( this time from around the world too) to the children and Families of Bengaluru through music, dance and theatre. Both Lavanya and Meenu run their respective storytelling ventures.\nPlease find more about them here.\nLavanya Prasad : www.talescope.in\nMeenu Sivaramakrishnan : www.kathagalatta.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT714",
    "image": "https://attagalatta.com/admin/uploads/events/2013933559.png",
    "performer": "Lavanya Prasad, \nMeenu Sivaramakrishnan,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-09-14T14:30:00+05:30",
    "endDate": "2024-09-14T15:30:00+05:30"
  },
  {
    "name": "Lakshmana’s Last Stand – The Rise of Nagvanshis - Book Launch",
    "description": "You are cordially invited for the launch of Raj Thambu’s debut book:  Lakshmana’s Last Stand – The Rise of Nagvanshis.  Prepare to be transported to one of the most exciting eras in Ancient Indian History!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT715",
    "image": "https://attagalatta.com/admin/uploads/events/1872797883.jpg",
    "performer": "Raj Thambu",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-14T15:30:00+05:30",
    "endDate": "2024-09-14T16:30:00+05:30"
  },
  {
    "name": "Coins In Rivers - Book Launch",
    "description": "If I were a country/and you my journalist/I would have shot you/down a street/and left you to bleed. Fierce and unflinching, Rochelle Potkar's poetry springs from the deeply personal and ripples out to the world, capturing lover's whispers and reverberations of explosions with equal ease. Vividly depicting love, grief, anger, defiance, these poems glimmer like coins beneath the water surface, tethered with the weight of wishes clinging to them. As sensuous as it is articulate, Coins in Rivers is a deep meditation on womanhood, motherhood, and citizenship. The legendary poet Jayanta Mahapatra said of it, \"Exceptional work, this. A haunting inventiveness runs through these poems. Rochelle Potkar's imagination is rich and carefully employed to her poetic purposes, sensitively met with through her concrete imagery and cosmopolitan vocabulary.\nRochelle Potkar is a prize-winning poet, author, and screenwriter based in Mumbai. She will be in conversation with Bangalore-based poet Poornima Laxmeshwar. Come join us as we discuss poetry, womanhood, citizenry, and our place in the world.\nPoornima Laxmeshwar resides in Bangalore, India. Her books of poetry include ‘Anything but Poetry’ (Writers Workshop), ‘Thirteen’ - a chapbook, (Yavanika Press) and 'Strings Attached', (Red River). She is currently working on fiction and an upcoming prose poetry collection.\nWidely anthologized, Rochelle Potkar is a prize-winning poet, author, and screenwriter based in Mumbai. She is the author of Four Degrees of Separation (poetry), Paper Asylum (haibun) - shortlisted for the Rabindranath Tagore Literary Prize 2020, and Bombay Hangovers (short fiction). An alumna of Iowa’s International Writing Program (2015) and a Charles Wallace Writer’s fellow, University. of Stirling (2017), her poetry film Skirt featured on Shonda Rhimes' Shondaland. As a creative-writing mentor, she has conducted poetry workshops at the Himalayan Writing Retreat and Iowa’s International Writing Summer Programs. Her prize-winning manuscript of poetry ‘Coins in Rivers' released in April 2024 by Hachette India. Her play 'Catharsis/Drama Queens' will be staged in Tamil at Prakriti's Foundation's Short+Sweet South India Theatre Festival this September.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT718",
    "image": "https://attagalatta.com/admin/uploads/events/22852376.png",
    "performer": "Rochelle Potkar",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-14T19:00:00+05:30",
    "endDate": "2024-09-14T20:00:00+05:30"
  },
  {
    "name": "Pen & Latte 4.0 - Story Writing Workshop",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT683",
    "image": "https://attagalatta.com/admin/uploads/events/419501552.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-15T11:11:00+05:30",
    "endDate": "2024-09-15T14:22:00+05:30"
  },
  {
    "name": "Infinitely Polar Bear - Mindful Cinema",
    "description": "\"Two emotions fighting each other to have control of you. Fights never end well. But being mindful around people who struggle with this fight every day is possible. Being at two poles of emotions is a conflict, confusion, embarrassment, and much more. Let`s know more about it!\"\nPrevention begins when we generate awareness and have empathy towards the happenings of our surroundings as well. Shraddha decided to screen cinema from the world to bring in some awareness about various aspects of mental health. The screening of the film will be followed by a discussion on the subject.\nOn 18th August 2024, we will screen the movie \"Infinitely Polar Bear\". It is an English movie with English subtitles on the father-daughter relationship.\nDirector and Writer: Maya Forbes\nCast: Mark Ruffalo and Zoe Saldana\nAfter the movie, there will be a facilitated discussion around \"Bipolar Disorder.\"\nFacilitator: Shraddha Modi, a psychologist and behavior therapist whose passion for mental health has motivated her to study and work in this field.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT696",
    "image": "https://attagalatta.com/admin/uploads/events/435924419.png",
    "performer": "Shraddha Modi",
    "keywords": [
      "Wellness and Health",
      "Film Screening"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-15T12:30:00+05:30",
    "endDate": "2024-09-15T14:30:00+05:30"
  },
  {
    "name": "Build-A-Book - Book Making Workshop",
    "description": "Build -A- Book is a carefully curated skill-based workshop about bookmaking. The participants will experiment together and learn how to transform ordinary household objects to repurpose them into journals and notebooks, and experiment with other materials!\nSaachi will be sharing all tips and tricks that she has learned and gathered over her 5 years of experience and practice with the skill. She will also be working with the participants to sharpen their observation skills and imagination to help them customise notebooks and journals to suit their needs and purpose.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT701",
    "image": "https://attagalatta.com/admin/uploads/events/816480318.jpg",
    "performer": "Saachi Pimprikar",
    "keywords": [
      "Book Making",
      "Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-15T15:00:00+05:30",
    "endDate": "2024-09-15T17:00:00+05:30"
  },
  {
    "name": "An Evening of Magic - Magic Show",
    "description": "An Evening of Magic is a most amazing magic show presented by `Nakul Shenoy & Friends`, featuring top entertainers and magic acts. Curated and hosted by the internationally-acclaimed mentalist Nakul Shenoy, each event in this series brings unique acts and performances by nationally and internationally acclaimed magicians, alongside some of the most notable up-and-coming stars of magic. This is an evening that is truly magical, and one you will want to experience many times over.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT728",
    "image": "https://attagalatta.com/admin/uploads/events/1231331959.png",
    "performer": "Nakul Shenoy",
    "keywords": [
      "Magic",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-15T18:00:00+05:30",
    "endDate": "2024-09-15T19:00:00+05:30"
  },
  {
    "name": "Reiki Level One Course and Initiation - Workshop",
    "description": "Reiki is a holistic, light-touch/ distant healing therapy that originated in Japan, aiming to balance the body, mind, and spirit. It involves transferring universal energy through the hands to promote relaxation, reduce stress, and enhance overall well-being. Regular Reiki practice can lead to increased calm, clarity, and vitality, supporting physical, emotional, and spiritual harmony.\nReiki’s advantages include:\n- Reduces stress and anxiety\n- Promotes relaxation and calmness\n- Relieves pain and inflammation\n- Improves sleep quality\n- Boosts mood and emotional balance\n- Enhances spiritual connection and self-awareness\n- Supports immune system function\n- Increases energy levels and vitality\n- Fosters overall well-being and inner peace.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT726",
    "image": "https://attagalatta.com/admin/uploads/events/292276182.png",
    "performer": "Vishal Nagranee",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-20T13:00:00+05:30",
    "endDate": "2024-09-20T17:00:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nSeptember Read: Chillies and Porridge: Writing Food edited by Mita Kapur\nWe assure you that you will relish every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT711",
    "image": "https://attagalatta.com/admin/uploads/events/987716312.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Food",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-21T11:00:00+05:30",
    "endDate": "2024-09-21T13:00:00+05:30"
  },
  {
    "name": "Screen Craft 2.0 - Screenplay Writing Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Screenplay Writing Workshop in town. \nOur Screenplay Writing workshop is an intensive program designed to guide aspiring screenwriters through the process of crafting compelling and marketable screenplays. This workshop provides participants with a solid foundation in screenplay structure, character development, dialogue writing, and industry-standard formatting, ensuring they are equipped to bring their stories to life on the big screen.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no screenwriting experience, as well as intermediate writers looking to refine their skills. It is also suitable for novelists, playwrights, or anyone interested in exploring the craft of screenwriting.\nWorkshop Objectives:\n- To introduce participants to the fundamentals of screenplay writing.\n- To develop participants` skills in creating engaging plots and well-rounded characters.\n- To enhance participants` abilities to write effective dialogue and visual storytelling.\n- To familiarize participants with the screenplay industry and submission processes.\nKey Components involves learning theory and practicals of: \n- Story and Character Development\n- Screenplay Structure\n- Dialogue Writing\n- Scene Construction\n- Visual Storytelling\n- Formatting and Style\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Writing a story based on a prompt.\n- Participating in the curated feedback discussion.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT685",
    "image": "https://attagalatta.com/admin/uploads/events/227598307.png",
    "performer": "MWM Movies",
    "keywords": [
      "Film",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-21T11:11:00+05:30",
    "endDate": "2024-09-21T14:22:00+05:30"
  },
  {
    "name": "Chapters Unsealed 4.0 - Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nBring along your favorite book and delve into a shared reading experience.\n \nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nSharing your views on favorite books.\nParticipating in the curated discussion.\nVoting for a Monthly Book Read.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT686",
    "image": "https://attagalatta.com/admin/uploads/events/1490616635.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-22T14:22:00+05:30",
    "endDate": "2024-09-22T17:55:00+05:30"
  },
  {
    "name": "Gond Art Workshop - Art Workshop",
    "description": "India has a rich tradition of folk arts. The custodians of which are the many tribes that live in the interiors of various states. The Gonds, are the largest Adivasi Community in India and are Dravidian's whose origin can be traced to the pre-Aryan era. They are mainly found in Madhya Pradesh and its surrounding States. The word Gond comes from the Dravidian expression kond, meaning green mountain. In the Gond belief system, besides Bara Deo (Great God), every hill, river, lake, tree, and rock is inhabited by a spirit and therefore sacred. Gond paintings are fascinating, where the artists express their faiths and beliefs, world view, their visual expression and sense of identity, both as a collective, and as individuals. The motifs are further associated with the rich repertoire of the community and strongly show the interactions with the cosmic, natural and social worlds of humans at multiple levels and contexts. Participate in the Gond Painting Workshop, get a chance to appreciate the art form and create you very own Gond Art masterpiece on cartridge sheets with acrylic colours.\nTake away: One complete painting A3 size\nBook Here: 9867982075",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT721",
    "image": "https://attagalatta.com/admin/uploads/events/318569093.jpeg",
    "performer": "Trishna Patnaik",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-27T16:30:00+05:30",
    "endDate": "2024-09-27T19:30:00+05:30"
  },
  {
    "name": "Kalighat Painting Workshop - Art Workshop",
    "description": "The paintings derive its name from the Kalighat Temple which flourished as a popular art form with the rise of a settlement around the temple. Legend has it that Sati slew herself after Lord Shiva was insulted by her father Daksha. Following this, Shiva wandered with her body on his shoulder threatening to destroy the universe. Vishnu, the preserver of Earth, intervened and shattered Sati’s body into 51 pieces which fell at different spots across the Indian subcontinent. These sites are known as Shakti Peethas. The toe of her right foot is said to have fallen at the site of the Kalighat Temple, associating it with Goddess Kalib- the ferocious form of Sati.\nWith bright colours, bold strokes, realistic figures, religious, as well as secular and civil subjects; these paintings catch the eyes of the appreciator in a jiffy. The subjects in the paintings are coloured but the base remains untouched. These characteristics came to be known as the key elements of the Kalighat paintings. The Kalighat Paintings were divided into two schools: The oriental school wherein Hindu gods and mythological figures were seen, and the occidental school that projected social evils and other secular themes.\nIn this fascinating workshop we will be working on a painting of Goddess Kali with acrylic paints on cartridge sheets. You will get to take away one complete painting (A3 size). The registration price is inclusive of all materials.\nBook Here: 9867982075",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT722",
    "image": "https://attagalatta.com/admin/uploads/events/124469668.jpeg",
    "performer": "Trishna Patnaik",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-28T11:30:00+05:30",
    "endDate": "2024-09-28T14:30:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "A space to unplug, and make stuff together. No agenda, no pressure. Draw, paint, read—or just sit and think. Talk about the art and stories that move you, or keep to yourself. It’s all good. Bring your creativity and let’s see what happens.\n(Please Note: This meetup is limited to 15 spots)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT730",
    "image": "https://attagalatta.com/admin/uploads/events/35019767.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-09-28T16:00:00+05:30",
    "endDate": "2024-09-28T19:00:00+05:30"
  },
  {
    "name": "Make Your Own Comic Strip - Workshop for Children",
    "description": "If your child loves animated characters, makes up stories about dinosaurs, fairies and superheroes, and narrates anecdotes from their life with sound effects and expressions, your child is a born storyteller!\nThis Saturday, join us so we can enable your kid(s) to present their innate creativity and original thinking in the form of a comic strip!\nThe workshop will be conducted by an experienced writer who has her work published in Femina, Mid-Day, ScoopWhoop, and Fork Media Group, among other renowned content brands. She will share - in kid-friendly language - lessons from her childhood days that helped her develop a flair for creative expression and develop a unique writing style.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT723",
    "image": "https://attagalatta.com/admin/uploads/events/1026262959.png",
    "performer": "Ritu Ailani",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-09-28T17:00:00+05:30",
    "endDate": "2024-09-28T19:00:00+05:30"
  },
  {
    "name": "Ranis of India - Storytelling",
    "description": "Ranis of India is a collection of stories from various oral, folk, mythical and historical narratives collected based on numerous travel and research over the last few years on the lesser-known or completely forgotten women rulers of this wonderful country by Vikram Sridhar.\nOver one hour, through oral story-telling smattered with folk songs, we travel the country, going deeper into many stories of Indian queens from myths, history and present times, whose stories need to be told and heard.\nFrom North to South, East to West there have been women rulers, administrators, changemakers who’ve changed and touched history strongly.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT681",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-28T20:00:00+05:30",
    "endDate": "2024-09-28T21:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT678",
    "image": "https://attagalatta.com/admin/uploads/events/1590760097.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-29T07:00:00+05:30",
    "endDate": "2024-09-29T09:30:00+05:30"
  },
  {
    "name": "Persian Mandala Art Workshop - Art Workshop",
    "description": "Mandala designs are applied in Persian art and architecture frequently. Here we are going to introduce Persian mandalas, their meaning, and characteristics.\nWhat is a Mandala?\nWhat we know about a mandala is that it is a geometric design and a symbol in Buddhism and Hinduism. In general, mandalas represent the universe. Mandalas are usually used to increase focus while meditating or doing yoga. In home décor designs, mandala tapestries, paintings or tiles can be hanged on the wall or used as a tablecloth or for bedding. In some cases, mandalas are used in decors because of their magnificent patterns and symbolic meaning for peace. Mandalas are very much engaged with home décor styles such as bohemian, hippie and gypsy in the modern design world.\nWhere do mandalas come from?\nMost of us might think mandalas root back only to India and Buddhism while there has been a wide use of mandala designs in the history of art in other religions and areas as well.\nMandala designs are applied in Persian art and architecture frequently. Here we are going to introduce Persian mandalas, their meaning, and characteristics.\nYou will take back your very own Persian Mandala Painting in A3 size paper.\nMake your own special art with acrylic colours on cartridge sheets.\nBook Here: 9867982075",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT725",
    "image": "https://attagalatta.com/admin/uploads/events/2044475145.jpeg",
    "performer": "Trishna Patnaik",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-29T11:30:00+05:30",
    "endDate": "2024-09-29T14:30:00+05:30"
  },
  {
    "name": "Madhubani Art Workshop - Art Workshop",
    "description": "India has a rich tradition of folk arts. The custodians of which are the many tribes that live in the interiors of various states. Madhubani or Mithila painting is a folk-art form, originated from Mithila region of Bihar.\nThe paintings are traditionally based on mythological, folk themes and pastoral symbols. The designs announce the occasion of the celebration and solicit good fortune and divine blessings.\nParticipate in the Madhubani Art Workshop, get a chance to appreciate the art form and create your very own Madhubani Art masterpiece with acrylic colours on cartridge sheets. You will get to take away one complete painting (A3 size). The registration price is inclusive of all materials.\nBook Here: 9867982075",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT724",
    "image": "https://attagalatta.com/admin/uploads/events/1467575699.jpeg",
    "performer": "Trishna Patnaik",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-29T16:30:00+05:30",
    "endDate": "2024-09-29T19:30:00+05:30"
  },
  {
    "name": "Ranis of India - Storytelling",
    "description": "Ranis of India is a collection of stories from various oral, folk, mythical and historical narratives collected based on numerous travel and research over the last few years on the lesser-known or completely forgotten women rulers of this wonderful country by Vikram Sridhar.\nOver one hour, through oral story-telling smattered with folk songs, we travel the country, going deeper into many stories of Indian queens from myths, history and present times, whose stories need to be told and heard.\nFrom North to South, East to West there have been women rulers, administrators, changemakers who’ve changed and touched history strongly.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT681",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-29T20:00:00+05:30",
    "endDate": "2024-09-29T21:00:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Reflection Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other`s experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT684",
    "image": "https://attagalatta.com/admin/uploads/events/1778962806.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Social",
      "Support Group"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-10-06T17:00:00+05:30",
    "endDate": "2024-10-06T19:00:00+05:30"
  }
]