[
  {
    "name": "Indie Ink 2025 - Bazinega’s Annual ZineFest",
    "description": "Join us for Bazinega’s Annual ZineFest – Indie Ink 2025. Explore zines from across India and the world, join hands-on workshops, listen to artist readings and learn from their creative walkthroughs, dive into panel discussions on independent publishing, and cast your vote at the Indie Ink Zine Awards.\nA celebration of creativity, community, and independent voices — this is where stories come alive!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1421",
    "image": "https://attagalatta.com/admin/uploads/events/671837236.png",
    "performer": "Bazinega",
    "keywords": [
      "Day Long Festival",
      "Day Long Festival"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-27T11:00:00+05:30",
    "endDate": "2025-09-27T19:00:00+05:30"
  },
  {
    "name": "Redefining Queerscapes — Rhyme and Reclaim - Queerscapes Circle",
    "description": "Hi friend,\nAre you tired of events that force you to perform queerness that doesn't sit with you. Are you forced to enact this day-to-day?  Join us as we play with words and bring stories of self. Come as you are. No performativity.\nit's a circle for reclaiming ourselves—our bodies, our stories, our truths—using the fierce magic of poetry and play.\nHere’s how we’ll move:\n• Listening Circle: Bring your whole self—everything about your bodies you’ve been holding close or wrestling with. We hold space with care, not judgment.\n• Blackout Poetry Ritual: Grab a page, cross out the noise, and uncover the words your body wants you to hear.\n• Found Poetry Collage: Piece together fragments of your experience—untold, unsaid—and turn them into art.\nThis space is trauma-informed, anti-caste and queer-affirming, a sanctuary where bodies marked by caste, gender, and history can feel seen and experience safety. \nBring a pen and your stories—whether scribbled or silent.\nCome ready to write poems that hold your complexity, your messiness, your power.\nRSVP now or share with someone who needs a space to reclaim their story.\nWith care and solidarity,",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1424",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Raju Behara",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-27T14:30:00+05:30",
    "endDate": "2025-09-27T16:30:00+05:30"
  },
  {
    "name": "Let Poetry Be - Monthly Poetry Open Mic",
    "description": "This monthly gathering will see poetry coming to life, through reading, music, art and any other forms of artistic expression, at Atta Galatta. Listeners and performers are all welcome\nEvent specifics & submission guidelines –\n1. Theme - Free verse (any original work)\n2. Works can be original or of other poets, performed live\n3. All languages welcome\n4. Participants can read to music (acoustic instrument/s), dramatise, use props & costumes\n5. Each participant will enjoy 5 minutes of reading time\n6. Kindly submit your poem and name to letpoetrybe@gmail.com on or before 24th July midnight. WE WILL NOT ACCEPT ATTACHMENTS OR LINKS. SUBJECT OF YOUR MAIL MUST READ AS 'Entry for -July LPB meet-up '\n7. You may also send entries that are not related to the theme\n8. The event will begin at 4pm sharp and will be held at Atta Galatta. Participants to report not later than 3:45 pm to hear about performance order and meet the host\n9. For any further clarifications, write to us at letpoetrybe@gmail.com\n \nYou are now welcome to flood our inbox!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1404",
    "image": "https://attagalatta.com/admin/uploads/events/2130777169.jpg",
    "performer": "Palgun KJ",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-27T15:00:00+05:30",
    "endDate": "2025-09-27T17:00:00+05:30"
  },
  {
    "name": "Sandhya Swaranjali - A Musical Offering at Dusk",
    "description": "An Enchanting Evening of Ragas, Bollywood & Soulful Fusion\n✨ As the sun sets, let the music rise.\nJoin us for an unforgettable evening where tradition meets contemporary, in Sandhya Swaranjali, a soulful musical offering at dusk. This unique concert features a captivating presentation of Evening Ragas blended beautifully with timeless Bollywood tunes and soul-stirring Coke Studio favorites.\n🎤 Featuring:\nSimran Senani on Vocals\nRam Mohan Rao on Harmonium\nPrahlad Deshpande on Tabla\nRavi Teja on Guitar\nBringing together classical finesse and modern flair\n🎼 What to Expect:\n• Mesmerizing Evening Ragas performed live\n• Iconic Bollywood melodies reimagined\n• Powerful Coke Studio fusion tracks\n• A serene ambiance to experience music at its purest",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1395",
    "image": "https://attagalatta.com/admin/uploads/events/1547531007.png",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-27T18:00:00+05:30",
    "endDate": "2025-09-27T20:00:00+05:30"
  },
  {
    "name": "Surfing Solo - Mixer by Pause to Begin",
    "description": "Are you between the ages of 25-45? What are your thoughts on singlehood?\nRegardless of age, join us at the fourth edition of Surfing Solo—an intimate group of single folks where we will engage in guided activity-based sharing. Fostering friendship, support, empowerment, it is designed for modern daters to make sense of the chaos. Whether you are divorced, never married, or bereaved; recently broke up, swimming in the dating pool, or taking a break from it, Surfing Solo is for you.\nWhat to Expect:\n- Sharing circle: An opportunity to share your current singlehood journey in a non-judgemental safe space of people with similar experiences.\n- Exploring themes: Small-group discussions as you deep dive with our facilitators holding space for banter, insight, and discovery. Together, we'll explore the unique advantages and hurdles of singlehood acknowledging the moments of uncertainty or loneliness.\n- Conversations and snacks: Informal chats and snacks, bond with other single people, and ask the facilitators, Anu and Prerna, any questions about therapy and coaching. They believe in offering compassionate care rooted in integrity and expertise.\nTakeaways\n● Keepsakes: This unique and first-of-its-kind group will leave you feeling seen and heard. You’ll go back not only with a fresh energy but also with goodies created by and for you.\n● Synergy: Through stories of shared struggles and experiences, make a friend or two and feel less isolated\n● Perspective: Create a lens that fosters joy and ease as modern dating, and singlehood can be daunting and exhausting at times.\n \nAll materials for the activities, as well as a beverage and snacks, are included in the ticket price. Please bring your curiosity, presence, and sense of humour!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1425",
    "image": "https://attagalatta.com/admin/uploads/events/1127419819.png",
    "performer": "Prerna Gupta",
    "keywords": [
      "mixer",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-27T18:30:00+05:30",
    "endDate": "2025-09-27T20:30:00+05:30"
  },
  {
    "name": "Indie Ink 2025 - Bazinega’s Annual ZineFest",
    "description": "Join us for Bazinega’s Annual ZineFest – Indie Ink 2025. Explore zines from across India and the world, join hands-on workshops, listen to artist readings and learn from their creative walkthroughs, dive into panel discussions on independent publishing, and cast your vote at the Indie Ink Zine Awards.\nA celebration of creativity, community, and independent voices — this is where stories come alive!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1422",
    "image": "https://attagalatta.com/admin/uploads/events/1340496481.png",
    "performer": "Bazinega",
    "keywords": [
      "Day Long Festival",
      "Day Long Festival"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-28T11:00:00+05:30",
    "endDate": "2025-09-28T19:00:00+05:30"
  },
  {
    "name": "Literary Meet - Meetup by White Falcon Publishing",
    "description": "This free event promises a day full of Word Games, a Quiz on Literature, Wall Art Making, a Panel Discussion, an Award Ceremony, and exciting Giveaways!\nRegistration is mandatory, so please RSVP by emailing marketing@whitefalconpublishing.com or filling out the form in bio.\n Don't miss this opportunity to network with fellow writers and readers who love the written word!\nLooking forward to seeing you there!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1403",
    "image": "https://attagalatta.com/admin/uploads/events/288978004.jpeg",
    "performer": "White Falcon Publishing",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-28T14:00:00+05:30",
    "endDate": "2025-09-28T16:00:00+05:30"
  },
  {
    "name": "Career Edge - Signing with Kaushik Mitra",
    "description": "Kaushik Mitra is the vice president and CFO at PepsiCo India with over 30 years of experience across Tata group, GE, and Reckitt Benckiser. Drawing from a rich, three-decade-long global career, this book is a practical, no-nonsense guide to building a sustainable and fulfilling professional journey. Through relatable stories and hard-earned wisdom, the author demystifies the complexities of corporate life, offering insights across three pivotal areas of self-development, collaboration and building resilience to deliver results.\nJoin us for a meet and greet and get copies of the book signed!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1418",
    "image": "https://attagalatta.com/admin/uploads/events/1896925600.jpg",
    "performer": "Penguin",
    "keywords": [
      "Books",
      "Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-28T15:30:00+05:30",
    "endDate": "2025-09-28T16:00:00+05:30"
  },
  {
    "name": "Atta Galatta presents “Support Group” - Support Group by Nimesh George and Gokul R.",
    "description": "Topic: Engagement in Loneliness\nPeople make up big cities but what makes up people’s lives, hopefully not loneliness. Loneliness is an intensely painful state which arises out of lack of intimacy and connectedness. People from every walk2 of life, even those with social contacts or pursuing successful careers can experience sadness from absence of belongingness. This painful experience is felt in a myriad of contexts such as breakups, disagreeing families, fear of rejection, unrelatability, shyness and so on.\nThis support group has been constituted to bring people struggling with disconnectedness in various contexts together for a shared experience of comfort, belongingness, laughter, guidance and above all to break the cycle of sustained loneliness.\nThe support is being organized and moderated by Nimesh George Mphil PhD who is a practicing psychologist based in Bangalore. This session will be co-moderated by Nimesh George & Gokul R, who are both practising psychologists in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1406",
    "image": "https://attagalatta.com/admin/uploads/events/1739175200.png",
    "performer": "Nimesh George",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-28T17:00:00+05:30",
    "endDate": "2025-09-28T18:30:00+05:30"
  },
  {
    "name": "UTOPIA - A Debut Standup Comedy Solo Show - A Comedy Show by Ravi Gaikwad",
    "description": "With a unique voice, as tongue-in-cheek as it is full of heart, in his debut solo, Ravi plans to take us all on a deeply personal journey through the messy, hilarious and strange realities of growing up Dalit, in and around Mumbai.\nBy blending sharp and unapologetic observational humour and unfiltered storytelling, the show tackles themes of caste, class, sex, love, feminism and more in the most hilarious and heartfelt ways imaginable.\nSo it's really a love letter to the complexities of life and with every punchline, emerges a version of the world as only Ravi can see it in his colourful imagination; and for one evening, you are all invited to drop by!”",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1414",
    "image": "https://attagalatta.com/admin/uploads/events/959994457.png",
    "performer": "Ravi Gaikwad",
    "keywords": [
      "Standup Comedy",
      "show"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-28T19:00:00+05:30",
    "endDate": "2025-09-28T20:30:00+05:30"
  },
  {
    "name": "The Other Mohan - Book Discussion by Amrita Shah",
    "description": "Join us at Atta Galatta for the book discussion of “The Other Mohan”, a personal journey on history. The author, Amrita Shah, will be doing a reading, book signing, and this will be followed by a short interaction. On a quest to understand why her great-grandfather, Mohanlal, set sail for South Africa from pre-Independent India, Amrita Shah''s wonderfully engaging book sets on record for the first time a sweeping social and business history of the Indian diaspora in the Indian ocean, drawing out an incredible story spanning centuries of migrations and peopled by slaves, political prisoners, sex workers, lascars, smugglers, indentured workers, traders and interpreters.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1436",
    "image": "https://attagalatta.com/admin/uploads/events/1313227520.jpg",
    "performer": "HarperCollins",
    "keywords": [
      "Book Discussion",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-28T19:00:00+05:30",
    "endDate": "2025-09-28T20:00:00+05:30"
  },
  {
    "name": "“🌈Beyond the Rainbow: LGBTQ+ Voices in Literature” - AG Lit Sisters Thematic Book Club",
    "description": "Representation in literature is more than just visibility. It’s about authenticity, dignity, and the power of stories to shape perspectives. This October, the AG Lit Sisters gather to explore how LGBTQ+ voices have been portrayed across genres, from tender romances and fierce memoirs to bold contemporary fiction.\nThrough discussion and reflection, we’ll celebrate the importance of diverse narratives while questioning the stereotypes and silences that still exist in publishing. Together, we’ll ask: When did literature first help you “see” LGBTQ+ representation? And what did it change in you?\nWhether you’re a reader, writer, or ally, this is a safe space to sip coffee, exchange ideas, and celebrate the many hues of the human experience.\n✨ Come join us. Let’s read beyond the rainbow.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1439",
    "image": "https://attagalatta.com/admin/uploads/events/1307259216.png",
    "performer": "Dr. Chhavi Gandhi Juneja",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-04T11:00:00+05:30",
    "endDate": "2025-10-04T12:30:00+05:30"
  },
  {
    "name": "Turn Books into Glowing Memories – Diwali Special Workshop - Book Lamp Making Workshop",
    "description": "Turn Books into Glowing Memories – Diwali Special Workshop \nThis Diwali, swap screens for stories and craft your own glowing Book Lamp! \nWith every fold, flip, and sparkle, you’ll bring light to life—literally. \nWhy join? \nExperience mindful making in a cozy bookstore atmosphere \nLaughter, bonding & creativity with family or friends — or enjoy soulful me-time \nRelish the warm smell of books, and unwind at the adjoining café — the perfect nook for rainy weather ☕🌧️📚 \nTake home a handmade lamp to brighten your space (or gift someone you love!) \n🌿 All materials provided \n✨ Limited seats — book yours now and let your stories shine! \nMindful making, the fragrance of books & a cozy café corner await you ☕📚🌧️",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1426",
    "image": "https://attagalatta.com/admin/uploads/events/1078833056.png",
    "performer": "Deepti Krishna",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-04T15:00:00+05:30",
    "endDate": "2025-10-04T17:00:00+05:30"
  },
  {
    "name": "Kirtan with Neha: An Evening of Modern Kirtan Jamming - A Musical Kirtan Jamming session",
    "description": "Step away from the everyday and into a space of pure positive energy. \"Kirtan with Neha\" is a unique evening presented by Kirtan Intelligence, where ancient chants meet modern rhythm. This is not your typical spiritual gathering—it's a dynamic, interactive experience of music, mindfulness, and community. Join us for a modern Kirtan Jamming session dedicated to fostering wellness and inner peace through soulful vibrations and shared energy. It’s an opportunity to connect with something bigger than yourself, and most importantly, with yourself.\nWhy to join\nThis event is a powerful antidote to the pressures of modern life. Whether you are a professional grappling with burnout, a student facing academic stress, or a young person/a mother/a homemaker or anyone, feeling overwhelmed and lacking focus, this evening is for you. We provide a space to combat the feeling of being \"stuck\" and find a renewed sense of clarity and purpose. By chanting together, you’ll not only find a release from stress but also an inner strength that helps you navigate life's challenges. It's a mindful pause to reset, recharge, and rediscover your inner resilience.\nFeaturing\nThe evening is led by Neha Agarwal with a uniquely grounded perspective. With a background as a Chartered Accountant, Company Secretary, and an IIM Lucknow Alumni, Neha has navigated the demanding corporate world with over a decade of experience, including working with B\nig 4s, startups, and non-profits.  Leading the Kirtan Jamming with the Kirtan Intelligence team, she brings a belief \"More of Kirtan = Less of Stress.\"\n \nWhat to expect\nPrepare for a holistic experience that engages your mind, body, and soul.\n * A unique jamming session that blends soulful chants with a mixer of slow and high beats, making you move not just from the outside, but also from within.\n * Guided meditation interludes to help you anchor your focus and find your calm center.\n * Food for thought conversations where we connect personal and professional problems with the transformative power of chanting.\n * Networking with a purpose—connect with a community of like-minded individuals, fostering positive vibrations and meaningful connections.\n * A complete detox for your mind and body, leaving you feeling refreshed, rejuvenated, and full of positive energy.\nEnding quote\nCome, get and spread the positive energy by chanting together.\nYour inner harmony is just one chant away.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1446",
    "image": "https://attagalatta.com/admin/uploads/events/282566746.jpg",
    "performer": "Neha Agarwal",
    "keywords": [
      "Music",
      "Jamming"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-04T17:30:00+05:30",
    "endDate": "2025-10-04T19:30:00+05:30"
  },
  {
    "name": "Lahe Lahe Caravan presents “Harry Potter Book Discussion” - Meetup by Sonali Bhatia",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1433",
    "image": "https://attagalatta.com/admin/uploads/events/1110208384.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-05T11:00:00+05:30",
    "endDate": "2025-10-05T12:30:00+05:30"
  },
  {
    "name": "Film screening of Dhadak 2 - A conversation with director Shazia Iqbal and poet Aleena",
    "description": "Moonbird Creative is hosting a special screening of Dhadak 2 on October 5th at Atta Galatta, followed by a conversation with director Shazia Iqbal and poet Aleena. It’s an evening on women’s art, politics, and the courage to interrupt the mainstream. Come hang out, watch the film, and be part of the chat.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1435",
    "image": "https://attagalatta.com/admin/uploads/events/700199069.png",
    "performer": "Moonbird Creative, \nRheea Mukherjee,",
    "keywords": [
      "film screening",
      "Discussion"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-10-05T11:30:00+05:30",
    "endDate": "2025-10-05T14:30:00+05:30"
  },
  {
    "name": "Glass Bottle Decoupage Workshop - Workshop by Motley Roots",
    "description": "Decoupage art is a very interesting and intricate art form from French, where cutting and pasting of paper is used on different materials. Special type of glue and many different decoupage paper is used to create this art. It is the most versatile and easy way to create wonderful home decor and gifts. Once you learn the technique you can select your own base. \nThese workshops guide you from the basics of decoupage, material, technique and a huge variety of papers are used. Exploring a clear glass surfaced bottle and decorate it in your own style. \nIt's time for some creative gateways to explore the intricate age old artform.  This beginner friendly workshop will guide you through the intricacy of art and fun filled time.\nLearn to get a professional painting looking decoupage art\nGuided session from start. Learning about materials and minimal details. And get your bottle from scratch to a finished masterpiece.\nNot just fun of cutting pasting paper but a soothing and calming process that anyone of any age and ability can enjoy.\nOpportunity to seek further clarification even after the session ends. Any question on Decoupage and we will be happy to answer it.\nTake back your own created masterpiece to adore your house.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1445",
    "image": "https://attagalatta.com/admin/uploads/events/462272597.png",
    "performer": "Motley Roots",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-10-05T12:30:00+05:30",
    "endDate": "2025-10-05T14:30:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup by ADHD Queeple",
    "description": "The next dates for Queer Quiet Hours are here!  Register here - http://bit.ly/adhdqueeple\r\nQueer Quiet Hours is back — a cozy space to rest, make art, and just be. No pressure to talk, no need to perform. Just soft community vibes and gentle company. Bring your own project or come as you are. We'll have plenty of art stuff for you to use.\n✨ For LGBTQIA+ folks only. We haven't opened it up to allies yet.\n📅 5th October\nSunday, 3 - 6 PM\n📍 @attagalatta, Indiranagar, Bangalore\n🆓 Free to join. Limited spots ( Sign up )\n📸 No photos taken without clear consent.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1434",
    "image": "https://attagalatta.com/admin/uploads/events/508895446.png",
    "performer": "Jade",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-05T15:00:00+05:30",
    "endDate": "2025-10-05T18:00:00+05:30"
  },
  {
    "name": "Math Cafe - An evening of Games, Strategy & Aha moments by Career Space",
    "description": "Join us for a 3-hour gamified session where math lovers, puzzle solvers, and curious minds come together to play, solve, and win.\nYou’ll crack puzzles, earn Career Space coins, unlock hints, and compete for medals, all while sipping coffee and having fun.\nThink of it as India’s version of a brain-game reality show, but live, interactive, and completely immersive. Whether you love math or fear it, Math Café will make you see numbers in a whole new way.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1437",
    "image": "https://attagalatta.com/admin/uploads/events/509177192.jpg",
    "performer": "Taral Shah",
    "keywords": [
      "Education",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-05T15:00:00+05:30",
    "endDate": "2025-10-05T18:00:00+05:30"
  },
  {
    "name": "Bangalore Writers Workshop presents “The BWW Book of Emerging Poets” - Book Launch with Bhumika Anand",
    "description": "Bangalore Writers Workshop (BWW) showcases 39 emerging global poets with 116 poems in this anthology, The BWW Book of Emerging Poets. This book commemorates ten years of the BWW Poetry workshop with its flower batches inspired by Charles Baudelaire’s Les Fleurs du mal. We can assure you there is a poem for everyone. Read in order or pick a poem a day. Let our poems move you and inspire you. Come, celebrate our poets with us. \nBWW is the first-of-its-kind writing and storytelling school in Bangalore, India. Founded in 2011, we have since been running intensive and supportive creative writing and other workshops, while building a community of writers in the city. BWW’s mission is to foster the creative mind, encourage a community, and make writers aware of who they are as creators of text. \n'Every poet in this anthology is intense and passionate about poetry, while being unique. A delight to read this orchestra of voices. Kudos to the Bangalore Writers Workshop for bringing out the best in all these poets.' - Mani Rao.\n\r\nCome meet poets Nida Sahar, Parnika Reys Gamat, Philip John, Rahul Krishnan, Ritika Chandy and Sarita Talwai.\n\r\nJoin us for the launch of this anthology at Atta Galatta on 5th October at 7 PM!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1442",
    "image": "https://attagalatta.com/admin/uploads/events/1805308546.png",
    "performer": "Bhumika Anand",
    "keywords": [
      "Books",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-05T19:00:00+05:30",
    "endDate": "2025-10-05T20:00:00+05:30"
  },
  {
    "name": "Madhubani Art - Workshop by Trishna Patnaik",
    "description": "India has a rich tradition of folk arts. The custodians of which are the many tribes that live in the interiors of various states. Madhubani or Mithila painting is a folk art form, originated from Mithila region of Bihar.\nThe paintings are traditionally based on mythological, folk themes and pastoral symbols. The designs announce the occasion of the celebration and solicit good fortune and divine blessings.\nParticipate in the Madhubani Art Workshop, get a chance to appreciate the art form and create your very own Madhubani Art masterpiece with acrylic colours on cartridge sheets.\nDate: 9th October, 2025 (Thursday)\nTimings:  1:30 to 3:30  pm\nAge Group: Teens and Adults\nFees: 1300 INR per person including Art Material \nVenue: Atta Galatta, Bengaluru \nTakeaway: One Complete Painting (A3 size)\nFor registrations please contact Trishna Patnaik on 9867982075 (Whatsapp).",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1427",
    "image": "https://attagalatta.com/admin/uploads/events/1112984503.png",
    "performer": "Trishna Patnaik",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-10-09T13:30:00+05:30",
    "endDate": "2025-10-09T15:30:00+05:30"
  },
  {
    "name": "An Evening with Aditi Krishnakumar: The Real History Behind the Murder Mystery - An interactive session with Aditi Krishnakumar",
    "description": "From merchants to teachers, from cowherds to moneylenders, our history is the story of people whose lives wove together into the sometimes inspiring, sometimes tragic, always rich and always layered tapestry of India.  \nJoin Aditi Krishnakumar, author of The White Lotus, for an interactive session on murders, the social pressures inherent in daily life, and how fiction makes history real – and leave with something that you’ve written yourself.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1448",
    "image": "https://attagalatta.com/admin/uploads/events/838259919.png",
    "performer": "Aditi Krishnakumar",
    "keywords": [
      "Books",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-11T16:00:00+05:30",
    "endDate": "2025-10-11T17:30:00+05:30"
  },
  {
    "name": "It’s All in Your Mind - Book Reading by Trishna Patnaik",
    "description": "Your mind is your most powerful tool—are you using it to lift yourself up or hold yourself back?\nIt’s All in Your Mind is the latest book release, here to help you break free from negative thought loops, build mental toughness, and create a mindset wired for growth and success.\nThis book is your guide to mastering your thoughts, developing emotional intelligence, and cultivating the confidence and resilience you need to move forward. If your inner voice has been holding you back, now’s the time to take control and reclaim your power.\nThe shift begins within. Are you ready to train your mind and transform your life?\nJoin us for a Book Reading Session with Trishna Patnaik, celebrated fine artist, art therapist, and wellness author, as she brings to life her latest work,“It’s All in Your Mind,” to your world.\nThis isn’t just a reading, it’s a journey into the world of healing, emotions, creativity, and inner transformation.\nAbout the Author:\nA self-taught artist and healer, Trishna moved on from corporate life to follow her passion for painting and wellness. With over 14 years of experience, she now helps people reconnect with themselves through art and therapy.\nReserve your spot and be part of a memorable conversation.\nTickets are Rs 250. please RSVP at the number below\nRSVP: 9867982075",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1428",
    "image": "https://attagalatta.com/admin/uploads/events/298406400.png",
    "performer": "Trishna Patnaik",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-11T18:00:00+05:30",
    "endDate": "2025-10-11T19:00:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup by The Listeners Circle",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1447",
    "image": "https://attagalatta.com/admin/uploads/events/685361361.png",
    "performer": "The Listeners Circle",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-12T11:00:00+05:30",
    "endDate": "2025-10-12T13:00:00+05:30"
  },
  {
    "name": "“The Wildflower of Assam” - Book Discussion by Gayatri Sarkar",
    "description": "Join us for an engaging evening at Atta Galatta, Bangalore’s iconic bookstore and cultural space, as Gayatri Sarkar discusses her acclaimed debut novel The Wildflower of Assam.\nSet against the turbulent backdrop of Assam between the 1950s and 1980s, this historical and women’s fiction novel traces the lives of migrant women navigating displacement, resilience, and identity. Through the unforgettable character of Shabana and her family, the story weaves together themes of survival, migration, and the search for belonging.\nIn conversation with Sweety Roy, Gayatri will share insights into her research, writing journey, and the social realities that shaped the novel. The discussion will be followed by an audience Q&A and a book signing session.\n \nWhy attend?\n\nDiscover the inspiration and untold history behind The Wildflower of Assam\nBe part of an intimate conversation on migration, women’s voices, and resilience\nConnect with the author and get your copy signed",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1444",
    "image": "https://attagalatta.com/admin/uploads/events/794884537.jpeg",
    "performer": "Gayatri Sarkar, \nSweety Roy,",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-12T18:00:00+05:30",
    "endDate": "2025-10-12T19:30:00+05:30"
  },
  {
    "name": "Vrindaban, Present Please  - An Interactive play written and performed by Somudranil Sarkar",
    "description": "About the play \"Vrindaban, Present Please\" is an immersive, one-man interactive play set in a rural Indian village, where Samiran Banerjee, a Kolkata teacher, is transferred to a village school after a Supreme Court ruling. Assigned to a chaotic school once led by the mysteriously absent Salma Khatoon, Samiran's efforts to restore order only lead him deeper into unsettling events. From a water shortage to a snake in his room, his attempts to connect with the eccentric villagers only intensify his isolation. But behind it all, Samiran harbors a secret—someone named Vrindaban. Why does he hide this figure? Is it the only refuge in a world that refuses to understand him? The play unravels questions about isolation, hidden truths, and the blurred lines between personal and professional life.\nAbout the artist:  Somudranil Sarkar, a theatre maker from kolkata. He has over 25 years of experience in theatre and has had the privilege of training under some of the most respected names in the Bengali theatre circuit, including Rudraprasad Sengupta, Swatilekha Sengupta, Debshankar Halder, Sohini Sengupta, and Goutam Halder in Nandikar. He has also trained in mime under the guidance of mime guru Jogesh Dutta. Over the years, he has directed and acted in over 100 plays and curated various theatre workshops for diverse groups. Somudranil has received the Azhar Alam Young Director’s Award for his contribution to the field.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1431",
    "image": "https://attagalatta.com/admin/uploads/events/2101294310.png",
    "performer": "Somudranil Sarkar",
    "keywords": [
      "Theatre",
      "Interactive Play"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-17T19:00:00+05:30",
    "endDate": "2025-10-17T20:00:00+05:30"
  },
  {
    "name": "Food In Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well. So, if viewing the world through the lens of food and literature interests you, then join us for a dialogue on “Food in Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we read our way through several powerful (and delicious) narratives. \nOctober Read: Desi Delicacies. \nEdited by Claire Chambers\nWe assure you that you will enjoy every single bite! The session is free but registration is a must as we have limited spots available. Prachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!\nCopies of the book are available at the store.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1449",
    "image": "https://attagalatta.com/admin/uploads/events/406224205.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-25T11:00:00+05:30",
    "endDate": "2025-10-25T13:00:00+05:30"
  },
  {
    "name": "Bhang and Beyond - Book Signing by Akshaya Bahibala",
    "description": "We’re delighted to host an engaging session with Akshaya Bahibala, author of Bhang Journeys, a book that is part cultural history, part social commentary, and is also shaped by his own tryst with bhang. \nJoin us for an open and interactive conversation where you can chat with him, hear about his journey, and of course, get your copies signed",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1429",
    "image": "https://attagalatta.com/admin/uploads/events/2143283007.jpg",
    "performer": "Akshaya Bahibala",
    "keywords": [
      "Books",
      "Book signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-28T18:30:00+05:30",
    "endDate": "2025-10-28T19:30:00+05:30"
  },
  {
    "name": "Tara Goes Aahhhhh! - Book Reading by Garima Gupta",
    "description": "Facing Fears with Roars and Giggles! Ready for a story that doesn’t need words—just your eyes, your imagination, and all those big, bold feelings? Join Tara and her dino buddy on a wild, wordless adventure as they tackle their fears in the pop-up book Tara Goes Aahhhhh! with author Garima Gupta. It's a roar-some ride through emotions, courage, and friendship.\nAge: 4-8, accompanied by a parent.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1430",
    "image": "https://attagalatta.com/admin/uploads/events/338996915.jpg",
    "performer": "Garima Gupta",
    "keywords": [
      "Books",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-08T11:00:00+05:30",
    "endDate": "2025-11-08T12:30:00+05:30"
  }
]