[
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nAugust Read: Bhog Naivedya: Food Offerings to the Gods by Sujata Shukla Rajan\nWe assure you that you will relish every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT659",
    "image": "https://attagalatta.com/admin/uploads/events/577505300.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books and Literature",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-24T11:00:00+05:30",
    "endDate": "2024-08-24T13:00:00+05:30"
  },
  {
    "name": "Don't Stop Acting 1.0 - Acting Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Acting Workshop in town. \nJoin fellow aspiring actors and actresses for an inspiring session of learning acting through basics at our Writers Club Meet event in the cozy ambiance of the library cafe. Our Acting workshop is designed for aspiring artists who wish to explore the fundamentals of acting and develop their performance skills in a supportive and engaging environment. This immersive workshop offers participants a thorough grounding in acting techniques, character development, and scene work, providing them with the tools needed to bring authenticity and depth to their performances.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no acting experience, as well as intermediate actors looking to refresh their skills. It is also suitable for anyone interested in improving their public speaking and presentation abilities.\nWorkshop Objectives:\n- To introduce participants to the basic principles of acting.\n- To develop participants` abilities to create believable and compelling characters.\n- To enhance participants` skills in scene study and script analysis.\n- To build participants` confidence in performing in front of an audience.\nKey Components involves learning theory and practicals of: \n- Acting Techniques\n- Character Development and Analysis\n- SCript Analysis and Interpretation\n- Understanding Director`s Vision\n- Conveying Emotions\n- Physicality and Movement of Camera\n- Improvization and Spontaneity\n- Voice and Diction\n- Working with Props and Costumes\n- Rehearsals and Performances\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Participating in workshop with enthusiasm.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT646",
    "image": "https://attagalatta.com/admin/uploads/events/219029336.png",
    "performer": "MWM Movies",
    "keywords": [
      "Theatre",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-08-24T11:11:00+05:30",
    "endDate": "2024-08-24T14:22:00+05:30"
  },
  {
    "name": "Warli Art Workshop - Art Course",
    "description": "Warli Art workshop will introduce you to a unique and rich art form practiced by Tribal communities of Maharashtra: The oldest art from North Sahyadri by the Adivasis, A tribal art that depicts the bond between humans and nature. Art is mainly a culmination of geometric shapes depicting the lifestyle and beliefs of the Warli Tribe. and introduce you to the intricacies of this art form.\nA good form of art to start with your basic art skills, easy on any age and gets you interested in the Indian art culture.\nYou need not have any prior experience in drawing or painting in order to attend this course.\nAt the end of the course, you walk out with the joy of having learned about a very interesting art form and having explored its varied facets and richness.\nWhat will you take home?\nKnowledge of Indian Art Culture\nLearn an ancient art form\nCompleted piece of artwork done by yourself\nWhat do you need to bring?\nWater bottle to keep you hydrated.\nThis workshop includes all materials, if required kindly get an Examination Pad / Paper Board.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT693",
    "image": "https://attagalatta.com/admin/uploads/events/1296475091.png",
    "performer": "Sindhoor Suryavamshi",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-08-24T14:00:00+05:30",
    "endDate": "2024-08-24T17:00:00+05:30"
  },
  {
    "name": "Keepsake: A Short Story Collection - Book Signing",
    "description": "Join us for author Neha Gupta's book signing at Atta Galatta on 24th August, Saturday, at 3.30 PM, where she will be signing copies of her short story collection, Keepsake.\n“Life gives us stories to tell!”\nOld photographs, cherished letters, museums, flea markets and heirlooms. From the pressed flowers between the pages of a forgotten book to the humming of a vintage song, from nostalgic daydreams to soulful conversations, the art of keeping memories forever. Just like moments in life, some stories are light-hearted and some intense, each having a heart of its own. Keepsake is a beautiful collection of memories lived and remembered. \nCelebrating nostalgia and storytelling with a cup of tea and conversations.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT654",
    "image": "https://attagalatta.com/admin/uploads/events/1694388288.jpeg",
    "performer": "Neha Gupta",
    "keywords": [
      "Books",
      "Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-24T15:30:00+05:30",
    "endDate": "2024-08-24T16:30:00+05:30"
  },
  {
    "name": "Everything Sucks - Book Launch",
    "description": "Kashish Asif, a popular Instagrammer, navigates life at 18, accompanied by her widowed father, and occasionally present older sister. As her witty reels earn her a large following, she falls into an online battle with Sameer, an aspiring cook and budding Instagrammer. But their playful conflict soon gets blown out of proportion through an error of judgement.\nThen, unexpectedly, they meet in real life. And even more unexpectedly, sparks fly between them. When reality creeps in, and an unfortunate incident forces them to unplug from their phones, they will need to figure out how to deal with life and relationships away from the screens.\nIs it possible to find a real friend (or someone more than a friend) in a world where reactions are staged, people pretend to date each other for the likes, and the only constant is that everything really, really sucks?\nFrom the bestselling author of Asmara’s Summer, filmed as the popular web series Dil Dosti Dilemma, comes a pitch-perfect teenage drama about friendship, family, and finding love in unexpected places. Join us for the launch of this YA book at Atta Galatta on 24th August at 4 PM!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT675",
    "image": "https://attagalatta.com/admin/uploads/events/75829156.png",
    "performer": "Andaleeb Wajid",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-24T16:00:00+05:30",
    "endDate": "2024-08-24T17:00:00+05:30"
  },
  {
    "name": "Hale Bottle Hosa Wine - Kannada Literature Program",
    "description": "Hale Botlee Hosa Wineu is a Kannada literature program whereas, the discussions between senior writers and contemporary Kannada writers.\nThis episode it’s a discussion about a story-film story.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT695",
    "image": "https://attagalatta.com/admin/uploads/events/1370738358.jpg",
    "performer": "Praveen Kumar G, \nSampath Sirimane, \nSatyaki, \nVikas Negiloni,",
    "keywords": [
      "Literature",
      "Discussion"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-08-25T10:30:00+05:30",
    "endDate": "2024-08-25T13:00:00+05:30"
  },
  {
    "name": "Cake Frosting Workshop - Workshop",
    "description": "One-of-a-kind Cake-Frosting workshop happening on 25 August, 2024 in one of the scenic, serene places - Atta Galata in Indiranagar. The workshop is a place to get creative in a fun way with lots of vibrant vibes and colors. We at Gobananas_bakes, strive for everyone walk-away with an amicable experience. It is the perfect getaway for people who like to unwind and furthermore learn Frosting to make intriguing cakes. The Event covers step by step concise, lucid instructions with insights to easier, smarter way to Frost a Bento Cake from an experienced Home-Baker who has conducted many similar workshops. All the materials will be provided to frost a cake, including cute toppers to get an ethereal experience. The participants get to know-how of trending piping methods to notch-up the looks of a piped flower or to border a cake. Furthermore, recipe will be provided to get the stable cream which gives Baker’s sleepless nights. Adieu, icing of the event, the participants get to take the cake proudly along with goodies.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT694",
    "image": "https://attagalatta.com/admin/uploads/events/478308317.png",
    "performer": "Sambavi Ganesh",
    "keywords": [
      "Food",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-08-25T16:00:00+05:30",
    "endDate": "2024-08-25T18:00:00+05:30"
  },
  {
    "name": "What I Call Home - Playback Theatre Performance",
    "description": "Home can mean different things to each of us. For some it’s a city or town, for others it’s the memory of certain people, or events. To some, it’s an emotion while for some it is a dream. And for some, it could be something they have moved on from!\nCome, let’s get together and share with each other; our real-stories of whatever we call ‘home’ and watch as these stories are brought alive by the actors, on-the-spot!\nAbout Playback Theatre:\nMagical, creative, thought-provoking, reflective, unscripted...just like life itself. A format of improvisational, interactive theatre where the actors use their creativity and skill, to present an engaging and sensitive retelling of the audience members’ story, on-the-spot.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT680",
    "image": "https://attagalatta.com/admin/uploads/events/523996055.jpeg",
    "performer": "First Drop Theatre",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-25T17:30:00+05:30",
    "endDate": "2024-08-25T18:30:00+05:30"
  },
  {
    "name": "Park - Play",
    "description": "One park. Three men. Three Benches and yet not enough space for all.\nManav Kaul’s \"Park\" delves into the complicated relationship of humans with space. Who has the better right on the space? The ones who need it for convenience or the ones who have a history associated or the ones who actually occupy it now? Why are men ready to wage wars for a mere piece of land? Is it a matter of power, history, pride or just plain greed?\nThrough the lens of the park, Manav Kaul offers a commentary on the human condition, prompting the audience to reflect on their own lives and relationships.\nAavirbhaav Naatya Manch presents a play that takes place in a seemingly ordinary setting – a PARK – but transcends the mundane as it delves into the complexities of the characters’ lives.\nDirector - Avinash Jain & Vikash Kumar\nActors - Rahul Gome, Jayant Sethi, Yashodhar Upadhyay",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT677",
    "image": "https://attagalatta.com/admin/uploads/events/161060630.png",
    "performer": "Aavirbhaav Naatya Manch",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-31T16:30:00+05:30",
    "endDate": "2024-08-31T17:30:00+05:30"
  },
  {
    "name": "Park - Play",
    "description": "One park. Three men. Three Benches and yet not enough space for all.\nManav Kaul’s \"Park\" delves into the complicated relationship of humans with space. Who has the better right on the space? The ones who need it for convenience or the ones who have a history associated or the ones who actually occupy it now? Why are men ready to wage wars for a mere piece of land? Is it a matter of power, history, pride or just plain greed?\nThrough the lens of the park, Manav Kaul offers a commentary on the human condition, prompting the audience to reflect on their own lives and relationships.\nAavirbhaav Naatya Manch presents a play that takes place in a seemingly ordinary setting – a PARK – but transcends the mundane as it delves into the complexities of the characters’ lives.\nDirector - Avinash Jain & Vikash Kumar\nActors - Rahul Gome, Jayant Sethi, Yashodhar Upadhyay",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT677",
    "image": "https://attagalatta.com/admin/uploads/events/161060630.png",
    "performer": "Aavirbhaav Naatya Manch",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-31T19:00:00+05:30",
    "endDate": "2024-08-31T17:30:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Reflection Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other`s experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT682",
    "image": "https://attagalatta.com/admin/uploads/events/2080566301.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Social",
      "Support Group"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-09-08T17:00:00+05:30",
    "endDate": "2024-09-08T19:00:00+05:30"
  },
  {
    "name": "Returning Home - Workshop",
    "description": "How do I break free from the deep-rooted conditioning of shame, self-doubt and self-judgment and embrace my authenticity? How do I align with my life`s essence and emerge as a whole?\nIf you find yourself grappling with these questions,\nIf you are someone finding it challenging to navigate through your emotions and aspire to lead a harmonious life.\nOr a curious explorer willing to discover the mysteries of our bodies. We invite you to join the Audacious Circle where we dive deep into understanding life essence, the concept of audacious love and return to our bodies.\nThe Audacious Circle is an initiative by Yashika CG, an educator, author and yoga practitioner who is on a forever journey into the great unknown.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT669",
    "image": "https://attagalatta.com/admin/uploads/events/138855616.jpg",
    "performer": "Yashika C. G.",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-14T11:00:00+05:30",
    "endDate": "2024-09-14T14:00:00+05:30"
  },
  {
    "name": "Pen & Latte 4.0 - Story Writing Workshop",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT683",
    "image": "https://attagalatta.com/admin/uploads/events/419501552.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-15T11:11:00+05:30",
    "endDate": "2024-09-15T14:22:00+05:30"
  },
  {
    "name": "Infinitely Polar Bear - Mindful Cinema",
    "description": "\"Two emotions fighting each other to have control of you. Fights never end well. But being mindful around people who struggle with this fight every day is possible. Being at two poles of emotions is a conflict, confusion, embarrassment, and much more. Let`s know more about it!\"\nPrevention begins when we generate awareness and have empathy towards the happenings of our surroundings as well. Shraddha decided to screen cinema from the world to bring in some awareness about various aspects of mental health. The screening of the film will be followed by a discussion on the subject.\nOn 18th August 2024, we will screen the movie \"Infinitely Polar Bear\". It is an English movie with English subtitles on the father-daughter relationship.\nDirector and Writer: Maya Forbes\nCast: Mark Ruffalo and Zoe Saldana\nAfter the movie, there will be a facilitated discussion around \"Bipolar Disorder.\"\nFacilitator: Shraddha Modi, a psychologist and behavior therapist whose passion for mental health has motivated her to study and work in this field.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT696",
    "image": "https://attagalatta.com/admin/uploads/events/435924419.png",
    "performer": "Shraddha Modi",
    "keywords": [
      "Wellness and Health",
      "Film Screening"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-15T12:30:00+05:30",
    "endDate": "2024-09-15T14:30:00+05:30"
  },
  {
    "name": "Screen Craft 2.0 - Screenplay Writing Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Screenplay Writing Workshop in town. \nOur Screenplay Writing workshop is an intensive program designed to guide aspiring screenwriters through the process of crafting compelling and marketable screenplays. This workshop provides participants with a solid foundation in screenplay structure, character development, dialogue writing, and industry-standard formatting, ensuring they are equipped to bring their stories to life on the big screen.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no screenwriting experience, as well as intermediate writers looking to refine their skills. It is also suitable for novelists, playwrights, or anyone interested in exploring the craft of screenwriting.\nWorkshop Objectives:\n- To introduce participants to the fundamentals of screenplay writing.\n- To develop participants` skills in creating engaging plots and well-rounded characters.\n- To enhance participants` abilities to write effective dialogue and visual storytelling.\n- To familiarize participants with the screenplay industry and submission processes.\nKey Components involves learning theory and practicals of: \n- Story and Character Development\n- Screenplay Structure\n- Dialogue Writing\n- Scene Construction\n- Visual Storytelling\n- Formatting and Style\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Writing a story based on a prompt.\n- Participating in the curated feedback discussion.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT685",
    "image": "https://attagalatta.com/admin/uploads/events/227598307.png",
    "performer": "MWM Movies",
    "keywords": [
      "Film",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-21T11:11:00+05:30",
    "endDate": "2024-09-21T14:22:00+05:30"
  },
  {
    "name": "Chapters Unsealed 4.0 - Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nBring along your favorite book and delve into a shared reading experience.\n \nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nSharing your views on favorite books.\nParticipating in the curated discussion.\nVoting for a Monthly Book Read.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT686",
    "image": "https://attagalatta.com/admin/uploads/events/1490616635.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-22T14:22:00+05:30",
    "endDate": "2024-09-22T17:55:00+05:30"
  },
  {
    "name": "Ranis of India - Storytelling",
    "description": "Ranis of India is a collection of stories from various oral, folk, mythical and historical narratives collected based on numerous travel and research over the last few years on the lesser-known or completely forgotten women rulers of this wonderful country by Vikram Sridhar.\nOver one hour, through oral story-telling smattered with folk songs, we travel the country, going deeper into many stories of Indian queens from myths, history and present times, whose stories need to be told and heard.\nFrom North to South, East to West there have been women rulers, administrators, changemakers who’ve changed and touched history strongly.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT681",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-28T20:00:00+05:30",
    "endDate": "2024-09-28T21:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT678",
    "image": "https://attagalatta.com/admin/uploads/events/1590760097.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-29T07:00:00+05:30",
    "endDate": "2024-09-29T09:30:00+05:30"
  },
  {
    "name": "Ranis of India - Storytelling",
    "description": "Ranis of India is a collection of stories from various oral, folk, mythical and historical narratives collected based on numerous travel and research over the last few years on the lesser-known or completely forgotten women rulers of this wonderful country by Vikram Sridhar.\nOver one hour, through oral story-telling smattered with folk songs, we travel the country, going deeper into many stories of Indian queens from myths, history and present times, whose stories need to be told and heard.\nFrom North to South, East to West there have been women rulers, administrators, changemakers who’ve changed and touched history strongly.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT681",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-29T20:00:00+05:30",
    "endDate": "2024-09-29T21:00:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Reflection Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other`s experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT684",
    "image": "https://attagalatta.com/admin/uploads/events/1778962806.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Social",
      "Support Group"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-10-06T17:00:00+05:30",
    "endDate": "2024-10-06T19:00:00+05:30"
  }
]