[
  {
    "name": "Poetic Brew 1.0 - Poetry Meetup",
    "description": "Gather, Poetic Souls, for an afternoon divine, where verses entwine and words intertwine. In this literary realm, hearts open wide, For a Poetry Meet, let passion be our guide.\nInviting all Poetry enthusiasts 📚 to an In-Person Meet where you can indulge in creative poetry writing and reading session. \nEvent Sections:\n1. Icebreaker Extravaganza - Intro yourself & let’s play an interesting fun Game to break ice cubes.\n2. Poet`s Spotlight: Write a poem based on an innovative prompt letting your thoughts engage.\n<-- INTERMISSION: CHILL & CHAT -->\n3. Recital Stage: Take center stage for 5-7 minutes, discuss the verse that`s touched your head. As you share your verse, let passion reign.\n4. Verse of the Month & What Lies Ahead - Vote for the next Poetry Book to read.\n \n5. Say Butter - Click that Snap button for a group picture.\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolising the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT849",
    "image": "https://attagalatta.com/admin/uploads/events/2044689334.png",
    "performer": "Maddy",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-07T11:11:00+05:30",
    "endDate": "2024-12-07T14:22:00+05:30"
  },
  {
    "name": "Atta Galatta Book Club - Monthly Book Club",
    "description": "What have you been reading? Come, discuss your latest read. Each member gets 5-7 minutes to talk about the book, theme, plot, with 2 minutes to answer any questions others might have. This month’s special focus will be on the classics.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT850",
    "image": "https://attagalatta.com/admin/uploads/events/677065040.jpeg",
    "performer": "Palgun KJ",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-07T15:00:00+05:30",
    "endDate": "2024-12-07T17:00:00+05:30"
  },
  {
    "name": "Narratives of Familiar Spaces - Writing Workshop",
    "description": "Join Kritika Arya for a writing workshop inspired by her memoir, Citizen by Descent. This workshop explores the profound impact of spaces on our lives and how they unintentionally shape our identities. Through a series of guided exercises, we'll delve into the interconnectedness of our physical, intellectual, and emotional experiences within a specific space of your choosing. We’ll recall the little details such as sights, sensations, textures and memories that are associated with the space, which will serve as the foundation for your piece.\nWhether you're a seasoned writer or just starting out, this workshop offers a supportive and inspiring environment to express yourself.\nWhat you’ll need:\nA notebook\nPens/Pencils – anything you’re comfortable writing with\nWriter Bio\nKritika Arya is an author, screenwriter, playwright and content writer. She is currently working on a mental health documentary called I Hope This Helps. She independently published her memoir called Citizen by Descent, a collection of illustrated autobiographical essays about home, identity, mental health and being a third culture kid. Each essay takes place in a different home that she has lived in and each essay has been illustrated by a different artist from around the world.\nWith an MA in Dramatic Writing from Drama Centre at Central Saint Martins (UAL), she has extensive experience in writers' rooms, mentoring, and facilitating which has honed her writing and listening skills. You can follow Kritika Arya on instagram @wordsbykritika",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT852",
    "image": "https://attagalatta.com/admin/uploads/events/301682969.jpg",
    "performer": "Krtika Arya",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-12-07T16:00:00+05:30",
    "endDate": "2024-12-07T18:00:00+05:30"
  },
  {
    "name": "Banned Gals of Lore - Stand-Up Comedy Show",
    "description": "Banned Gals of Lore! An evening filled with laughter where Anamika, Amruta, Shivangi, and Spatica take over the stage in their times and do their best for you in the Live audience. It’s an evening of great laughs at a great price! Come on down!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT851",
    "image": "https://attagalatta.com/admin/uploads/events/1023606340.png",
    "performer": "Amruta Bendre, \nAnamika Haridas, \nShivangi Srivatsava, \nSpatica Ramanujam,",
    "keywords": [
      "Standup Comedy",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-07T19:00:00+05:30",
    "endDate": "2024-12-07T20:00:00+05:30"
  },
  {
    "name": "Datsan-e-Akhtari - Dastangoi Performance",
    "description": "Akhtari Bai Faizabadi, also known as Begum Akhtar was a unique singer of her time. In her unique voice and andaz, she produced such hauntingly sweet notes, coupled with her spontaneity, that the audience were immediately captivated. Beginning at the age of Seven, Begum Akhtar kept her audience spellbound for almost six decades.\nThis was Begum Akhtar, the Singer; but her personal journey is equally captivating and inspiring. She was a brave, fiercely independent-minded person, who drew her life path herself amidst the struggles that life threw at her. At a time when the social and political landscape of the country was gradually changing, she set her own standards of life and arts, not withstanding the constraints of times and emerged as a stronger person and better singer by living upto those standards.\nWith all its highs and lows and awws and wows, Dastan-e-Akhtari is the story of the life of the legend of her time and beyond, Begum Akhtar. In this performance, the story of her life will be told by Kafeel Jafri – a Dastango (‘storyteller’ in Urdu), interspersed with rendition of her songs – Ghazals & Thumris by Yusra Naqvi, a trained Hindustani Classical Singer.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT853",
    "image": "https://attagalatta.com/admin/uploads/events/264633393.png",
    "performer": "Kafeel Jafri, \nYusra Naqvi,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-07T19:00:00+05:30",
    "endDate": "2024-12-07T20:45:00+05:30"
  },
  {
    "name": "All-In: The Moments - Improv Comedy Show",
    "description": "9 improvisers take over the stage without any script. A few prompts from the audience are all that they want. Can they make things funny? Can they even come up with a story? They have 1.5 hours to prove.\nWhat is improv?\nImprov is not a play, there’s no script. It is also not standup, there are no tried and tested jokes. It is somewhere in between these two things. You’ll have to come to find out!\nWhy should you attend?\n\nYou are part of the script - your prompts will decide where the show will go\nYou can bring a date for a cool show\nYou can tell your Instagram friends that you attended a cool show",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT821",
    "image": "https://attagalatta.com/admin/uploads/events/1795373959.png",
    "performer": "All In Improv",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-21T17:30:00+05:30",
    "endDate": "2024-12-21T19:00:00+05:30"
  }
]