[
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nDecember Read: From the King’s Table to Street Food by Pushpesh Pant\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT860",
    "image": "https://attagalatta.com/admin/uploads/events/156722764.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-21T11:00:00+05:30",
    "endDate": "2024-12-21T13:00:00+05:30"
  },
  {
    "name": "Screen Craft 3.0 - Screenplay Writing Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Screenplay Writing Workshop in town. \nOur Screenplay Writing workshop is an intensive program designed to guide aspiring screenwriters through the process of crafting compelling and marketable screenplays. This workshop provides participants with a solid foundation in screenplay structure, character development, dialogue writing, and industry-standard formatting, ensuring they are equipped to bring their stories to life on the big screen.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no screenwriting experience, as well as intermediate writers looking to refine their skills. It is also suitable for novelists, playwrights, or anyone interested in exploring the craft of screenwriting.\nWorkshop Objectives:\n- To introduce participants to the fundamentals of screenplay writing.\n- To develop participants` skills in creating engaging plots and well-rounded characters.\n- To enhance participants` abilities to write effective dialogue and visual storytelling.\n- To familiarize participants with the screenplay industry and submission processes.\nKey Components involves learning theory and practicals of: \n- Story and Character Development\n- Screenplay Structure\n- Dialogue Writing\n- Scene Construction\n- Visual Storytelling\n- Formatting and Style\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Writing a story based on a prompt.\n- Participating in the curated feedback discussion.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT862",
    "image": "https://attagalatta.com/admin/uploads/events/1013544196.png",
    "performer": "Maddie",
    "keywords": [
      "Film",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-12-21T12:12:00+05:30",
    "endDate": "2024-12-21T15:33:00+05:30"
  },
  {
    "name": "Feelings on Canvas - Exploratory Art Workshop",
    "description": "Take a creative journey through the highs, lows, and everything in between from 2024. Feelings on Canvas is an exploratory art workshop designed to help you reconnect with your emotions and express them through art. Whether it's the joy of a celebration, the challenges you overcame, or the quiet moments of introspection, this workshop lets you bring your unique story to life on canvas. No prior artistic experience is required—just an open mind and a willingness to dive into your feelings. \nLed by Junu, a talented multimedia artist and art guide, this session will also feature festive surprises, including handmade gifts for each participant! \nWho Can Attend?\nThis workshop is open to everyone—no age or skill barriers. Just bring your enthusiasm, and we’ll provide the rest. \nJoin us for a cozy, creative celebration this festive season and leave with a one-of-a-kind masterpiece that tells your story!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT866",
    "image": "https://attagalatta.com/admin/uploads/events/95059766.png",
    "performer": "Junu",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-12-21T15:00:00+05:30",
    "endDate": "2024-12-21T17:00:00+05:30"
  },
  {
    "name": "International Saree Day Meetup - Meetup",
    "description": "Saree Sakhiyaan, a community for and of saree enthusiasts, is hosting a one-of-its-kind celebration on the occasion of International Saree Day on December 21st, 2024. Saree Sakhiyaan is a thriving saree tribe that champions the saree as a versatile garment for all. Through various curated events, Saree Sakhiyaan connects enthusiasts and encourages them to celebrate the saree in modern, innovative ways. The International Saree Day meet up is a first of the community's thoughtfully-curated events in Bengaluru city.\nThe meet up will be an intimate but informal gathering of like-minded individuals across ages and genders, and will have interesting aspects to it such as conversation starter games like Saree Bingo and Saree Taboo; a preloved saree swap; as well as a unique meet and greet opportunity with some iconic personalities from the larger saree-wearing community across Bengaluru city. Some of these include IT professional Dhruv Dhody, clinical nutritionist Dr Dhruti Bal, image consultant & founder of the Preloved Co Meghana Khanna, textile designer Abhishek Smurthy, and brand strategist and marketer Shruti Srivastava. These personalities have also contributed their personal stories to a coffee table book called Saree Stories from the 21st Century, curated by Saree Sakhiyaan, in partnership with Stonemill Publishing.\nThe evening is likely to be a memorable one for saree enthusiasts across the city.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT870",
    "image": "https://attagalatta.com/admin/uploads/events/1820335631.png",
    "performer": "Saree Sakhiyan",
    "keywords": [
      "Lifestyle",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-21T17:00:00+05:30",
    "endDate": "2024-12-21T19:00:00+05:30"
  },
  {
    "name": "All-In: The Moments - Improv Comedy Show",
    "description": "9 improvisers take over the stage without any script. A few prompts from the audience are all that they want. Can they make things funny? Can they even come up with a story? They have 1.5 hours to prove.\nWhat is improv?\nImprov is not a play, there’s no script. It is also not standup, there are no tried and tested jokes. It is somewhere in between these two things. You’ll have to come to find out!\nWhy should you attend?\n\nYou are part of the script - your prompts will decide where the show will go\nYou can bring a date for a cool show\nYou can tell your Instagram friends that you attended a cool show",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT821",
    "image": "https://attagalatta.com/admin/uploads/events/1795373959.png",
    "performer": "All In Improv",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-21T17:30:00+05:30",
    "endDate": "2024-12-21T19:00:00+05:30"
  },
  {
    "name": "Saikiran Checks In - Stand-Up Comedy Show",
    "description": "Why should rich people have all the fun? What could go wrong if a middle-class guy is put up in a five-star hotel. If you have ever stayed in any kind of hotel, lodge, inn, resort this show will be hilarious.\nA comedy show with incisive observations, outrageous anecdotes and pretentious social commentary.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT861",
    "image": "https://attagalatta.com/admin/uploads/events/1463167546.png",
    "performer": "Saikiran",
    "keywords": [
      "Standup Comedy",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-21T19:30:00+05:30",
    "endDate": "2024-12-21T21:00:00+05:30"
  },
  {
    "name": "Chapters Unsealed 6.0 - Monthly Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nCurated Books for Discussion on Monthly Reads:\n- CARRIE by Stephen King (Winner of Vote list)\n- MEN WITHOUT WOMEN by Murakami\n- MURDER IN A MINUTE by Shouvik Bhattacharya\n- THE VEGETARIAN by HAN KANG\n- THE INMATE by Frieda McFadden\n- STARSHIP TROOPERS by Robert A Heinlien\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nSharing your views on favorite books.\nParticipating in the curated discussion.\nVoting for a Monthly Book Read.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT864",
    "image": "https://attagalatta.com/admin/uploads/events/1711557125.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-22T11:11:00+05:30",
    "endDate": "2024-12-22T14:22:00+05:30"
  },
  {
    "name": "Hugs - December Storytelling Meetup for Adults",
    "description": "Another wonderful year has passed by. As we come closer to the new year, let's end this year that has given us stories to remember, stories to cherish, stories to ponder, with a warm embrace. BSS invites you all to our year end story party 🥳 🎉 - Our monthly storytelling meet up for adults\nThe theme for this month is HUG.\nWhat does this word mean to you? What emotions does it trigger and what stories are coming to you? We would love to hear!\nSend us the synopsis of your storyline to bangalorestorytellingsociety@gmail.com by 19th December. Come one and come all, if not to tell, to listen and be there to send farewell to this year with your story tribe.\n\" Warm hugs and Entry\" FREE!!!\nAbout BSS \nBSS is a not-for-profit organization established in the year 2013 by like-minded story lovers with the sole idea of reviving and promoting the oral storytelling traditions in India. The monthly meet-up for adults by the BANGALORE STORYTELLING SOCIETY, that began in 2013, aims to revive the traditional way of sharing tales amidst a gathering.  This is one of the longest running meetups in India.\nAny questions? We are glad to help. WhatsApp: 9845680816",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT863",
    "image": "https://attagalatta.com/admin/uploads/events/732075484.jpg",
    "performer": "Bangalore Storytelling Society",
    "keywords": [
      "Storytelling",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-22T15:30:00+05:30",
    "endDate": "2024-12-22T17:00:00+05:30"
  },
  {
    "name": "Read A Kitaab - Monthly Book Club",
    "description": "Read A Kitaab is an unbiased community of Readers, Booklovers, writers and artists. We strive to provide the community an ecosystem with an online library, book discussions, author meet, book of the month, monthly meets, newsletters & much more...\nRead A Kitaab is a calm & comfort space to be yourself, to discuss books and life with no bars on age/gender/ethnicity/political views etc.\nJoin us for the August meet on Sunday 17th November to discuss your yearly recap on books! Entry free.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT865",
    "image": "https://attagalatta.com/admin/uploads/events/1698086995.jpeg",
    "performer": "Anurag Kothari, \nEkta Bhandari,",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-22T16:00:00+05:30",
    "endDate": "2024-12-22T18:00:00+05:30"
  },
  {
    "name": "Shine N Inspire - Book Launch",
    "description": "Mark Your Date for an Inspiring Journey! \nJoin us as we celebrate the launch of Shine n Inspire by Anshita Sharma!\nTogether, let’s raise awareness on mental health and empower one another.\nEvent Highlights:\nMeet & Greet | Book Signing with the Author | Lucky Draw | Live Instrumental Performance & More\nLet’s connect, get inspired, and make a difference! \nFor More Info - www.shineninspire.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT867",
    "image": "https://attagalatta.com/admin/uploads/events/549050165.jpg",
    "performer": "Anshita Sharma",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-22T16:00:00+05:30",
    "endDate": "2024-12-22T17:00:00+05:30"
  },
  {
    "name": "Enchanted Tales in Fantasyland - Storytelling for Children",
    "description": "Join us for a delightful, interactive oral storytelling event crafted especially for young dreamers and their families. As you settle into the warm glow of our fairy-lit tent, our Storyteller will whisk you away to a fantasy land filled with characters from old tales and new. Enjoy the world of imagination sprinkled with the pixie dust of story creation with Aparna Jaishankar. Psstttt …. There is also a delicious surprise for our story creators.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT869",
    "image": "https://attagalatta.com/admin/uploads/events/1368649582.png",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-12-22T18:00:00+05:30",
    "endDate": "2024-12-22T19:00:00+05:30"
  },
  {
    "name": "Queer Meet and Greet - Meetup",
    "description": "This is a queer meet and greet event hosted by Prarthana (@shorthairedbrownqueer). It's an informal, inclusive and neurodivergent friendly space for members of the LGBTQIA+ to come together and connect with like-minded folks.\nFolks of all ages from the LGBTQIA+ community are welcome!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT871",
    "image": "https://attagalatta.com/admin/uploads/events/858195469.png",
    "performer": "Short Haired Brown Queer",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-12-29T16:00:00+05:30",
    "endDate": "2024-12-29T19:00:00+05:30"
  }
]