[
  {
    "name": "Brand Basics for First-Time Entrepreneurs - Workshop by Sudhir Kiran",
    "description": "A space for people who want to start or grow a business but feel lost in branding, storytelling, and marketing. This workshop will help entrepreneurs communicate better, build trust, and move forward with confidence without jargon or overwhelm.\nWho is this for?\nFirst-time entrepreneurs, professionals thinking of starting something on the side, freelancers who want clarity and confidence & MSME owners who wish to understand branding without jargon and students or anybody interested in starting a business.\nWhat do participants get from the workshop?\n\nClarity in their brand messaging\nA simple framework to build a business/ visual identity\nPractical marketing steps they can apply immediately\n\r\n\tEmail sudhirkirangn@gmail.com for more details.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1596",
    "image": "https://attagalatta.com/admin/uploads/events/1588876565.png",
    "performer": "Sudhir Kiran",
    "keywords": [
      "Business",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-25T11:00:00+05:30",
    "endDate": "2026-01-25T13:00:00+05:30"
  },
  {
    "name": "Chaos in a Coupe: Travelling across India with Three Dogs - Book Launch by Divya Dugar",
    "description": "Atta Galatta is delighted to host the launch of Chaos in a Coupe: Travelling across India with Three Dogs by Divya Dugar on 25th Jan at 12:30 PM.\nOnce upon a time, there was a family: Divya Dugar, her partner Olivier, their tiny hooman Marius, and their three rescue streeties—Tigress, Marcopolo and Pari. They lived in Delhi. And they wanted to go to other places.\nSo they booked a first-class coupe with the Indian Railways that allowed them to travel with their dogs. The sixsome went on many, many train journeys. It was not just about getting to a place, be it Goa, Rajasthan or Madhya Pradesh, but about seeing it with new eyes—and ears and noses, which is inevitable when half your touring party is canine.\nAs they faced uncanny, hilarious situations and tried their best to grapple with systems designed for human convenience, the high point of the trips was often the adventures in the train compartment, which the dogs made their very own.\nA witty, whimsical, wry account of those journeys, accompanied by some stunning photographs, Chaos in a Coupe is a book that travellers, pet parents and anyone who likes a good read will enjoy.\nAbout the Author\nDivya Dugar is a journalist and storyteller with over fifteen years of experience covering news and producing long-form documentaries. Born in Rajasthan and having lived between Kolkata and Delhi, she studied at the Asian College of Journalism before going on to work as a producer on more than sixty reports/documentaries for European broadcasters, primarily ARTE. She also worked as a journalist for four years with France 2.\nHer writing has appeared in numerous publications (including The Book of Dog, edited by Hemali Sodhi and published by HarperCollins) and often draws from her love for animals, heritage architecture, train travel and places off the beaten path. Now based in Southeast Asia, Divya lives with her partner Olivier, their two young children Marius and Elora, and two dogs—Marcopolo and Pari—who are equal parts companions and chaos agents.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1636",
    "image": "https://attagalatta.com/admin/uploads/events/900565760.jpeg",
    "performer": "Divya Dugar",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-25T12:30:00+05:30",
    "endDate": "2026-01-25T15:30:00+05:30"
  },
  {
    "name": "A Walk in the Backyard - A Nature Journaling Workshop",
    "description": "A Walk in the Backyard is a gentle, slow-paced nature journaling workshop designed to help you pause, observe, and reconnect with the small wonders around you. Inspired by the philosophy of John Muir Laws—observation, curiosity, and wonder—this session invites participants to look closely at everyday nature: backyard birds, leaves, flowers, insects, sounds, and fleeting moments that often go unnoticed.\nYou don’t need to be an artist or a writer. Nature journaling is not about perfection—it’s about paying attention. Through simple prompts, guided observation, and easy watercolor and drawing exercises, you’ll learn how to record what you see, feel, and wonder about in your own sketchbook.\nThis workshop is perfect if you want to:\n\nSlow down and be present in the moment\nBuild a regular nature journaling habit\nExplore watercolor and sketching in a relaxed, pressure-free way\nReconnect with your curiosity and childlike sense of wonder\nUse art as a calming, mindful practice\n\nBy the end of the session, you’ll walk away with:\n\nA completed nature journal page\nSimple tools and prompts you can reuse at home\nIncreased confidence in observing and expressing nature\nA calmer, more grounded state of mind\n\nAll materials will be provided.\nAbout the Facilitator\nThe workshop is facilitated by Charu Jain, a self-taught watercolor artist and illustrator with a deep love for storytelling and nature journaling.\nCharu’s work is rooted in gentle observation, expressive lines, and a playful, hand-drawn watercolor style. She believes art is a way to slow down, listen deeply, and build a personal relationship with the natural world. Her practice combines illustration, journalling, and storytelling to make creativity feel accessible rather than intimidating.\nThrough her workshops, Charu encourages participants to let go of “getting it right” and instead focus on noticing, wondering, and enjoying the process. Her sessions are known for being warm, inclusive, and thoughtfully guided—especially welcoming to beginners.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1635",
    "image": "https://attagalatta.com/admin/uploads/events/2001516150.png",
    "performer": "Charu Jain",
    "keywords": [
      "Journaling",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-25T13:30:00+05:30",
    "endDate": "2026-01-25T15:30:00+05:30"
  },
  {
    "name": "Ta Ka Dhi Mi - Book Launch by Shyama Panikkar",
    "description": "The event marks the launch of the much awaited book, Ta Ka Dhi Mi 2358, by author Shyama Panikkar. It is the 4th book in her series of music books for children. After the launch and a session by Shyama around the new book, her students will do a hindustani classical performance for the audience with live tabla.\nAll attendees need ticket. 1 ticket = 1 kid + 1 adult.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1598",
    "image": "https://attagalatta.com/admin/uploads/events/2146744333.jpeg",
    "performer": "Shyama Panikkar",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-25T16:00:00+05:30",
    "endDate": "2026-01-25T18:00:00+05:30"
  },
  {
    "name": "Aiyyo, What Will the Neighbours Say? - Book Signing by Aruna Nambiar",
    "description": "Join us at Atta Galatta for a book signing with Aruna Nambiar, author of Aiyyo, What Will the Neighbours Say?, a warm, witty collection that finds the extraordinary in the everyday.\nIn this book, Aruna Nambiar brings together thirteen sharply observed stories filled with quirky humour and unexpected turns. A mother and son debate what happens after death, a group holiday unravels in amusing ways, senior citizens take on social media with hilarious results, and small moments quietly spiral into something much bigger. Each story ends with a clever twist—sometimes ironic, sometimes tender—and familiar characters reappear across the collection, gently linking one tale to the next.\nWritten with warmth and a keen understanding of human behaviour, Aiyyo, What Will the Neighbours Say? offers an affectionate, insightful portrait of contemporary Indian life, its contradictions, anxieties, and everyday joys.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1639",
    "image": "https://attagalatta.com/admin/uploads/events/826284395.jpg",
    "performer": "Aruna Nambiar",
    "keywords": [
      "Books and Literature",
      "Book Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-25T16:00:00+05:30",
    "endDate": "2026-01-25T17:00:00+05:30"
  },
  {
    "name": "Launch of Three New Titles by Red River Authors - Book Launch by Red River Publications",
    "description": "Join us on 25th January, Sunday, from 5 pm to 7 pm, for the launch of books by Ankush Banerjee, Babitha Marina Justin, and Salini Vineeth, published by Red River.\nWe’re excited to unveil three unique books and to have an engaging discussion about these books and their themes – myth, memory, resilience, and gender identity.\nField Notes on Kindness by Ankush Banerjee is a collection of poems that are inspired from memories, anecdotes, and characters in the family, but recast them with an eye for detail and an attitude of pure wonder.\nThe Way Madmen Smell by Babitha Marina Justin is a collection of ten stories that move between the real, the unreal, and the surreal, weaving themes of love, loss, memory, betrayal, and resilience.\nThe Tree, The Well & the Drag Queen by Salini Vineeth is a novella that blends folklore, myth, and magic with a contemporary exploration of gender identity as it follows a queer person’s quest for freedom and authenticity.\nWe cordially invite you to an engaging literary discussion as we celebrate these three books!\nAbout the Authors:\nAnkush Banerjee is a Kochi-based poet, educator, book reviewer, and research scholar in masculinity studies. His work appears in numerous print and online platforms. This is his second book of poems.\nBabitha Marina Justin is a writer and visual artist who moves easily between a paintbrush and a pen. Her poetry lingers on memory, gender, and the small intimacies of everyday life, with a voice that can be tender one moment and uncompromising the next. She has written nine books, including three poetry collections, Of Fireflies, Guns and the Hills (2015), I Cook My Own Feast (2019), and Forty-Five Shades of Brown (2023). She also co-edited salt, pepper and silver linings: celebrating our grandmothers (2019), a tribute to resilience and inheritance.\nSalini Vineeth is a fiction writer and translator. She worked as an engineer for ten years before moving to full-time writing in 2019. Since then, she has published five books — Lost Edges (novel, 2023), Magic Square (novella, 2020), Everyday People (short story collection, 2019), and travel guides for Hampi and Badami. She has also translated four books from English to Malayalam. She is the fiction editor of Mean Pepper Vine, a quarterly literary magazine. salinivineeth.in",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1625",
    "image": "https://attagalatta.com/admin/uploads/events/675485021.png",
    "performer": "Red River Publications",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-25T17:00:00+05:30",
    "endDate": "2026-01-25T19:00:00+05:30"
  },
  {
    "name": "Aging (Un)Gracefully - Book Discussion with Lalita Iyer",
    "description": "In her memoir, Lalita reflects on ageing as something far more layered than simply “getting old”. She looks at it as a disruption — a moment when women begin to see themselves differently, take stock of friendships, rethink their roles, and slowly come into who they really are.\nShe asks simple but disarming questions: When do we actually become old? And how is coping with ageing any different from coping with puberty?\nThrough personal stories and observations, Lalita writes about losing estrogen, gaining perspective, building new tribes, and learning to live with bodies that are changing — with a mix of honesty, curiosity, and humour. For her, ageing becomes both a process of growing up and a kind of liberation.\nJoin us for an intimate reading and conversation around the themes of ageing, identity, and what it means to keep evolving.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1597",
    "image": "https://attagalatta.com/admin/uploads/events/625019098.jpeg",
    "performer": "Lalita Iyer",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-28T17:00:00+05:30",
    "endDate": "2026-01-28T18:00:00+05:30"
  },
  {
    "name": "Hippity Hoppity Get Off My Property - Comedy rap show by MC Hammersmith and No Pressure Improve",
    "description": "Join No Pressure Improv as we host the multi award winning rapper-comedian MC Hammersmith who is here to WOW Bengaluru for the very first time! 'Hippity Hoppity Get Off My Property' is a show of entirely improvised comedy raps based on your suggestions! MC Hammersmith writes and performs original hip hop comedy tracks, and performs improvised freestyle rap comedy based on audience suggestions. He's based out of Edinburgh and performs across the UK and internationally.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1647",
    "image": "https://attagalatta.com/admin/uploads/events/333338162.png",
    "performer": "No Pressure Improv",
    "keywords": [
      "Comedy",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-30T19:00:00+05:30",
    "endDate": "2026-01-30T20:00:00+05:30"
  },
  {
    "name": "Food In Literature - Book Club with Prachi Grover",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.  So, if viewing the world through the lens of food and literature interests you, then join us for a dialogue on “Food in Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we read our way through several powerful (and delicious) narratives.\nJanuary Read: In the Beginning there was Bombay Duck by Pronoti Datta\nWe assure you that you will enjoy every single bite! The session is free but registration is a must as we have limited spots available. \n \nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who love to read and eat!\nWhen: Saturday, 31st January, 2026 at 11 a.m.\nWhere: Atta Galatta Bookstore, Indira Nagar\nAges: 18+\nRegistration is mandatory (link in bio)\nCopies of the book are available at the store.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1582",
    "image": "https://attagalatta.com/admin/uploads/events/1865055897.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Literature",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-31T11:00:00+05:30",
    "endDate": "2026-01-31T13:00:00+05:30"
  },
  {
    "name": "50 Above Fifty – India’s Biggest Senior Talent Event - Talent Hunt by Khyaal",
    "description": "LIVE Auditions in Bengaluru! 🎶\nAre you 50+ and ready to showcase your talent? Your stage awaits! 🌟\nStep into the spotlight and take your first step towards becoming India's Senior Superstar at Khyaal’s 50 Above 50 – India’s biggest talent hunt for seniors!\n \n📍 Venue: Atta Galatta, Bengaluru\n🎭 Choose your category — Singing, Dancing, Poetry, Art, Storytelling, Comedy & more!\n🎁 Stand a chance to win exciting cash prizes\n💰 Registration Fee: ₹999 (This includes a 1-year FREE Khyaal Club membership and allows you to nominate yourself in two award categories.)\n🎉 Exclusive Benefits for Participants:\n✅ Nominate yourself in 2 or more award categories\n✅ The registration fee can be paid either at the venue or online at https://www.50above50.com/ \n✅ For your performance, you may bring your track on a pen drive or share the name of the song here so we can have it ready in advance.\n✅ Each participant will get 4 minutes to perform!\n📲 Register now and let your talent shine: https://forms.gle/zFo5ArpueY5HLkfU7 \n💻 Pay online at https://www.50above50.com/ or at the venue.\r\n🔗 For more details about the different categories, visit: https://www.50above50.com/categories",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1643",
    "image": "https://attagalatta.com/admin/uploads/events/480385230.jpeg",
    "performer": "Khyaal 50 over 50",
    "keywords": [
      "Talent Hunt",
      "Talent Hunt"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-31T11:00:00+05:30",
    "endDate": "2026-01-31T13:00:00+05:30"
  },
  {
    "name": "Vocal Harmony Workshop & Jam - Jamming session by Danish Abdi",
    "description": "Flash Jam Bangalore is a unique community of amateur singers and musicians that sing and harmonise together. No experience required - just a love for music and connection :)\n\r\nThis time, we're hosting a special, first-of-its-kind workshop! We learn the concepts of vocal harmony, chords, and composing, and then create harmonies together and sing them as a choir - using Hallelujah, by Leonard Cohen, as the base. We'll learn and imbibe concepts like:\n\r\n1. How do I find my vocal range? - terms like basses, baritones, tenors, altos, sopranos, broken down in simple terms, with a bonus lesson in voice modulation\r\n2. What are harmonies and chords? - how multiple different notes blend together, create complexity of emotions with simple changes, the anatomy of a chord\r\n3. How do I assign emotions to notes? - how the emotional spectrum of a scale can be used to create both melody and chords, with the same fundamentals\r\n4. How do I use chords in a song? - for a certain melody, how to choose chords, using overlapping notes with melody, internal progressions, least-change-algorithm, and more\r\n5. How can I visualise music better? - learn some basic exercises to compose and write chords on the fly, and be able to imagine sounds simply in your mind's eye\n\r\nSo come, elevate your skills, and immerse yourselves in the magic of vocal harmony!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1637",
    "image": "https://attagalatta.com/admin/uploads/events/1513590176.png",
    "performer": "Danish Abdi",
    "keywords": [
      "Music",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-31T14:00:00+05:30",
    "endDate": "2026-01-31T17:00:00+05:30"
  },
  {
    "name": "Financial Freedom Starts with Awareness - A Financial Literacy Workshop by Aatmeeya",
    "description": "Financial Freedom Starts with Awareness is a financial literacy workshop organized by Aatmeeya, designed to help individuals build a strong foundation in personal finance and investing.\nThe workshop will be conducted by Sathwik N N, Co-Founder of Aatmeeya, who will simplify key financial concepts and guide participants on how to make informed investment decisions. The session focuses on practical knowledge that can be applied immediately, especially for beginners and working professionals.\nKey topics covered:\n\n\nIntroduction to Mutual Funds\n\n\nInvestment basics everyone should know\n\n\nPlanning short-term and long-term financial goals\n\n\n📅 Date: 31st January 2026\r\n⏰ Time: 3:00 PM – 5:00 PM\r\n📍 Venue: Atta Galatta, Indiranagar, Bengaluru\r\n💰 Fee: ₹299 only\nThis workshop is ideal for anyone looking to gain clarity, confidence, and awareness in their financial journey.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1617",
    "image": "https://attagalatta.com/admin/uploads/events/1624080254.jpg",
    "performer": "Sathwik N N",
    "keywords": [
      "Finance",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-31T15:00:00+05:30",
    "endDate": "2026-01-31T19:00:00+05:30"
  },
  {
    "name": "Within the Mind Lantern - Book Signing with Keerti Nair",
    "description": "Within the Mind Lantern, is a beautifully collection of 41 poems, that has been very well received by the early readers. It is thoughtfully divided into four soul-stirring sections that reads like a gentle walk through memories, emotions, and quiet self-realization. With this poetry collection, the author lights small lanterns within the reader’s mind, guiding them inward. The first section, poems on Nostalgia and Memories, feels like revisiting old photographs, bittersweet, familiar, and deeply comforting. They remind us how memories shape who we are, even when they hurt a little. In the section - Love, Family and Relations, the author captures the beauty of connection, the fragility of bonds, and the unspoken love that often lives between silences. The section on Nature, with gentle metaphors, the poems flow effortlessly, grounding the reader while offering moments of calm and reflection. The final section, Personal Growth and Inspiration, feels like a soft hand on your shoulder, encouraging, reassuring, and deeply empowering. They remind us that growth is personal, nonlinear, and beautifully imperfect. Within the Mind Lantern is not meant to be rushed. It is meant to be felt, revisited, and held close on quiet days. A luminous collection that speaks to the heart, this book is a perfect read if you are looking forward to reconnecting with yourself!\nReaders are invited to meet the author and get their copies signed at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1646",
    "image": "https://attagalatta.com/admin/uploads/events/328644389.png",
    "performer": "Keerti Nair",
    "keywords": [
      "Poetry",
      "Book Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-31T17:00:00+05:30",
    "endDate": "2026-01-31T17:30:00+05:30"
  },
  {
    "name": "Collage Workshop – Cut, Paste & Create Stories! - Collage Workshop by The Healing Palette",
    "description": "Art enthusiasts, get ready for a playful and expressive creative evening!\nJoin us for a lively Collage Art Workshop, where textures, colors, patterns, and imagination come together to tell stories your way.\nIn this hands-on session, participants will be provided with all the materials required to create fun, bold, and expressive collages. You’ll explore layering, composition, storytelling through visuals, and intuitive creativity. Whether you’re a beginner or someone who loves experimenting with mixed media, this workshop promises a relaxed, joyful space to create, connect, and let your creativity flow freely.\nCome as you are and leave with a piece of art that feels uniquely you.\nEvent Details:\n• 📍 Location: Atta Galatta, Bangalore\n• 📅 Date: 31st January\n• ⏰ Time: 5:30 PM – 7:30 PM\n• ✂️ Materials: All materials will be provided\nLimited spots available—come cut, paste, and create something magical with us ✨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1631",
    "image": "https://attagalatta.com/admin/uploads/events/1547190804.jpeg",
    "performer": "The Healing Palette",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-31T17:30:00+05:30",
    "endDate": "2026-01-31T19:30:00+05:30"
  },
  {
    "name": "Thēe Forged Butterfly - Book discussion by Logambal Raaga Sundaram",
    "description": "Join us at Atta Galatta for a warm and reflective conversation around Thēe Forged Butterfly, a memoir by Logambal Raaga Sundaram.\nThe book traces Raaga’s life journey through loss, betrayal, and abandonment, yet she remains unwilling to be defined by what tried to break her. Through grief, guilt, and repeated trials, the memoir reveals how resilience is forged through lived experience, and not inherited.\nNeeraja, founder of the Bangalore Book Club, will offer a reader’s perspective on the book.\nShalini Saraswathi, an Indian blade runner and motivational speaker, will share her reflections on resilience, drawing from both the memoir and her own lived understanding of it.\nLogambal Raaga Sundaram will speak about the journey behind the memoir and her surprise at the many moving ways readers have resonated with it, often finding pieces of their own stories within its pages.\nThe session will also feature a fun, interactive quiz based on the book.\nThe conversation will be hosted by Mugdha Kalra, an autism activist and TV journalist, known for her thoughtful and empathetic style of dialogue.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1640",
    "image": "https://attagalatta.com/admin/uploads/events/26082756.png",
    "performer": "Logambal Raaga Sundaram",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-01T11:00:00+05:30",
    "endDate": "2026-02-01T12:30:00+05:30"
  },
  {
    "name": "Reclaim the economy  - Community Meetup by Get It Together Bengaluru",
    "description": "What does it mean to reclaim the economy in Bengaluru today?\nAs part of the global Reclaim The Economy Week, Get It Together Bengaluru has organised a small, participatory gathering to reflect on overconsumption, gig work, and community-led change. Through guided conversations and brainstorming, we’ll explore everyday economic choices and practical ways to act - individually and together.\nIf you find yourself feeling overwhelmed by climate change anxiety, gig worker strikes, global politics and more, but don't know where to start in the journey of making meaningful change, join us!\nExpect open dialogue, collective problem-solving, and plenty of resources for Bengaluru residents to make changes and share reminders with others.\nThere will also be a guide shared with hands-on recycling & composting tips to take learning beyond the room. Limited spots are available for this gathering.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1644",
    "image": "https://attagalatta.com/admin/uploads/events/416161335.png",
    "performer": "Get It Together Bengaluru",
    "keywords": [
      "Nature",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-01T11:00:00+05:30",
    "endDate": "2026-02-01T13:00:00+05:30"
  },
  {
    "name": "Lahe Lahe Caravan presents “Harry Potter Book Discussion” - Meetup by Sonali Bhatia",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1649",
    "image": "https://attagalatta.com/admin/uploads/events/840443572.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Book Discussion",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-01T14:30:00+05:30",
    "endDate": "2026-02-01T16:30:00+05:30"
  },
  {
    "name": "Atta Galatta presents “Support Group” - Support Group by Nimesh George and Gokul R.",
    "description": "People make up big cities but what makes up people’s lives, hopefully not loneliness. Loneliness is an intensely painful state which arises out of lack of intimacy and connectedness. People from every walk of life, even those with social contacts or pursuing successful careers can experience sadness from absence of belongingness. This painful experience is felt in a myriad of contexts such as breakups, disagreeing families, fear of rejection, unrelatability, shyness and so on.\nThis support group has been constituted to bring people struggling with disconnectedness in various contexts together for a shared experience of comfort, belongingness, laughter, guidance and above all to break the cycle of sustained loneliness.\nThe support is being organized and moderated by Nimesh George Mphil PhD who is a practicing psychologist based in Bangalore. This session will be co-moderated by Nimesh George & Gokul R, who are both practising psychologists in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1651",
    "image": "https://attagalatta.com/admin/uploads/events/1071785509.jpeg",
    "performer": "Nimesh George and Gokul R.",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-01T16:00:00+05:30",
    "endDate": "2026-02-01T17:30:00+05:30"
  },
  {
    "name": "INDISHMAN  - Book reading by Dr Gopi Chandroth",
    "description": "Dr Gopi Chandroth, author of INDISHMAN – Reflections from India, Britain and the Sea, will be at Atta Galatta Bookstore in Indiranagar on 1 February, from 4.30 pm to 6 pm. He will talk about selected stories and engage informally with the audience. Signed copies of the book will be on sale.\n \nThe following are sample extracts from reviews on Amazon globally and on Goodreads:\n• India: “INDISHMAN reminded me of the lyrical beauty of Arundhati Roy, the vivid storytelling of Salman Rushdie, and the magic of García Márquez.”\n• UK: “A lovely meander through the vagaries of human nature. Each story warms the heart like a good malt whisky. A very well-written book; I defy anyone not to enjoy it.”\n• USA: “It (INDISHMAN) is hard to slot into a specific genre – the stories, reflections and gentle musings flit from rural Kerala to Nepal, from Southampton to the high seas with ease. They strike the perfect balance between being sharply observed and deeply memorable, yet light enough for an effortlessly enjoyable read, and never without a touch of humour and heart. Without a doubt, this has been the best six dollars and change I’ve spent in a very long time.”",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1600",
    "image": "https://attagalatta.com/admin/uploads/events/867047692.jpg",
    "performer": "Dr Gopi Chandroth",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-01T16:45:00+05:30",
    "endDate": "2026-02-01T18:00:00+05:30"
  },
  {
    "name": "Sita’s Yoga: The Yoga of Awakening - Book Reading with Dena Merriam",
    "description": "Join us at Atta Galatta for a book discussion with Dena Merriam, author of Sita’s Yoga: The Yoga of Awakening, a reflective and spiritually resonant work that reimagines Sita as a guide for inner transformation.\nIn this book, Dena Merriam explores Sita not only as an avatar of the divine Narayani, but as a compassionate presence in the lives of ordinary people—those navigating family, work, duty, and the search for meaning. Through these encounters, the narrative turns inward, examining the everyday battles we face with anger, greed, fear, arrogance, and indifference. Ravana emerges as a powerful symbol of the forces that pull human consciousness toward materialism and delusion, both in Sita’s time and our own.\nWritten with clarity and depth, Sita’s Yoga: The Yoga of Awakening invites readers to look within, to recognise and transform the shadows of the mind and heart, and to discover how inner awakening becomes the foundation for confronting the challenges of the outer world.\nDate: Sunday, 1 February\nTime: 5:00 PM – 7:00 PM\nVenue: Atta Galatta, Bengaluru",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1641",
    "image": "https://attagalatta.com/admin/uploads/events/728920602.jpg",
    "performer": "Dena Merriam",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-01T17:00:00+05:30",
    "endDate": "2026-02-01T19:00:00+05:30"
  },
  {
    "name": "Love Stories from Indian Heritage - A Storytelling Performance by Aparna Jaishankar and Vikram Sridhar",
    "description": "Love stories aren’t only about the hero and heroine, for love can rarely exist in isolation. Zealous messengers, art and music as mood enhancers, food as aphrodisiacs, taboos and mores – all play a pivotal role in shaping stories of love. Vikram Sridhar and Aparna Jaishankar rummage through the passages of time to bring you various hues of love etched in our heritage through literature, architecture, songs and poetry through the all- encompassing art form of oral storytelling.\n\nAbout Aparna Jaishankar\r\nAparna Jaishankar is a Storyteller with a penchant for Indic mythology. She believes that there is no ONE version of any story. Her storytelling performances take a contemporary view of ancient tales.Aparna also works with educators in developing learning perspectives in the classroom and with organisations in building internal narratives.\n\nAbout Vikram Sridhar\r\nVikram Sridhar is a Performance Storyteller, Theatre Practitioner.and a Narrative based Facilitator .  His Stories , Performance and Workshops for Children , Students , Adults and Families are rooted in Heritage , Ecology and Folklore deeply inspired from various communities of the soil . Based in Chennai and Bangalore , he travels the country extensively with his  Desi way of Storytelling",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1604",
    "image": "https://attagalatta.com/admin/uploads/events/1180907729.png",
    "performer": "Aparna Jaishankar, \nVikram Sridhar,",
    "keywords": [
      "Folklore",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-06T19:00:00+05:30",
    "endDate": "2026-02-06T20:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk by Vikram Sridhar",
    "description": "On a Saturday morning , Walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore , Heritage and Ecology of the area . The walk will begin and culminate at ATTA GALATTA . The tales will revolve around historical , mythical and personal narratives weaved as we discover the area through the walk .\n Date : 7th February ( Saturday)  2025\n Time : 10 AM\n Starting Point : Atta Galatta",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1608",
    "image": "https://attagalatta.com/admin/uploads/events/1890938241.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-07T07:00:00+05:30",
    "endDate": "2026-02-07T09:00:00+05:30"
  },
  {
    "name": "Gond Art - Workshop by Hues by Sindhoor",
    "description": "Our Gond Art workshop is your passport to explore the colorful tapestry of this ancient Indian folk tradition. Dive deep into the intricate techniques and whimsical motifs that define Gond art. Unleash your inner creativity as you paint your own vibrant masterpiece, infused with the spirit of tribal storytelling. \r\nTickets priced at INR 999/- 3 hours of workshop with Inclusive of all materials.\r\nContact +91 9513544920 for tickets & more details.\r\nGet ready for a joyous fusion of tradition and imagination that promises to ignite your artistic spark!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1603",
    "image": "https://attagalatta.com/admin/uploads/events/1582965496.jpeg",
    "performer": "Hues by Sindhoor",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-02-07T11:00:00+05:30",
    "endDate": "2026-02-07T14:00:00+05:30"
  },
  {
    "name": "Who started the fire? - Murder mystery by Varun Gwalani",
    "description": "Have you ever wanted to solve a crime? Believed that you can do better than fictional detectives? Well, you’re in luck!\nThe bestselling author of The Only Way Out is Death and A Deadly Faith, Varun Gwalani brings you a unique experience, played by a thousand people across the country!\nHe will take you through an original murder mystery where you are the detective! Uncover clues, find evidence and deduce the theory to help you find the murderer among you!\nVarun Gwalani, the bestselling author of The Only Way Out is Death and A Deadly Faith, has created a unique murder mystery experience! He has created and personally hosts an interactive murder mystery, where participants are the characters within the story, and one of them is the culprit. Using a combination of storytelling, improv and immersive theatre, Varun adds a personal touch to his murder mystery games, one that has captivated people across the country.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1648",
    "image": "https://attagalatta.com/admin/uploads/events/632162035.jpg",
    "performer": "Varun Gwalani",
    "keywords": [
      "Mystery",
      "Murder Mystery"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-07T11:00:00+05:30",
    "endDate": "2026-02-07T13:00:00+05:30"
  },
  {
    "name": "Blackout Poetry & Haiku - A Creative Workshop with Dr. Vaishnavi Pusapati",
    "description": "I am so pleased to invite interested participants to an inspiring poetry workshop led by internationally published poet and physician Dr. Vaishnavi Pusapati. Scheduled for 7th February 2026 from 2:30 PM to 3:30 PM, the event will explore the art and craft of Blackout Poetry and Haiku, inviting participants to creatively reimagine text and discover poetic expression in unexpected places. Blackout is a form of erasure and found poetry where existing text material such as newspaper clippings and journal pages are used as raw material and the phrases that stand out to a poet, are highlighted to form a new, often unrelated to the text in meaning, poem. It is a technique used to overcome writer's block as well. Haiku is a short form of Japanese poetry focused on attention and detail. In this workshop we will also explore haiku techniques such as the cut word and season word and how to edit your haiku better, through examples and worksheet exercises.\nDr. Vaishnavi Pusapati is a distinguished physician-writer whose poetry and micro-fiction have appeared in numerous prestigious literary journals and anthologies around the world. Her work has been featured in publications such as Cold Moon Journal, Autumn Moon Journal, Heron’s Nest Journal, Poetry Pea Journal, Haikuniverse, Under the Bashō, and many others, earning recognition for its lyrical precision and contemplative depth. She is also the winner of the Beyond Words micro-fiction contest and her haiku have been anthologized in the Living Haiku Anthology and the Haiku Registry. Her haiku book, Afterlife:haikus is forthcoming from Hawakal Publishers. Her creative practice spans haiku, free verse, monostich, and other forms that illuminate the subtle moments of lived experience. Through her work, she invites readers and writers alike to engage deeply with language, memory, and the transformational possibilities of brevity.\nThe Blackout Poetry & Haiku Workshop will provide attendees with hands-on exercises, guided techniques, and creative prompts designed to nurture individual expression and literary play. Art supplies and refreshments will be provided. Whether you are a seasoned writer or a curious beginner, the session promises to unlock new ways of seeing, connecting and writing.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1653",
    "image": "https://attagalatta.com/admin/uploads/events/595623461.jpg",
    "performer": "Dr. Vaishnavi Pusapati",
    "keywords": [
      "Poetry",
      "Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-07T14:30:00+05:30",
    "endDate": "2026-02-07T15:30:00+05:30"
  },
  {
    "name": "Making Sense of Creative Contracts - A Workshop by arts-lawyer Manojna Yeluri",
    "description": "Are you an illustrator or artist? Would you like to meet a community of your peers over a cup of tea, and learn sector specific skills together? Welcome to Common Lines Illustrator' Circle! \nYou are invited to our first ever event: Making Sense of Creative Contracts, a workshop by arts-lawyer Manojna Yeluri. \nThis interactive workshop blends anecdotal learning with scenario- based exercises, encouraging independent illustrators and visual artists to better understand contracts and copyright, alongside advocating for their creative rights. Led by Manojna Yeluri (@artistiklicense), an artist-rights and intellectual property lawyer, this session unpacks common contract challenges and clauses, offering some ways to approach them without feeling overwhelmed. Read more about her work here: https://www.artistiklicense.com/\nEvent Details:\n📅 Date: 7th Feb 2026\n🕚 Time: 3:00-5:00 PM\n📍 Venue: Atta Galatta, Indiranagar, Bengaluru\n🖌️Open only to illustrators and artists\nREGISTRATION LINK: https://forms.gle/yfTYEDPtbUmMxcz46\nCommon Lines: Illustrators' Circle is a series of events hosted by Current Conservation magazine. Created for freelance illustrators and artists, Common Lines offers a space to learn together, share experiences, and simply spend time with peers. Through workshops, jams, or conversations over tea, the series aims to nurture connection, and a sense of belonging within the illustration community. \nFor any questions, please write to editor.ccmagazine@gmail.com.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1652",
    "image": "https://attagalatta.com/admin/uploads/events/517461320.png",
    "performer": "Manojna Yeluri",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-02-07T15:00:00+05:30",
    "endDate": "2026-02-07T17:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Domlur - Story Walk by Vikram Sridhar",
    "description": "On a Sunday morning , Walk through the lanes of DOMLUR , from lores dating back in time from the Madras Presidency , Mysore State to the current IT , Banking and Retail sectors with Vikram Sridhar discovering the lanes through the Folklore , Heritage and Ecology of the rich area which is identified as a village. The walk will begin from Bhandutvas , a theatre collective , and culminate at the Bangalore International Centre . The tales will revolve around historical , mythical and personal narratives weaved as we discover the area through the walk . \nDate : 8th February  (Sunday)  2025\n Time : 7 AM\n Starting Point : Bhandutvas , Domlur\nDetails and GPAY : 9945799224",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1607",
    "image": "https://attagalatta.com/admin/uploads/events/1735873685.jpeg",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T07:00:00+05:30",
    "endDate": "2026-02-08T09:00:00+05:30"
  },
  {
    "name": "Once Upon a Brunch - Sunday morning brunch and stories by Vikram Sridhar",
    "description": "Late weekend morning , brunch , stories like the ones from the olden times , meeting new people\nWhat if they all come together ?\nWeekend and late morning Brunch is an emotion . On the other hand Stories have always been an emotion too . What's common between the two is the rich heritage of food and stories. What if they come together ? .\nListen to these stories of the food as you enjoy your weekend Brunch set at a cozy location that has its own stories . A beautiful day starts with a lovely breakfast . And a morning with breakfast and stories . Every food we eat has a story to share .. Idli , Vada , bread , Paratha etc . Every breakfast comes after a long break and is eager to be eaten . A simple Weekend morning Brunch put together by Atta Galatta\nStorytelling around the food lores by Vikram Sridhar",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1642",
    "image": "https://attagalatta.com/admin/uploads/events/860324237.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Food",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T10:00:00+05:30",
    "endDate": "2026-02-08T12:00:00+05:30"
  },
  {
    "name": "Ventriloquism Show & Workshop - Ventriloquism workshop by M. Santhosh Kumar",
    "description": "Mr. M. Santhosh Kumar is a qualified Company Secretary by Profession yet a  passionate Ventriloquism  Artiste. He  is an International Ventriloquism Artiste, a TEDX Speaker, Voice Coach. He is the only Indian Ventriloquism artiste attending the International  Ventriloquism Convention in the USA since 2012. He has performed & enthralled both Kids & Adults in various Countries like USA, UAE, UK, Germany & all over India.  He specialises in presenting our Indian Values Culture blending humour and learning using the Ventriloquism Art. He is the Winner of Outstanding Ventriloquism Artiste award for 2021. Awardee for exemplary work in puppetry and storytelling from Early Childhood Association of India.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1599",
    "image": "https://attagalatta.com/admin/uploads/events/1546739439.jpg",
    "performer": "M. Santhosh Kumar",
    "keywords": [
      "Puppetry",
      "Workshop + Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T16:00:00+05:30",
    "endDate": "2026-02-08T17:00:00+05:30"
  },
  {
    "name": "SHAAM-E-BAAZGASHT | Bengaluru Diaries - An Evening of Poetry, Conversations & Healing by Krishnendu Chatterjee",
    "description": "Shaam-e-Baazgasht is an intimate, cosy, and immersive poetry experience drawn from Baazgasht – Echoes of Words & Silence, a bilingual Hindi–English collection that journeys through unrequited love, longing, heartbreak, queerness, healing, and the quiet courage of letting go.\nMore than a performance, it is a gathering that invites presence.\nThrough selected poems from the Baazgasht series, the evening unfolds alongside the stories that birthed them — gentle, honest conversations with the poet on his own journey, interwoven with brief guided moments of breathing, mindfulness, and emotional reflection. Together, these elements create a space where words are not merely heard, but felt — allowing the audience to touch closure, clarity, and a softer, steadier kind of inner peace.\nShaam-e-Baazgasht | Bengaluru Diaries offers an evening of listening, pausing, and returning — to oneself.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1621",
    "image": "https://attagalatta.com/admin/uploads/events/983215955.png",
    "performer": "Krishnendu Chatterjee",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T17:30:00+05:30",
    "endDate": "2026-02-08T19:30:00+05:30"
  },
  {
    "name": "Trial by Water - Book Signing with Uttam Kumar Sinha",
    "description": "Join us at Atta Galatta for a book signing with Uttam Kumar Sinha, author of Trial by Water, a timely and incisive exploration of the rivers that lie at the heart of India–Pakistan relations.\nIn this book, Uttam Kumar Sinha traces the turbulent history of the Indus Basin, once a shared lifeline of the subcontinent and later a fractured landscape shaped by Partition, politics, and conflict. Beginning with 1947 and moving through the signing of the Indus Waters Treaty in 1960, the narrative examines how cooperation over water emerged even amidst deep hostility—and why it has remained fragile. With the treaty’s suspension by India in April 2025 following the Pahalgam terror attack, the book asks urgent questions about its future and the possibility of a new, more resilient framework.\nWritten with clarity and analytical depth, Trial by Water looks at the role of political leadership, regional tensions, and global pressures in shaping one of the world’s most significant transboundary water agreements. By following the flow of the Indus rivers, the book offers a powerful lens through which to understand conflict, compromise, and survival in South Asia.\nDate: Tuesday, 10 February\nTime: 3:00 PM - 5:00 PM\nVenue: Atta Galatta, Bengaluru",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1645",
    "image": "https://attagalatta.com/admin/uploads/events/1316920228.jpg",
    "performer": "Uttam Kumar Sinha",
    "keywords": [
      "Books and Literature",
      "Book Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-10T15:00:00+05:30",
    "endDate": "2026-02-10T17:00:00+05:30"
  },
  {
    "name": "Shiva in the Mahabharata - Storytelling by Aparna Jaishankar",
    "description": "The Mahabharata is often read as the tale of Krishna and dharma but running parallel to its grand narrative is another presence: Shiva. Elusive, ascetic, fierce, compassionate, and unsettling.\nThis storytelling session for adults explores Shiva’s appearances in the Mahabharata . The session weaves together the many Shivas through multiple lenses like regional retellings, Puranic expansions, classical and folk art, temple narratives, poetry, and oral traditions.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1650",
    "image": "https://attagalatta.com/admin/uploads/events/1988790881.png",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "History",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-14T19:00:00+05:30",
    "endDate": "2026-02-14T20:00:00+05:30"
  }
]