[
  {
    "name": "Life Activation Workshop - Wellness Workshop",
    "description": "Personalized Acupuncture via touch & Guided Meditation for physical and emotional healing.\nWe are powered by the Life Force that sustains the Universe. We don`t just live on the surface of this planet, we are deeply integrated within its energy fields.  The Elemental Energies of Earth, Air, Water & Fire power and protect all living beings in this world, including us - helping us flourish and grow - mind, body and soul.  When these Elemental Energies are in proper balance, our bodies are dis-ease free, our emotions are clear and our minds are powerfully activated. \nHow will this workshop help you? \nYou will be provided with an Acupuncture treatment customized based on your individual pulse & energy reading. This will channel the elemental energy within your body and mind - to heal you physically and mentally. (No needles involved).\nGuiding you through powerful ‘Shadow Work’ and ‘741 Sound Healing Meditation’ to access the deepest parts of your soul, releasing any repressed emotional pain & healing them. \nProviding you with tips and techniques that can be incorporated in your daily life to live in balance within yourself and the world around you. \nYou will be leaving this workshop feeling emotionally balanced, mentally powerful and healed in body & soul – with a renewed appreciation for your magnificent self. \nWho are the healers conducting the workshop?\nDimpy Fadhya is a wellbeing & spiritual therapist. An intuitive tarot and energy reader, crystal healer. Successfully conducted many workshops with miraculous transformations in participants` lives. She has travelled worldly using and putting her knowledge, wisdom, gifts and skills to uplift the consciousness of the collective. As a channeller she connects you to your higher self to help you find answers and receive guided messages towards your life purpose. \nBenazir is an Acupuncture therapist certified by Bharat Sevak Samaj. She is an MBA from ISB, Hyderabad who discovered the power of Acupuncture to heal body & mind via a personal awakening, which moved her to step away from the corporate world to focus on holistic healing practices that help her clients flourish in all aspects of life.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT632",
    "image": "https://attagalatta.com/admin/uploads/events/597911877.png",
    "performer": "Benazir, \nDimpy,",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-07-23T18:30:00+05:30",
    "endDate": "2024-07-23T20:30:00+05:30"
  },
  {
    "name": "Tangled Tales - Fun-Filled Theatre Workshop for Older Adults",
    "description": "*Always loved acting or wanted to give it a shot? Here's your chance to shine at our beginner-friendly theatre workshop! *\nHop on our magic carpet and join us for an unforgettable ride! We'll travel through enchanted forests, soar over magic mountains, and land in a fairyland where your favourite childhood stories come to life.\n*Tangled Tales is a beginner-friendly theatre workshop where you can step into the stories that once held you spellbound*\n🎭 *What to Expect*\n- Fun Games and Activities: Play and laugh with fellow participants.\n- Story Enactment: Bring those familiar tales to life on stage!\n- Theatre Techniques: Learn new skills and shed your inhibitions.\n- New Friends: Meet like-minded folks in a fun and interactive setting.\n*Who Can Join?*\n*Whether you're a beginner or a seasoned actor, this 3-hour workshop is designed for anyone who loves to have fun with theatre*\n*The workshop is meant for non-actors and people who want to experience acting without the stress!*\n Anita will guide you through various exercises and activities to help you develop your skills and build your confidence on stage. Plus, you will have the chance to make new like-minded friends in a fun and interactive environment.\n*Meet Your Teacher: Anita Mithra* \nAnita Mithra is an actor, theatre artist, and casting coordinator who has casted actors in ads, films, web series, and videos. She has opened doors for many Silver Talkies club members in the world of theatre and ads. Over the last decade Anita has conducted various open workshops helping non actors to express freely, lose their inhibitions and learn to enjoy the moment. A skill we lose as we get older and busier!\nCome play, laugh, and rediscover the joy of acting!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT648",
    "image": "https://attagalatta.com/admin/uploads/events/591900590.png",
    "performer": "Anita Mithra, \nSilver Talkies,",
    "keywords": [
      "Theatre",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-07-24T10:30:00+05:30",
    "endDate": "2024-07-24T13:30:00+05:30"
  },
  {
    "name": "Puppy Adoption Drive - Adoption Drive",
    "description": "Join us for a cute and cuddly puppy adoption drive! Puppies aided by Let’s Live Together, an NGO that initiated Bangalore’s first foster-based rescue program for orphaned puppies, will be available for you to interact with, and to take home for fostering / adoption. Come by to Atta Galatta anytime between 11 AM and 5 PM on 27th July, Saturday.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT643",
    "image": "https://attagalatta.com/admin/uploads/events/1575282711.jpeg",
    "performer": "Let's Live Together",
    "keywords": [
      "Animals",
      "Adoption Drive"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-27T11:00:00+05:30",
    "endDate": "2024-07-27T17:00:00+05:30"
  },
  {
    "name": "Pen & Latte 3.0 - Writers Group",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT611",
    "image": "https://attagalatta.com/admin/uploads/events/710377088.png",
    "performer": "Aparajita Sharma, \nYour View On Books,",
    "keywords": [
      "Writing",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-27T11:11:00+05:30",
    "endDate": "2024-07-27T14:22:00+05:30"
  },
  {
    "name": "The Write Step - Writers Group",
    "description": "The Write Step is a writers’ support group that hopes to foster and grow a community of writers who meet once a month to talk about the myriad aspects of writing. Writers in the making who haven’t published or written yet are most welcome. The aim is to devise a support group that sparks creativity.\nWhile each meeting will be around a certain predefined subject matter pertaining to the craft, there will be time set aside for the group to address individual queries.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT636",
    "image": "https://attagalatta.com/admin/uploads/events/2141772494.png",
    "performer": "Nandita Bose",
    "keywords": [
      "Writing",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-27T15:00:00+05:30",
    "endDate": "2024-07-27T17:00:00+05:30"
  },
  {
    "name": "Dear Me - Inner Child Letter Writing Workshop",
    "description": "Atta Galatta and Dr. Divyanshi warmly invite you to a transformative Inner Child Letter Writing Workshop called \"Dear Me\". \nImagine a time, when you were a kid and felt carefree and full of wonder, unburdened by the weight of the world. We all carry pieces of our childhood within us. We all are simply children with responsibilities. However, sometimes, life experiences can hold us back.\nThrough inner child work you can uncover buried emotions and release old wounds. This Inner Child Letter Writing Workshop is designed to help you reconnect with that part of yourself, guiding you through self-reflection and emotional healing. Learn to let go of the past, embrace self-compassion, and unlock your full potential. Leave feeling lighter, empowered, and ready to move forward with confidence. Our Inner Child Letter Writing Workshop is a unique and nurturing program designed to help participants reconnect with their inner child through the powerful medium of letter writing. This workshop aims to foster self-compassion, inner growth, and a deeper understanding of one`s past experiences, providing a safe space for personal reflection and healing.\nWho Should Attend?\nThis workshop is perfect for anyone above 16 years of age seeking to heal past wounds, foster self-compassion, or explore their inner emotional landscape. It is also suitable for anyone interested in the therapeutic benefits of letter writing. You don`t need any sort of prior experience. \nWorkshop Objectives:\n- To guide participants in reconnecting with their inner child.\n- To develop participants` skills in reflective and expressive writing.\n- To enhance participants` abilities to identify and articulate past experiences.\n- To foster a supportive and compassionate community for personal growth.\nKey Components:\n- Understanding the Inner Child: Delving into the concept and significance of the inner child in healing.\n- Reflective Writing: Techniques and exercises to help participants access and express their inner thoughts and feelings.\n- Guided Letter Writing: Step-by-step guidance on writing compassionate and healing letters to one`s inner child.\n- Sharing and Feedback: Creating a safe space for participants to share their letters and receive supportive feedback.\nWhat Does It Entail:\n- Ice Breaker Activity: Engaging in an introductory exercise to foster connection and openness among participants.\n- Guided Meditation & Visualization: A short session to help participants access a reflective and relaxed state.\n- Letter Writing Session: Composing a heartfelt letter to one`s inner child.\n- Curated Feedback Discussion: Participating in a supportive group discussion to share insights and experiences.\n- Following Community Guidelines: Ensuring a respectful and nurturing environment for all participants.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nONLY 5 SEATS AVAILABLE. The intention is to keep the space as intimate as possible for exclusive experience, comfortable sharing, enhanced space for self-reflection, and personalised attention. \nPlease bring your own journals and pens!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT639",
    "image": "https://attagalatta.com/admin/uploads/events/1326027214.jpeg",
    "performer": "Dr. Divyanshi",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-07-27T15:00:00+05:30",
    "endDate": "2024-07-27T17:00:00+05:30"
  },
  {
    "name": "The Art of Storytelling - Session on Writing & Publishing a Successful Debut Novel",
    "description": "Join us for a comprehensive and enlightening session at Atta Galatta, with author Aishwarya Jha and executive editor, Penguin Random House India, Venkatesh Karthik, as they take us over the secrets behind writing and publishing a successful debut novel. This session will cover:\n\nTurning the seed of an idea into a script;\nBringing characters to life;\nThe importance of setting;\nThe querying process;\nWhat editors are looking for: and\nTroubleshooting & common pitfalls.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT652",
    "image": "https://attagalatta.com/admin/uploads/events/1129822170.jpg",
    "performer": "Aishwarya Jha, \nKarthik Venkatesh,",
    "keywords": [
      "Writing",
      "Discussion"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-07-27T15:00:00+05:30",
    "endDate": "2024-07-27T16:00:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Listener's Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other's experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT610",
    "image": "https://attagalatta.com/admin/uploads/events/1901849491.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-07-27T16:00:00+05:30",
    "endDate": "2024-07-27T18:00:00+05:30"
  },
  {
    "name": "Stories Through Collage - Zine Making Workshop",
    "description": "We will be exploring relationships using abstract collage. Colors, shapes and textures influence our emotions in very strange ways. You will also learn the visual vocabulary to express your emotions through collage. Come and join us for this zine making workshop!\nKeerthana Srinivasan aka Keena is an author/illustrator of a silent picture book, a memoir for adults. You can get her signed copies of the book after this session.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT650",
    "image": "https://attagalatta.com/admin/uploads/events/379603246.jpeg",
    "performer": "Keena",
    "keywords": [
      "Zine Making",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-07-28T10:00:00+05:30",
    "endDate": "2024-07-28T12:00:00+05:30"
  },
  {
    "name": "Think The Luna Way - Book Launch",
    "description": "“Think the Luna way\" process is crafted especially for you. Formulated at Threadality Technologies, \"Think the Luna way\" was born from a thorough analysis of the pitfalls encountered during our product development cycles. This process ensures no feature is left behind and helps you build a strong foundation for your ideas before you even start building them.\n\"Think the Luna way\" is more than just a guide; it’s a journey through the innovative process that revolutionized how Threadality Technologies approaches product development. Whether you're an experienced professional or just starting out, this book provides the insights and tools you need to refine your creative and development processes.\nMukundh Bhushan is the founder and CEO of Threadality Technologies. His entrepreneurial journey began in a college dorm room at the age of 19, where he had to manage every aspect of his IT business on his own. This experience, though challenging, laid the foundation for his future success. Mukundh has navigated the complex world of entrepreneurship by teaching and training himself, overcoming numerous challenges along the way. His book is a reflection of his ongoing journey, sharing invaluable lessons on showcasing work, recruiting and managing teams, and most importantly, efficient thinking.\nIn \"Think the Luna way\" you will learn about a comprehensive process that guarantees no feature is left behind. The book emphasizes the importance of building a solid foundation for your ideas before diving into the actual creation. Mukundh shares his insights on efficient thinking and effective strategies, a skill critical for any entrepreneur or innovator. The book is filled with real-life lessons and practical advice drawn from Mukundh’s personal experiences in starting and growing a successful tech company.\nJoin us for the launch of \"Think the Luna way\" and embark on a transformative journey that will empower you to turn your ideas into reality. The event will take place on 28th July between 1:30 to 2:30 PM in the afternoon.\nGet ready to redefine your approach to design and development with \"Think the Luna way\" by Mukundh Bhushan!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT647",
    "image": "https://attagalatta.com/admin/uploads/events/275325142.png",
    "performer": "Mukundh Bhushan",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-28T13:30:00+05:30",
    "endDate": "2024-07-28T14:30:00+05:30"
  },
  {
    "name": "Build-A-Book - Book Making Workshop",
    "description": "Build -A- Book is a carefully curated skill-based workshop about bookmaking. The participants will experiment together and learn how to transform ordinary household objects to repurpose them into journals and notebooks, and experiment with other materials!\nSaachi will be sharing all tips and tricks that she has learned and gathered over her 5 years of experience and practice with the skill. She will also be working with the participants to sharpen their observation skills and imagination to help them customise notebooks and journals to suit their needs and purpose.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT649",
    "image": "https://attagalatta.com/admin/uploads/events/1848720751.jpg",
    "performer": "Saachi Pimprikar",
    "keywords": [
      "Book Making",
      "Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-28T15:00:00+05:30",
    "endDate": "2024-07-28T17:00:00+05:30"
  },
  {
    "name": "Poetic Musings - Book Launch",
    "description": "\"Poetic Musings\" by Dr. Padmashree R P invites readers on an enchanting journey through the human experience. This collection weaves a tapestry of diverse themes, from the paradox of freedom to the life-giving power of rain, from storytelling magic to rediscovering latent talents. Dr. Padmashree's verses resonate with collective strength and civic duty, urging readers to explore their inner depths.\nThe standout poem, \"The Whispering Attic,\" poignantly explores time's passage and the desire to rekindle dormant passions. It serves as a metaphor for the hidden treasures of knowledge and talent within us all.\nA central theme is the profound interconnectedness of all things. The poems illuminate the delicate threads binding humans, nature, and the cosmos, fostering a sense of unity and shared destiny.\nThese verses are catalysts for introspection and personal growth, challenging readers to reflect deeply on their experiences and inspiring a renewed appreciation for life's complexities. Join us to launch this exhilarating work on Sunday, 28th July, at 7.30 PM.\nDr. Padmashree R. P. is an accomplished teacher trainer and Karnataka Educational Services Officer with over 33 years of extensive experience in the education sector. She is also a passionate Academic writer, poet and story writer.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT642",
    "image": "https://attagalatta.com/admin/uploads/events/1358033336.jpeg",
    "performer": "Dr. Padma Shee R. P.",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-28T19:30:00+05:30",
    "endDate": "2024-07-28T20:30:00+05:30"
  },
  {
    "name": "Gypsy's Run on Wednesday - Book Reading",
    "description": "Enjoy a book reading and interactive session with author May Zareah. She is the author of Vodka Sambar and her second book ‘Gypsy’s Run on Wednesday’ has just been launched. Do come for an insightful session on how to get your bread, butter and biriyani, and relish a world of books!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT651",
    "image": "https://attagalatta.com/admin/uploads/events/2097929669.jpg",
    "performer": "Mary Zareah",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-10T17:30:00+05:30",
    "endDate": "2024-08-10T18:30:00+05:30"
  },
  {
    "name": "Kuch Kehta Hai Yeh Saawan - Kannada, Hindi and Marathi Music Performance",
    "description": "The Trio singing group will present an evening of soulful woven tunes, film compositions celebrating monsoon season, infused with poetry through this curated concert providing a holistic and culturally enriching experience. They will be accompanied by Rohit Kumar, leading Keyboard artist.        \nWatch the best of field perform live, feel the vibrations of music being in the same space as the performers and witnessing the expressions create a thrilling experience for all. Listen to the unheard gems featuring monsoon songs, anecdotes, trivia and poetry and immerse yourselves in a captivating musical experience, that showcases talent and artistry of featured musicians. This group showcases the versatility and creativity of musicians who skilfully incorporate freshness in their singing, bringing a new perspective to familiar/unheard tunes. It's an artistic exploration and a deeper understanding of the interplay between tradition and innovation in music.\nPratibha Kulkarni - is an Indian playback singer and a voice over artist. She is a trained Hindustani artist and has rendered several Kannada film songs and has recorded songs for many albums in multiple Indian languages including Hindi, Marathi, Kannada, Gujrati, Rajasthani and Sanskrit. \nRajeev Anand - is a professional singer and a performer. He has performed over 400+ shows in and around Bangalore till date.\nKunal Kushwaha - is a popular singer among club gigs and has been regularly performing all over Bangalore since many years.\nRohit Kumar - Leading Keyboard Artist who has delivered fantastic music across all concerts in Bangalore music circuit today.\nDr. Kavita - Anchor, Actress by passion and Doctor by profession who's been anchoring several leading concerts and events.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT509",
    "image": "https://attagalatta.com/admin/uploads/events/410636282.png",
    "performer": "Kunal Kushwaha, \nPratibha Kulkarni, \nRajeev Anand, \nRohit Kumar,",
    "keywords": [
      "Music",
      "Performance"
    ],
    "@type": "MusicEvent",
    "startDate": "2024-08-10T19:00:00+05:30",
    "endDate": "2024-08-10T21:00:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Listener's Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other's experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT644",
    "image": "https://attagalatta.com/admin/uploads/events/507165536.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Wellness and Health",
      "Support Group"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-11T17:00:00+05:30",
    "endDate": "2024-08-11T19:00:00+05:30"
  },
  {
    "name": "Chapter Carnival 2.0 - Literary Meetup",
    "description": "Atta Galatta and Your View On Books, A Novel Club cordially invite you to the latest Library Meetup in town.\nJoin us for a innovative Library Meet wherein there`s over hundreds of books and you could pick a book in random and start reading together.\nHave an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nCome along with Empty Minds and fill it with rich literature from Atta Galatta’s Reading Section.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nReading minimum one chapter from a random book that you choose from the libary.\nParticipating in the ensuing curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT645",
    "image": "https://attagalatta.com/admin/uploads/events/1677113111.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-17T11:11:00+05:30",
    "endDate": "2024-08-17T14:22:00+05:30"
  },
  {
    "name": "Don't Stop Acting 1.0 - Acting Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Acting Workshop in town. \nJoin fellow aspiring actors and actresses for an inspiring session of learning acting through basics at our Writers Club Meet event in the cozy ambiance of the library cafe. Our Acting workshop is designed for aspiring artists who wish to explore the fundamentals of acting and develop their performance skills in a supportive and engaging environment. This immersive workshop offers participants a thorough grounding in acting techniques, character development, and scene work, providing them with the tools needed to bring authenticity and depth to their performances.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no acting experience, as well as intermediate actors looking to refresh their skills. It is also suitable for anyone interested in improving their public speaking and presentation abilities.\nWorkshop Objectives:\n- To introduce participants to the basic principles of acting.\n- To develop participants` abilities to create believable and compelling characters.\n- To enhance participants` skills in scene study and script analysis.\n- To build participants` confidence in performing in front of an audience.\nKey Components involves learning theory and practicals of: \n- Acting Techniques\n- Character Development and Analysis\n- SCript Analysis and Interpretation\n- Understanding Director`s Vision\n- Conveying Emotions\n- Physicality and Movement of Camera\n- Improvization and Spontaneity\n- Voice and Diction\n- Working with Props and Costumes\n- Rehearsals and Performances\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Participating in workshop with enthusiasm.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT646",
    "image": "https://attagalatta.com/admin/uploads/events/219029336.png",
    "performer": "MWM Movies",
    "keywords": [
      "Theatre",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-08-24T11:11:00+05:30",
    "endDate": "2024-08-24T14:22:00+05:30"
  }
]