[
  {
    "name": "The Colony Brats - Book Launch",
    "description": "Experience the Exclusive Launch of The Colony Brats, a Coming-of-Age Comedy-Drama by Vineed P Menon!\nHi, I’m Niv, though my parents named me Nivrutti Nandan Nedumpilly Nair—yeah, I know, what a ridiculous name. But trust me, the name is nothing compared to the ridiculousness of my life. And here’s why we call ourselves brats in Sawalpur, a town dominated by the cement plant:\n\nAs children of wage board workers, we faced injustice and weren’t allowed to enter the officers’ colony. But I had the guts to sneak into my girlfriend’s quarters—don’t ask why.\nMy best friend, Baiju, had the audacity to have an affair—sorry, a relationship—with the colony’s schoolteacher.\nOur so-called ordinary life was filled with mischief, adventures, and escapades.\nOur shift to an ultra-ordinary life came with reckless schemes and acts of revenge, making the lives of the factory officers, who took their privilege a bit too literally, a living hell—just to prove our worth.\nMy problem? I take things to heart and always make sure to get back at those who hurt me. This time, it was the cement company that wronged me, and I made sure to give back royally.\n\nRead The Colony Brats to learn how not to screw up your life—and everyone else's—with vengeance. Get ready to laugh, cry, and rethink everything as you follow our journey from innocent kids to not-so-innocent troublemaking adults. Outrage can turn your world upside down, and our story is living proof of that.\nThe Invite\nHey there! Niv here. Curious about me, my best friend Baiju, and the chaotic world of our cement colony in Sawalpur? Join us at Atta Galatta on 30th November at 6:30 pm. Trust me—you won’t want to miss the laughs, the drama, and all the mayhem in between.\nAnd here’s the kicker: you’ll meet the mastermind behind all this—our storyteller and certified troublemaker, Vineed P. Menon! He’s more than just a writer, let me tell you. He’s written and directed over eight original plays, including That Night and Family Ke Side Effects, along with short films like First Sin, Interfere, and Ring Road that even made the Dadasaheb Phalke Awards take notice. Oh, and he’s also the co-writer of the Assamese film Birangana Xaadhani (currently in post-production). And if that’s not enough, he’s also a seasoned Training Manager—though I’ve got a few “training” stories of my own he wouldn’t dare share!\nSo, whether you're here for the stories, the laughs, or just to see what kind of madness unfolds, be there. You won’t regret it—well, at least not as much as the cement company regrets messing with me!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT827",
    "image": "https://attagalatta.com/admin/uploads/events/1907161670.png",
    "performer": "Vineedh Menon",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-30T18:30:00+05:30",
    "endDate": "2024-11-30T19:30:00+05:30"
  },
  {
    "name": "All-In: The Moments - Improv Comedy Show",
    "description": "9 improvisers take over the stage without any script. A few prompts from the audience are all that they want. Can they make things funny? Can they even come up with a story? They have 1.5 hours to prove.\nWhat is improv?\nImprov is not a play, there’s no script. It is also not standup, there are no tried and tested jokes. It is somewhere in between these two things. You’ll have to come to find out!\nWhy should you attend?\n\nYou are part of the script - your prompts will decide where the show will go\nYou can bring a date for a cool show\nYou can tell your Instagram friends that you attended a cool show",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT821",
    "image": "https://attagalatta.com/admin/uploads/events/1795373959.png",
    "performer": "All In Improv",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-21T17:30:00+05:30",
    "endDate": "2024-12-21T19:00:00+05:30"
  }
]