[
  {
    "name": "The Silent Chaos - Children's Theatre Performance",
    "description": "In \"The Silent Chaos,\" two clumsy but lovable mimes, Kuku and Madhu, embark on a series of hilarious adventures in a park. They stumble through a series of funny situations, starting with a comical argument over a park bench that ends in a shared tumble to the ground. Their day continues with a chaotic picnic where invisible food turns into an epic, imaginary food fight.\nNext, they encounter an invisible dog that leads to playful jealousy and laugh-out-loud antics as they take turns pretending to be the dog. Their antics move to a playground where they try to navigate invisible swings and a seesaw, resulting in more slapstick humour.\nFinally, Kuku and Madhu put on a magic show where every trick goes hilariously wrong, with Kuku trying to saw Madhu in half, resulting in more chaos and laughter. The play concludes with Kuku and Madhu saying a playful goodbye to the audience, ensuring that everyone leaves with a smile on their face.\n*\"The Silent Chaos\"* is a fun-filled, full of laughter and visual comedy, perfect for entertaining kids and igniting their imaginations.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT615",
    "image": "https://attagalatta.com/admin/uploads/events/166282211.png",
    "performer": "Kunal Motling, \nMadhura Jadhav,",
    "keywords": [
      "Childrens Theatre",
      "Performance"
    ],
    "type": "ChildrensEvent",
    "startDate": "2024-06-29T10:00:00",
    "endDate": "2024-06-29T11:00:00"
  },
  {
    "name": "Dum Dama Dum - Childrens Theatre Festival",
    "description": "The Theatre and Reading festival by Atta Galatta that began in 2017 unites two beautiful things in a child’s life, the love for drama and love for reading. The festival will have plays for children from various renowned theatre groups while on another level they can enter into a world of books from their favourite authors and publishers.\nThe Day Pass includes access to all 6 scheduled plays.\nAdults and children require tickets.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT596",
    "image": "https://attagalatta.com/admin/uploads/events/122725401.jpeg",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Childrens Theatre",
      "Performance"
    ],
    "type": "ChildrensEvent",
    "startDate": "2024-06-29T10:00:00",
    "endDate": "2024-06-29T19:00:00"
  },
  {
    "name": "The Thief's Story - Children's Theatre Performance",
    "description": "The thief's story is about a boy who goes through a transformation from a thief to someone who realizes the value of human relationships and trust. The play has been originally written by Ruskin Bond. It will be performed by Sachin Ravindran and directed by Vivek Vijayakumaran. There will be an activity for all the kids at the end!\nOnce Upon a Time is part of our initiative to bring theatre and performance to children. In this program, children will get to watch a performance created using handpicked stories. The performance will be followed by an activity with the children to help them respond to the story in their own unique ways. The Thief's Story was developed as part of this initiative at Our Theatre Collective in 2023.\nOur Theatre Collective is an independent collective creating original multi-lingual plays since 2009. Based out of Bangalore, our focus lies strongly on performance training for actors and theatre-makers. Our studio space in Koramangala, fondly called Our Theatre Studio, has also been hosting curated performances and showcases since 2018 and has recently become home to a variety of theatre-based events for young audiences as well.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT597",
    "image": "https://attagalatta.com/admin/uploads/events/700149351.png",
    "performer": "Our Theatre Collective, \nSachin Ravindran,",
    "keywords": [
      "Childrens Theatre",
      "Performance"
    ],
    "type": "ChildrensEvent",
    "startDate": "2024-06-29T11:15:00",
    "endDate": "2024-06-29T12:00:00"
  },
  {
    "name": "Bibbidi-Bobbidi-Boo The Schoolbag! - Children's Theatre Performance",
    "description": "It's June, and the school season has just begun! After a long summer break, excitement and nervousness fill the air as children in Bengaluru return to school. The hottest summer has given way to rains, soaking new uniforms, bags, and shoes. Children must protect their freshly wrapped books and stationery from the wet weather. As they step into new classrooms and meet new teachers & friends, this play brings relatable tales to life. Join us for \"Bibbidi-Bobbidi-Boo: The Schoolbag!\" where imagination takes flight and everything inside a school bag narrates its own enchanting story. Perfect for kids and parents alike, this session celebrates the magical and realistic world of school, making the transition both fun and familiar. Bring your kids along for an evening of fantasy stories rooted in the everyday adventures of school life.\nTeam 'Theatre Artistree' proudly presents 'Rangaakshara', a project aimed at utilizing theatre as a dynamic tool to enrich the teaching-learning process for children. At 'Rangaakshara', we are dedicated to exploring relevant themes and crafting original scripts that engage students through interactive theatre experiences. Our productions are the result of extensive research and draw upon the diverse expertise and experiences of our team of theatre practitioners and facilitators.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT616",
    "image": "https://attagalatta.com/admin/uploads/events/151215891.png",
    "performer": "Theatre Artistree",
    "keywords": [
      "Childrens Theatre",
      "Performance"
    ],
    "type": "ChildrensEvent",
    "startDate": "2024-06-29T12:30:00",
    "endDate": "2024-06-29T13:30:00"
  },
  {
    "name": "Ashcharya Choodamani - Children's Theatre Performance",
    "description": "‘Ashcharya Choodamani' is a vibrant theatrical adaptation by Mr. Prasanna inspired by the timeless classic, \"\"Alice in Wonderland,\"\" showcasing a delightful fusion of five languages: Hindi, English, Marathi, Kannada, and, Gujarati. Audiences get a linguistic rollercoaster, experiencing a delightful confusion of languages that adds to the comic charm of the production. At the heart of the play is the spirited character of Choodamani, a young girl who radiates joy and curiosity, always seeking out surprises in her whimsical world. Her infectious energy draws the audience into her enchanting journey filled with wonder and laughter. Accompanying Choodamani are three animals , each adding their own unique flavor to the narrative. Their interactions with Chudamani spark lively exchanges and moments of humor, enriching the theatrical experience.\nOne of the standout features of ‘Ashcharya Choodamani’ is its interactive nature, inviting the audience to become actively engaged in the unfolding story. With rhythmic and live songs interwoven throughout the performance, viewers are transported into a world where music and storytelling seamlessly blend, creating an immersive and memorable theatrical experience for all.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT619",
    "image": "https://attagalatta.com/admin/uploads/events/799599977.png",
    "performer": "Indian Theatre Foundation",
    "keywords": [
      "Childrens Theatre",
      "Performance"
    ],
    "type": "ChildrensEvent",
    "startDate": "2024-06-29T15:00:00",
    "endDate": "2024-06-29T16:00:00"
  },
  {
    "name": "The Tickle Monster - Children's Theatre Performance",
    "description": "A grumpy collector of rare things is set out to capture Gudgudee the tickle monster to add to his collection. He has now mastered the magic spell to summon the monster. What do you think happens next.? Does he succeed in capturing Gudgudee? Will Gudgudee be bound by the collector and never laugh or bring joy for children ever again? Or does she succeed in tickling his funny bone? Join us to find out while we take you on a laughter riot!\nKathaCorner started in 2014 celebrates it's 10 years anniversary. The team has carved a niche for itself through their innovative storytelling styles. Crafting stories with use of props, live music and theatrical for children, adults, corporate giants, education institutions, literature festivals etc. has been their forte.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT617",
    "image": "https://attagalatta.com/admin/uploads/events/1901789450.jpeg",
    "performer": "KathaCorner, \nRamya Srinidhi, \nSneha Kappanna,",
    "keywords": [
      "Childrens Theatre",
      "Performance"
    ],
    "type": "ChildrensEvent",
    "startDate": "2024-06-29T16:30:00",
    "endDate": "2024-06-29T17:30:00"
  },
  {
    "name": "Project Magic - Children's Theatre Performance",
    "description": "We go through life oblivious to the wondrous things we do and magical beings we are. The fact is there’s magic all around us and there’s magic in us. People who love is do things for us even if it makes them uncomfortable, even though it may be challenging for them – and vice versa. It’s the magic of love.\nWe go through obstacles every day, do things that are difficult, go to sleep, wake up the next morning and we are willing to meet the day again – everyday. That we do that is nothing short of magic.\nWe run from one thing to another every day without really pausing and looking. If we did, we’d realize that the world we live in is full of magic.\nProject Magic is an attempt to stop and rediscover the magic surrounding us and in us. The play uses elements of folk, absurdity, music, song and dance to create a visual treat on stage. And in the spirit of being jugaad, all of these visuals are created with small everyday things around us - because even the smallest thing has the potential to be something big.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT620",
    "image": "https://attagalatta.com/admin/uploads/events/709316334.png",
    "performer": "JUGAAD",
    "keywords": [
      "Childrens Theatre",
      "Performance"
    ],
    "type": "ChildrensEvent",
    "startDate": "2024-06-29T18:00:00",
    "endDate": "2024-06-29T19:00:00"
  },
  {
    "name": "Storywalk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.\nFor clarifications and questions, do call Vikram Sridhar at +91 99457 99224.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT591",
    "image": "https://attagalatta.com/admin/uploads/events/945396298.jpg",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-06-30T07:00:00",
    "endDate": "2024-06-30T09:30:00"
  },
  {
    "name": "Once Upon A Brunch - Sunday Morning Brunch and Stories",
    "description": "Late weekend morning, brunch, stories like the ones from the olden times, meeting new people – what if they all come together?\nWeekend and late morning Brunch is an emotion. On the other hand, Stories have always been an emotion too. What’s common between the two is the rich heritage of food and stories. What if they come together?\nListen to these stories of the food as you enjoy your weekend Brunch set at a cozy location that has its own stories. A beautiful day starts with a lovely breakfast. And a morning with breakfast and stories. Every food we eat has a story to share… Idli, Vada, bread, Paratha etc. Every breakfast comes after a long break and eager to be eaten.\nThis event has 3 aspects to it: A simple Weekend morning Brunch put together by Atta Galatta; storytelling around the food lores by Vikram Sridhar; and meet new people with similar interest over culture and art.\nThe Brunch and the Stories will be suitable for adults and children alike. Children 13 and above\nOnce upon a Brunch is a morning to experience food in all its senses, watching them unfold as you enjoy the yummy meal on a late weekend morning at Atta Galatta. The ticket price is inclusive of a simple Brunch and the Storytelling Performance at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT579",
    "image": "https://attagalatta.com/admin/uploads/events/231455251.jpeg",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance and Menu Tasting"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-06-30T10:00:00",
    "endDate": "2024-06-30T12:00:00"
  },
  {
    "name": "Board Game Session - Board Game Session",
    "description": "Board Game Enthusiasts of all ages are welcome to try out and play as many as five Board games on the theme of Wildlife, from Kaadoo Games.\nA representative from Kaadoo Games, Ms. Kiran Sarjapuram, will be on hand to support and instruct in the experience of the Games.\nThe event is for two hours, from 11 am - 1 pm, on Sunday 30th June.\nIt is priced at Rs.300.\nWheelchair access can be provided on prior request or intimation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT621",
    "image": "https://attagalatta.com/admin/uploads/events/1531885828.png",
    "performer": "Anukey, \nAnupa Raman,",
    "keywords": [
      "Board Games",
      "Meetup"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-06-30T11:00:00",
    "endDate": "2024-06-30T13:00:00"
  },
  {
    "name": "Support Group - Support Group",
    "description": "Topic of Discussion - Overcoming Fear of Rejection\nPeople make up big cities but what makes up people’s lives, hopefully not loneliness. Loneliness is an intensely painful state which arises out of lack of intimacy and connectedness. People from every wake of life, even those with social contacts or pursuing successful careers can experience sadness from absence of belongingness. This painful experience is felt in a myriad of contexts such as breakups, disagreeing families, fear of rejection, unrelatability, shyness and so on.\nThis support group has been constituted to bring people struggling with disconnectedness in various contexts together for a shared experience of comfort, belongingness, laughter, guidance and above all to break the cycle of sustained loneliness.\nThe support is being organized and moderated by Nimesh George Mphil PhD who is a practicing psychologist based in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT625",
    "image": "https://attagalatta.com/admin/uploads/events/1234386314.jpeg",
    "performer": "Nimesh George",
    "keywords": [
      "Wellness and Health",
      "Discussion"
    ],
    "type": "SocialEvent",
    "startDate": "2024-06-30T12:00:00",
    "endDate": "2024-06-30T13:00:00"
  },
  {
    "name": "Magic of the Western Ghats - Storytelling",
    "description": "Join us for an engaging and productive event with author Priyadarshini! This session will feature a meet-the-author, storytelling, and brainstorming with kids' own ideas to create their own books. Priyadarshini, acclaimed author of “The Guardians of the Forest,” will discuss her inspirations, why she chooses to write eco-fiction, and offer tips on writing your own eco-fiction book. Don't miss this opportunity to learn and create with an experienced writer!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT599",
    "image": "https://attagalatta.com/admin/uploads/events/891196671.jpg",
    "performer": "Priyadarshini Panchapakesan",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-06-30T12:30:00",
    "endDate": "2024-06-30T13:30:00"
  },
  {
    "name": "Meet and Greet with the Founder of ProtoVillage – Kalyan Akkipeddi - Meet and Greet",
    "description": "After quitting his corporate career in early 2008, Kalyan traveled exclusively through rural India for about 2 and ½ years, and slow-traveled for about a year through the central Indian tribal communities right from Kuchchh all the way to the Sundarbans.\nHaving lived with scores of families that were below the so-called poverty line and right down at the bottom of the pyramid, his views on development and poverty turned 180 degrees.\nInstead of reacting or responding to the symptoms of poverty, he wanted to create a new possibility in which poverty just cannot exist. He found the idea of \"creating Resilience\" more empowering than that of \"eradicating poverty”.\nKalyan has been living and working in a remote drought-prone village called Tekulodu in the second driest and one of the poorest districts in India (Anantapur district, Andhra Pradesh) since August 2011, to co-create ProtoVillage - the prototype of a Resilient village - that ensures ecological, social and economic wellbeing. His vision is a rural India that is a network of resilient communities.\nKalyan has an undergraduate degree in Mechanical Engineering, and Masters in Business Administration. Kalyan is a fellow of the Aspen Global Leadership Network. Join us for an interactive session with Kalyan on Sunday, 30th June, at Atta Galatta, to examine how one can build self-sufficient communities.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT623",
    "image": "https://attagalatta.com/admin/uploads/events/1426409838.jpeg",
    "performer": "ProtoVillage",
    "keywords": [
      "Sustainability",
      "Meet and Greet"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-06-30T14:00:00",
    "endDate": "2024-06-30T15:00:00"
  },
  {
    "name": "Chapters Unsealed 3.0 - Monthly Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nBring along your favorite book and delve into a shared reading experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nSharing your views on favorite books.\nParticipating in the curated discussion.\nVoting for a Monthly Book Read.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT568",
    "image": "https://attagalatta.com/admin/uploads/events/709428563.png",
    "performer": "Aparajita Sharma, \nYour View On Books,",
    "keywords": [
      "Books and Literature",
      "Meetup"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-06-30T14:22:00",
    "endDate": "2024-06-30T17:55:00"
  },
  {
    "name": "Queer Meet and Greet - Meetup",
    "description": "This is a queer meet and greet event hosted by Prarthana (@shorthairedbrownqueer). It's an informal, inclusive and neurodivergent friendly space for members of the LGBTQIA+ to come together and connect with like-minded folks.\nFolks of all ages from the LGBTQIA+ community are welcome!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT606",
    "image": "https://attagalatta.com/admin/uploads/events/545012249.png",
    "performer": "Short Haired Brown Queer",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "type": "SocialEvent",
    "startDate": "2024-06-30T16:00:00",
    "endDate": "2024-06-30T19:00:00"
  },
  {
    "name": "Daiva - Author Interaction Session",
    "description": "The famous Kola performances of Tulu Nadu involve dancers who invite powerful, sacred spirits to possess them. Through the performers, and surrounded by vibrant colours and striking visuals, these spirits—known as daiva—may settle disputes, provide guidance, grant blessings and pass judgement.\nHowever, there is so much more to it than art and devotion. From Panjurli, the benevolent boar spirit, to Bobbarya, guardian of the sea, this book explores it all: the kinds of daiva, their stories, their individual natures and the ways in which they come to inhabit the devout.\nIn Daiva, bestselling author K. Hari Kumar brings you stories of powerful immortals along with details of their worship through mystifying rituals—all of which are known leave onlookers awestruck. Join us for an interactive session with the author on Sunday, 30th June, at Atta Galatta, to find out more about this spell-binding book.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT622",
    "image": "https://attagalatta.com/admin/uploads/events/1063318313.jpg",
    "performer": "K. Hari Kumar",
    "keywords": [
      "Books and Literature",
      "Launch"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-06-30T19:00:00",
    "endDate": "2024-06-30T20:30:00"
  },
  {
    "name": "Love Stories from Indian Heritage - Storytelling",
    "description": "Love stories aren’t only about the hero and heroine for love can rarely exist in isolation. Zealous messengers, art and music as mood enhancers, food as aphrodisiacs, taboos and mores – all play a pivotal role in shaping stories of love. Vikram Sridhar and Aparna Jaishankar rummage through the passages of time to bring you various hues of love etched in our heritage through literature, architecture, songs and poetry through the all- encompassing art form of oral storytelling.\nAbout Aparna Jaishankar\nAparna Jaishankar is a Storyteller with a penchant for Indic mythology. She believes that there is no ONE version of any story. Her storytelling performances take a contemporary view of ancient tales. Aparna also works with educators in developing learning perspectives in the classroom and with organisations in building internal narratives.\nAbout Vikram Sridhar \nVikram Sridhar is a Performance Storyteller and theatre practitioner who believes in Storytelling as a strong medium for Conservation and Conversation, which is highly relevant in the modern context. Vikram combines his work and interest in Theatre, Social Work, and Conservation in his Storytelling and has performed for audience of various age groups across India.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT594",
    "image": "https://attagalatta.com/admin/uploads/events/1121382649.jpeg",
    "performer": "Aparna Jaishankar, \nVikram Sridhar,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-06-30T19:30:00",
    "endDate": "2024-06-30T20:30:00"
  },
  {
    "name": "It's Pumpkin Time! - Storytelling",
    "description": "It's Pumpkin Time! Join Priya Muthukumar for a fun-filled storytelling session; listen to a few heartwarming, hilarious pumpkin tales, play a few pumpkin games & take home a pumpkin-craft!\nBesides fun, the session is loosely based on 'healthy eating'.\nPlease Note: children/ participants are requested to bring their own child-friendly scissors for the craft activity.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT598",
    "image": "https://attagalatta.com/admin/uploads/events/1100476317.jpg",
    "performer": "Priya Muthukumar",
    "keywords": [
      "Storytelling"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-07-06T11:00:00",
    "endDate": "2024-07-06T12:00:00"
  },
  {
    "name": "In Search of our First Citizens - Oral Travelogue",
    "description": "Getting lost in a tribal village at night in Birbhum. Leading to the discovery of the true meaning of Tribal life.\nWatching the \"Dhimsa\" at a remote tribal village in Orissa. Understanding it to be the tribal way of renewal and healthy procreation. \nDiscovering Katyayani, an urban girl growing up among the tribals. A parents' decision to rear a child among the tribals.\nWith the tribals at a camp on the fringes of the Eastern Ghats. The tribals adapting to other means of livelihood yet keeping their tradition intact.\nThe Bonda Tribes. Exclusive tribal communities living in the hills, their women still barely cover their upper bodies.\nThe Dhongariya Tribes. Their ancestors probably belonged to the first East African migration some 50,000 - 60,000 years ago. Here, momentarily one forgets one is in India.\nJoin Pragya to hear all about her adventures, in her search for the first citizens of India.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT614",
    "image": "https://attagalatta.com/admin/uploads/events/1413870894.jpeg",
    "performer": "Pragya Padhi",
    "keywords": [
      "Storytelling",
      "Interactive Session"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-07-06T12:30:00",
    "endDate": "2024-07-06T13:30:00"
  },
  {
    "name": "Mythology Marvels - Tales of Trees from Indic Mythology - Storytime for Children and Families",
    "description": "Indic Mythology is full of answers to the many whys of our culture. Join Lavanya Prasad as she  explores and brings forth the marvellous stories from the Indic Mythology through music, dance and theatre.\nHave you planted a tree? Do you have a favourite tree? Have you ever wondered why trees are the way they are? Trees are a significant part of the earth and have been given deep and sacred meaning in various cultures. The Champa, The Banyan, The Parijatha all have stories behind them. Join me as I take you to the world of trees through their stories. You will start seeing the trees in a different lens after this interactive and enjoyable session. There is a surprise for you all to take home too :-)\nAbout the Storyteller:\nLavanya Prasad is a passionate professional storyteller with deep love for Music and Mythology. Mythology Marvels is a humble attempt to bring to light the treasures from Indian mythology to the children and Families of Bengaluru through music, dance and theatre. Lavanya Prasad is also the founder and chief storyteller at Talescope.\nPlease find more about her here.\nLavanya Prasad: www.talescope.in",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT608",
    "image": "https://attagalatta.com/admin/uploads/events/142099394.png",
    "performer": "Lavanya Prasad",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "type": "ChildrensEvent",
    "startDate": "2024-07-06T14:30:00",
    "endDate": "2024-07-06T15:30:00"
  },
  {
    "name": "Silver Linings - July Storytelling Meetup for Adults",
    "description": "After a wonderful June meetup, we are excited to announce the July Meet up. During times of distress learning to find a silver lining increases the ability to adapt and view life through an optimistic lens. As the rain clouds engulf Bengaluru, we thought why not Silver Linings!\nYes, that's the theme for July.\nYour story can be a folktale, an authored story, a mythological tale or a legend.\nWe are announcing the meet up early to give you enough time to come up with a wonderful story and also block your dates for the meetup. Write the synopsis of your story to bangalorestorytellingsociety@gmail.com by June 30th.\nWe look forward to a wonderful July meetup with you all.\nAny questions? We are glad to help. 🙂. Whatsapp: 9845680816\nAbout BSS \nBangalore Storytelling Society (BSS), a registered body, formed in 2013, is dedicated to reviving, promoting, nurturing the art of oral storytelling and popularizing it as a performance medium.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT595",
    "image": "https://attagalatta.com/admin/uploads/events/1041624665.png",
    "performer": "Bangalore Storytelling Society",
    "keywords": [
      "Storytelling",
      "Meetup"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-07-06T16:00:00",
    "endDate": "2024-07-06T17:30:00"
  },
  {
    "name": "The BWW Short Story Community - Literary Meetup",
    "description": "The BWW Short Story Community\nThis month we will discuss The Cheater’s Guide to Love by Junot Diaz (https://www.newyorker.com/magazine/2012/07/23/the-cheaters-guide-to-love). \nWhat this is:\nThis is a ticketed, curated literary and community event, presented by Bhumika Anand from the Bangalore Writers Workshop, where we will do a deep-dive analysis and discussion of a short story.\nYou get to join a reading community where you will get to read a pre-chosen short story a month.\nYou get to examine the story in terms of its literary merit, yes, but also in terms of writing craft and context, which will be very useful if you are an aspiring storyteller or writer.\nWho should join:\nIf you are above 18 years old, interested in storytelling, literature, or are an aspiring or published author, this is for you.\nIf you are new in the city and want to be part of a community and make friends over writing,storytelling, and literature, then this is for you.\nWhat does it entail:\nReading the prescribed story. \nParticipating in the curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT600",
    "image": "https://attagalatta.com/admin/uploads/events/1423056321.jpeg",
    "performer": "Bhumika Anand",
    "keywords": [
      "Literary Discussion",
      "Meetup"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-07-06T16:00:00",
    "endDate": "2024-07-06T18:00:00"
  },
  {
    "name": "The Vagina Monologues - Theatre Performance",
    "description": "\"The Vagina Monologues\" is a play by Eve Ensler, featuring a series of diverse and empowering monologues that explore women's experiences with their bodies, sexuality, and societal expectations. Through candid and often humorous narratives, it addresses topics such as pleasure, childbirth, and violence. The monologues aim to celebrate and reclaim the female experience, promoting awareness and dialogue about women's issues. The play advocates for empowerment, breaking taboos, and fostering a sense of solidarity among women.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT609",
    "image": "https://attagalatta.com/admin/uploads/events/384805082.jpg",
    "performer": "Arena Theatre Productions",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "type": "TheatreEvent",
    "startDate": "2024-07-07T16:00:00",
    "endDate": "2024-07-07T17:30:00"
  },
  {
    "name": "Denim Embroidery Workshop - Workshop",
    "description": "Give your denim some personality!\nOur clothes can tell a great deal about our personalities and if treated with just a little bit of creativity, we can transform them into wonderful works of art. \nAt this denim embroidery workshop, you’ll learn embroidery techniques to elevate your plain denim to something uniquely you. If you’re ready for this makeover, be sure to bring your favourite denim and join us at Atta Galatta this 7th of July, 2024 between 5 and 6:30 PM. \nParticipants need to bring their own denim. Threads and needles will be provided",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT624",
    "image": "https://attagalatta.com/admin/uploads/events/582353898.png",
    "performer": "Kavitha Mahamkali",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "type": "EducationEvent",
    "startDate": "2024-07-07T17:00:00",
    "endDate": "2024-07-07T18:30:00"
  },
  {
    "name": "The Vagina Monologues - Theatre Performance",
    "description": "\"The Vagina Monologues\" is a play by Eve Ensler, featuring a series of diverse and empowering monologues that explore women's experiences with their bodies, sexuality, and societal expectations. Through candid and often humorous narratives, it addresses topics such as pleasure, childbirth, and violence. The monologues aim to celebrate and reclaim the female experience, promoting awareness and dialogue about women's issues. The play advocates for empowerment, breaking taboos, and fostering a sense of solidarity among women.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT609",
    "image": "https://attagalatta.com/admin/uploads/events/384805082.jpg",
    "performer": "Arena Theatre Productions",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "type": "TheatreEvent",
    "startDate": "2024-07-07T19:00:00",
    "endDate": "2024-07-07T17:30:00"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nJuly Read: Dalit Kitchens of Marathwada by Shahu Patole\nWe assure you that you will relish every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT626",
    "image": "https://attagalatta.com/admin/uploads/events/1991680109.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books and Literature",
      "Meetup"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-07-20T11:00:00",
    "endDate": "2024-07-20T13:00:00"
  },
  {
    "name": "Screen Craft 1.0 - Screenplay Writing Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Screenplay Writing Workshop in town. \nOur Screenplay Writing workshop is an intensive program designed to guide aspiring screenwriters through the process of crafting compelling and marketable screenplays. This workshop provides participants with a solid foundation in screenplay structure, character development, dialogue writing, and industry-standard formatting, ensuring they are equipped to bring their stories to life on the big screen.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no screenwriting experience, as well as intermediate writers looking to refine their skills. It is also suitable for novelists, playwrights, or anyone interested in exploring the craft of screenwriting.\nWorkshop Objectives:\n- To introduce participants to the fundamentals of screenplay writing.\n- To develop participants` skills in creating engaging plots and well-rounded characters.\n- To enhance participants` abilities to write effective dialogue and visual storytelling.\n- To familiarize participants with the screenplay industry and submission processes.\nKey Components involves learning theory and practicals of: \n- Story and Character Development\n- Screenplay Structure\n- Dialogue Writing\n- Scene Construction\n- Visual Storytelling\n- Formatting and Style\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Writing a story based on a prompt.\n- Participating in the curated feedback discussion.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT613",
    "image": "https://attagalatta.com/admin/uploads/events/102361248.png",
    "performer": "MWM Movies",
    "keywords": [
      "Film",
      "Workshop"
    ],
    "type": "EducationEvent",
    "startDate": "2024-07-20T11:11:00",
    "endDate": "2024-07-20T14:22:00"
  },
  {
    "name": "Risking Delight with Kedarnath Singh's \"कुदाल\" (Shovel) - Poetry Reading and Discussion",
    "description": "Dwelling on new possibilities, Risking Delight explores poetry juxtaposed with joy and despair, sound and language, body and movement, thought and discovery, then life and death, via means of close-reading as guided by the legacy of the poet, Jack Gilbert.\nRecipient of the Deepankar Khiwani Memorial Prize 2022 and Longlisted for the 2024 TOTO Funds the Arts Award for Poetry, Tuhin Bhowal’s poems and translations appear or are forthcoming in Bad Lilies, Poetry at Sangam, Oxford Anthology of Translation 2022, Commonwealth Writers UK, Parentheses Journal, and elsewhere. Tuhin lives alone in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT588",
    "image": "https://attagalatta.com/admin/uploads/events/71280061.jpeg",
    "performer": "Tuhin Bhowal",
    "keywords": [
      "Poetry",
      "Reading"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-07-20T16:00:00",
    "endDate": "2024-07-20T17:30:00"
  },
  {
    "name": "Raj Natyanjali - Classical Dance Recital",
    "description": "Mani Nata Raja Nrithya Pradhesham in association with Atta Galatta Presents a classical dance recital for a cause, in the memory of the fur angels, where 50 percent of raised fund will be donated for animal welfare.\nThe classical evening showcases 2 styles, the wonderful vibrant Bharathanatyam and Beauty of elegant Mohiniyattam. The curator Shri Manimaran Ilangovan along with his disciples Smt.Deepu, Smt.Sonika, Kum.Bavya, Kum.Aura, Kum. Aruthira, Kum.Yazhmozhi, Kum.Raina bring this memorable event for you. Smt.Sindhuja Radhakrishnan and Smt.Rashmi Chauhan shall be hosting the event.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT612",
    "image": "https://attagalatta.com/admin/uploads/events/888590554.png",
    "performer": "Manimaran Illangovan",
    "keywords": [
      "Dance",
      "Performance"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-07-20T19:00:00",
    "endDate": "2024-07-20T21:00:00"
  },
  {
    "name": "Pen & Latte 3.0 - Writers Group",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT611",
    "image": "https://attagalatta.com/admin/uploads/events/710377088.png",
    "performer": "Aparajita Sharma, \nYour View On Books,",
    "keywords": [
      "Writing",
      "Meetup"
    ],
    "type": "LiteraryEvent",
    "startDate": "2024-07-27T11:11:00",
    "endDate": "2024-07-27T14:22:00"
  },
  {
    "name": "Wandering Thoughts - Listener's Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other's experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT610",
    "image": "https://attagalatta.com/admin/uploads/events/1901849491.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "type": "SocialEvent",
    "startDate": "2024-07-27T16:00:00",
    "endDate": "2024-07-27T18:00:00"
  },
  {
    "name": "Kuch Kehta Hai Yeh Saawan - Kannada, Hindi and Marathi Music Performance",
    "description": "The Trio singing group will present an evening of soulful woven tunes, film compositions celebrating monsoon season, infused with poetry through this curated concert providing a holistic and culturally enriching experience. They will be accompanied by Rohit Kumar, leading Keyboard artist.        \nWatch the best of field perform live, feel the vibrations of music being in the same space as the performers and witnessing the expressions create a thrilling experience for all. Listen to the unheard gems featuring monsoon songs, anecdotes, trivia and poetry and immerse yourselves in a captivating musical experience, that showcases talent and artistry of featured musicians. This group showcases the versatility and creativity of musicians who skilfully incorporate freshness in their singing, bringing a new perspective to familiar/unheard tunes. It's an artistic exploration and a deeper understanding of the interplay between tradition and innovation in music.\nPratibha Kulkarni - is an Indian playback singer and a voice over artist. She is a trained Hindustani artist and has rendered several Kannada film songs and has recorded songs for many albums in multiple Indian languages including Hindi, Marathi, Kannada, Gujrati, Rajasthani and Sanskrit. \nRajeev Anand - is a professional singer and a performer. He has performed over 400+ shows in and around Bangalore till date.\nKunal Kushwaha - is a popular singer among club gigs and has been regularly performing all over Bangalore since many years.\nRohit Kumar - Leading Keyboard Artist who has delivered fantastic music across all concerts in Bangalore music circuit today.\nDr. Kavita - Anchor, Actress by passion and Doctor by profession who's been anchoring several leading concerts and events.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT509",
    "image": "https://attagalatta.com/admin/uploads/events/410636282.png",
    "performer": "Kunal Kushwaha, \nPratibha Kulkarni, \nRajeev Anand, \nRohit Kumar,",
    "keywords": [
      "Music",
      "Performance"
    ],
    "type": "MusicEvent",
    "startDate": "2024-08-10T19:00:00",
    "endDate": "2024-08-10T21:00:00"
  }
]