[
  {
    "name": "It's Pumpkin Time! - Storytelling",
    "description": "It's Pumpkin Time! Join Priya Muthukumar for a fun-filled storytelling session; listen to a few heartwarming, hilarious pumpkin tales, play a few pumpkin games & take home a pumpkin-craft!\nBesides fun, the session is loosely based on 'healthy eating'.\nPlease Note: children/ participants are requested to bring their own child-friendly scissors for the craft activity.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT598",
    "image": "https://attagalatta.com/admin/uploads/events/1100476317.jpg",
    "performer": "Priya Muthukumar",
    "keywords": [
      "Storytelling",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-06T11:00:00+05:30",
    "endDate": "2024-07-06T12:00:00+05:30"
  },
  {
    "name": "In Search of our First Citizens - Oral Travelogue",
    "description": "Getting lost in a tribal village at night in Birbhum. Leading to the discovery of the true meaning of Tribal life.\nWatching the \"Dhimsa\" at a remote tribal village in Orissa. Understanding it to be the tribal way of renewal and healthy procreation. \nDiscovering Katyayani, an urban girl growing up among the tribals. A parents' decision to rear a child among the tribals.\nWith the tribals at a camp on the fringes of the Eastern Ghats. The tribals adapting to other means of livelihood yet keeping their tradition intact.\nThe Bonda Tribes. Exclusive tribal communities living in the hills, their women still barely cover their upper bodies.\nThe Dhongariya Tribes. Their ancestors probably belonged to the first East African migration some 50,000 - 60,000 years ago. Here, momentarily one forgets one is in India.\nJoin Pragya to hear all about her adventures, in her search for the first citizens of India.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT614",
    "image": "https://attagalatta.com/admin/uploads/events/1413870894.jpeg",
    "performer": "Pragya Padhi",
    "keywords": [
      "Storytelling",
      "Interactive Session",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-06T12:30:00+05:30",
    "endDate": "2024-07-06T13:30:00+05:30"
  },
  {
    "name": "Mythology Marvels - Tales of Trees from Indic Mythology - Storytime for Children and Families",
    "description": "Indic Mythology is full of answers to the many whys of our culture. Join Lavanya Prasad as she  explores and brings forth the marvellous stories from the Indic Mythology through music, dance and theatre.\nHave you planted a tree? Do you have a favourite tree? Have you ever wondered why trees are the way they are? Trees are a significant part of the earth and have been given deep and sacred meaning in various cultures. The Champa, The Banyan, The Parijatha all have stories behind them. Join me as I take you to the world of trees through their stories. You will start seeing the trees in a different lens after this interactive and enjoyable session. There is a surprise for you all to take home too :-)\nAbout the Storyteller:\nLavanya Prasad is a passionate professional storyteller with deep love for Music and Mythology. Mythology Marvels is a humble attempt to bring to light the treasures from Indian mythology to the children and Families of Bengaluru through music, dance and theatre. Lavanya Prasad is also the founder and chief storyteller at Talescope.\nPlease find more about her here.\nLavanya Prasad: www.talescope.in",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT608",
    "image": "https://attagalatta.com/admin/uploads/events/142099394.png",
    "performer": "Lavanya Prasad",
    "keywords": [
      "Storytelling",
      "Performance",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-07-06T14:30:00+05:30",
    "endDate": "2024-07-06T15:30:00+05:30"
  },
  {
    "name": "Silver Linings - July Storytelling Meetup for Adults",
    "description": "After a wonderful June meetup, we are excited to announce the July Meet up. During times of distress learning to find a silver lining increases the ability to adapt and view life through an optimistic lens. As the rain clouds engulf Bengaluru, we thought why not Silver Linings!\nYes, that's the theme for July.\nYour story can be a folktale, an authored story, a mythological tale or a legend.\nWe are announcing the meet up early to give you enough time to come up with a wonderful story and also block your dates for the meetup. Write the synopsis of your story to bangalorestorytellingsociety@gmail.com by June 30th.\nWe look forward to a wonderful July meetup with you all.\nAny questions? We are glad to help. 🙂. Whatsapp: 9845680816\nAbout BSS \nBangalore Storytelling Society (BSS), a registered body, formed in 2013, is dedicated to reviving, promoting, nurturing the art of oral storytelling and popularizing it as a performance medium.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT595",
    "image": "https://attagalatta.com/admin/uploads/events/1041624665.png",
    "performer": "Bangalore Storytelling Society",
    "keywords": [
      "Storytelling",
      "Meetup",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-06T16:00:00+05:30",
    "endDate": "2024-07-06T17:30:00+05:30"
  },
  {
    "name": "The BWW Short Story Community - Literary Meetup",
    "description": "The BWW Short Story Community\nThis month we will discuss The Cheater’s Guide to Love by Junot Diaz (https://www.newyorker.com/magazine/2012/07/23/the-cheaters-guide-to-love). \nWhat this is:\nThis is a ticketed, curated literary and community event, presented by Bhumika Anand from the Bangalore Writers Workshop, where we will do a deep-dive analysis and discussion of a short story.\nYou get to join a reading community where you will get to read a pre-chosen short story a month.\nYou get to examine the story in terms of its literary merit, yes, but also in terms of writing craft and context, which will be very useful if you are an aspiring storyteller or writer.\nWho should join:\nIf you are above 18 years old, interested in storytelling, literature, or are an aspiring or published author, this is for you.\nIf you are new in the city and want to be part of a community and make friends over writing,storytelling, and literature, then this is for you.\nWhat does it entail:\nReading the prescribed story. \nParticipating in the curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT600",
    "image": "https://attagalatta.com/admin/uploads/events/1423056321.jpeg",
    "performer": "Bhumika Anand",
    "keywords": [
      "Literary Discussion",
      "Meetup",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-06T16:00:00+05:30",
    "endDate": "2024-07-06T18:00:00+05:30"
  },
  {
    "name": "The Vagina Monologues - Theatre Performance",
    "description": "\"The Vagina Monologues\" is a play by Eve Ensler, featuring a series of diverse and empowering monologues that explore women's experiences with their bodies, sexuality, and societal expectations. Through candid and often humorous narratives, it addresses topics such as pleasure, childbirth, and violence. The monologues aim to celebrate and reclaim the female experience, promoting awareness and dialogue about women's issues. The play advocates for empowerment, breaking taboos, and fostering a sense of solidarity among women.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT609",
    "image": "https://attagalatta.com/admin/uploads/events/384805082.jpg",
    "performer": "Arena Theatre Productions",
    "keywords": [
      "Theatre",
      "Performance",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "TheatreEvent",
    "startDate": "2024-07-07T16:00:00+05:30",
    "endDate": "2024-07-07T17:30:00+05:30"
  },
  {
    "name": "Queer Meet and Greet - Meetup",
    "description": "This is a queer meet and greet event hosted by Prarthana (@shorthairedbrownqueer). It's an informal, inclusive and neurodivergent friendly space for members of the LGBTQIA+ to come together and connect with like-minded folks.\nFolks of all ages from the LGBTQIA+ community are welcome!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT606",
    "image": "https://attagalatta.com/admin/uploads/events/545012249.png",
    "performer": "Short Haired Brown Queer",
    "keywords": [
      "Social",
      "Meetup",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-07-07T16:00:00+05:30",
    "endDate": "2024-07-07T19:00:00+05:30"
  },
  {
    "name": "Denim Embroidery Workshop - Workshop",
    "description": "Give your denim some personality!\nOur clothes can tell a great deal about our personalities and if treated with just a little bit of creativity, we can transform them into wonderful works of art. \nAt this denim embroidery workshop, you’ll learn embroidery techniques to elevate your plain denim to something uniquely you. If you’re ready for this makeover, be sure to bring your favourite denim and join us at Atta Galatta this 7th of July, 2024 between 5 and 6:30 PM. \nParticipants need to bring their own denim. Threads and needles will be provided",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT624",
    "image": "https://attagalatta.com/admin/uploads/events/582353898.png",
    "performer": "Kavitha Mahamkali",
    "keywords": [
      "Art",
      "Workshop",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-07-07T17:00:00+05:30",
    "endDate": "2024-07-07T18:30:00+05:30"
  },
  {
    "name": "The Vagina Monologues - Theatre Performance",
    "description": "\"The Vagina Monologues\" is a play by Eve Ensler, featuring a series of diverse and empowering monologues that explore women's experiences with their bodies, sexuality, and societal expectations. Through candid and often humorous narratives, it addresses topics such as pleasure, childbirth, and violence. The monologues aim to celebrate and reclaim the female experience, promoting awareness and dialogue about women's issues. The play advocates for empowerment, breaking taboos, and fostering a sense of solidarity among women.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT609",
    "image": "https://attagalatta.com/admin/uploads/events/384805082.jpg",
    "performer": "Arena Theatre Productions",
    "keywords": [
      "Theatre",
      "Performance",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "TheatreEvent",
    "startDate": "2024-07-07T19:00:00+05:30",
    "endDate": "2024-07-07T17:30:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nJuly Read: Dalit Kitchens of Marathwada by Shahu Patole\nWe assure you that you will relish every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT626",
    "image": "https://attagalatta.com/admin/uploads/events/1991680109.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books and Literature",
      "Meetup",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-20T11:00:00+05:30",
    "endDate": "2024-07-20T13:00:00+05:30"
  },
  {
    "name": "Screen Craft 1.0 - Screenplay Writing Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Screenplay Writing Workshop in town. \nOur Screenplay Writing workshop is an intensive program designed to guide aspiring screenwriters through the process of crafting compelling and marketable screenplays. This workshop provides participants with a solid foundation in screenplay structure, character development, dialogue writing, and industry-standard formatting, ensuring they are equipped to bring their stories to life on the big screen.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no screenwriting experience, as well as intermediate writers looking to refine their skills. It is also suitable for novelists, playwrights, or anyone interested in exploring the craft of screenwriting.\nWorkshop Objectives:\n- To introduce participants to the fundamentals of screenplay writing.\n- To develop participants` skills in creating engaging plots and well-rounded characters.\n- To enhance participants` abilities to write effective dialogue and visual storytelling.\n- To familiarize participants with the screenplay industry and submission processes.\nKey Components involves learning theory and practicals of: \n- Story and Character Development\n- Screenplay Structure\n- Dialogue Writing\n- Scene Construction\n- Visual Storytelling\n- Formatting and Style\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Writing a story based on a prompt.\n- Participating in the curated feedback discussion.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT613",
    "image": "https://attagalatta.com/admin/uploads/events/102361248.png",
    "performer": "MWM Movies",
    "keywords": [
      "Film",
      "Workshop",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-07-20T11:11:00+05:30",
    "endDate": "2024-07-20T14:22:00+05:30"
  },
  {
    "name": "Risking Delight with Kedarnath Singh's \"कुदाल\" (Shovel) - Poetry Reading and Discussion",
    "description": "Dwelling on new possibilities, Risking Delight explores poetry juxtaposed with joy and despair, sound and language, body and movement, thought and discovery, then life and death, via means of close-reading as guided by the legacy of the poet, Jack Gilbert.\nRecipient of the Deepankar Khiwani Memorial Prize 2022 and Longlisted for the 2024 TOTO Funds the Arts Award for Poetry, Tuhin Bhowal’s poems and translations appear or are forthcoming in Bad Lilies, Poetry at Sangam, Oxford Anthology of Translation 2022, Commonwealth Writers UK, Parentheses Journal, and elsewhere. Tuhin lives alone in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT588",
    "image": "https://attagalatta.com/admin/uploads/events/71280061.jpeg",
    "performer": "Tuhin Bhowal",
    "keywords": [
      "Poetry",
      "Reading",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-20T16:00:00+05:30",
    "endDate": "2024-07-20T17:30:00+05:30"
  },
  {
    "name": "Raj Natyanjali - Classical Dance Recital",
    "description": "Mani Nata Raja Nrithya Pradhesham in association with Atta Galatta Presents a classical dance recital for a cause, in the memory of the fur angels, where 50 percent of raised fund will be donated for animal welfare.\nThe classical evening showcases 2 styles, the wonderful vibrant Bharathanatyam and Beauty of elegant Mohiniyattam. The curator Shri Manimaran Ilangovan along with his disciples Smt.Deepu, Smt.Sonika, Kum.Bavya, Kum.Aura, Kum. Aruthira, Kum.Yazhmozhi, Kum.Raina bring this memorable event for you. Smt.Sindhuja Radhakrishnan and Smt.Rashmi Chauhan shall be hosting the event.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT612",
    "image": "https://attagalatta.com/admin/uploads/events/888590554.png",
    "performer": "Manimaran Illangovan",
    "keywords": [
      "Dance",
      "Performance",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-20T19:00:00+05:30",
    "endDate": "2024-07-20T21:00:00+05:30"
  },
  {
    "name": "Pen & Latte 3.0 - Writers Group",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT611",
    "image": "https://attagalatta.com/admin/uploads/events/710377088.png",
    "performer": "Aparajita Sharma, \nYour View On Books,",
    "keywords": [
      "Writing",
      "Meetup",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-27T11:11:00+05:30",
    "endDate": "2024-07-27T14:22:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Listener's Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other's experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT610",
    "image": "https://attagalatta.com/admin/uploads/events/1901849491.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Social",
      "Meetup",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-07-27T16:00:00+05:30",
    "endDate": "2024-07-27T18:00:00+05:30"
  },
  {
    "name": "Kuch Kehta Hai Yeh Saawan - Kannada, Hindi and Marathi Music Performance",
    "description": "The Trio singing group will present an evening of soulful woven tunes, film compositions celebrating monsoon season, infused with poetry through this curated concert providing a holistic and culturally enriching experience. They will be accompanied by Rohit Kumar, leading Keyboard artist.        \nWatch the best of field perform live, feel the vibrations of music being in the same space as the performers and witnessing the expressions create a thrilling experience for all. Listen to the unheard gems featuring monsoon songs, anecdotes, trivia and poetry and immerse yourselves in a captivating musical experience, that showcases talent and artistry of featured musicians. This group showcases the versatility and creativity of musicians who skilfully incorporate freshness in their singing, bringing a new perspective to familiar/unheard tunes. It's an artistic exploration and a deeper understanding of the interplay between tradition and innovation in music.\nPratibha Kulkarni - is an Indian playback singer and a voice over artist. She is a trained Hindustani artist and has rendered several Kannada film songs and has recorded songs for many albums in multiple Indian languages including Hindi, Marathi, Kannada, Gujrati, Rajasthani and Sanskrit. \nRajeev Anand - is a professional singer and a performer. He has performed over 400+ shows in and around Bangalore till date.\nKunal Kushwaha - is a popular singer among club gigs and has been regularly performing all over Bangalore since many years.\nRohit Kumar - Leading Keyboard Artist who has delivered fantastic music across all concerts in Bangalore music circuit today.\nDr. Kavita - Anchor, Actress by passion and Doctor by profession who's been anchoring several leading concerts and events.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT509",
    "image": "https://attagalatta.com/admin/uploads/events/410636282.png",
    "performer": "Kunal Kushwaha, \nPratibha Kulkarni, \nRajeev Anand, \nRohit Kumar,",
    "keywords": [
      "Music",
      "Performance",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "MusicEvent",
    "startDate": "2024-08-10T19:00:00+05:30",
    "endDate": "2024-08-10T21:00:00+05:30"
  }
]