[
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nSeptember Read: Chillies and Porridge: Writing Food edited by Mita Kapur\nWe assure you that you will relish every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT711",
    "image": "https://attagalatta.com/admin/uploads/events/987716312.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Food",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-21T11:00:00+05:30",
    "endDate": "2024-09-21T13:00:00+05:30"
  },
  {
    "name": "Screen Craft 2.0 - Screenplay Writing Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Screenplay Writing Workshop in town. \nOur Screenplay Writing workshop is an intensive program designed to guide aspiring screenwriters through the process of crafting compelling and marketable screenplays. This workshop provides participants with a solid foundation in screenplay structure, character development, dialogue writing, and industry-standard formatting, ensuring they are equipped to bring their stories to life on the big screen.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no screenwriting experience, as well as intermediate writers looking to refine their skills. It is also suitable for novelists, playwrights, or anyone interested in exploring the craft of screenwriting.\nWorkshop Objectives:\n- To introduce participants to the fundamentals of screenplay writing.\n- To develop participants` skills in creating engaging plots and well-rounded characters.\n- To enhance participants` abilities to write effective dialogue and visual storytelling.\n- To familiarize participants with the screenplay industry and submission processes.\nKey Components involves learning theory and practicals of: \n- Story and Character Development\n- Screenplay Structure\n- Dialogue Writing\n- Scene Construction\n- Visual Storytelling\n- Formatting and Style\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Writing a story based on a prompt.\n- Participating in the curated feedback discussion.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT685",
    "image": "https://attagalatta.com/admin/uploads/events/227598307.png",
    "performer": "MWM Movies",
    "keywords": [
      "Film",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-21T11:11:00+05:30",
    "endDate": "2024-09-21T14:22:00+05:30"
  },
  {
    "name": "The Write Step - Writers Group",
    "description": "The Write Step is a writers’ support group that hopes to foster and grow a community of writers who meet once a month to talk about the myriad aspects of writing. Writers in the making who haven’t published or written yet are most welcome. The aim is to devise a support group that sparks creativity.\nWhile each meeting will be around a certain predefined subject matter pertaining to the craft, there will be time set aside for the group to address individual queries.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT745",
    "image": "https://attagalatta.com/admin/uploads/events/373993578.png",
    "performer": "Nandita Bose",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-21T14:00:00+05:30",
    "endDate": "2024-09-21T16:00:00+05:30"
  },
  {
    "name": "ColorFull Kids: Art Adventures for Little Explorers - Art Therapy for Kids",
    "description": "\"ColorFull Kids\" is a playful art therapy session designed for children to explore their imagination and emotions through creative activities. Kids will dive into a world of colors, discovering new ways to express themselves in a safe, fun, and interactive environment.\nDate: 21st September (Saturday) \nTime: 4:00 PM – 6:00 PM\nVenue: Atta Galatta, Indiranagar\nAge group: 6- to 12-year-old kids\nWhat to Expect:\nPlayful Environment: A safe and fun atmosphere where kids can express themselves freely while making new friends.\nNo Experience Needed: All kids are welcome, whether they love drawing or just want to have fun with colors.\nInteractive Guidance: Easy-to-follow, hands-on guidance to help kids explore their imagination. Use of child-friendly language with prompts like \"Let’s paint what makes you happy!\"\nArt Supplies Provided: Non-toxic art materials such as crayons, washable paints, sheets, markers, etc. will be provided. However, participants are welcome to bring their own art supplies if they’d like.\nActivities:\nIntroduction playful, age-appropriate prompts like \"What makes you feel brave?\" or \"Draw your superhero.\"\nCollective art game called “Color Relay,” where children take turns adding to a collaborative artwork.\nGoals:\nSelf-Discovery and Fun: To encourage kids to explore emotions like joy and courage through their drawings.\nTeam Building: To help kids learn teamwork by creating group art that reflects their shared experiences.\nParental Guidance:\nParents are welcome to join or remain in the space if the children need extra support.\nJoin us for a colorful journey where every child’s imagination is the star!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT743",
    "image": "https://attagalatta.com/admin/uploads/events/639859492.png",
    "performer": "Fizapreet Dhillon",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-21T16:00:00+05:30",
    "endDate": "2024-09-21T18:00:00+05:30"
  },
  {
    "name": "BWW Short Story Community - Literary Meetup",
    "description": "The BWW Short Story Community\nThis month we will discuss The Love Of A Good Woman by Alice Munroe. (https://www.newyorker.com/magazine/1996/12/23/the-love-of-a-good-woman)\nWhat this is:\nThis is a ticketed, curated literary and community event, presented by Bhumika Anand from the Bangalore Writers Workshop, where we will do a deep-dive analysis and discussion of a short story.\nYou get to join a reading community where you will get to read a pre-chosen short story a month.\nYou get to examine the story in terms of its literary merit, yes, but also in terms of writing craft and context, which will be very useful if you are an aspiring storyteller or writer.\nWho should join:\nIf you are above 18 years old, interested in storytelling, literature, or are an aspiring or published author, this is for you.\nIf you are new in the city and want to be part of a community and make friends over writing,storytelling, and literature, then this is for you.\nWhat does it entail:\nReading the prescribed story.\nParticipating in the curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT748",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Bhumika Anand",
    "keywords": [
      "Books and Literature",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-21T16:00:00+05:30",
    "endDate": "2024-09-21T18:00:00+05:30"
  },
  {
    "name": "How and Why Tales - Storytime for Children and Families",
    "description": "Why do nightingales sing at night?\nHow did the moon get its craters?\nWhy did the Great Bear become a constellation?\nGET READY FOR THE BOOK LAUNCH of Geeta Ramanujam's third book “HOW AND WHY TALES” and get your signed copy.\nJoin Geeta Ramanujam the Master Storyteller as she whisks you away to faraway lands to explore the magical mysteries of nature.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT742",
    "image": "https://attagalatta.com/admin/uploads/events/61717001.jpeg",
    "performer": "Geeta Ramanujam",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-09-22T12:30:00+05:30",
    "endDate": "2024-09-22T13:30:00+05:30"
  },
  {
    "name": "Chapters Unsealed 4.0 - Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nBring along your favorite book and delve into a shared reading experience.\n \nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nSharing your views on favorite books.\nParticipating in the curated discussion.\nVoting for a Monthly Book Read.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT686",
    "image": "https://attagalatta.com/admin/uploads/events/1490616635.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-22T14:22:00+05:30",
    "endDate": "2024-09-22T17:55:00+05:30"
  },
  {
    "name": "3, 2, 1 Action - Kannada Improv Comedy",
    "description": "Indian Improv Tribe, a professional Improv Comedy Ensemble has been entertaining the crowd with unscripted, unplanned and yet unbelievably funny shows! We are super excited to share that we are back in action with the show 3.2.1 Action on Sept 22nd at Atta Galatta Indiranagar.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT747",
    "image": "https://attagalatta.com/admin/uploads/events/991938424.png",
    "performer": "Indian Improv Tribe",
    "keywords": [
      "Comedy",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-22T16:00:00+05:30",
    "endDate": "2024-09-22T18:30:00+05:30"
  },
  {
    "name": "Gond Art Workshop - Art Workshop",
    "description": "India has a rich tradition of folk arts. The custodians of which are the many tribes that live in the interiors of various states. The Gonds, are the largest Adivasi Community in India and are Dravidian's whose origin can be traced to the pre-Aryan era. They are mainly found in Madhya Pradesh and its surrounding States. The word Gond comes from the Dravidian expression kond, meaning green mountain. In the Gond belief system, besides Bara Deo (Great God), every hill, river, lake, tree, and rock is inhabited by a spirit and therefore sacred. Gond paintings are fascinating, where the artists express their faiths and beliefs, world view, their visual expression and sense of identity, both as a collective, and as individuals. The motifs are further associated with the rich repertoire of the community and strongly show the interactions with the cosmic, natural and social worlds of humans at multiple levels and contexts. Participate in the Gond Painting Workshop, get a chance to appreciate the art form and create you very own Gond Art masterpiece on cartridge sheets with acrylic colours.\nTake away: One complete painting A3 size\nBook Here: 9867982075",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT721",
    "image": "https://attagalatta.com/admin/uploads/events/318569093.jpeg",
    "performer": "Trishna Patnaik",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-27T16:30:00+05:30",
    "endDate": "2024-09-27T19:30:00+05:30"
  },
  {
    "name": "Let Poetry Be - Poetry Open Mic",
    "description": "Celebrate the beauty in the everyday with Let Poetry Be! Join us on September 27th at 5:30pm, for our English language poetry open-mic. This month’s theme is “Truth With A Twist” and is hosted by Shivangi Jain.\nShivangi Jain who goes by the pen name @shivi_on_wheels, is an observer of everyday things and a huge advocate of humanity. She is a psychologist, writer, and a Learning Architect. She has a lot of ideas and intends to make all of them a reality. She has recently published her debut poetry collection, Polaroids - Life in Snapshots. Her writings are said to leave one with strength and hope.\nEntry to the Open Mic is free! To read your poem, e-mail shividoodle101@gmail.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT746",
    "image": "https://attagalatta.com/admin/uploads/events/2012130717.png",
    "performer": "Shivangi Jain",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-27T17:30:00+05:30",
    "endDate": "2024-09-27T18:30:00+05:30"
  },
  {
    "name": "Underground Film Club - Monthly Film Screenings",
    "description": "At a time when we are spoilt for choice on what to watch, the best movies don't make it to streaming. And nothing beats the communal experience of watching a movie together. Join us for the first (literally) Underground film club in the city. \nThis month, join us for a screening of Fight Club (1999). Unhappy with his capitalistic lifestyle, a white-collared insomniac forms an underground fight club with Tyler, a careless soap salesman. Soon, their venture spirals down into something sinister.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT751",
    "image": "https://attagalatta.com/admin/uploads/events/1721351556.png",
    "performer": "Falah Faisal",
    "keywords": [
      "Film",
      "Screening"
    ],
    "@type": "ScreeningEvent",
    "startDate": "2024-09-27T19:00:00+05:30",
    "endDate": "2024-09-27T21:00:00+05:30"
  },
  {
    "name": "Kalighat Painting Workshop - Art Workshop",
    "description": "The paintings derive its name from the Kalighat Temple which flourished as a popular art form with the rise of a settlement around the temple. Legend has it that Sati slew herself after Lord Shiva was insulted by her father Daksha. Following this, Shiva wandered with her body on his shoulder threatening to destroy the universe. Vishnu, the preserver of Earth, intervened and shattered Sati’s body into 51 pieces which fell at different spots across the Indian subcontinent. These sites are known as Shakti Peethas. The toe of her right foot is said to have fallen at the site of the Kalighat Temple, associating it with Goddess Kalib- the ferocious form of Sati.\nWith bright colours, bold strokes, realistic figures, religious, as well as secular and civil subjects; these paintings catch the eyes of the appreciator in a jiffy. The subjects in the paintings are coloured but the base remains untouched. These characteristics came to be known as the key elements of the Kalighat paintings. The Kalighat Paintings were divided into two schools: The oriental school wherein Hindu gods and mythological figures were seen, and the occidental school that projected social evils and other secular themes.\nIn this fascinating workshop we will be working on a painting of Goddess Kali with acrylic paints on cartridge sheets. You will get to take away one complete painting (A3 size). The registration price is inclusive of all materials.\nBook Here: 9867982075",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT722",
    "image": "https://attagalatta.com/admin/uploads/events/124469668.jpeg",
    "performer": "Trishna Patnaik",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-28T11:30:00+05:30",
    "endDate": "2024-09-28T14:30:00+05:30"
  },
  {
    "name": "Becoming You - Wellness and Self-Improvement Workshop",
    "description": "This transformative workshop is about Remeeting yourself. BECOMING YOU AGAIN.\nReImagining. Restarting. Refinding. YOU.\nWe look at ourselves from the inside out, and transform ourselves into our higher beings\nIn tune with our highest frequency.\nUS BEING WHOLE We are a sum total of all our parts, the positive and the negative, the good and the bad.\nWe just have to embrace the whole. Be Authentic. Be YOU.\nThrough Transformative exercises and pattern breaking we will find a part of ourselves that we lost somewhere in the circus of life.\nHi I am Rachana,A Transformative Life Coach and the founder of The You Project. THE GREATEST PROJECT YOU WILL EVER WORK ON.\nThe You Project is about not becoming anyone else but stepping into the journey of becoming YOUR GREATEST SELF.\nAnd through this workshop we will together empower You to transform into your best version.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT734",
    "image": "https://attagalatta.com/admin/uploads/events/519416435.jpg",
    "performer": "Rachana Nagranee",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-28T13:00:00+05:30",
    "endDate": "2024-09-28T15:00:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "A space to unplug, and make stuff together. No agenda, no pressure. Draw, paint, read—or just sit and think. Talk about the art and stories that move you, or keep to yourself. It’s all good. Bring your creativity and let’s see what happens.\n(Please Note: This meetup is limited to 15 spots)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT730",
    "image": "https://attagalatta.com/admin/uploads/events/35019767.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-09-28T16:00:00+05:30",
    "endDate": "2024-09-28T19:00:00+05:30"
  },
  {
    "name": "Risking Delight with John Keats’ \"How many bards gild the lapses of time!\" - Poetry Reading and Discussion",
    "description": "Dwelling on new possibilities, Risking Delight explores poetry juxtaposed with joy and despair, sound and language, body and movement, thought and discovery, then life and death, via means of close-reading as guided by the legacy of the poet, Jack Gilbert.\nRecipient of the Deepankar Khiwani Memorial Prize 2022 and Longlisted for the 2024 TOTO Funds the Arts Award for Poetry, Tuhin Bhowal’s poems and translations appear or are forthcoming in Bad Lilies, Poetry at Sangam, Oxford Anthology of Translation 2022, Commonwealth Writers UK, Parentheses Journal, and elsewhere. Tuhin lives alone in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT733",
    "image": "https://attagalatta.com/admin/uploads/events/748360114.png",
    "performer": "Tuhin Bhowal",
    "keywords": [
      "Poetry",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-28T16:00:00+05:30",
    "endDate": "2024-09-28T17:30:00+05:30"
  },
  {
    "name": "Make Your Own Comic Strip - Workshop for Children",
    "description": "If your child loves animated characters, makes up stories about dinosaurs, fairies and superheroes, and narrates anecdotes from their life with sound effects and expressions, your child is a born storyteller!\nThis Saturday, join us so we can enable your kid(s) to present their innate creativity and original thinking in the form of a comic strip!\nThe workshop will be conducted by an experienced writer who has her work published in Femina, Mid-Day, ScoopWhoop, and Fork Media Group, among other renowned content brands. She will share - in kid-friendly language - lessons from her childhood days that helped her develop a flair for creative expression and develop a unique writing style.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT723",
    "image": "https://attagalatta.com/admin/uploads/events/1026262959.png",
    "performer": "Ritu Ailani",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-09-28T17:00:00+05:30",
    "endDate": "2024-09-28T19:00:00+05:30"
  },
  {
    "name": "Ranis of India - Storytelling",
    "description": "Ranis of India is a collection of stories from various oral, folk, mythical and historical narratives collected based on numerous travel and research over the last few years on the lesser-known or completely forgotten women rulers of this wonderful country by Vikram Sridhar.\nOver one hour, through oral story-telling smattered with folk songs, we travel the country, going deeper into many stories of Indian queens from myths, history and present times, whose stories need to be told and heard.\nFrom North to South, East to West there have been women rulers, administrators, changemakers who’ve changed and touched history strongly.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT681",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-28T20:00:00+05:30",
    "endDate": "2024-09-28T21:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT678",
    "image": "https://attagalatta.com/admin/uploads/events/1590760097.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-29T07:00:00+05:30",
    "endDate": "2024-09-29T09:30:00+05:30"
  },
  {
    "name": "Persian Mandala Art Workshop - Art Workshop",
    "description": "Mandala designs are applied in Persian art and architecture frequently. Here we are going to introduce Persian mandalas, their meaning, and characteristics.\nWhat is a Mandala?\nWhat we know about a mandala is that it is a geometric design and a symbol in Buddhism and Hinduism. In general, mandalas represent the universe. Mandalas are usually used to increase focus while meditating or doing yoga. In home décor designs, mandala tapestries, paintings or tiles can be hanged on the wall or used as a tablecloth or for bedding. In some cases, mandalas are used in decors because of their magnificent patterns and symbolic meaning for peace. Mandalas are very much engaged with home décor styles such as bohemian, hippie and gypsy in the modern design world.\nWhere do mandalas come from?\nMost of us might think mandalas root back only to India and Buddhism while there has been a wide use of mandala designs in the history of art in other religions and areas as well.\nMandala designs are applied in Persian art and architecture frequently. Here we are going to introduce Persian mandalas, their meaning, and characteristics.\nYou will take back your very own Persian Mandala Painting in A3 size paper.\nMake your own special art with acrylic colours on cartridge sheets.\nBook Here: 9867982075",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT725",
    "image": "https://attagalatta.com/admin/uploads/events/2044475145.jpeg",
    "performer": "Trishna Patnaik",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-29T11:30:00+05:30",
    "endDate": "2024-09-29T14:30:00+05:30"
  },
  {
    "name": "Tobacco De-Addiction by Yoga - Yoga Workshop",
    "description": "Yoga can be a valuable tool in helping individuals overcome tobacco addiction. The practice combines Kriya, physical asanas, breathing exercises/ Pranayama, and Meditation, which collectively address both the physical and psychological aspects of addiction. Deep breathing techniques like pranayama can help manage cravings and reduce stress, a common trigger for smoking. Regular yoga practice improves overall body awareness, potentially making smokers more conscious of tobacco`s harmful effects. Meditation and mindfulness aspects of yoga can enhance self-control and help individuals develop healthier coping mechanisms. Additionally, yoga`s focus on holistic well-being may motivate individuals to make other positive lifestyle changes, supporting their journey to quit smoking. The improved lung capacity and circulation from yoga practice can also aid in physical recovery from long-term tobacco use.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT750",
    "image": "https://attagalatta.com/admin/uploads/events/1928658798.png",
    "performer": "Vishal Nagranee",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-29T14:00:00+05:30",
    "endDate": "2024-09-29T16:00:00+05:30"
  },
  {
    "name": "Madhubani Art Workshop - Art Workshop",
    "description": "India has a rich tradition of folk arts. The custodians of which are the many tribes that live in the interiors of various states. Madhubani or Mithila painting is a folk-art form, originated from Mithila region of Bihar.\nThe paintings are traditionally based on mythological, folk themes and pastoral symbols. The designs announce the occasion of the celebration and solicit good fortune and divine blessings.\nParticipate in the Madhubani Art Workshop, get a chance to appreciate the art form and create your very own Madhubani Art masterpiece with acrylic colours on cartridge sheets. You will get to take away one complete painting (A3 size). The registration price is inclusive of all materials.\nBook Here: 9867982075",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT724",
    "image": "https://attagalatta.com/admin/uploads/events/1467575699.jpeg",
    "performer": "Trishna Patnaik",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-29T16:30:00+05:30",
    "endDate": "2024-09-29T19:30:00+05:30"
  },
  {
    "name": "Ranis of India - Storytelling",
    "description": "Ranis of India is a collection of stories from various oral, folk, mythical and historical narratives collected based on numerous travel and research over the last few years on the lesser-known or completely forgotten women rulers of this wonderful country by Vikram Sridhar.\nOver one hour, through oral story-telling smattered with folk songs, we travel the country, going deeper into many stories of Indian queens from myths, history and present times, whose stories need to be told and heard.\nFrom North to South, East to West there have been women rulers, administrators, changemakers who’ve changed and touched history strongly.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT681",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-29T20:00:00+05:30",
    "endDate": "2024-09-29T21:00:00+05:30"
  },
  {
    "name": "What's For Dinner?  - Proposal Writing Workshop",
    "description": "Are you an arts practitioner in Bengaluru? A filmmaker, poet, musician, author, designer, curator, dancer, painter...?\nHave you ever wondered how to approach writing a proposal for a grant, or a scholarship or for sponsorship...?\nWhether your ask is small or big, for money or for support in kind, whether you have been successful or unsuccessful in the past, if you have something brewing and want a dash of freshness... This 2-hour workshop will put proposal writing in a whole new light.\nConceived as a 6-step guide on how to prepare a meal for a guest, it will make you pause to think of:\nStage I: The Guest for Dinner\nState II: The Menu\nStage III: The Recipe and Ingredients\nStage IV: Cooking Processes\nState V: Plating and Presentation\nStage VI: Pre Dinner-Pleasantries\nCome. Cook up a proposal.\n--\nArundhati Ghosh is a writer and cultural practitioner based in Bangalore with three decades of experience in the arts and culture. She served as the Executive Director of India Foundation for the Arts (IFA) between 2013 and 2023.\nHer awards include the Global Fundraiser Award from Resource Alliance, Chevening Clore Leadership Award (2015-2016), Chevening Gurukul Scholarship at the London School of Economics (2005-2006), and Salzburg Global Seminar Fellowship.\nIn her professional capacity first as a fundraiser and then Executive Director at IFA, she has raised funds from foundations, trusts, corporations, bilateral agencies and individuals, across programmes and projects.\nShe has contributed on advisory panels and boards of the Seagull Foundation for the Arts, Blind with Camera and Toto funds the Arts, and continues to sit on the advisory panel for The Museum of Art and Photography (MAP), Bangalore and is a Board Member of Sangama, Bangalore an organisation working for the rights of sexual minorities, sex workers and people living with HIV.\nShe writes for publications such as Scroll, The Wire, The Hindu, The Deccan Herald, News 9, Himal, Business Standard, etc.\nInstructions\nPlease come with an idea or a need for support, this will make the workshop more relevant and less of an academic exercise.\nPlease bring your own writing implements - paper and pens/pencils - and a refillable water bottle.\nPlease be on time.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT753",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Arundhati Ghosh",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-04T16:00:00+05:30",
    "endDate": "2024-10-04T19:00:00+05:30"
  },
  {
    "name": "Pen & Latte 5.0 - Story Writing Workshop",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT736",
    "image": "https://attagalatta.com/admin/uploads/events/2004387093.png",
    "performer": "Aparajita Sharma, \nYour View On Books,",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-05T11:11:00+05:30",
    "endDate": "2024-10-05T14:22:00+05:30"
  },
  {
    "name": "Comics and Animation Workshop for Beginners - Workshop",
    "description": "An experience into the world of Bakarmax - India’s hottest comics and animation studio.\nGet to know the basics of cartooning and animation.\nWe`ll first remove your fear of drawing with simple exercises - making circles, cartoons, and panels, while we take you through different drawing types and our own methods.\nAfter getting comfortable with drawing exercises, we will explore how comics tell stories using a sequence of images and animation takes this sequence into another pace. We will attempt our own comic and animated flipbook (as seen in Taare Zameen Pe)\nDuring the break, we will give you an inside tour of a typical cartoonist and animator’s studio - our tools, comics and animation under work, projects, inspirations. You can also buy our graphic novels.\nNext, after the break, we will take you through our process when it comes to ideas and stories. We will create fun stories using mundane examples.\nWe will introduce you to other amateur cartoonists to inspire you. In the end, we will share resources and methods for you to continue drawing - the same way that we did years ago. \nAt the very end, we will screen some of our sketches and episode of a very special show we are making - strictly confidential.\nOther things to note:\nCartooning and Animation can be ✨therapeutic✨.\nAttempt this once and we are sure you’ll be doodling through rest of your life (and meetings).",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT744",
    "image": "https://attagalatta.com/admin/uploads/events/166952260.jpg",
    "performer": "Bakarmax",
    "keywords": [
      "Comics",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-05T16:00:00+05:30",
    "endDate": "2024-10-05T20:00:00+05:30"
  },
  {
    "name": "Crafting Your Ikigai Blueprint - Wellness Workshop",
    "description": "Atta Galatta and Dr. Divyanshi warmly invite you to a transformative journey of self-discovery through this Ikigai workshop.\nTrue Ikigai is much deeper than the simplified, westernized diagram you may have seen. It’s not just about the intersection of what you love, what you’re good at, and what pays the bills—it’s a profound connection to life itself. It’s a sense of purpose that transcends personal fulfillment and speaks to the joy of simply being alive, regardless of circumstances. In this Ikigai Workshop, you’ll dive beyond the surface-level interpretations to explore the authentic essence of Ikigai, rooted in Japanese culture and philosophy.\nThroughout the workshop, you’ll be guided through reflective exercises, guided meditations, introspective prompts and insightful discussions to explore the core elements of your purpose. Whether you feel stuck in your current routine, are searching for new directions, or simply want to live a more fulfilling life, this workshop will help you identify your personal Ikigai. Through self-reflection, guided activities, and group sharing, you’ll leave with clarity on how to live with intention, satisfaction, and a renewed sense of direction.\n\nWho Should Attend? \r\nThis workshop is perfect for anyone seeking more clarity and purpose in life. Whether you're navigating career transitions, looking for personal fulfillment, or simply curious about the Ikigai philosophy, this workshop is open to anyone aged 16 and above. No prior experience or background is needed.\n\nWorkshop Objectives:\r\n- To guide participants in understanding and applying the Ikigai framework in their lives.\r\n- To encourage self-reflection on passions, skills, and values.\r\n- To provide tools for aligning life choices with deeper purpose.\r\n- To create a supportive space for personal growth and sharing insights.\n\nCommunity Guidelines:\r\n- Be open, be civil, be kind.\r\n- Listen with respect and speak with intention.\r\n- Keep the conversation constructive and supportive.\n\r\nONLY 7 SEATS AVAILABLE\r\nWe aim to create an intimate and focused experience, ensuring personalized attention, deeper discussions, and space for meaningful reflection.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT752",
    "image": "https://attagalatta.com/admin/uploads/events/726112441.png",
    "performer": "Dr. Divyanshi",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-06T17:00:00+05:30",
    "endDate": "2024-10-06T20:00:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Reflection Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other`s experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT684",
    "image": "https://attagalatta.com/admin/uploads/events/1778962806.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Social",
      "Support Group"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-10-06T17:00:00+05:30",
    "endDate": "2024-10-06T19:00:00+05:30"
  },
  {
    "name": "Don't Stop Acting 2.0 - Acting Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Acting Workshop in town. \nJoin fellow aspiring actors and actresses for an inspiring session of learning acting through basics at our Writers Club Meet event in the cozy ambiance of the library cafe. Our Acting workshop is designed for aspiring artists who wish to explore the fundamentals of acting and develop their performance skills in a supportive and engaging environment. This immersive workshop offers participants a thorough grounding in acting techniques, character development, and scene work, providing them with the tools needed to bring authenticity and depth to their performances.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no acting experience, as well as intermediate actors looking to refresh their skills. It is also suitable for anyone interested in improving their public speaking and presentation abilities.\nWorkshop Objectives:\n- To introduce participants to the basic principles of acting.\n- To develop participants` abilities to create believable and compelling characters.\n- To enhance participants` skills in scene study and script analysis.\n- To build participants` confidence in performing in front of an audience.\nKey Components involves learning theory and practicals of: \n- Acting Techniques\n- Character Development and Analysis\n- SCript Analysis and Interpretation\n- Understanding Director`s Vision\n- Conveying Emotions\n- Physicality and Movement of Camera\n- Improvization and Spontaneity\n- Voice and Diction\n- Working with Props and Costumes\n- Rehearsals and Performances\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Participating in workshop with enthusiasm.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT737",
    "image": "https://attagalatta.com/admin/uploads/events/217366545.png",
    "performer": "MWM Movies",
    "keywords": [
      "Film",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-19T11:11:00+05:30",
    "endDate": "2024-10-19T14:22:00+05:30"
  },
  {
    "name": "Manga Mochas 1.0 - Manga and Comics Fan Meet",
    "description": "Atta Galatta and Your View on Books, Novel Club cordially invite you to the unique Manga Mochas, a fans meet for Comics & Manga readers.\nAre you a Manga maven or a comic connoisseur? Have you ever wanted to share your passion, connect with like-minded enthusiasts, and debate the finer points of your favorite stories? Well, your wait is over!\nCalling all voracious readers of Manga, comics, and graphic novels! Join us for an exhilarating in-person meet-up where you can express YOUR views, discuss your beloved series, and meet fellow aficionados!\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\n \nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolising the conversation.\nEvent Sections:\n1. Icebreaker Extravaganza: Kick things off with a fun game and introduce yourself. Let`s warm up the crowd!\n2. Manga Mochas: Step into the spotlight for 5-7 minutes and share your passion for your favorite Manga or comic. No slides, just pure enthusiasm!\nINTERMISSION: Chill & Chat\n3. Fun & Games: Prepare for laughs with another engaging game.\n4. What’s Next? Discuss and vote on the next Manga, comic, or graphic novel we’ll dive into!\n5. Special Surprise Activity: Stay tuned for an exciting twist!\n6. Photo Op: Say \"cheese\" for our group picture!\nCurated Books for Discussion on Monthly Reads:\n- The Maus Chapter I (Graphic Novel) by Art Spigelman\n- Batman Year One (Comics) by Frank Miller\n- Rave Master (Manga) by Hiro Mashima\n- Saga Volume One (Comics) by Brian K. Vaughan\n- Palestine (Graphic Novel) by Joe Sacco\n- Noragami Volume 1 (Manga) by Adachitoka\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT739",
    "image": "https://attagalatta.com/admin/uploads/events/329144806.png",
    "performer": "MWM Movies",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-10-20T14:22:00+05:30",
    "endDate": "2024-10-20T17:55:00+05:30"
  },
  {
    "name": "Junior Detectives: Mystery Hunters - Session",
    "description": "So you want to be a detective? Do you love reading mystery books? Then put on your thinking caps and get your magnifying glasses ready!\n- Create your own secret codes\n- Learn about fingerprints\n- Test your observation skills\n-Find clues and solve a mystery\nAll participants get one free copy of The Egghead Detective Agency Vol. 1!\nPika Nani is a children’s author based in Bengaluru. Her popular titles include, The Egghead Detective Agency Vol 1 and 2, an interactive chapter book with two little girls and a ghost detective. The Adventures of Shrilok Homeless Vol 1 & 2, an Indian version of Sherlock Holmes set in Mumbai. Little Indians: Stories from across the country, a bestselling fact plus fiction book. Five of her stories appear in school text books by Orient Blackswan and Macmillan.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT754",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Pika Nani",
    "keywords": [
      "Books",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-10-20T16:30:00+05:30",
    "endDate": "2024-10-20T17:30:00+05:30"
  }
]