[
  {
    "name": "Mahabharata: A Krishna Thriller - Storytelling",
    "description": "More than 39 Lakh warriors fought in the great war of Mahabharata. Before the swords clashed and arrows flew, a battle of strategic words transpired within the hallowed premises of Hastinapura.\nAttend this storytelling session to see a drama unfold. A drama that shattered the confidence of all those who sided with Duryodhana. There are 3 settings in which Krishna uses the tactics of \"Mantra Yuddha\" (Battle of Words) to diffuse the opposition.\nJoin us for this extraordinary storytelling show, where the power of words takes centre stage.\nPrepare to be enthralled as Krishna masterfully employs the tactics of \"Mantra Yuddha\" in three captivating settings, unleashing his unmatched intellect to outmanoeuvre and subdue those who stood alongside Duryodhana.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT631",
    "image": "https://attagalatta.com/admin/uploads/events/836679337.png",
    "performer": "Aniket Amdekar",
    "keywords": [
      "Mythology",
      "Storytelling",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-07T12:30:00+05:30",
    "endDate": "2024-07-07T13:30:00+05:30"
  },
  {
    "name": "The Vagina Monologues - Theatre Performance",
    "description": "\"The Vagina Monologues\" is a play by Eve Ensler, featuring a series of diverse and empowering monologues that explore women's experiences with their bodies, sexuality, and societal expectations. Through candid and often humorous narratives, it addresses topics such as pleasure, childbirth, and violence. The monologues aim to celebrate and reclaim the female experience, promoting awareness and dialogue about women's issues. The play advocates for empowerment, breaking taboos, and fostering a sense of solidarity among women.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT609",
    "image": "https://attagalatta.com/admin/uploads/events/384805082.jpg",
    "performer": "Arena Theatre Productions",
    "keywords": [
      "Theatre",
      "Performance",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "TheatreEvent",
    "startDate": "2024-07-07T16:00:00+05:30",
    "endDate": "2024-07-07T17:30:00+05:30"
  },
  {
    "name": "Queer Meet and Greet - Meetup",
    "description": "This is a queer meet and greet event hosted by Prarthana (@shorthairedbrownqueer). It's an informal, inclusive and neurodivergent friendly space for members of the LGBTQIA+ to come together and connect with like-minded folks.\nFolks of all ages from the LGBTQIA+ community are welcome!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT606",
    "image": "https://attagalatta.com/admin/uploads/events/633305456.jpeg",
    "performer": "Short Haired Brown Queer",
    "keywords": [
      "Social",
      "Meetup",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-07-07T16:00:00+05:30",
    "endDate": "2024-07-07T19:00:00+05:30"
  },
  {
    "name": "Denim Embroidery Workshop - Workshop",
    "description": "Give your denim some personality!\nOur clothes can tell a great deal about our personalities and if treated with just a little bit of creativity, we can transform them into wonderful works of art. \nAt this denim embroidery workshop, you’ll learn embroidery techniques to elevate your plain denim to something uniquely you. If you’re ready for this makeover, be sure to bring your favourite denim and join us at Atta Galatta this 7th of July, 2024 between 5 and 6:30 PM. \nParticipants need to bring their own denim. Threads and needles will be provided",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT624",
    "image": "https://attagalatta.com/admin/uploads/events/582353898.png",
    "performer": "Kavitha Mahamkali",
    "keywords": [
      "Art",
      "Workshop",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-07-07T17:00:00+05:30",
    "endDate": "2024-07-07T18:30:00+05:30"
  },
  {
    "name": "The Vagina Monologues - Theatre Performance",
    "description": "\"The Vagina Monologues\" is a play by Eve Ensler, featuring a series of diverse and empowering monologues that explore women's experiences with their bodies, sexuality, and societal expectations. Through candid and often humorous narratives, it addresses topics such as pleasure, childbirth, and violence. The monologues aim to celebrate and reclaim the female experience, promoting awareness and dialogue about women's issues. The play advocates for empowerment, breaking taboos, and fostering a sense of solidarity among women.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT609",
    "image": "https://attagalatta.com/admin/uploads/events/384805082.jpg",
    "performer": "Arena Theatre Productions",
    "keywords": [
      "Theatre",
      "Performance",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "TheatreEvent",
    "startDate": "2024-07-07T19:00:00+05:30",
    "endDate": "2024-07-07T17:30:00+05:30"
  },
  {
    "name": "Mindscape and Landscape: An Illustrated History of NIMHANS - Book Talk",
    "description": "Join us for a book talk by Dr. Sanjeev Jain as he discusses \"Mindscape and Landscape: An Illustrated History of NIMHANS.\" This captivating book delves into the rich history and evolution of the National Institute of Mental Health and Neurosciences (NIMHANS) Bengaluru, blending historical narratives with striking illustrations. Dr. Jain, a renowned psychiatrist, teacher and author, will provide unique insights into the institution's significant contributions to mental health and neurosciences, and the milestones & stories that have shaped NIMHANS. Don't miss this opportunity to explore the intersection of mind, medicine, and history through the lens of one of India's premier mental health institutions!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT630",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Centre for Brain and Mind, NIMHANS, \nDr. Sanjeev Jain,",
    "keywords": [
      "Books",
      "Talk",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-17T16:00:00+05:30",
    "endDate": "2024-07-17T18:00:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nJuly Read: Dalit Kitchens of Marathwada by Shahu Patole\nWe assure you that you will relish every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT626",
    "image": "https://attagalatta.com/admin/uploads/events/1991680109.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books and Literature",
      "Meetup",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-20T11:00:00+05:30",
    "endDate": "2024-07-20T13:00:00+05:30"
  },
  {
    "name": "Screen Craft 1.0 - Screenplay Writing Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Screenplay Writing Workshop in town. \nOur Screenplay Writing workshop is an intensive program designed to guide aspiring screenwriters through the process of crafting compelling and marketable screenplays. This workshop provides participants with a solid foundation in screenplay structure, character development, dialogue writing, and industry-standard formatting, ensuring they are equipped to bring their stories to life on the big screen.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no screenwriting experience, as well as intermediate writers looking to refine their skills. It is also suitable for novelists, playwrights, or anyone interested in exploring the craft of screenwriting.\nWorkshop Objectives:\n- To introduce participants to the fundamentals of screenplay writing.\n- To develop participants` skills in creating engaging plots and well-rounded characters.\n- To enhance participants` abilities to write effective dialogue and visual storytelling.\n- To familiarize participants with the screenplay industry and submission processes.\nKey Components involves learning theory and practicals of: \n- Story and Character Development\n- Screenplay Structure\n- Dialogue Writing\n- Scene Construction\n- Visual Storytelling\n- Formatting and Style\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Writing a story based on a prompt.\n- Participating in the curated feedback discussion.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT613",
    "image": "https://attagalatta.com/admin/uploads/events/102361248.png",
    "performer": "MWM Movies",
    "keywords": [
      "Film",
      "Workshop",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-07-20T11:11:00+05:30",
    "endDate": "2024-07-20T14:22:00+05:30"
  },
  {
    "name": "Risking Delight with Kedarnath Singh's \"कुदाल\" (Shovel) - Poetry Reading and Discussion",
    "description": "Dwelling on new possibilities, Risking Delight explores poetry juxtaposed with joy and despair, sound and language, body and movement, thought and discovery, then life and death, via means of close-reading as guided by the legacy of the poet, Jack Gilbert.\nRecipient of the Deepankar Khiwani Memorial Prize 2022 and Longlisted for the 2024 TOTO Funds the Arts Award for Poetry, Tuhin Bhowal’s poems and translations appear or are forthcoming in Bad Lilies, Poetry at Sangam, Oxford Anthology of Translation 2022, Commonwealth Writers UK, Parentheses Journal, and elsewhere. Tuhin lives alone in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT588",
    "image": "https://attagalatta.com/admin/uploads/events/71280061.jpeg",
    "performer": "Tuhin Bhowal",
    "keywords": [
      "Poetry",
      "Reading",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-20T16:00:00+05:30",
    "endDate": "2024-07-20T17:30:00+05:30"
  },
  {
    "name": "Raj Natyanjali - Classical Dance Recital",
    "description": "Mani Nata Raja Nrithya Pradhesham in association with Atta Galatta Presents a classical dance recital for a cause, in the memory of the fur angels, where 50 percent of raised fund will be donated for animal welfare.\nThe classical evening showcases 2 styles, the wonderful vibrant Bharathanatyam and Beauty of elegant Mohiniyattam. The curator Shri Manimaran Ilangovan along with his disciples Smt.Deepu, Smt.Sonika, Kum.Bavya, Kum.Aura, Kum. Aruthira, Kum.Yazhmozhi, Kum.Raina bring this memorable event for you. Smt.Sindhuja Radhakrishnan and Smt.Rashmi Chauhan shall be hosting the event.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT612",
    "image": "https://attagalatta.com/admin/uploads/events/888590554.png",
    "performer": "Manimaran Illangovan",
    "keywords": [
      "Dance",
      "Performance",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-20T19:00:00+05:30",
    "endDate": "2024-07-20T21:00:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT627",
    "image": "https://attagalatta.com/admin/uploads/events/1462771811.png",
    "performer": "The Listeners Circle",
    "keywords": [
      "Social",
      "Meetup",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-07-21T11:00:00+05:30",
    "endDate": "2024-07-21T13:00:00+05:30"
  },
  {
    "name": "Pen & Latte 3.0 - Writers Group",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT611",
    "image": "https://attagalatta.com/admin/uploads/events/710377088.png",
    "performer": "Aparajita Sharma, \nYour View On Books,",
    "keywords": [
      "Writing",
      "Meetup",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-07-27T11:11:00+05:30",
    "endDate": "2024-07-27T14:22:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Listener's Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other's experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT610",
    "image": "https://attagalatta.com/admin/uploads/events/1901849491.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Social",
      "Meetup",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-07-27T16:00:00+05:30",
    "endDate": "2024-07-27T18:00:00+05:30"
  },
  {
    "name": "Kuch Kehta Hai Yeh Saawan - Kannada, Hindi and Marathi Music Performance",
    "description": "The Trio singing group will present an evening of soulful woven tunes, film compositions celebrating monsoon season, infused with poetry through this curated concert providing a holistic and culturally enriching experience. They will be accompanied by Rohit Kumar, leading Keyboard artist.        \nWatch the best of field perform live, feel the vibrations of music being in the same space as the performers and witnessing the expressions create a thrilling experience for all. Listen to the unheard gems featuring monsoon songs, anecdotes, trivia and poetry and immerse yourselves in a captivating musical experience, that showcases talent and artistry of featured musicians. This group showcases the versatility and creativity of musicians who skilfully incorporate freshness in their singing, bringing a new perspective to familiar/unheard tunes. It's an artistic exploration and a deeper understanding of the interplay between tradition and innovation in music.\nPratibha Kulkarni - is an Indian playback singer and a voice over artist. She is a trained Hindustani artist and has rendered several Kannada film songs and has recorded songs for many albums in multiple Indian languages including Hindi, Marathi, Kannada, Gujrati, Rajasthani and Sanskrit. \nRajeev Anand - is a professional singer and a performer. He has performed over 400+ shows in and around Bangalore till date.\nKunal Kushwaha - is a popular singer among club gigs and has been regularly performing all over Bangalore since many years.\nRohit Kumar - Leading Keyboard Artist who has delivered fantastic music across all concerts in Bangalore music circuit today.\nDr. Kavita - Anchor, Actress by passion and Doctor by profession who's been anchoring several leading concerts and events.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT509",
    "image": "https://attagalatta.com/admin/uploads/events/410636282.png",
    "performer": "Kunal Kushwaha, \nPratibha Kulkarni, \nRajeev Anand, \nRohit Kumar,",
    "keywords": [
      "Music",
      "Performance",
      "ATTAGALATTA",
      "BOOKSTORE"
    ],
    "@type": "MusicEvent",
    "startDate": "2024-08-10T19:00:00+05:30",
    "endDate": "2024-08-10T21:00:00+05:30"
  }
]