[
  {
    "name": "Lahe Lahe Caravan presents Harry Potter Book Discussion - Meetup by Sonali Bhatia",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1554",
    "image": "https://attagalatta.com/admin/uploads/events/565028741.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-21T11:00:00+05:30",
    "endDate": "2025-12-21T12:30:00+05:30"
  },
  {
    "name": "Math Cafe by Career Space - The Weekend Twist You Didn’t Know You Needed! by Career Space",
    "description": "Let’s be honest: weekends get boring.\nChess, Carrom, Uno, Ludo… great, but overrated.\nThis time, play something totally new, something you’ve never tried, and yes… with a math twist.\nThat’s exactly what makes it Math Café.\n \nHere, you don’t just have fun, you get a free brain gym session too.\nBecause every game nudges you to think, reason, strategize… and you’ll actually enjoy using your brain (we promise).\n \nExperience it once, and we challenge you\nYou’ll come back next time with your friends.\n \nAny math enthusiast is welcome.\nAnd if you think you’re not a math person?\nEven better. Math Café is where that changes\nVenue: Atta Galatta\nDate: 21 December 2025\nTime: 2 PM – 5 PM",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1574",
    "image": "https://attagalatta.com/admin/uploads/events/1661247995.jpg",
    "performer": "Career Space",
    "keywords": [
      "Math",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-12-21T14:00:00+05:30",
    "endDate": "2025-12-21T17:00:00+05:30"
  },
  {
    "name": "Letters of connection - Letter writing circle by Svaha Space",
    "description": "Letters of Connection is a community letter writing circle that was started in 2023 by Svaha Space, a creative arts mental health initiative. This circle's theme is \"Thank you and Good-bye 2025\". It's an opportunity for you and your friends to come together on a Sunday afternoon and take some space to look back at how much 2025 has brought in, taken out, and put to rest in your life. There will be opportunities to share what your letter endeavour brought up for you or to just witness what others would like to share. We look forward to having you there.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1572",
    "image": "https://attagalatta.com/admin/uploads/events/1972750011.png",
    "performer": "Svaha Space",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-12-21T15:30:00+05:30",
    "endDate": "2025-12-21T17:30:00+05:30"
  },
  {
    "name": "Whispers from the Lighthouse of Galle - Book Launch by Priyanka Kumar",
    "description": "In an era where Gen Zs and millennials seek meaning through experiences rather than possessions, Whispers from the Lighthouse of Galle – Stories of Friendships & Adventures in Nature offers exactly the kind of soulful escape today’s young adventurers crave. For those who live for spontaneous road trips, mountain treks, beach escapades, and serendipitous conversations with strangers—and secretly nurture the hope of finding love and companionship along the way—Priyanka Kumar’s latest collection is a deeply relatable read. With its mix of short stories and memoir-style reflections, this book resonates with those who believe that real connection and personal discovery often happen far away from the familiar.\nThe newest installment in Priyanka’s celebrated People’s Kafe series, Whispers from the Lighthouse of Galle brings together heartfelt stories and travel-infused memories that capture the healing magic of nature and the unspoken bonds we form with people and places. Though it’s not a travelogue in the conventional sense, the book reads like one—with vivid glimpses into landscapes and emotions that stay with the reader long after they turn the final page.\nAnd yet, the book is as much about the people as it is about the places. There are tales of peacocks who roamed her childhood garden like kin, strangers-turned-friends on spontaneous journeys, and even encounters that subtly hint at love blossoming when least expected. The presence of love—gentle, unforced, and organic—is a quiet undercurrent in a couple of these stories, offering a warm, relatable thread for every romantic dreamer who has ever looked out of a train window and wondered, what if?",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1541",
    "image": "https://attagalatta.com/admin/uploads/events/996951640.jpeg",
    "performer": "Priyanka Kumar",
    "keywords": [
      "Travel",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-21T17:30:00+05:30",
    "endDate": "2025-12-21T19:00:00+05:30"
  },
  {
    "name": "Let Poetry Be - Poetry Open Mic by Palgun K. J.",
    "description": "This monthly gathering will see poetry coming to life, through reading, music, art and any other forms of artistic expression, at Atta Galatta. Listeners and performers are all welcome!\nDate: 27th December\nTime: 4pm \nVenue: Atta Galatta, Indiranagar\n \nEvent specifics & submission guidelines –\n1. Theme - Free Verse (any original work)\n2. Works can be original or of other poets, performed live\n3. All languages welcome\n4. Participants can read to music (acoustic instrument/s), dramatise, use props & costumes\n5. Each participant will enjoy 5 minutes of reading time\n6. Kindly submit your poem and name to letpoetrybe@gmail.com on or before 25th Dec midnight. WE WILL NOT ACCEPT ATTACHMENTS OR LINKS. SUBJECT OF YOUR MAIL MUST READ AS 'Entry for-December LPB meet-up'\n7. You may also send entries that are not related to the theme\n8. The event will begin at 4pm sharp and will be held at Atta Galatta. Participants to report not later than 3:45 pm to hear about performance order and meet the host\n9. For any further clarifications, write to us at letpoetrybe@gmail.com\nYou are now welcome to flood our inbox!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1562",
    "image": "https://attagalatta.com/admin/uploads/events/271944344.png",
    "performer": "Palgun KJ",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-27T16:00:00+05:30",
    "endDate": "2025-12-27T18:00:00+05:30"
  },
  {
    "name": "Alchemy with Art - Art Workshop by Harshitha",
    "description": "Atta Galatta presents 'Alchemy with Art' - a creative healing workshop guided by Harshitha on Sunday 28 December 2025 at 11:00 AM. \nIn this second episode of Alchemy with Art, you will be guided through a transformative art session, balancing creative expression and inner work, with the intention of turning your personal pain into power. If this is meant for you, come join and leave empowered for the New Year. \n#AlchemywithArt #creativity #innerwholeness #healingcircle #Bengaluruevents #attagalatta",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1576",
    "image": "https://attagalatta.com/admin/uploads/events/507481152.jpeg",
    "performer": "Harshitha",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-12-28T11:00:00+05:30",
    "endDate": "2025-12-28T13:00:00+05:30"
  },
  {
    "name": "Read A Kitaab - Book club",
    "description": "✨Grab your coffee, your mood, and your 2025 reading wrapup!\nJoin us for Read A Kitaab’s Book Club Meetup — this time, we’re diving in books you’ve read this year. 💭💥\n📍 Atta Galatta, Indira Nagar, Bangalore\n🗓 28 December| Sunday | 5–7 PM\nCentered around a 2025 reading wrap-up, the session invites readers to share, listen, and reflect on the books that shaped their year. 🌈📚",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1575",
    "image": "https://attagalatta.com/admin/uploads/events/1533897228.jpeg",
    "performer": "Read a Kitaab",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-28T17:00:00+05:30",
    "endDate": "2025-12-28T19:00:00+05:30"
  },
  {
    "name": "My Life Closed Twice - Book Launch by Subhashini Kaligotla",
    "description": "Author Subhashini Kaligotla launches her new poetry collection My Life Closed Twice (Copper Coin, 2025), with Jeet Thayil.\nIn My Life Closed Twice, Subhashini Kaligotla charts the long aftermath of grief, and its recursive, obsessive cadences. Drawing on premodern India’s art, literature, and history, through invented forms and received ones, in fragments, litanies, lists, and queries, the poems in this spare volume embody the psychological terrain of the grieving. Two premature deaths are at the heart of the book. Kaligotla writes of their immediate aftereffects and their enduring impact. She braids her voice with voices from India’s past—from the unknown bards of the Sanskrit epics who counsel equanimity in the face of catastrophe to the laments of Ashoka, Bilhana, and Jahangir.\r\n \nAuthor Bio\nSubhashini Kaligotla is a poet and an art historian of ancient and medieval South Asia. She is author of the poetry collection Bird of the Indian Subcontinent and the monograph Shiva’s Waterfront Temples. She teaches at Columbia, dividing her time between New York City and Hyderabad.\r\n \nAdvance Praise for My Life Closed Twice\nSubhashini Kaligotla’s ingeniously fashioned poetic structures—which are light, flexible, delicate yet possessed of remarkable tensile strength and architectural clarity and integrity—aren’t just beautiful in themselves. They’re also vessels for deep imaginative feeling and thinking and wondering and longing. She has a unique, compelling lyric voice and a distinguished twenty-first century consciousness.\n- Vijay Seshadri\nAnger, denial, bargaining, despair, all the stages of grief except acceptance, each stage overlaid with the forensic precision generated by love when it has nowhere to go. These enraged, laceratingly plainspoken poems burn with the singular self-awareness that is the writer's curse, and the writer's gift. Two deaths enclose the book like 'two dates // enclosed / by parentheses'. It is impossible to read, say, 'Only Your Brother Will You Lose' – its fifty shards hammered into the flesh like fifty nine-inch nails – and come away unscathed. \n- Jeet Thayil",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1573",
    "image": "https://attagalatta.com/admin/uploads/events/537483135.jpg",
    "performer": "Subhashini Kaligotla",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-12-28T18:30:00+05:30",
    "endDate": "2025-12-28T19:30:00+05:30"
  }
]