[
  {
    "name": "Music Camp 2025 - Music Summer Camp",
    "description": "As we melt away this summer, we may as well do it to a beat. Taaqademy Presents - Music Camp 2025\nCamp Content\n\nSong Learning - Students will develop a repertoire of songs that they can perform\nEveryone gets exposed to and gets to touch and feel all instruments - Gtr, Drums, Keys, Ukulele, Percussion, Vocals.\nStudents can choose a preferred stream of learning: Guitar, Keyboard, Drums, Vocals. (Or our teacher can help you choose too)\nMusic Appreciation - designed to enrich the student's listening experience by introducing various instruments, genres, history & evolution of styles, artists.\nBasic Music Theory\nInstruments will be provided!\nOutcome - End of batch group Recitals\n\nWe have a flexible Hop On Hop Off schedule and will be happy to fit it within your summer holiday plans.\nLet the kids sweat it out with some music. They will love it.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1078",
    "image": "https://attagalatta.com/admin/uploads/events/1869607451.png",
    "performer": "Taaqademy",
    "keywords": [
      "Music",
      "Summer Programme"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-05-29T10:30:00+05:30",
    "endDate": "2025-05-29T11:30:00+05:30"
  },
  {
    "name": "Music Camp 2025 - Music Summer Camp",
    "description": "As we melt away this summer, we may as well do it to a beat. Taaqademy Presents - Music Camp 2025\nCamp Content\n\nSong Learning - Students will develop a repertoire of songs that they can perform\nEveryone gets exposed to and gets to touch and feel all instruments - Gtr, Drums, Keys, Ukulele, Percussion, Vocals.\nStudents can choose a preferred stream of learning: Guitar, Keyboard, Drums, Vocals. (Or our teacher can help you choose too)\nMusic Appreciation - designed to enrich the student's listening experience by introducing various instruments, genres, history & evolution of styles, artists.\nBasic Music Theory\nInstruments will be provided!\nOutcome - End of batch group Recitals\n\nWe have a flexible Hop On Hop Off schedule and will be happy to fit it within your summer holiday plans.\nLet the kids sweat it out with some music. They will love it.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1078",
    "image": "https://attagalatta.com/admin/uploads/events/1869607451.png",
    "performer": "Taaqademy",
    "keywords": [
      "Music",
      "Summer Programme"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-05-29T15:00:00+05:30",
    "endDate": "2025-05-29T11:30:00+05:30"
  },
  {
    "name": "Music Camp 2025 - Music Summer Camp",
    "description": "As we melt away this summer, we may as well do it to a beat. Taaqademy Presents - Music Camp 2025\nCamp Content\n\nSong Learning - Students will develop a repertoire of songs that they can perform\nEveryone gets exposed to and gets to touch and feel all instruments - Gtr, Drums, Keys, Ukulele, Percussion, Vocals.\nStudents can choose a preferred stream of learning: Guitar, Keyboard, Drums, Vocals. (Or our teacher can help you choose too)\nMusic Appreciation - designed to enrich the student's listening experience by introducing various instruments, genres, history & evolution of styles, artists.\nBasic Music Theory\nInstruments will be provided!\nOutcome - End of batch group Recitals\n\nWe have a flexible Hop On Hop Off schedule and will be happy to fit it within your summer holiday plans.\nLet the kids sweat it out with some music. They will love it.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1078",
    "image": "https://attagalatta.com/admin/uploads/events/1869607451.png",
    "performer": "Taaqademy",
    "keywords": [
      "Music",
      "Summer Programme"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-05-30T10:30:00+05:30",
    "endDate": "2025-05-30T11:30:00+05:30"
  },
  {
    "name": "Music Camp 2025 - Music Summer Camp",
    "description": "As we melt away this summer, we may as well do it to a beat. Taaqademy Presents - Music Camp 2025\nCamp Content\n\nSong Learning - Students will develop a repertoire of songs that they can perform\nEveryone gets exposed to and gets to touch and feel all instruments - Gtr, Drums, Keys, Ukulele, Percussion, Vocals.\nStudents can choose a preferred stream of learning: Guitar, Keyboard, Drums, Vocals. (Or our teacher can help you choose too)\nMusic Appreciation - designed to enrich the student's listening experience by introducing various instruments, genres, history & evolution of styles, artists.\nBasic Music Theory\nInstruments will be provided!\nOutcome - End of batch group Recitals\n\nWe have a flexible Hop On Hop Off schedule and will be happy to fit it within your summer holiday plans.\nLet the kids sweat it out with some music. They will love it.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1078",
    "image": "https://attagalatta.com/admin/uploads/events/1869607451.png",
    "performer": "Taaqademy",
    "keywords": [
      "Music",
      "Summer Programme"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-05-30T15:00:00+05:30",
    "endDate": "2025-05-30T11:30:00+05:30"
  },
  {
    "name": "Underground Film Club - Monthly Film Screenings",
    "description": "You're Mad As Hell? So Are We.\nJoin us for a special screening of Sidney Lumet's explosive satire Network, the film that predicted the future of media—and then some. A biting, prophetic masterpiece, Network takes you inside the madness of a ratings-hungry news channel as it exploits a troubled anchor’s breakdown for profit.\nStarring Peter Finch, Faye Dunaway, and William Holden, Network is as relevant today as it was in 1976—a razor-sharp takedown of sensationalism, corporatization, and the spectacle that news has become.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1192",
    "image": "https://attagalatta.com/admin/uploads/events/2068699104.jpeg",
    "performer": "Falah Faisal",
    "keywords": [
      "Films",
      "Screening"
    ],
    "@type": "ScreeningEvent",
    "startDate": "2025-05-30T19:00:00+05:30",
    "endDate": "2025-05-30T21:00:00+05:30"
  },
  {
    "name": "Madhubani Painting Workshop - Painting Workshop",
    "description": "Madhubani paintings from Bihar, India is a traditional art form celebrated for its beautiful patterns, vibrant colours, and rich cultural significance. These paintings depict stories based on Hindu mythology, nature, everyday life and many folklores. Nature is frequently represented in various forms like motifs and borders. The common subject includes Hindu deities, scenes from Ramayana and Mahabharat, wedding rituals, day to day life. Madhubani art has evolved from wall and floor paintings to various mediums, including canvases, textiles, pottery, and even contemporary art installations. Besides its aesthetic appeal, Madhubani art plays an important role in preserving stories from Hindu mythology and local folklore. The art form also provides a livelihood to many women artists in Bihar, contributing to the economic and social empowerment of rural communities.\nIt’s time for some creative gateways to explore the intricate age old artform.  This beginner friendly workshop will guide you through the intricacy of art though tradition.\n\nA deep dive into the history, styles, and symbolism of Madhubani art. Know the amazing tales about Madhubani and its impact.\nGuided session for covering traditional borders, motifs, and compositions. From scratch to a finished master piece.\nHands-on instruction with step-by-step demonstrations for your painting. When you get your creativity and we guide you through the steps and you enter into the wonderful era of Madhubani paintings.\nOpportunity to seek further clarification even after the session ends. Any question on Madhubani and we will be happy to answer it.\nTake back your own created master piece to adore your house.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1212",
    "image": "https://attagalatta.com/admin/uploads/events/633424130.png",
    "performer": "Motley Roots",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-05-31T11:00:00+05:30",
    "endDate": "2025-05-31T13:00:00+05:30"
  },
  {
    "name": "Chapters Unsealed - Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nBring along your favorite book and delve into a shared reading experience.\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nEvent Sections:\n1. Icebreaker Extravaganza - Intro yourself & let's play an interesting fun Game to break ice cubes.\n2. Book Spotlight: This is your time to shine! Take the stage for 5-7 minutes and share your insights, thoughts, and love for any book. No slides required – just bring your passion and captivate your audience.\n       INTERMISSION: CHILL & CHAT\n3. Monthly Book Discussions - We will discuss about the books that were on vote list in previous CU and also vote for a new book to discuss in the next meet.\n4. Awards Galleria - A Surprising session for the participants.\n5. Say Butter - Click that Snap button for a group picture.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1162",
    "image": "https://attagalatta.com/admin/uploads/events/778387778.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books and Literature",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-05-31T13:11:00+05:30",
    "endDate": "2025-05-31T16:44:00+05:30"
  },
  {
    "name": "Conversation Circle - Meetup",
    "description": "This is a 90-minute open-format group session designed to encourage slow, meaningful conversation. Participants will sit in a circle and engage with thoughtful prompts, shared listening, and personal reflection. The space is gently guided, with no pressure to perform — just a chance to listen, speak, and reconnect through conversation.  \nWhy Attend?  • For meaningful dialogue and thoughtful reflection  • To slow down and connect in a calm group setting  • To explore familiar questions in a new, shared space  \nHV Chahal is a counseling psychologist and the founder of Anam Cara, where she facilitates group therapy and reflective sessions. With over seven years of experience across counseling, education, and psychological product development, she brings a warm, people-focused approach to her work. She also works with a leading technology company to design mental health and education tools.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1217",
    "image": "https://attagalatta.com/admin/uploads/events/1367711289.jpg",
    "performer": "Anam Cara, \nHarsh V. Chahal,",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-05-31T14:00:00+05:30",
    "endDate": "2025-05-31T15:30:00+05:30"
  },
  {
    "name": "Life and Other Illusions - Book Signing",
    "description": "\"Life & Other Illusions\" marks the author's debut in poetry, expressing his deepest thoughts and beliefs through 50 English poems, with a Bengali version on the horizon. This collection represents a heartfelt venture into professional writing, exploring themes of love, loss, and hope.\nLove is a central theme, intertwined with abstract reflections on social and political issues. The poems address desperation, loneliness, fear, and desire while confronting faith, hypocrisy, tyranny, and hatred. They aim to reveal injustices and societal constraints that have plagued humanity. The verses flow with freedom, innocence, emotion, and evolving expectations. Join us for the book signing at Atta Galatta!\nSourav G Roy (Rob), born in Kolkata, India, discovered his passion for poetry during his teenage years. After years of experience in the IT and Financial industries, \"Life & Other Illusions\" marks his debut as a poet. A romantic at heart, Rob is also an avid traveller, foodie, and gaming enthusiast. He currently resides in Bangalore while dreaming of a coastal haven.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1213",
    "image": "https://attagalatta.com/admin/uploads/events/1209147720.png",
    "performer": "Anecdote Publishing, \nSourav G. Roy,",
    "keywords": [
      "Books",
      "Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-05-31T16:00:00+05:30",
    "endDate": "2025-05-31T16:30:00+05:30"
  },
  {
    "name": "The BWW Short Story Community - Literary Meetup",
    "description": "The BWW Short Story Community\nThis month we will discuss The Lottery by Shirley Jackson\nWhat this is:\nThis is a ticketed, curated literary and community event, presented by Bhumika Anand from the Bangalore Writers Workshop, where we will do a deep-dive analysis and discussion of a short story.\nYou get to join a reading community where you will get to read a pre-chosen short story a month.\nYou get to examine the story in terms of its literary merit, yes, but also in terms of writing craft and context, which will be very useful if you are an aspiring storyteller or writer.\nWho should join:\nIf you are above 18 years old, interested in storytelling, literature, or are an aspiring or published author, this is for you.\nIf you are new in the city and want to be part of a community and make friends over writing,storytelling, and literature, then this is for you.\nWhat does it entail:\nReading the prescribed story.\nParticipating in the curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1170",
    "image": "https://attagalatta.com/admin/uploads/events/",
    "performer": "Bhumika Anand",
    "keywords": [
      "Books and Literature",
      "Discussion"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-05-31T16:00:00+05:30",
    "endDate": "2025-05-31T18:00:00+05:30"
  },
  {
    "name": "Ammavai Enakku Migavum Pidikkum - Tamil Book Launch",
    "description": "Atta Galatta, Bengaluru’s leading independent bookstore, will host a book discussion on the Tamil translation of Vasudhendra’s acclaimed Kannada work Nammamma Andre Nangishta on Friday, May 31, 2025, at 5:00 PM. Titled Ammavai Enakku Migavum Pidikkum in Tamil and published by Two Shores Press earlier this month ahead of the Mother’s Day celebration, this new release offers Tamil readers a fresh window into this deeply personal narrative. The original Kannada edition has sold over 30,000 copies and received the Karnataka Sahitya Akademi Award in 2006. The book’s wide-reaching impact is evident—one of its essays features in the Kannada ICSE high school syllabus, and a stage adaptation has been performed more than 50 times at Bengaluru’s iconic Rangashankara theatre.\nThe event will feature Vasudhendra in conversation with Tamil writer B. Kanmani, a powerful literary voice in her own right. The translator, K. Nallathambi, will also join the discussion.\nAmmavai Enakku Migavum Pidikkum is a collection of memoir-like essays centered on the author’s mother, with tenderness, wit, and unflinching honesty. This conversation will delve into the original work, the Tamil rendition, and the nuances of translating from Kannada to Tamil.\nIn Perumal Murugan’s words:\n\"Ammavai Enakku Migavum Pidikkum, the celebrated Kannada author Vasudhendra’s moving collection of memoir-like essays, offers not just a vivid portrait of his mother but a glimpse into her unique worldview. With a delicate balance of humor and self-mockery, the essays provoke hearty laughter even as they carry the weight of sorrow in many moments. The writing compels you forward—once you finish one essay, you can’t help but leap to the next. This is a book you’ll want to read in a single breath.\"\nTwo Shores Press is a new independent publisher founded under the Brooklyn-based Ulysses Press Indie Accelerator. Focused on literary translation, it is dedicated to bridging linguistic and geographical divides through literature. The Tamil edition of Nammamma Andre Nangishta is a significant addition to the press's expanding collection of translations.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1193",
    "image": "https://attagalatta.com/admin/uploads/events/1994529447.jpeg",
    "performer": "Two Shores Press, \nVasudhendra,",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-05-31T17:00:00+05:30",
    "endDate": "2025-05-31T18:00:00+05:30"
  },
  {
    "name": "Nirvana + GST - Stand-Up Comedy Show",
    "description": "Punit Pania has detached himself from most mainstream seductions but he can’t resist writing a new stand-up show about it.\nNew jokes from the fringes of civilization and the edge of consciousness, followed by a QnA session, i.e., Satsang IRL.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1156",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Punit Pania",
    "keywords": [
      "Standup Comedy",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-05-31T18:00:00+05:30",
    "endDate": "2025-05-31T19:00:00+05:30"
  },
  {
    "name": "Love Is All Around - Book Launch",
    "description": "Welcome to the book launch of Rita Chhablani's latest book 'Love is all Around.'\nLimiting your love to a few limits your experiences and hence your life. When we open our hearts and keep them in the 'Explore mode’, we come across people in our lives who we may have never noticed and a flow of love, accompanied by compassion and kindness happens. This leads to fresh ideas and new experiences, which add tremendous value and joy to our lives\nSo, let’s check out how a stuck-up professor’s life changed when a loving ex-student came to live with him and how a man working in a multinational company learnt life lessons from a happy waiter. There are  many  such stories in the book!\nThe author of this book, her fourth one, Rita Chhablani, will be interviewed by Shinie Antony, the co-founder of the Bangalore Literature Festival.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1195",
    "image": "https://attagalatta.com/admin/uploads/events/2086406653.jpeg",
    "performer": "Rita Chhablani",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-05-31T18:30:00+05:30",
    "endDate": "2025-05-31T19:30:00+05:30"
  },
  {
    "name": "Harry Potter Book Discussion - Meetup",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1200",
    "image": "https://attagalatta.com/admin/uploads/events/2143121269.png",
    "performer": "Lahe Lahe Caravan, \nSonali Bhatia,",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-01T11:00:00+05:30",
    "endDate": "2025-06-01T12:30:00+05:30"
  },
  {
    "name": "Making Poems with 'The Little Prince' - A poetry-writing workshop using the story of ‘The Little Prince’ as a portal",
    "description": "“What makes the desert beautiful,' said the little prince, 'is that somewhere it hides a well...” this Sunday morning we come together to find poems in the shape of deep wells resting, waiting achingly within us.\nDillipoetry invites you to a two-hour-long immersive poetry writing workshop using the story of The Little Prince as a portal to 'find what's essential and yet invisible to the eye'. Published 80 years ago, The Little Prince remains one of the most profound stories written in the past century. Every sentence in the book tucks away much more between the layers than what seems to appear. A story that offers a strange sense of novelty in every re-reading.\nThe workshop with a number of modalities, and reflective prompts will bring alive The Little Prince's laughter and grief, his sudden arrival, and his farewell light as a feather - through the story, we shall go into a pilgrimage of our own to find poems neatly tucked in the pleats of our essential experiences. No prior poetry writing experience is needed - just bring the curiosity & the untamed spirit of The Little Prince.\nNote: The medium of the workshop and the referred text will be in English.\nWhat's included?\n- Poetry writing prompts & exercises along with facilitated reflection\n- Delving into themes of wonderment, curiosity & creativity through varied activities\n- Recitation & discussion on hand-picked excerpts from 'The Little Prince's' story\n- Self-reflection & group-based activities to brush away the writer's block",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1211",
    "image": "https://attagalatta.com/admin/uploads/events/566862274.jpeg",
    "performer": "Dillipoetry, \nRachit Sharma,",
    "keywords": [
      "Poetry",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-01T12:30:00+05:30",
    "endDate": "2025-06-01T14:30:00+05:30"
  },
  {
    "name": "Conversation Circle - Meetup",
    "description": "This is a 90-minute open-format group session designed to encourage slow, meaningful conversation. Participants will sit in a circle and engage with thoughtful prompts, shared listening, and personal reflection. The space is gently guided, with no pressure to perform — just a chance to listen, speak, and reconnect through conversation.  \nWhy Attend?  • For meaningful dialogue and thoughtful reflection  • To slow down and connect in a calm group setting  • To explore familiar questions in a new, shared space  \nHV Chahal is a counseling psychologist and the founder of Anam Cara, where she facilitates group therapy and reflective sessions. With over seven years of experience across counseling, education, and psychological product development, she brings a warm, people-focused approach to her work. She also works with a leading technology company to design mental health and education tools.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1217",
    "image": "https://attagalatta.com/admin/uploads/events/1367711289.jpg",
    "performer": "Anam Cara, \nHarsh V. Chahal,",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-01T14:00:00+05:30",
    "endDate": "2025-06-01T15:30:00+05:30"
  },
  {
    "name": "Sprinting Through Ancient India! - Interactive Session and DIY Comic Workshop",
    "description": "How do we know what we know about ancient India? Join this interactive session with stories, discoveries—and make your own history-inspired comic!\nSaisudha Acharya makes Indian history come alive with wild stories, forgotten facts, and humour. A published author, educator, and compulsive reader, she believes the best way to understand the present is by asking better questions about the past.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1202",
    "image": "https://attagalatta.com/admin/uploads/events/155752935.png",
    "performer": "Rohit Bhasi, \nSaisudha Acharya,",
    "keywords": [
      "Books",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-01T16:00:00+05:30",
    "endDate": "2025-06-01T17:00:00+05:30"
  },
  {
    "name": "Yoga Tales! – Yoga Adventures for Curious Minds with Stories - Yoga and Storytelling Workshop for Children",
    "description": "Join us on a magical journey where stories come alive through Yoga!\nOur program combines fun tales with yoga poses, helping children develop flexibility, focus and calming down.\nThrough interactive storytelling and moving to different Yoga poses, kids will explore new worlds, meet exciting characters, and discover the joy of yoga.\nBenefits:\n- Develops flexibility and balance\n- Improves focus, memory and concentration\n- Boosts confidence and enjoy Yoga\n- Encourages mindfulness and relaxation\n- Fosters creativity and imagination\nSuitable for Children aged 4-12 years. Things to carry: Yoga Mat and water bottle\n*Let's breathe, move, and imagine together!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1185",
    "image": "https://attagalatta.com/admin/uploads/events/1500698703.png",
    "performer": "Dr. Meghna Vohra",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2025-06-01T17:30:00+05:30",
    "endDate": "2025-06-01T18:30:00+05:30"
  },
  {
    "name": "Picture This! - Improv Show",
    "description": "Join us for a one-of-a-kind improv comedy show where real childhood pictures — from the improvisers and the audience — inspire hilarious, heartwarming, and totally unexpected scenes. From letters to our younger selves, to toybox tales and misremembered photo moments, this show weaves nostalgia, chaos, and creativity into an unforgettable night of laughter and love.\nBring your favourite childhood photo (or just your imagination), and help us create a show that’s as unique as your 90s haircut.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1208",
    "image": "https://attagalatta.com/admin/uploads/events/1813995578.png",
    "performer": "Improv Lore",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-01T18:00:00+05:30",
    "endDate": "2025-06-01T19:00:00+05:30"
  },
  {
    "name": "Fable to Folk: Ancient Stories, Modern Voices - Theatre Summer Camp for Kids",
    "description": "Fable to Folk: Ancient Stories, Modern Voices invites children aged 8–12 on a transformative five-day theatrical journey through India’s storytelling treasures. Led by theatre practitioner Lekha Naidu, participants will explore enchanting tales from the Panchatantra, Jataka Tales, and works of A.K. Ramanujan through dynamic theatre games and creative improvisation. Children will reimagine timeless characters and narratives with their own \"Gen-Alpha\" perspective, developing essential skills in communication, teamwork, and creative expression. Each day deepens their connection to our rich cultural heritage while building confidence, clarity, and imaginative thinking.\nThe workshop culminates in a showcase where young performers share their newly crafted interpretations with family and friends. This immersive experience offers a perfect blend of cultural enrichment and contemporary expression, nurturing young minds, bodies, and souls in a screen-free, imagination-rich environment.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1187",
    "image": "https://attagalatta.com/admin/uploads/events/1298904201.png",
    "performer": "Lekha Naidu",
    "keywords": [
      "Childrens Theatre",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-02T11:00:00+05:30",
    "endDate": "2025-06-02T14:00:00+05:30"
  },
  {
    "name": "Fable to Folk: Ancient Stories, Modern Voices - Theatre Summer Camp for Kids",
    "description": "Fable to Folk: Ancient Stories, Modern Voices invites children aged 8–12 on a transformative five-day theatrical journey through India’s storytelling treasures. Led by theatre practitioner Lekha Naidu, participants will explore enchanting tales from the Panchatantra, Jataka Tales, and works of A.K. Ramanujan through dynamic theatre games and creative improvisation. Children will reimagine timeless characters and narratives with their own \"Gen-Alpha\" perspective, developing essential skills in communication, teamwork, and creative expression. Each day deepens their connection to our rich cultural heritage while building confidence, clarity, and imaginative thinking.\nThe workshop culminates in a showcase where young performers share their newly crafted interpretations with family and friends. This immersive experience offers a perfect blend of cultural enrichment and contemporary expression, nurturing young minds, bodies, and souls in a screen-free, imagination-rich environment.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1187",
    "image": "https://attagalatta.com/admin/uploads/events/1298904201.png",
    "performer": "Lekha Naidu",
    "keywords": [
      "Childrens Theatre",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-03T11:00:00+05:30",
    "endDate": "2025-06-03T14:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Simran Sewani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-03T17:00:00+05:30",
    "endDate": "2025-06-03T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Simran Sewani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-03T19:00:00+05:30",
    "endDate": "2025-06-03T18:00:00+05:30"
  },
  {
    "name": "Fable to Folk: Ancient Stories, Modern Voices - Theatre Summer Camp for Kids",
    "description": "Fable to Folk: Ancient Stories, Modern Voices invites children aged 8–12 on a transformative five-day theatrical journey through India’s storytelling treasures. Led by theatre practitioner Lekha Naidu, participants will explore enchanting tales from the Panchatantra, Jataka Tales, and works of A.K. Ramanujan through dynamic theatre games and creative improvisation. Children will reimagine timeless characters and narratives with their own \"Gen-Alpha\" perspective, developing essential skills in communication, teamwork, and creative expression. Each day deepens their connection to our rich cultural heritage while building confidence, clarity, and imaginative thinking.\nThe workshop culminates in a showcase where young performers share their newly crafted interpretations with family and friends. This immersive experience offers a perfect blend of cultural enrichment and contemporary expression, nurturing young minds, bodies, and souls in a screen-free, imagination-rich environment.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1187",
    "image": "https://attagalatta.com/admin/uploads/events/1298904201.png",
    "performer": "Lekha Naidu",
    "keywords": [
      "Childrens Theatre",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-04T11:00:00+05:30",
    "endDate": "2025-06-04T14:00:00+05:30"
  },
  {
    "name": "Fable to Folk: Ancient Stories, Modern Voices - Theatre Summer Camp for Kids",
    "description": "Fable to Folk: Ancient Stories, Modern Voices invites children aged 8–12 on a transformative five-day theatrical journey through India’s storytelling treasures. Led by theatre practitioner Lekha Naidu, participants will explore enchanting tales from the Panchatantra, Jataka Tales, and works of A.K. Ramanujan through dynamic theatre games and creative improvisation. Children will reimagine timeless characters and narratives with their own \"Gen-Alpha\" perspective, developing essential skills in communication, teamwork, and creative expression. Each day deepens their connection to our rich cultural heritage while building confidence, clarity, and imaginative thinking.\nThe workshop culminates in a showcase where young performers share their newly crafted interpretations with family and friends. This immersive experience offers a perfect blend of cultural enrichment and contemporary expression, nurturing young minds, bodies, and souls in a screen-free, imagination-rich environment.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1187",
    "image": "https://attagalatta.com/admin/uploads/events/1298904201.png",
    "performer": "Lekha Naidu",
    "keywords": [
      "Childrens Theatre",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-05T11:00:00+05:30",
    "endDate": "2025-06-05T14:00:00+05:30"
  },
  {
    "name": "Fable to Folk: Ancient Stories, Modern Voices - Theatre Summer Camp for Kids",
    "description": "Fable to Folk: Ancient Stories, Modern Voices invites children aged 8–12 on a transformative five-day theatrical journey through India’s storytelling treasures. Led by theatre practitioner Lekha Naidu, participants will explore enchanting tales from the Panchatantra, Jataka Tales, and works of A.K. Ramanujan through dynamic theatre games and creative improvisation. Children will reimagine timeless characters and narratives with their own \"Gen-Alpha\" perspective, developing essential skills in communication, teamwork, and creative expression. Each day deepens their connection to our rich cultural heritage while building confidence, clarity, and imaginative thinking.\nThe workshop culminates in a showcase where young performers share their newly crafted interpretations with family and friends. This immersive experience offers a perfect blend of cultural enrichment and contemporary expression, nurturing young minds, bodies, and souls in a screen-free, imagination-rich environment.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1187",
    "image": "https://attagalatta.com/admin/uploads/events/1298904201.png",
    "performer": "Lekha Naidu",
    "keywords": [
      "Childrens Theatre",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-06T11:00:00+05:30",
    "endDate": "2025-06-06T14:00:00+05:30"
  },
  {
    "name": "Kempi - Book Launch",
    "description": "🌟 Get Ready for a Magical Adventure! 🌟\nAwwa Pustaka proudly presents Kempi — the first-ever die-cut book in Kannada! Join us for the official book launch on June 7th at Atta Galatta.\nEnjoy a fun-filled day of stories, laughter, and imagination — perfect for children and anyone who loves a great tale. Let’s celebrate Kempi together with joy and creativity!\n🎨✨ Highlights:\nLive read-aloud session\nInteractive art activity with illustrator Poorti\nA chance to explore the beautifully crafted Kempi up close!\n🎉 Event is FREE, but registration is required — we wouldn’t want to run out of snacks! 🥪🍪\n👉 Please confirm your spot by filling out the form!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1214",
    "image": "https://attagalatta.com/admin/uploads/events/1435888166.jpg",
    "performer": "Anupama K B, \nAwwa Pustaka, \nPoorti Bapat,",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-07T11:30:00+05:30",
    "endDate": "2025-06-07T12:30:00+05:30"
  },
  {
    "name": "(K)Not Your Saree - Fashion Healing and Rephilosophy Session",
    "description": "Want to have a fearless and intutive moment with your unstitched, unused or hoarded textile - sari, stole, dupatta, or dhoti?\nRegister for (K)NOT YOUR SAREE #fashionhealing #rephilosophy session by Fashion Editor-Educator, Yoga-Pranayama Teacher, and Founder of Spiritual Fashion Platform www.revastra.com / @re_vastra\nDate: 7th June 2025\nDay: Saturday\nTime: 4 PM to 6 PM\nFee: INR 499\nVenue: Atta Galattta, Indiranagar, Bengaluru\n1. We will explore a modern version of the ancient kashta or kacchakattu drape.\n2. We will discuss rituals and practices of handwoven textiles and more.\n3. We will exchange and learn style / identity tips and techniques in an immersive sharing circle.\n4. We will read out soulful, saree stories that matter with people who matter.\nFACILITATOR\nThe session is conducted by Bhawana Pingali, former Fashion Features Editor of FEMINA (Worldwide Media Ltd.—Times of India / BBC Magazines). She is a mother of a teen, has been an editor-educator for the last 19+ years, and is currently authoring a book with PENGUIN. Her articles have appeared in The Hindu, Hindustan Times-Mint Lounge, Time Out, Lonely Planet, Travel + Leisure, Maxim, Orissa Post, Signature-Oman, among others. She has taught at NIFT, Pearl Academy, Symbiosis Institute of Design, CEPT-Ahmedabad, IIM-A, British Council (TEFL-certified trainer), GD Goenka and Ansal Universities. Her heart now lies in teaching yoga, and reviving saris and rituals through fashion research lab REVASTRA.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1201",
    "image": "https://attagalatta.com/admin/uploads/events/755552311.jpeg",
    "performer": "Bhawana Pingali",
    "keywords": [
      "Fashion",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-06-07T16:00:00+05:30",
    "endDate": "2025-06-07T18:00:00+05:30"
  },
  {
    "name": "The Night We Found Magic - Theatre Performance",
    "description": "The Night We Found Magic by Jugaad Co. is an attempt to stop and rediscover the magic surrounding us and in us.\nWe go through life oblivious to the wondrous things we do and magical beings we are. The fact is there’s magic all around us and there’s magic in us. People who love to do things for us even if it makes them uncomfortable, even though it may be challenging for them – and vice versa. It’s the magic of love.\nWe go through obstacles every day, do things that are difficult, go to sleep, wake up the next morning and we are willing to meet the day again – everyday. That we do that is nothing short of magic. We run from one thing to another everyday without really pausing and looking. If we did we’d realize that the world we live in is full of magic.\nThe play uses elements of folk, absurdity, music, song and dance to create a visual treat on stage. And in the spirit of being jugaad, all of these visuals are created with small everyday things around us – because even the smallest thing has the potential to be something big.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1215",
    "image": "https://attagalatta.com/admin/uploads/events/2004501553.jpg",
    "performer": "JUGAAD",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "TheatreEvent",
    "startDate": "2025-06-07T17:00:00+05:30",
    "endDate": "2025-06-07T18:00:00+05:30"
  },
  {
    "name": "The Grand Oxford Mystery - Book Launch",
    "description": "A destination thriller based in various locations in the heart of the Oxford University. A heart-pumping tale where fiction and reality play a treacherous game of hide-and-seek in the quaint town of Oxford. Local tourist guide Emma Carter helps an elderly stranger, Paul, write the first chapter of his 'perfect' novella. But when Paul suddenly takes his own life.... The situation takes a dark turn when Emma's uncle, Professor Jeffery, receives the typed chapter, accompanied by a menacing note threatening to disrupt a prestigious award ceremony at the historic Sheldonian Theatre. As the investigative journalist Re Parkar joins force with Emma, they embark on a frantic search for the remaining seven chapters across Oxford's iconic landscape. Join us for the launch of this thrilling book, by award-winning international author, Dr. Manjiri Prabhu!\nDr. Manjiri Prabhu is an award-winning international author, a short-film-maker, and the Curator & Founder/Director of two international festivals Pune International Literary Festival and International Festival of Spiritual India (for Humanity & Wisdom). She has authored 23 books and has directed over 200 children’s TV programmes, more than 50 short fiction and travel films. The first female mystery Author to be published outside India, Prabhu has been acknowledged as a pioneer in India among women writers of mystery fiction, and has completed 52 years in the world of writing.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1203",
    "image": "https://attagalatta.com/admin/uploads/events/1127698569.jpeg",
    "performer": "Manjiri Prabhu",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-07T18:30:00+05:30",
    "endDate": "2025-06-07T19:30:00+05:30"
  },
  {
    "name": "Pen & Latte - Story Writing Workshop",
    "description": "Atta Galatta and Aristotles Writers Club cordially invite you to the latest Writers Meetup in town. \nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you're a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Writing a story based on a prompt.\n- Participating in the curated feedback discussion.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nEvent Sections:\n1. Let’s chuckle and giggle - Intro yourself & let's play an interesting fun Game to break ice cubes. [15-20 mins]\n2. Take your Pen out Writing segment 1 - Write an outline of your Story as an individual, based on a prompt given by the host [10-15 min].\n3. Let's Learn Together - We will learn a writing technique with detailed analysis and literature case studies.\n4. Take your Pen out Writing segment 2 - Now write the complete story using the newly learned technique. [25-30 mins]\nINTERMISSION: CHILL & CHAT\n5. Sssh! Open your PowerPoint -  Present your newly written story to a fellow participant and get feedback [30 - 40 mins].\n6. Awards Galleria - A Surprising session for the participants.\n7. Say Butter - Click that Snap button for a group picture.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1204",
    "image": "https://attagalatta.com/admin/uploads/events/1801013525.png",
    "performer": "Aristotle's Writers Club",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-06-08T13:11:00+05:30",
    "endDate": "2025-06-08T16:44:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Simran Sewani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-10T17:00:00+05:30",
    "endDate": "2025-06-10T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Simran Sewani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-10T19:00:00+05:30",
    "endDate": "2025-06-10T18:00:00+05:30"
  },
  {
    "name": "Chapter Carnival - Library Meetup",
    "description": "Atta Galatta and Your View On Books, A Novel Club cordially invite you to the latest Library Meetup in town.\nJoin us for a innovative Library Meet wherein there`s over hundreds of books and you could pick a book in random and start reading together.\nHave an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nCome along with Empty Minds and fill it with rich literature from Atta Galatta’s Reading Section.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nReading minimum one chapter from a random book that you choose from the libary.\nParticipating in the ensuing curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1205",
    "image": "https://attagalatta.com/admin/uploads/events/1922640717.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-14T11:11:00+05:30",
    "endDate": "2025-06-14T14:22:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "No agenda. No icebreakers. Just a cozy space, kind people, and time to just be—draw, journal, knit, doodle, zone out... whatever feels good. 💭🖍\nWe’ll have some optional art stuff, quiet corners, and probably a bit of wholesome chaos too. Bring a project or just bring yourself. That’s more than enough.\nThis space is exclusively for LGBTQIA+ folks. We haven’t opened it up to allies just yet—thank you for understanding. 🏳‍🌈\n🌈 Spots are limited—sign up!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1119",
    "image": "https://attagalatta.com/admin/uploads/events/1673568880.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-06-15T14:00:00+05:30",
    "endDate": "2025-06-15T17:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Simran Sewani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-17T17:00:00+05:30",
    "endDate": "2025-06-17T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Simran Sewani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-17T19:00:00+05:30",
    "endDate": "2025-06-17T18:00:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nJune Read: Following Fish by Samanth Subramanian\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1216",
    "image": "https://attagalatta.com/admin/uploads/events/1926618741.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Food",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-21T11:00:00+05:30",
    "endDate": "2025-06-21T13:00:00+05:30"
  },
  {
    "name": "Love Stories from Indian Heritage - A Late Evening Story Time for Adults",
    "description": "Love stories aren’t only about the hero and heroine for love can rarely exist in isolation. Zealous messengers, art and music as mood enhancers, food as aphrodisiacs, taboos and mores – all play a pivotal role in shaping stories of love. Vikram Sridhar and Aparna Jaishankar rummage through the passages of time to bring you various hues of love etched in our heritage through literature, architecture, songs and poetry through the all- encompassing art form of oral storytelling.\nAbout Aparna Jaishankar\nAparna Jaishankar is a Storyteller with a penchant for Indic mythology. She believes that there is no ONE version of any story. Her storytelling performances take a contemporary view of ancient tales. Aparna also works with educators in developing learning perspectives in the classroom and with organisations in building internal narratives.\nAbout Vikram Sridhar \nVikram Sridhar is a Performance Storyteller and theatre practitioner who believes in Storytelling as a strong medium for Conservation and Conversation, which is highly relevant in the modern context. Vikram combines his work and interest in Theatre, Social Work, and Conservation in his Storytelling and has performed for audience of various age groups across India.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1210",
    "image": "https://attagalatta.com/admin/uploads/events/1977254080.png",
    "performer": "Aparna Jaishankar, \nVikram Sridhar,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-21T19:00:00+05:30",
    "endDate": "2025-06-21T20:00:00+05:30"
  },
  {
    "name": "Storywalk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1188",
    "image": "https://attagalatta.com/admin/uploads/events/372238875.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-22T07:00:00+05:30",
    "endDate": "2025-06-22T09:30:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Simran Sewani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-24T17:00:00+05:30",
    "endDate": "2025-06-24T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Simran Sewani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-24T19:00:00+05:30",
    "endDate": "2025-06-24T18:00:00+05:30"
  },
  {
    "name": "Chapters Unsealed - Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nBring along your favorite book and delve into a shared reading experience.\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Discussing a Curated Monthly Book Read.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nEvent Sections:\n1. Icebreaker Extravaganza - Intro yourself & let's play an interesting fun Game to break ice cubes.\n2. Book Spotlight: This is your time to shine! Take the stage for 5-7 minutes and share your insights, thoughts, and love for any book. No slides required – just bring your passion and captivate your audience.\n       INTERMISSION: CHILL & CHAT\n3. Monthly Book Discussions - We will discuss about the books that were on vote list in previous CU and also vote for a new book to discuss in the next meet.\n4. Awards Galleria - A Surprising session for the participants.\n5. Say Butter - Click that Snap button for a group picture.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1206",
    "image": "https://attagalatta.com/admin/uploads/events/325929322.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-28T11:11:00+05:30",
    "endDate": "2025-06-28T14:22:00+05:30"
  },
  {
    "name": "Screen Craft - Screenplay Writing Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Screenplay Writing Workshop in town. \nOur Screenplay Writing workshop is an intensive program designed to guide aspiring screenwriters through the process of crafting compelling and marketable screenplays. This workshop provides participants with a solid foundation in screenplay structure, character development, dialogue writing, and industry-standard formatting, ensuring they are equipped to bring their stories to life on the big screen.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no screenwriting experience, as well as intermediate writers looking to refine their skills. It is also suitable for novelists, playwrights, or anyone interested in exploring the craft of screenwriting.\nWorkshop Objectives:\n- To introduce participants to the fundamentals of screenplay writing.\n- To develop participants` skills in creating engaging plots and well-rounded characters.\n- To enhance participants` abilities to write effective dialogue and visual storytelling.\n- To familiarize participants with the screenplay industry and submission processes.\nKey Components involves learning theory and practicals of: \n- Story and Character Development\n- Screenplay Structure\n- Dialogue Writing\n- Scene Construction\n- Visual Storytelling\n- Formatting and Style\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Writing a story based on a prompt.\n- Participating in the curated feedback discussion.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1207",
    "image": "https://attagalatta.com/admin/uploads/events/381927883.png",
    "performer": "Maddie Dawson",
    "keywords": [
      "Film",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-06-29T13:11:00+05:30",
    "endDate": "2025-06-29T16:44:00+05:30"
  },
  {
    "name": "Creative Jam - Bangalore Edition - Offline Jam",
    "description": "An offline jam for people who want to create, express, and connect —outside of their 9 to 5.\nExpect 2 hours of:\n\nFun intros with strangers\nOpen mic for your hidden talents\nQuick creative challenges\nPromises to self\nReal conversations (not networking)\nExciting goodies\n\nNo big talks. No panels.\nJust people like you—figuring things out.\n📍 Atta Galatta, Bangalore\n📅 6th July\nDM 9779618662 for tickets.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1209",
    "image": "https://attagalatta.com/admin/uploads/events/1696404509.png",
    "performer": "The Outsiders",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-07-06T17:00:00+05:30",
    "endDate": "2025-07-06T19:00:00+05:30"
  }
]