[
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-19T17:00:00+05:30",
    "endDate": "2025-08-19T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-19T19:00:00+05:30",
    "endDate": "2025-08-19T18:00:00+05:30"
  },
  {
    "name": "Dances of Universal Peace - A Prayer for Peace and Celebration of Oneness",
    "description": "From the beginning of time, songs, stories and dance have brought people together in daily life, ceremonies and celebrations. Born from this timeless tradition is a simple yet powerful collective practice called the Dances of Universal Peace. Drawing on the sacred phrases of the many cultures of the world, the Dances blend singing, live music and guided meditative movement into a prayer for peace and a celebration of our oneness. No singing or dancing experience required. The Dances are for everyone, easy to learn, easy to sing and easiest to feel. Come join us! No fixed charges. Pay based on your experience and capacity after the session.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1349",
    "image": "https://attagalatta.com/admin/uploads/events/99275287.jpg",
    "performer": "Dances of Universal Peace",
    "keywords": [
      "Wellness and Health",
      "Dance and Guided Meditation"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-22T17:30:00+05:30",
    "endDate": "2025-08-22T20:30:00+05:30"
  },
  {
    "name": "Qu For Quiz - Quiz",
    "description": "The Qu for Quiz is based on a grid format with the grids formed by topics on one axis and level of difficulty (and hence the points) on the other. The topics could be varied like History, Sports, Music, Literature, Movies and more. A team of two members would get to choose a topic and the level of difficulty and the question would be revealed. The rest of the teams can go for the buzzer if they know the answer. Depending on the number of teams registering, the size of the grid would be decided. \nSAMPLE Qu: 2. The name is inspired by the traditional malt whisky distillation process in which malted barley was mixed by hand with shovels. This labor-intensive process often caused a shoulder injury to workers, causing their arms to hang low. Which brand is named thus?\nGanesh Balakrishnan is an entrepreneur, marketer and creator of terrible dad jokes. His claim to fame is attempting to sell shoes during the pandemic, culminating in a viral Shark Tank \"Down But Not Out\" appearance. He is a collector of useless facts since childhood, and has dabbled in trivia quiz circuits since college. ganesh.flatheads@gmail.com\nKarthik Srinivasan is a pseudo-retired software leader by choice, specializing in innovative ideas to spend time that include organizing cricket leagues at the scale of IPL but for free, staying up to date on latest debates in virtual social groups helmed by family and friends and more on similar lines. emailkarth@gmail.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1321",
    "image": "https://attagalatta.com/admin/uploads/events/849786021.jpeg",
    "performer": "Ganesh Balakrishnan, \nKarthik Srinivasan,",
    "keywords": [
      "Quiz",
      "Quiz"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-22T19:00:00+05:30",
    "endDate": "2025-08-22T20:30:00+05:30"
  },
  {
    "name": "Letters to Dadu: A Storytime for Hearts Big and Small - Storytelling",
    "description": "Join author Aprajita Singh for a warm and engaging storytelling session based on her picture book Summers with Dadu. Set in the world of mangoes, memories, and mischief, this session invites children (and grown-ups!) to relive the magic of holidays spent with grandparents and heartwarming connections across generations.\r\nCome be part of a fun-filled morning of stories, art and writing for the grandparents near and far!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1323",
    "image": "https://attagalatta.com/admin/uploads/events/1700706381.png",
    "performer": "Aprajita Singh",
    "keywords": [
      "Books",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-23T11:00:00+05:30",
    "endDate": "2025-08-23T12:00:00+05:30"
  },
  {
    "name": "Believer's Dilemma & Vajpayee - Book Signing & Meet and Greet",
    "description": "Abhishek Choudhary studied economics in Delhi and Chennai, followed by stints in development and journalism. He was awarded the NIF Fellowship in 2017 to research former prime minister Vajpayee’s life. During the winter of 2021–22, he was a scholar-in-residence at the International Centre Goa.\nHe will be signing copies of his books, Believer’s Dilemma and Vajpayee, at Atta Galatta, on 23rd August at 4.30 PM. Join us for an informal chat with the author, and get your books signed!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1346",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Abhishek Choudhary",
    "keywords": [
      "Books",
      "Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-23T16:30:00+05:30",
    "endDate": "2025-08-23T17:30:00+05:30"
  },
  {
    "name": "wepushthesky - Interactive Solo Performance",
    "description": "wepushthesky is back with shows in Bangalore! With performances internationally and across India, including festival shows at Feminist Theatre Festival 2023 in Palestine, AWID 2024 in Bangakok, Singapore Fringe Festival 2025, KNMA 2024 in Delhi and Neeti Hubba 2024 in Bangalore - this production is now more than 40 shows old. \nwepushthesky is an interactive solo performance that reflects on an urgent social reality of these polarized times - friendships that have been lost or have endured deeply divisive politics of hate. The protagonist weaves personal stories with community histories, stories of the Karbala with songs of the Ramayana, anecdotes of the past with desires about the future - all the while inviting the audience to listen as an act of solidarity and resistance. \nCast and Credits:\nDesign & Direction: Ujwala Rao \nPlaywright and Performer: Nisha Abdulla\nProduction Manager: Shradha Raj\nLighting Designer: Arun DT and Madhusudan BR\nSound Design: Pardafash\nSet Execution: Gautham Bheema",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1345",
    "image": "https://attagalatta.com/admin/uploads/events/1022885621.jpg",
    "performer": "Nisha Abdulla, \nQabila Collective,",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-23T17:30:00+05:30",
    "endDate": "2025-08-23T18:30:00+05:30"
  },
  {
    "name": "We Fed the Whale A Greenhouse - Book Discussion",
    "description": "The AG Lit Sisters invite you to an intimate evening with award-winning journalist and debut author Sonali Prasad, as we dive into her lyrical and poignant novel Glass Bottom, a story of two pairs of mothers and daughters who reside by the sea, navigating the silent intensity of love, loss, legacy, and everything in between.\nSet against the shifting tides of the coastline, Glass Bottom offers a tender meditation on relationships, memory, and healing. In this special session, Sonali will read a short excerpt from the novel, followed by a heartfelt Q&A and book discussion with readers.\n📚 Hosted by AG Lit Sisters\r\n🎤 In collaboration with Pan Macmillan India\nWhether you're drawn to stories that stir your soul or conversations that linger long after they end, this is a session you won’t want to miss.\nSONALI PRASAD was born and raised in New Delhi, India. Her journalism has appeared in publications such as the Guardian, Washington Post, Hakai Magazine, Quartz and Esquire Singapore. She has been awarded a Pulitzer Traveling Fellowship, Global TED Fellowship, MIT Knight Science Journalism\r\nFellowship, Logan Science Journalism Fellowship and a Jan Michalski Writing Residency, among other grants and honours.\nGlass Bottom is her first book.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1308",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Dr. Chhavi Gandhi Juneja, \nSonali Prasad,",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-23T18:00:00+05:30",
    "endDate": "2025-08-23T20:00:00+05:30"
  },
  {
    "name": "Step Into The World of Junk Journaling  - Workshop",
    "description": "Step into the world of junk journaling, where one man’s trash is another man’s treasure! Junk journaling is described as a sustainable craft that revolves around using whatever recycled materials or old scraps you have to create a personalised journal. This therapeutic hobby is perfect for seasoned journalers who want to experience a new form of journaling and even for fresh beginners who want to start journaling themselves!\nIn this 2-hour session, you will learn the basics of junk journaling, which include making journals out of old paper bags, learning how to make personalised art out of scrap, and so much more! A basic starter kit is included in this workshop to help you get right to the fun stuff.\nSo if you want to make new space, throw out old stuff, or just can’t separate from sentimental scraps, join me for a fun junk journaling session that will help you turn something drab into something fab!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1347",
    "image": "https://attagalatta.com/admin/uploads/events/1925898944.jpg",
    "performer": "Deepa Rao",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-08-24T11:00:00+05:30",
    "endDate": "2025-08-24T13:00:00+05:30"
  },
  {
    "name": "Void Niches - Autobiographical Notes Of A Hearing Disabled - Book Launch",
    "description": "\"Void Niches: Autobiographical Notes Of A Hearing Disabled\" is a powerful exploration of a life-altering transition - the journey from a non-hearing-impaired individual to someone living with a hearing disability. More than the physical change that the author had to face, the book delves into the more profound, unattractive, and unexpected transformations in relationships, perceptions, and the isolating indifference from people around. In this book, author critically examines the circumstances and situations that foster neglect and exclusion.\nChief guests of the event will be Shri. Sudhakaran Ramanthali, well known Malayalam - Kannada writer & Central Sahitya Academi Award Winner, and Smt. Rashmi Bhat, Principal and Deputy Director of Academics, Dr S R Chandrasekhar Institute of Speech and Hearing, Bengaluru. The event will also be graced by the presence of -\nJothi Mahadevan - Translator.\r\nVishnu Soman - Founder, The Inclusion Movement.\r\nParmeet - Founder, Dead_Bookwave.\nSunil Upasana is a Malayalam writer. Born in Thrissur, Kerala, he has authored four books including two short story collections and a work on Indian philosophy. His debut book earned the prestigious Kerala Sahitya Academy Award in 2016. Sunil holds degrees in Computer Engineering and Philosophy and has a deep-seated interest in Indian philosophy. He currently works as an IT Engineer while continuing his literary pursuits. He is partially hearing disabled since he was twelve years of age.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1348",
    "image": "https://attagalatta.com/admin/uploads/events/2098575486.jpeg",
    "performer": "Sunil Upasana",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-24T15:00:00+05:30",
    "endDate": "2025-08-24T17:00:00+05:30"
  },
  {
    "name": "Read A Kitaab - Monthly Book Club",
    "description": "Bangalore, the mic is yours!\nAn evening of stories, poetry, and booking conversations awaits you from Read A Kitaab – where the words are yours, and the stage is open.\nWhat’s Happening:\nOpen Mic – Read your work, or recite your poem.\nTalk About the Book You Love – Koin in bookish discussions that spark ideas and recommendations.\nBook Swap – Bring a book, take a book.\nAuthor Talk – With poet Surbhi Gupta, author of Iron Draped in Silk.\nGames – Fun icebreakers to connect with fellow book lovers.\nNetworking – Meet like-minded readers and writers.\nGifts – Surprises for our literary guests.\nWhether you’re a poet, storytelling, or just someone who loves a good bookish conversation, this evening is for you.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1350",
    "image": "https://attagalatta.com/admin/uploads/events/1490289809.jpeg",
    "performer": "Anurag Kothari, \nEkta Bhandari,",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-24T17:00:00+05:30",
    "endDate": "2025-08-24T19:00:00+05:30"
  },
  {
    "name": "Weaving A Story - A curated exploration of Khadi Textile through stories",
    "description": "Join us for a curated storytelling evening - Weaving a story (A curated exploration of Khadi Textiles). Whether you're a lover of textiles, history, or just fascinated by Indian heritage, this event will wrap you in the magic of tradition.\nThis event is organized in partnership with Metaphor Racha, an initiative to honour the people and process behind Khadi.\nAbout Ravi Kiran: \nAfter graduating from Karnataka University with a degree in electronics in 1993, Ravi Kiran chose to work in textiles/garments. For the next four years, he worked in a few garment factories and realized his true calling was more towards handcrafted textiles and made-ups. Keeping this in mind, in 1997, he started a company called 'Barometre'. Though he was not trained in textile and garment construction, having a workshop provided him with the opportunity to learn everything hands-on.\nIn 2010, he formed Metaphor Racha with a clear understanding of working with the Khadi value chain, be it spinners, weavers, dyers, printers, or tailors, and bringing deserving craftspeople to the forefront. He strongly advocates transparency in business, fair prices, pride in labour, and equal opportunity for growth for everyone involved. He considers himself fortunate to have worked with various Khadi cooperatives in Karnataka and tries to be the bridge between rural crafts and urban needs.\nAbout Aparna:\nAparna Jaishankar is a Storyteller, Educator and Corporate Trainer.\nAparna’s passion lies in exploring Indic Mythology with a contemporary lens. She enjoys the various versions of these stories found in the nooks and crannies of the Indian subcontinent in the form of songs, theatre, dance, weaving, rituals and practices. She incorporates these rich sources in her Storytelling performances.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1351",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Aparna Jaishankar, \nMetaphor Racha, \nRavi Kiran,",
    "keywords": [
      "Art",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-24T18:00:00+05:30",
    "endDate": "2025-08-24T19:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-26T17:00:00+05:30",
    "endDate": "2025-08-26T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-26T19:00:00+05:30",
    "endDate": "2025-08-26T18:00:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nAugust Read: Eating Women, Telling Tales by Bulbul Sharma\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1342",
    "image": "https://attagalatta.com/admin/uploads/events/1806174759.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-30T11:00:00+05:30",
    "endDate": "2025-08-30T13:00:00+05:30"
  },
  {
    "name": "Storywalk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1355",
    "image": "https://attagalatta.com/admin/uploads/events/174726949.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-31T07:00:00+05:30",
    "endDate": "2025-08-31T09:30:00+05:30"
  },
  {
    "name": "Once Upon A Brunch - Storytelling and Menu Tasting Session",
    "description": "Late weekend morning, brunch, stories like the ones from the olden times, meeting new people\nWhat if they all come together?\nWeekend and late morning Brunch is an emotion. On the other hand, Stories have always been an emotion too. What's common between the two is the rich heritage of food and stories. What if they come together?\nListen to these stories of the food as you enjoy your weekend Brunch set at a cozy location that has its own stories  A beautiful day starts with a lovely breakfast. And a morning with breakfast and stories. Every food we eat has a story to share… Idli, Vada, brea , Paratha etc. Every breakfast comes after a long break and is eager to be eaten. A simple Weekend morning Brunch put together by Atta Galatta\nStorytelling around the food lores by Vikram Sridhar",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1354",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance and Menu Tasting"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-31T10:00:00+05:30",
    "endDate": "2025-08-31T12:00:00+05:30"
  },
  {
    "name": "50 Above Fifty – India’s Biggest Senior Talent Event - Talent Hunt",
    "description": "🪩 LIVE Auditions in Bengaluru! 🎶\n \nAre you 50+ and ready to showcase your talent? Your stage awaits! 🌟\nStep into the spotlight and take your first step towards becoming India's Senior Superstar at Khyaal’s 50 Above 50 – India’s biggest talent hunt for seniors!\n📍 Venue: Atta Galatta, Bengaluru\n🎭 Choose your category — Singing, Dancing, Poetry, Art, Storytelling, Comedy & more!\n🎁 Stand a chance to win exciting cash prizes\n💰 Registration Fee: ₹999 only\n🎉 Exclusive Benefits for Participants:\n✅ Nominate yourself in 2 or more award categories\n✅ Get 1-year FREE membership to the Khyaal Club — India’s largest club for seniors!\n📲 Register now and let your talent shine: https://forms.gle/Pi8gwH4es8uN56nFA\n💻 Pay online at www.50above50.com or at the venue.\n🔗 For more details about the different categories, visit: https://www.50above50.com/categories",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1353",
    "image": "https://attagalatta.com/admin/uploads/events/263962052.jpeg",
    "performer": "Khyaal",
    "keywords": [
      "Talent Hunt",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-31T11:00:00+05:30",
    "endDate": "2025-08-31T13:00:00+05:30"
  },
  {
    "name": "Anxious Minds, Restless Hearts - Interactive Session for Wellness",
    "description": "Ever felt like you are moving through life on autopilot? – Functioning, producing, responding, while your mind races and your heart quietly aches for something more?  This 75-minute interactive session is designed for working professionals and young adults who carry the weight of doing it all, while quietly wondering if they’re okay at all.\nLed by Mandeep Kaur Bhalla, Licensed Clinical Psychologist and Founder of Peacepod- with 7+ years of experience post master’s and 4+ years post MPhil in Clinical Psychology - this session is not a lecture. It’s a pause.\nA space to reflect, connect, and reset your inner compass.\nWhether you’re managing silent anxiety, inner restlessness, or simply running on empty- this conversation is for you.\nWhat you’ll take back:\n• A deeper understanding of your anxious mind\n• Grounding tools for emotional turbulence\n• Insightful reflection that lingers after the session ends\nExpect a blend of reflection, real talk and meaningful exercises.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1352",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Mandeep Kaur Bhalla",
    "keywords": [
      "Wellness and Health",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-06T16:00:00+05:30",
    "endDate": "2025-09-06T17:15:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "The next dates for Queer Quiet Hours are here!  \nQueer Quiet Hours is back — a cozy space to rest, make art, and just be. No pressure to talk, no need to perform. Just soft community vibes and gentle company. Bring your own project or come as you are. We'll have plenty of art stuff for you to use.\n✨ For LGBTQIA+ folks only. We haven't opened it up to allies yet.\n\r\n🆓 Free to join. Limited spots.\n\r\n📸 No photos taken without clear consent.\n\r\nSpots are limited - Sign up!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1275",
    "image": "https://attagalatta.com/admin/uploads/events/99240190.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-07T14:00:00+05:30",
    "endDate": "2025-09-07T17:00:00+05:30"
  }
]