[
  {
    "name": "Qu For Quiz - Quiz",
    "description": "The Qu for Quiz is based on a grid format with the grids formed by topics on one axis and level of difficulty (and hence the points) on the other. The topics could be varied like History, Sports, Music, Literature, Movies and more. A team of two members would get to choose a topic and the level of difficulty and the question would be revealed. The rest of the teams can go for the buzzer if they know the answer. Depending on the number of teams registering, the size of the grid would be decided. \nSAMPLE Qu: 2. The name is inspired by the traditional malt whisky distillation process in which malted barley was mixed by hand with shovels. This labor-intensive process often caused a shoulder injury to workers, causing their arms to hang low. Which brand is named thus?\nGanesh Balakrishnan is an entrepreneur, marketer and creator of terrible dad jokes. His claim to fame is attempting to sell shoes during the pandemic, culminating in a viral Shark Tank \"Down But Not Out\" appearance. He is a collector of useless facts since childhood, and has dabbled in trivia quiz circuits since college. ganesh.flatheads@gmail.com\nKarthik Srinivasan is a pseudo-retired software leader by choice, specializing in innovative ideas to spend time that include organizing cricket leagues at the scale of IPL but for free, staying up to date on latest debates in virtual social groups helmed by family and friends and more on similar lines. emailkarth@gmail.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1026",
    "image": "https://attagalatta.com/admin/uploads/events/1124654186.jpeg",
    "performer": "Ganesh Balakrishnan, \nKarthik Srinivasan,",
    "keywords": [
      "Quiz",
      "Quiz"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-14T19:00:00+05:30",
    "endDate": "2025-03-14T20:00:00+05:30"
  },
  {
    "name": "Poetic Brew - Poetry Meetup",
    "description": "Gather, Poetic Souls, for an afternoon divine, where verses entwine and words intertwine. In this literary realm, hearts open wide, For a Poetry Meet, let passion be our guide.\nInviting all Poetry enthusiasts 📚 to an In-Person Meet where you can indulge in creative poetry writing and reading session. \nEvent Sections:\n1. Icebreaker Extravaganza - Intro yourself & let`s play an interesting fun Game to break ice cubes.\n2. Poet`s Spotlight: Write a poem based on an innovative prompt letting your thoughts engage.\n<-- INTERMISSION: CHILL & CHAT -->\n3. Recital Stage: Take center stage for 5-7 minutes, discuss the verse that`s touched your head. As you share your verse, let passion reign.\n4. Verse of the Month & What Lies Ahead - Vote for the next Poetry Book to read.\n5. Say Butter - Click that Snap button for a group picture.\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolising the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT936",
    "image": "https://attagalatta.com/admin/uploads/events/769771471.png",
    "performer": "Your View On Books",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-15T11:11:00+05:30",
    "endDate": "2025-03-15T17:55:00+05:30"
  },
  {
    "name": "Book Idea to Success - Writing Workshop",
    "description": "Do you have a book idea but don’t know where to start?\nHave you been dreaming of writing a book but feel stuck?\nOr maybe you have a strong gut feeling that your book can be successful—but you`re unsure how to make it happen amidst the messy market?\nJoin \"Book Idea to Success\"—an interactive, activity-based workshop designed to help you craft a winning strategy and turn your book idea into a publishing success!\nIn this workshop, you`ll get introduced to six key areas that will make your book a success. You`ll also go through a proven five-step process to achieve your goal. By the end of this workshop, you’ll have a clear direction and a solid plan to start writing your book with confidence to make it successful.\n📆 Date: 15th March\n⏰ Time: 4:00 - 6:00 PM\n📍 Location: Atta Galatta, Indiranagar\n💰 Investment: 399 Rupees\nRegister now to secure your spot—link is in bio!\nReady to break through your doubts and create a winning strategy for your first book?\nResearch suggests that 81% of people want to write a book, but only 3% start writing, and less than 0.1% successfully publish and sell significant copies.\n👉 Register now and take the first step toward your successful author journey. Experience success alongside other aspiring authors as you unlock the strategies, tools, and confidence to turn your ‘Book Idea into Success’.\nLet’s make your book dream a reality!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1015",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Rudresh Jayaram",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-15T16:00:00+05:30",
    "endDate": "2025-03-15T18:00:00+05:30"
  },
  {
    "name": "Conscious Relating - Wellness and Self-Improvement Workshop",
    "description": "Would you like richer and deeper connections in your life? Do you want to relate better with your family, romantic partner, colleagues or friends? Come join us for a session on Conscious Relating, where we will explore:\nHow to create containers to help each other open up\nHow to deal with triggers that come up\nThe art of empathizing before responding\nAvoiding the Drama Triangle in relationships\nIn this 1.5 hour session we will mix in theory with some fun and reflective exercises where you will get a chance to try out the practices with others. \nAbout the Facilitator: Roy Jacob is the founder of the Conscious Communication Academy. He has been facilitating retreats for the past 14 years, including Conscious Communication, the India Youth Jam, the EcoJam, Authentic Relating, Deep Ecology, and team retreats for NGO`s and companies. He also mediates and coaches people through conflicts. Roy grew up in the U.S. before finding his calling and coming to India (where his roots are) in 2003. Apart from facilitating, he enjoys farming, simple living, and watching the moon and stars at night.\nGuidelines:\nYou`re in control. Choose how much you want to participate (or not)\nBe respectful of others, include keeping other people`s personal stories confidential\nIf you like to speak a lot please give others space as well; and if you tend not to speak as much, your voice is welcome too!\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1029",
    "image": "https://attagalatta.com/admin/uploads/events/740892259.png",
    "performer": "Roy Jacob",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-15T17:00:00+05:30",
    "endDate": "2025-03-15T18:30:00+05:30"
  },
  {
    "name": "TechnoCats - Special Rough Cut Screening",
    "description": "You are cordially invited to a special rough-cut screening of TechnoCats, a documentary that delves into a personal journey of ambition, competition, and the high-stakes in the world of the Indian Institute of Technology (IIT) and the relentless pursuit of success in a fiercely competitive system.\nAt India’s most elite engineering college, ambition is everything—but so is survival. TechnoCats follows 7 students over 7 years, chasing success in a high-stakes environment where winner takes all. Layered with the perspective of an IIT alumnus from 35 years ago, the film paints a portrait of an institution that shapes not just careers, but identities and futures.\nThis is an opportunity to see the film in its rough-cut stage. We’re looking for fresh perspectives—your feedback will help shape the final version. We’re also seeking support to complete the film, whether through funding, studio time, or connections that can help bring TechnoCats to a wider audience.\nYour presence, thoughts, and support—of any kind—would mean a lot to us. Looking forward to sharing this journey with you!\nGautam Sonti is an independent documentary filmmaker, who attempts to unearth stories that are hidden below the surface. Whether it’s the subversion of democracy in a city government, the absurdity of food politics in the country, or the narrowing of young minds in our educational system, his films quietly capture life as it unfolds.  They don’t shout for attention, but invite audiences to pause, observe, and reconsider their positions. You can find out more about his work at gautamsonti.com\nOver the last 4 decades or so, Tara Rao graduated from being an architect to working on climate justice and human rights with various organisations, including Amnesty and WWF in Asia, Africa and Europe. As a campaigner though, the visual side of communication became more critical and exciting for her. That experience served her well when she led GoodPitch Karnataka - a process involving multiple people and initiatives shaping impactful communication through film to further a cause. Today the richness of possibilities and the deepening challenges keep her on her toes and buzzing.  www.ourgroundworks.org",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1027",
    "image": "https://attagalatta.com/admin/uploads/events/1648779447.jpeg",
    "performer": "Gautam Sonti, \nTara Rao,",
    "keywords": [
      "Film",
      "Screening"
    ],
    "@type": "ScreeningEvent",
    "startDate": "2025-03-15T18:00:00+05:30",
    "endDate": "2025-03-15T19:00:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "Join us for a cozy, creative space where you can unplug, connect, and just be. This meetup is all about chill vibes—no agenda, no pressure. 🖍️✨\nWhether it’s your first time or your fourth, come as you are—dive into your own project or simply soak up the wholesome atmosphere. Each meetup has brought inspiring moments and wonderful people, and we’re excited to share it all again! 💜\nThere are 15 spots available, and this meetup is exclusively for LGBTQIA+ folks. Neurospicy and neurotypical folks are all welcome. 🌈🎨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT878",
    "image": "https://attagalatta.com/admin/uploads/events/1136766814.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-03-16T14:00:00+05:30",
    "endDate": "2025-03-16T17:00:00+05:30"
  },
  {
    "name": "Beat by Beat - Music Based Wellness Workshop",
    "description": "🎶 Beat by Beat 🎶\nA rhythmic journey of self-discovery, reflection, and celebration!\nJoin a Happiness Coach, Life Coach and a Music Facilitator for a fun, immersive musical experience designed to ignite self-awareness and joy. Feel the rhythm, embrace the moment, and walk away with renewed energy and clarity.\nNo musical skills needed—just bring your enthusiasm and an open mind!\n✨ Limited spots available—confirm yours now✨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1028",
    "image": "https://attagalatta.com/admin/uploads/events/410486648.jpg",
    "performer": "Ketki Anand, \nSunita Jose,",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-16T16:00:00+05:30",
    "endDate": "2025-03-16T18:00:00+05:30"
  },
  {
    "name": "Read A Kitaab - Monthly Book Club",
    "description": "📖 Theme: Books by Women & Books on Women Literature\n📍 Venue: Atta Galatta, Indiranagar\n📅 Date: Sunday, 16th March 2025\n⏰ Time: 4:00 PM – 6:00 PM\n📚 Join us for a thought-provoking discussion on books written by women and those that explore women’s lives, experiences, and stories. Connect with fellow book lovers and celebrate literature that shapes perspectives!\nPlease note: This is for strictly bookish / literature conversation and no personal life discussions/rave or rant.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1030",
    "image": "https://attagalatta.com/admin/uploads/events/1437061396.jpeg",
    "performer": "Anurag Kothari, \nEkta Bhandari,",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-16T16:00:00+05:30",
    "endDate": "2025-03-16T18:00:00+05:30"
  },
  {
    "name": "Art Jamming with Little Boto Project - Group Meetup",
    "description": "Art Jamming with Little Boto Project – A Creative Escape!\nStep into a world of colors, creativity, and conversations at Little Boto Project’s Art Jamming Event! \nWhether you’re a seasoned artist or just love to doodle, this event is designed for everyone to relax, explore, and express themselves through art.\nAbout Little Boto Project & Vishwa Sindhuri\nFounded by Vishwa Sindhuri, artist at heart and a textile designer (NID alumna) and creative educator with experience in India and the US, Little Boto Project is a brand that celebrates coloring as a mindful and joyful experience. Known for its beautifully illustrated coloring books for kids and adults, the brand encourages creativity, self-expression, and relaxation through art. Sindhuri`s passion for design and teaching makes this event more than just an art session—it’s an immersive experience in creativity and fun.\nWhat to Expect?\nChoose from three exclusive themes—find the one that inspires you!\nExperiment with watercolors, pencils, and crayons—mix and match as you like!\nNo rules, no judgment—just pure fun, creativity, and self-expression!\nMeet like-minded people, share stories, and create something beautiful together.\nTAKE AWAY: Coloring book you choose and a beginner watercolor set.\nThis isn’t just about art—it’s about living the moment, making memories, and having a great time with colors, conversations, and creativity.\nJoin us for a fun-filled session where art meets joy. Let’s color, gossip, and create magic! 🌈🎨✨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1012",
    "image": "https://attagalatta.com/admin/uploads/events/1431361921.png",
    "performer": "Little Boto Project, \nSindhu Nethi,",
    "keywords": [
      "Art",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-16T17:45:00+05:30",
    "endDate": "2025-03-16T19:15:00+05:30"
  },
  {
    "name": "Fresh Violence - Stand-Up Special",
    "description": "Our country is as beautiful as it is brutal. Punit Pania takes an unflinching look at the violence and apathy that seem to be as much a part of our identities as our diversity.\nIn this latest stand-up special, Punit takes the audience on a tour across our great land through the eyes of a hopeful artist and a veteran writer.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1025",
    "image": "https://attagalatta.com/admin/uploads/events/327247044.png",
    "performer": "Punit Pania",
    "keywords": [
      "Standup Comedy",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-16T18:00:00+05:30",
    "endDate": "2025-03-16T19:00:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nMarch Read: Mangifera indica by Sopan Joshi\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1016",
    "image": "https://attagalatta.com/admin/uploads/events/1368683893.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-23T11:00:00+05:30",
    "endDate": "2025-03-23T13:00:00+05:30"
  },
  {
    "name": "Chapter Carnival - Library Meetup",
    "description": "Atta Galatta and Your View On Books, A Novel Club cordially invite you to the latest Library Meetup in town.\nJoin us for a innovative Library Meet wherein there`s over hundreds of books and you could pick a book in random and start reading together.\nHave an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nCome along with Empty Minds and fill it with rich literature from Atta Galatta’s Reading Section.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nReading minimum one chapter from a random book that you choose from the libary.\nParticipating in the ensuing curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT991",
    "image": "https://attagalatta.com/admin/uploads/events/830714749.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-23T11:11:00+05:30",
    "endDate": "2025-03-23T14:22:00+05:30"
  },
  {
    "name": "Thus Spake Shoorpanakha, So Said Shakuni - Theatre Performance",
    "description": "The protagonists, a man and a woman, are both waiting for a delayed flight in a small-town airport lounge. The woman provokes the man into conversation, setting of a series of narratives that feature two characters from the Ramayana and the Mahabharata: Shoorpanakha and Shakuni. Their lives and experiences are set in the context of this century, indicating that the stories of power, ambition and revenge span history and myth.\nThis script was found in The Drama Library by the Bhasha Centre.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT997",
    "image": "https://attagalatta.com/admin/uploads/events/704698497.jpg",
    "performer": "Jimmy Xavier, \nPoile Sengupta, \nSamragni Dasgupta, \nUrvashi H. V. ,",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "TheatreEvent",
    "startDate": "2025-04-06T19:00:00+05:30",
    "endDate": "2025-04-06T20:00:00+05:30"
  }
]