[
  {
    "name": "World Thrift Day - Exploring Thrifting, Roots, and Circular Choices in Bengaluru",
    "description": "This World Thrift Day (30th October), Enviu is bringing together voices from across Bengaluru for a meaningful conversation on thrifting — what it means, how it’s done, and why it matters in the journey toward circular fashion.\nHosted by Enviu, the event explores thrifting through diverse lenses. From a millennial who’s been thrifting long before it was a trend, to a Gen Z voice who blends sustainability with style, and an entrepreneur working to make thrifting accessible and mainstream, this conversation will unpack how this growing culture connects to both individual choice and systemic change.\nAlongside insights and stories, the event will host a small thrift pop-up that encouraged participants to experience secondhand fashion firsthand. A space to share tried-and-tested thrifting practices, bust a few myths, and connect with others reimagining how we consume, reuse, and value clothes.\nThrough conversations like these, Enviu aims to highlight how everyday actions like choosing pre-loved can tie into broader efforts and build a circular future with platforms like Qilin. \nEnviu as a part of Saamuhika Shakti is creates solution to reduce textile waste and build inclusive, sustainable livelihoods.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1503",
    "image": "https://attagalatta.com/admin/uploads/events/597195414.jpg",
    "performer": "Alisha Jain",
    "keywords": [
      "Thrifting",
      "Discussion"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-10-30T16:30:00+05:30",
    "endDate": "2025-10-30T18:30:00+05:30"
  },
  {
    "name": "Art Journaling Workshop - Workshop by Yukti Grover",
    "description": "When was the last time you picked a colour just because it felt right? 🎨\nIf you don’t remember, this one’s definitely for you.\nWe’re slowing down for an evening of art journaling at Atta Galatta, where it’s not about being perfect but about playing with colours, textures, and feelings. You don’t need to bring anything—just your curiosity and an open mind. We’ve got all the materials, a cute postcard, and loads of good vibes waiting.\nCome spend two hours creating, reflecting, and reconnecting with yourself.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1499",
    "image": "https://attagalatta.com/admin/uploads/events/1503869867.jpg",
    "performer": "Yukti",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-10-31T17:00:00+05:30",
    "endDate": "2025-10-31T19:00:00+05:30"
  },
  {
    "name": "Improv & Sketch Open Stage - An improv open mic",
    "description": "No Pressure Improv returns with the Improv & Sketch Open Stage - think open mics, but for improv (and sketch)! Come watch Bengaluru's bubbling improv scene every month, and sign up if you will, to flaunt your improv on the Open Stage! \nUp to 8 performers who sign up are put together on the Open Stage to play improv together, led by the jam-master of the evening. This is a great opportunity to get stage time and to play improv in front of a kind and supporting audience, who will be alongside you as you improvise and discover the make-believe. \n40 minutes of Open Stage is followed by a featured act in the second half. Bring your ensemble or solo act, improv or otherwise - whether it's storytelling or stand-up or spoken word or your original set of songs - it's the perfect stage for you to experiment with your act or present it to the community.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1486",
    "image": "https://attagalatta.com/admin/uploads/events/1372573427.png",
    "performer": "No Pressure Improv",
    "keywords": [
      "Improv",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-31T18:30:00+05:30",
    "endDate": "2025-10-31T20:30:00+05:30"
  },
  {
    "name": "Rapid Prototyping with AI: Build Faster. Ship Smarter. - AI Workshop by Roshan Mishra",
    "description": "Most people can make AI-assisted demos, but few can ship production-ready apps. This workshop takes you through the complete lifecycle - from idea to high-quality prototype using real tools and real projects. Learn to turn messy ideas into clean specs, build production-grade apps with AI coding agents, and guide AI output like a senior engineer. Designed for backend engineers, frontend devs, PMs, and innovators who want to execute faster and smarter. Facilitated by Roshan Mishra, an applied researcher on AI systems.\nParticipants get 4M complimentary tokens to explore leading frontier models including GPT-5 and Claude Opus 4.1.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1500",
    "image": "https://attagalatta.com/admin/uploads/events/1778378119.png",
    "performer": "Roshan Mishra",
    "keywords": [
      "Science and Technology",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-01T11:00:00+05:30",
    "endDate": "2025-11-01T15:00:00+05:30"
  },
  {
    "name": "The Next Chapter - A book club for stories of renewal, purpose, and reinvention by Zuva Life",
    "description": "We continue exploring Strength to Strength by Arthur Brooks, a book that reframes success and fulfillment in the second half of life. We will discuss selected excerpts, so you’re welcome even if you haven’t read the book yet. Just show up with curiosity.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1504",
    "image": "https://attagalatta.com/admin/uploads/events/1603380507.png",
    "performer": "Royina Baruah",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-01T11:00:00+05:30",
    "endDate": "2025-11-01T12:30:00+05:30"
  },
  {
    "name": "Land or Love? Book Reading and Discussion of Battle of Lands - Book Reading session",
    "description": "Join us for an engaging morning at Atta Galatta, Bengaluru’s beloved bookstore and cultural space, as Vandita Mishra discusses her latest book, Battle of Lands.\nRooted in the complexities of Indian families, Battle of Lands explores how love, ego, and the pursuit of inheritance intertwine to leave scars that echo across generations. Through its layered narrative, the book reflects on relationships fractured by property disputes and the silent emotional wounds carried within families, asking readers to ponder what truly endures: land or love.\nThe session will be followed by an audience interaction and book signing.\nVenue: Atta Galatta, Bengaluru\nDate and Time: November 1st, 11:30 AM- 1:00 PM\nEntry: Free",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1483",
    "image": "https://attagalatta.com/admin/uploads/events/217749942.jpeg",
    "performer": "Vandita Mishra",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-01T11:30:00+05:30",
    "endDate": "2025-11-01T13:00:00+05:30"
  },
  {
    "name": "Children's Theatre Workshop - Theatre Workshop by Vikram Sridhar",
    "description": "Theatre is a wonderful space for children to be themselves , overcome fear , build patience and respect , responsibility , communication and many more. Telling a Story , speaking to an audience , becoming a character ... all these and many more . The 3 hour acting workshop for children will take them through various fun filled activities and theatre games to bring out the performer in them.\nFace : From Smiles to Anger to disgust , the children will explore their inner emotion and discover how the others react to us based on our expressions .\nBody : From Gestures to Physical Movements , the children will explore the power and usage of Non verbal Communication in day to day drama\nVoice : From Native Sounds to Language based speech , the children will explore how their voices can do magic in communication and confidence building . \nSimple Outcomes and Benefits\n1) Expand their Communication skills with an audience \n2) Gain Self Confidence by interacting with new friends \n3) The joy of Creativity in acting and drama \n \nLimited to 15 children , we will discover various aspects of acting through drama and storytelling to audiences in a fun and learning way.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1494",
    "image": "https://attagalatta.com/admin/uploads/events/790176679.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Childrens Theatre",
      "Workshop"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2025-11-01T15:00:00+05:30",
    "endDate": "2025-11-01T18:00:00+05:30"
  },
  {
    "name": "RANIs of INDIA: A Performance Storytelling - Storytelling by Vikram",
    "description": "RANIs of INDIA , Theatrical Storytelling Performance is a collection of lores from various oral and historical narratives of Queens who ruled different regions of the Country at various timelines collected based on numerous travel and research over the last few years on the lesser-known or completely forgotten women rulers of this country by Vikram Sridhar . Over one hour, through oral story-telling smattered with folk songs , we travel the country, going deeper into many stories of Indian queens from myths, history and present times, whose stories need to be told and heard. From North to South, East to West there have been women rulers/Queens/Ranis who`have changed and touched history strongly.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1490",
    "image": "https://attagalatta.com/admin/uploads/events/1598370444.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Mythology",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-01T19:00:00+05:30",
    "endDate": "2025-11-01T20:30:00+05:30"
  },
  {
    "name": "A STORY WALK through INDIRA NAGAR - Story Walk by Vikram Sridhar",
    "description": "On a Sunday morning , Walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore , Heritage and Ecology of the area . The walk will begin and culminate at ATTA GALATTA . The tales will revolve around historical , mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1496",
    "image": "https://attagalatta.com/admin/uploads/events/558718782.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "Storywalk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-02T07:00:00+05:30",
    "endDate": "2025-11-02T09:00:00+05:30"
  },
  {
    "name": "ONCE UPON A BRUNCH - Sunday morning brunch and stories by Vikram Sridhar",
    "description": "Late weekend morning , brunch , stories like the ones from the olden times, meeting new people.\nWhat if they all come together?\nWeekend and late morning Brunch is an emotion . On the other hand, stories have always been an emotion too . What's common between the two is the rich heritage of food and stories. What if they come together?\nListen to these stories of the food as you enjoy your weekend Brunch set at a cozy location that has its own stories . A beautiful day starts with a lovely breakfast . And a morning with breakfast and stories . Every food we eat has a story to share .. Idli , Vada , bread , Paratha etc. Every breakfast comes after a long break and is eager to be eaten. A simple Weekend morning Brunch put together by Atta Galatta\nStorytelling around the food lores by Vikram Sridhar",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1466",
    "image": "https://attagalatta.com/admin/uploads/events/1770521456.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance and Menu Tasting"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-02T10:00:00+05:30",
    "endDate": "2025-11-02T12:00:00+05:30"
  },
  {
    "name": "Harry Potter Book Discussion - Meetup by Sonali Bhatia",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1487",
    "image": "https://attagalatta.com/admin/uploads/events/1625353735.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-02T11:00:00+05:30",
    "endDate": "2025-11-02T12:30:00+05:30"
  },
  {
    "name": "Tarot & Intuition - An Afternoon of Insights",
    "description": "Step into an afternoon of soulful reflection and intuitive discovery with Anuradha Shukla — celebrated Tarot reader, life coach, and author of “The Intuitive Edge: A DIY Tarot Guide for Smarter Decisions in Love and Business.”\nIn a world full of noise, this gathering offers a quiet, meaningful space to reconnect with your inner wisdom. Through the ancient art of tarot, Anuradha gently guides participants to explore their emotions, clarify decisions, and realign with life’s deeper flow.\nThe session will feature:\nPersonal Tarot Readings – short, insightful sessions offering clarity and direction\nReflections on Intuition – understanding how to listen to the voice within\nGuided Conversations – linking tarot symbolism with everyday choices\nEnergy & Awareness Exercises – simple ways to ground and center yourself\nWhether you seek answers about love, career, or personal growth, this event invites you to pause, reflect, and trust your intuition. The experience is designed to help you leave lighter, calmer, and more attuned to your own path.\nCome with curiosity, stay with openness, and leave with a renewed sense of clarity.\nJoin us at Atta Galatta on 2nd November for an afternoon where spirituality meets insight — and where the tarot becomes a mirror to your soul.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1473",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Anuradha Shukla",
    "keywords": [
      "Wellness",
      "Personal Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-02T13:00:00+05:30",
    "endDate": "2025-11-02T15:00:00+05:30"
  },
  {
    "name": "Bebey’s Day Out - Book Discussion",
    "description": "Step into the richly woven world of Bebey’s Day Out by Lakshmi C.V, where stories move\nseamlessly across centuries, cities, and states of mind. From the bustling IT hubs of modern\nIndia to the quiet cotton fields of the seventeenth-century Deccan, Lakshmi crafts tales that\nexplore the fragile boundaries between the ordinary and the extraordinary, the real and the\nsupernatural. Each story opens a window into a different world — one filled with love, loss, guilt,\nand grace.\nPopulated with a memorable cast — from a spirited old lady to a weary housewife and a\nrestless teenager — this collection delves into the raw, unguarded emotions that make us\nhuman. Told with insight, warmth, and gentle humour, Bebey’s Day Out is a celebration of life’s\nunpredictability, reminding us that beneath every moment of chaos or calm lies a story waiting to\nbe told.\nAbout the author\nLakshmi C.V. is a writer who delightfully blurs the lines between being a storyteller and a\nhomemaker — though she’s still deciding which came first. A Physics graduate from IIT with her\nhead often in the clouds but her feet firmly on the ground (also the name of her blog), Lakshmi\nbrings warmth, humour, and heart to everything she writes. Her journey as a writer began early,\nwith her first piece published in Eve’s Weekly while she was still in school.\nHer stories have since appeared in Femina, Woman’s Era, Good Housekeeping, Today,\nWomen’s Web, and Readomania, among others. She has also written books for children and\ncontributed to anthologies like Airavata: Elephant Tales. When not lost in words, Lakshmi can be\nfound teaching, volunteering, or reading — always finding joy in the journey rather than the\ndestination.\nShe slips in and out of teaching mode without warning. It was quite a relief to her children when\nshe took up assignments as a volunteer with Teach India.\nWhen she is not writing, she is reading for herself, and editing other people’s works.\nFor her, the journey is more interesting than the destination.\nShe lives in the NCR.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1484",
    "image": "https://attagalatta.com/admin/uploads/events/1075360513.jpg",
    "performer": "Lakshmi CV",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-02T16:00:00+05:30",
    "endDate": "2025-11-02T17:00:00+05:30"
  },
  {
    "name": "PlaySipConnect - An Interactive session by Shreya Yogway",
    "description": "A space where you can truly be yourself — laugh freely, play like you did as a child, and connect beyond the usual small talk. Here, conversations flow from the heart, bonds are formed, and joy is shared in a safe, non-judgmental space. Let yourself just be, laugh, and enjoy the moment.\nWe’ll enjoy board games, group activities, and playful challenges that bring out your inner child — all while sipping a welcome drink.\n🎲 Play • Sip • Connect by Shreya Yogway\n📅 Sunday, 2nd November | 4–7 PM\n📍 At Atta Galatta, Indira Nagar",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1492",
    "image": "https://attagalatta.com/admin/uploads/events/1251427948.jpg",
    "performer": "Shreya Yogway",
    "keywords": [
      "Wellness and Health",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-02T16:00:00+05:30",
    "endDate": "2025-11-02T19:00:00+05:30"
  },
  {
    "name": "Kannada Jamming - for Kannada Rajyotsava",
    "description": "🎶 Aaroha the band Presents: Kannada Jamming for Kannada Rajyotsava 🎶 \n This Kannada Rajyotsava, let’s come together to celebrate the spirit, culture, and soulful music of Karnataka! 💛❤️ Join Aaroha the Band for a special Kannada Jamming Session – an evening dedicated to the melodies that define our land. From timeless classics to contemporary hits that echo across generations, Aaroha brings you a heartfelt musical journey in the language of our roots. \n✨ Highlights of the Event: 🎵 Soulful Kannada songs and unplugged renditions 🎤 Sing-along moments with the audience Let’s celebrate Kannada Rajyotsava not just with words, but with the universal language of music. Come, sing, sway, and feel the pride of being a Kannadiga! \n📅 Date: 2nd November \n 🕒 Time: 6pm to 7:30pm \n📍 Venue: Atta Galatta, Indiranagar \n Let the beats of Karnataka’s heart resonate through every chord and every voice. Aaroha the Band invites you to be part of this musical tribute to Namma Kannada Nadu! 💛❤️",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1468",
    "image": "https://attagalatta.com/admin/uploads/events/342466238.jpg",
    "performer": "Aaroha the band",
    "keywords": [
      "Live Music",
      "Jamming"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-02T18:00:00+05:30",
    "endDate": "2025-11-02T19:30:00+05:30"
  },
  {
    "name": "Unfollow the Trends - A workshop by Purnima & Suneyna",
    "description": "We scroll past countless trends every day, feeling the pressure to copy, perform, and fit in. Unfollow the Trends is a student-led workshop inviting you to explore what lies behind the scroll: your own authentic voice. It’s a space to pause, notice the stories only you can tell, and reimagine your digital identity. Sit, chat, and build your creative confidence together.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1502",
    "image": "https://attagalatta.com/admin/uploads/events/1481136128.png",
    "performer": "Purnima & Suneyna",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-04T16:30:00+05:30",
    "endDate": "2025-11-04T19:30:00+05:30"
  },
  {
    "name": "Pre-Bangalore Literature Festival Book Sale - AG’s Annual Blowout Sale",
    "description": "Get ready, bookworms! The biggest book event of the year is here! AG’s Annual Blowout Sale, our massive Pre-Bangalore Literature Festival Book Sale, is your chance to stock up on incredible reads for less.\nFrom Wednesday, November 5th, through Sunday, November 9th, 2025, you can enjoy a FLAT 50% OFF on absolutely all books!\nBrowse our bookstore and huge garage sale selection to discover literary treasures across every genre. Whether you're hunting for the best of Indian fiction, essential non-fiction reads, language books, or captivating children's books, everything is half-price!\nDon't miss this five-day blowout event. Mark your calendars, tell your friends, and get ready to fill your shelves without emptying your wallet!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1507",
    "image": "https://attagalatta.com/admin/uploads/events/1102813610.png",
    "performer": "Atta Galatta",
    "keywords": [
      "Book Sale",
      "Sale"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-05T11:00:00+05:30",
    "endDate": "2025-11-05T19:00:00+05:30"
  },
  {
    "name": "Pre-Bangalore Literature Festival Book Sale - AG’s Annual Blowout Sale",
    "description": "Get ready, bookworms! The biggest book event of the year is here! AG’s Annual Blowout Sale, our massive Pre-Bangalore Literature Festival Book Sale, is your chance to stock up on incredible reads for less.\nFrom Wednesday, November 5th, through Sunday, November 9th, 2025, you can enjoy a FLAT 50% OFF on absolutely all books!\nBrowse our bookstore and huge garage sale selection to discover literary treasures across every genre. Whether you're hunting for the best of Indian fiction, essential non-fiction reads, language books, or captivating children's books, everything is half-price!\nDon't miss this five-day blowout event. Mark your calendars, tell your friends, and get ready to fill your shelves without emptying your wallet!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1508",
    "image": "https://attagalatta.com/admin/uploads/events/1412063946.png",
    "performer": "Atta Galatta",
    "keywords": [
      "Book Sale",
      "Sale"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-06T11:00:00+05:30",
    "endDate": "2025-11-06T19:00:00+05:30"
  },
  {
    "name": "Pre-Bangalore Literature Festival Book Sale - AG’s Annual Blowout Sale",
    "description": "Get ready, bookworms! The biggest book event of the year is here! AG’s Annual Blowout Sale, our massive Pre-Bangalore Literature Festival Book Sale, is your chance to stock up on incredible reads for less.\nFrom Wednesday, November 5th, through Sunday, November 9th, 2025, you can enjoy a FLAT 50% OFF on absolutely all books!\nBrowse our bookstore and huge garage sale selection to discover literary treasures across every genre. Whether you're hunting for the best of Indian fiction, essential non-fiction reads, language books, or captivating children's books, everything is half-price!\nDon't miss this five-day blowout event. Mark your calendars, tell your friends, and get ready to fill your shelves without emptying your wallet!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1509",
    "image": "https://attagalatta.com/admin/uploads/events/445801080.png",
    "performer": "Atta Galatta",
    "keywords": [
      "Book Sale",
      "Sale"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-07T11:00:00+05:30",
    "endDate": "2025-11-07T19:00:00+05:30"
  },
  {
    "name": "Girls Who Said Nothing & Everything - Book Signing by",
    "description": "Author and activist Meera Vijayann will be in Bangalore this November for a special book signing event celebrating the release of her debut essay collection, Girls Who Said Nothing & Everything, published by Penguin Random House India. The event will take place on Thursday, 7th November at 3:30 PM at Atta Galatta, one of the city’s most beloved indie bookstores.\nVijayann’s collection features eleven deeply personal essays that explore the silences Indian women have been taught to maintain—at home, in relationships, and within themselves. Set in 1990s India, the essays delve into themes of girlhood, family, bodily autonomy, and the emotional inheritance of silence. With candour and nuance, the book speaks to the resilience it takes to find and reclaim one’s voice.\nBased in Washington, Meera Vijayann has written extensively on gender, mental health, and social justice, with bylines in The Guardian, Forbes, Catapult, and Electric Literature. Her widely viewed TED talk on experiencing sexual assault as a young girl in India continues to resonate with audiences around the world.\nThe event offers readers a rare opportunity to meet the author in person and engage with her work, which is already being recognised as a bold and timely contribution to feminist literature",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1491",
    "image": "https://attagalatta.com/admin/uploads/events/294833946.jpeg",
    "performer": "Meera Vijayann",
    "keywords": [
      "Books and Literature",
      "Book Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-07T15:30:00+05:30",
    "endDate": "2025-11-07T16:30:00+05:30"
  },
  {
    "name": "Tara Goes Aahhhhh! - Book Reading by Garima Gupta",
    "description": "Facing Fears with Roars and Giggles! Ready for a story that doesn’t need words—just your eyes, your imagination, and all those big, bold feelings? Join Tara and her dino buddy on a wild, wordless adventure as they tackle their fears in the pop-up book Tara Goes Aahhhhh! with author Garima Gupta. It's a roar-some ride through emotions, courage, and friendship.\nAge: 4-8, accompanied by a parent.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1430",
    "image": "https://attagalatta.com/admin/uploads/events/338996915.jpg",
    "performer": "Garima Gupta",
    "keywords": [
      "Books",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-08T11:00:00+05:30",
    "endDate": "2025-11-08T12:30:00+05:30"
  },
  {
    "name": "Pichwai Art Workshop - Art Workshop",
    "description": "Let`s witness Lord Krishna and his leelas through an art form - Pichwai Art, Pichwai means backdrops, these paintings were used as backdrops mainly in Srinathji's sanctum.\nIt is a traditional art form that dates back to the 16th century from the city of Nathdwara, Rajasthan.\nThese paintings portray Srinath ji and his leelas through bright and vivid colors.\nThe paintings are a way for us to connect with the Lord Krishna.\nThis art is soul-satisfying and divine, another art form to start with your basic art skill.\nYou need no prior knowledge of drawing or painting in order to attend this workshop.\nNO TRACING OR COPYING, You will be drawing on your own.\nSrinathji will be taught in this workshop and some of the required basic pichwai motifs.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1470",
    "image": "https://attagalatta.com/admin/uploads/events/1129495751.png",
    "performer": "Sindhoor",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-08T11:00:00+05:30",
    "endDate": "2025-11-08T14:00:00+05:30"
  },
  {
    "name": "Pre-Bangalore Literature Festival Book Sale - AG’s Annual Blowout Sale",
    "description": "Get ready, bookworms! The biggest book event of the year is here! AG’s Annual Blowout Sale, our massive Pre-Bangalore Literature Festival Book Sale, is your chance to stock up on incredible reads for less.\nFrom Wednesday, November 5th, through Sunday, November 9th, 2025, you can enjoy a FLAT 50% OFF on absolutely all books!\nBrowse our bookstore and huge garage sale selection to discover literary treasures across every genre. Whether you're hunting for the best of Indian fiction, essential non-fiction reads, language books, or captivating children's books, everything is half-price!\nDon't miss this five-day blowout event. Mark your calendars, tell your friends, and get ready to fill your shelves without emptying your wallet!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1510",
    "image": "https://attagalatta.com/admin/uploads/events/130533697.png",
    "performer": "Atta Galatta",
    "keywords": [
      "Book Sale",
      "Sale"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-08T11:00:00+05:30",
    "endDate": "2025-11-08T19:00:00+05:30"
  },
  {
    "name": "Flash Jam 8 - Sing and Jam with Strangers",
    "description": "We’re a one-day choir of amateur singers that get together, sing and harmonise and jam our hearts out! That's right, experience or skill level is no bar - if you want to learn about vocal harmony, or just have fun and sing in a community, this is the place for you! This time, we’ll be performing Chiquitita, by ABBA! So come join us for a fresh, memorable weekend session :)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1469",
    "image": "https://attagalatta.com/admin/uploads/events/1070288969.png",
    "performer": "Danish Abdi",
    "keywords": [
      "Live Music",
      "Jamming"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-08T15:00:00+05:30",
    "endDate": "2025-11-08T17:00:00+05:30"
  },
  {
    "name": "Atta Galatta presents “AG Book Club” - Monthly Book Club with Palgun KJ",
    "description": "What have you been reading? Come, discuss your latest read. Each member gets 5-7 minutes to talk about the book, theme, plot, with 2 minutes to answer any questions others might have. This month’s special focus will be food- come tell us what you've been reading.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1512",
    "image": "https://attagalatta.com/admin/uploads/events/2027576167.png",
    "performer": "Palgun KJ",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-08T15:00:00+05:30",
    "endDate": "2025-11-08T19:00:00+05:30"
  },
  {
    "name": "PaySlipConnect - Interactive Session by Shreya Yogway",
    "description": "A space where you can truly be yourself — laugh freely, play like you did as a child, and connect beyond the usual small talk. Here, conversations flow from the heart, bonds are formed, and joy is shared in a safe, non-judgmental space. Let yourself just be, laugh, and enjoy the moment.\nWe’ll enjoy board games, group activities, and playful challenges that bring out your inner child — all while sipping a welcome drink.\n🎲 Play • Sip • Connect by Shreya Yogway\n📅 Saturday, 8th November | 4–7 PM\n📍 At Atta Galatta, Indira Nagar",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1493",
    "image": "https://attagalatta.com/admin/uploads/events/880897579.jpg",
    "performer": "Shreya Yogway",
    "keywords": [
      "Wellness and Health",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-08T16:00:00+05:30",
    "endDate": "2025-11-08T19:00:00+05:30"
  },
  {
    "name": "An Evening of Survivor & Protest Poetry, Feminism, and Healing - Book Launch by Nishita De",
    "description": "Under the Jackfruit Tree is not just a book — it is a reclamation. An evening that bridges poetry and protest, music and memory, trauma and tenderness. Join Nish, poet and author of Under the Jackfruit Tree, for a one-hour immersive experience that intertwines survivor poetry, trauma stories, feminist reflections from the 90s, and a heartfelt journey of inner child healing.\nThis evening celebrates the voices that survived, the children who grew up too soon, and the communities that continue to rebuild themselves with love, dissent, and resilience.\nExpect raw spoken word because healing, after all, is incomplete without unconditional love.\nAbout the Book\nUnder the Jackfruit Tree: A Tribute to the Inner Child and a Chorale of Hope\nis an unflinching collection of poems that unearth the layered histories of trauma, inheritance, and healing.\nNish writes with a voice that is both political and personal — a lyrical rebellion that meditates on the legacies of survival, feminism, and compassion.\nThrough six acts of poetry, the book journeys from childhood rupture to adult repair, culminating in an anthem of hope and defiance — a manifesto for those who have ever longed for gentleness in a brutal world.\nAbout the Author\nNish is a Survivor and proud Thriver, a poet and community builder devoted to trauma healing, inner child work, and feminist storytelling.\nShe is also a tech product leader by profession, living in Bengaluru with her partner of 15 years and two beloved Indies.\nWriting under her poetic identity Gargle in Grey, Nish believes in the power of a conscious community and the refusal of binaries — in life, love, and art.\nThis launch isn’t merely a literary event — it’s a social movement through verse.\nEach reading becomes a protest, each poem a reclamation of language and tenderness from the jaws of trauma.\n“Through my poems,” Nish says, “I speak to the ones who have survived in silence. This book is an ode to them — and to the children we once were, who kept us alive.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1489",
    "image": "https://attagalatta.com/admin/uploads/events/1636468202.png",
    "performer": "Nishita De",
    "keywords": [
      "Book Discussion",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-08T18:00:00+05:30",
    "endDate": "2025-11-08T19:00:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup by The Listeners Circle",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1488",
    "image": "https://attagalatta.com/admin/uploads/events/177097026.png",
    "performer": "The Listeners Circle",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-09T11:00:00+05:30",
    "endDate": "2025-11-09T13:00:00+05:30"
  },
  {
    "name": "Pre-Bangalore Literature Festival Book Sale - AG’s Annual Blowout Sale",
    "description": "Get ready, bookworms! The biggest book event of the year is here! AG’s Annual Blowout Sale, our massive Pre-Bangalore Literature Festival Book Sale, is your chance to stock up on incredible reads for less.\nFrom Wednesday, November 5th, through Sunday, November 9th, 2025, you can enjoy a FLAT 50% OFF on absolutely all books!\nBrowse our bookstore and huge garage sale selection to discover literary treasures across every genre. Whether you're hunting for the best of Indian fiction, essential non-fiction reads, language books, or captivating children's books, everything is half-price!\nDon't miss this five-day blowout event. Mark your calendars, tell your friends, and get ready to fill your shelves without emptying your wallet!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1511",
    "image": "https://attagalatta.com/admin/uploads/events/549007240.png",
    "performer": "Atta Galatta",
    "keywords": [
      "Book Sale",
      "Sale"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-09T11:00:00+05:30",
    "endDate": "2025-11-09T19:00:00+05:30"
  },
  {
    "name": "Divine Delicacies - Storytelling and Menu Tasting Session",
    "description": "Food is such an integral part of our lives that we cannot imagine any worship without food. Keeping this in mind, we welcome you to a unique experience where we shall serve you samples of prasadams from various temples and share stories of places of worship and the perceived food preferences of the divine. Join Aparna Jaishankar for Divine Delicacies, only at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1513",
    "image": "https://attagalatta.com/admin/uploads/events/2120215311.png",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "Food",
      "Performance and Menu Tasting"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-09T12:30:00+05:30",
    "endDate": "2025-11-09T14:30:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - ",
    "description": "The next dates for Queer Quiet Hours are here!  Register here - http://bit.ly/adhdqueeple\r\nQueer Quiet Hours is back — a cozy space to rest, make art, and just be. No pressure to talk, no need to perform. Just soft community vibes and gentle company. Bring your own project or come as you are. We'll have plenty of art stuff for you to use.\n \n✨ For LGBTQIA+ folks only. We haven't opened it up to allies yet.\n📅 9th November\nSunday, 2:00 - 5:00 PM\n📍 @attagalatta, Indiranagar, Bangalore\n🆓 Free to join. Limited spots ( Sign up)\n📸 No photos taken without clear consent.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1514",
    "image": "https://attagalatta.com/admin/uploads/events/350805317.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-09T14:00:00+05:30",
    "endDate": "2025-11-09T17:00:00+05:30"
  },
  {
    "name": "Haiku Echoes, a collaboration of haiku and storytelling - In collaboration with Lavanya Prasad Conceptualised by Kala Ramesh",
    "description": "Step into the delicate world of haikai poetry at Haiku Echoes, a 90-minute taster session celebrating the beauty of brevity and the power of pause. Conceptualised by renowned haiku poet Kala Ramesh, this evening brings together ten distinguished voices from the haiku community.\nThe line-up includes Anju Kishore, Devoshruti Mandal, Kavita Ratna, Namratha Varadarajan, Shloka Shankar, Tapan Mozumdar, Teji Sethi, Vani Sathyanarayan, Vinay R. Leo, and Kala Ramesh. Through evocative readings and enactments, and a special visual presentation of haiku by actor Lavanya Prasad, the event promises a unique and immersive poetic experience.\n📅 Date: 14 November 2025\r\n🕒 Time: 6:00 PM to 7:30 PM\r\n📍 Venue: Atta Galatta, Bengaluru\nThis gathering invites poetry lovers, new and seasoned, to listen, feel, and echo the quiet power of haiku.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1515",
    "image": "https://attagalatta.com/admin/uploads/events/1507695091.png",
    "performer": "Kala Ramesh, \nLavanya Prasad,",
    "keywords": [
      "Haiku",
      "Workshop + Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-14T18:00:00+05:30",
    "endDate": "2025-11-14T19:30:00+05:30"
  },
  {
    "name": "Step into the world of junk journaling - Junk Journaling workshop by Deepa Rao",
    "description": "As the saying goes, one man’s trash is another man’s treasure! Junk journaling is described as a  sustainable craft that revolves around using whatever recycled materials or old scraps you have, to create a personalised journal. This therapeutic hobby is perfect for seasoned journalers who want to experience a new form of journaling and even for fresh beginners who want to start journaling themselves!\nIn this 2-hour session, you will learn the basics of junk journaling, which include making journals out of old paper bags, learning how to make personalised art out of scrap, and so much more! A basic starter kit is included in this workshop to help you get right to the fun stuff.\nI am Deepa, step into the world of Junk and Visual journaling with me for a fun junk journaling session that will help you turn something drab into something fab!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1523",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Deepa Rao",
    "keywords": [
      "Journaling",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-15T11:00:00+05:30",
    "endDate": "2025-11-15T13:00:00+05:30"
  },
  {
    "name": "The Bougainvillea Circle - Connection Circle by Radhika Ghose",
    "description": "\"Sawubona\" a Zulu Greeting meaning, \"We See You\". At Bougainvillea Circles you are offered a space to be heard, seen, welcomed as you are. A non-judgmental, safe, trusted space where you are free to be all that you want to be. Nothing More, Nothing less. No Restrictions, no judgements, just an intimate group of people looking for a space to be real. A space where we`re all less alone for a little while. Where we are seen, how we want to be seen. Conversations, Connections, Community of Compassion. All that makes the world go round, after Love of course!\nRemember - Sawubona: We See You.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1516",
    "image": "https://attagalatta.com/admin/uploads/events/973796884.png",
    "performer": "Radhika Ghose",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-15T16:00:00+05:30",
    "endDate": "2025-11-15T17:30:00+05:30"
  },
  {
    "name": "The Long and Short of Haiku - An intensive haikai workshop with Kala Ramesh",
    "description": "Haiku may be short, but it can hold a world of meaning. In this masterclass, Kala Ramesh will guide participants through the beauty, rules, and craft of this unique form of poetry.\n“What is Haiku”- exploring and understanding the masters through a PowerPoint presentation. A lot of interaction will be included, encouraging each participant to become more involved and engage with this minimalistic form of poetry in a more compelling way. Like all Japanese art forms, haiku is full of rules – though we don’t call them that! The art of writing haiku will be gradually introduced. The ‘kire’ or ‘cut’, which is so important to haiku, will be taught. Certain key Japanese aesthetics will also be introduced. Homework will be assigned.\n16th November: Haiku assigned as homework will be discussed. The class progresses into an in-depth study of the masters, both old and new. A brief introduction to haibun (prose embedded with haiku), tanka (a 1300-year-old lyrical poem), and haiku (artwork with haiku) will be provided.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1518",
    "image": "https://attagalatta.com/admin/uploads/events/1609006394.png",
    "performer": "Kala Ramesh",
    "keywords": [
      "Haiku",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-15T16:00:00+05:30",
    "endDate": "2025-11-15T19:00:00+05:30"
  },
  {
    "name": "Mahabharata Stories in Bengaluru - Storytelling by Aparna Jaishankar",
    "description": "The Mahabharata is a living epic that thrives amongst us.  If so, what about Bengaluru? What stories live in this city in the form of art, architecture, rituals, and landscape. Join Aparna Jaishankar for an oral storytelling performance, as she shares a few episodes from the Mahabharata that one might have seen and experienced in the city of Bengaluru.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1517",
    "image": "https://attagalatta.com/admin/uploads/events/729707085.png",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "Mythology",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-15T17:30:00+05:30",
    "endDate": "2025-11-15T18:30:00+05:30"
  },
  {
    "name": "The Long and Short of Haiku - An intensive haikai workshop with Kala Ramesh",
    "description": "Haiku may be short, but it can hold a world of meaning. In this masterclass, Kala Ramesh will guide participants through the beauty, rules, and craft of this unique form of poetry.\n“What is Haiku”- exploring and understanding the masters through a PowerPoint presentation. A lot of interaction will be included, encouraging each participant to become more involved and engage with this minimalistic form of poetry in a more compelling way. Like all Japanese art forms, haiku is full of rules – though we don’t call them that! The art of writing haiku will be gradually introduced. The ‘kire’ or ‘cut’, which is so important to haiku, will be taught. Certain key Japanese aesthetics will also be introduced. Homework will be assigned.\n16th November: Haiku assigned as homework will be discussed. The class progresses into an in-depth study of the masters, both old and new. A brief introduction to haibun (prose embedded with haiku), tanka (a 1300-year-old lyrical poem), and haiku (artwork with haiku) will be provided.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1519",
    "image": "https://attagalatta.com/admin/uploads/events/1785798383.png",
    "performer": "Kala Ramesh",
    "keywords": [
      "Haikai",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-16T10:00:00+05:30",
    "endDate": "2025-11-16T13:00:00+05:30"
  },
  {
    "name": "Food In Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food\r\nliterature combines them in a way that helps us connect not only to our past and our present, to \r\ndifferent cultures, and communities, values and rituals, events both life-changing and mundane but to \r\neach other as well. \r\nSo, if viewing the world through the lens of food and literature interests you, then join us for a \r\ndialogue on “Food in Literature” and to celebrate those stories and their diversity. Each month with \r\nPrachi Grover, we read our way through several powerful (and delicious) narratives.\r\nNovember Read: Kitchen Confidential by Anthony Bourdain\r\nWe assure you that you will enjoy every single bite!\r\nThe session is free but registration is a must as we have limited spots available. \r\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a \r\ncommunity for people who to love to read and eat!\r\nWhen: Saturday, 22nd November, 2025 at 11 a.m.\r\nWhere: Atta Galatta Bookstore, Indira Nagar\r\nAges: 18+\r\nRegistration is mandatory: https://t.ly/BO6wV \r\nCopies of the book are available at the store.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1525",
    "image": "https://attagalatta.com/admin/uploads/events/1337390941.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-22T11:00:00+05:30",
    "endDate": "2025-11-22T13:00:00+05:30"
  },
  {
    "name": "Let Poetry Be - Poetry Open Mic",
    "description": "This monthly gathering will see poetry coming to life, through reading, music, art and any other forms of artistic expression, at Atta Galatta. Listeners and performers are all welcome!\nDate: 22nd November\nTime: 4pm \nVenue: Atta Galatta, Indiranagar\nEvent specifics & submission guidelines –\n1. Theme - Free Verse (any original work)\n2. Works can be original or of other poets, performed live\n3. All languages welcome\n4. Participants can read to music (acoustic instrument/s), dramatise, use props & costumes\n5. Each participant will enjoy 5 minutes of reading time\n6. Kindly submit your poem and name to letpoetrybe@gmail.com on or before 20th Nov midnight. WE WILL NOT ACCEPT ATTACHMENTS OR LINKS. SUBJECT OF YOUR MAIL MUST READ AS 'Entry for-November LPB meet-up'\n7. You may also send entries that are not related to the theme\n8. The event will begin at 4pm sharp and will be held at Atta Galatta. Participants to report not later than 3:45 pm to hear about performance order and meet the host\n9. For any further clarifications, write to us at letpoetrybe@gmail.com\nYou are now welcome to flood our inbox!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1521",
    "image": "https://attagalatta.com/admin/uploads/events/1802200582.png",
    "performer": "Palgun KJ",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-22T16:00:00+05:30",
    "endDate": "2025-11-22T18:00:00+05:30"
  },
  {
    "name": "Step Into The World of Junk Journaling  - Junk Journaling workshop by Deepa Rao",
    "description": "As the saying goes, one man’s trash is another man’s treasure! Junk journaling is described as a  sustainable craft that revolves around using whatever recycled materials or old scraps you have, to create a personalised journal. This therapeutic hobby is perfect for seasoned journalers who want to experience a new form of journaling and even for fresh beginners who want to start journaling themselves!\nIn this 2-hour session, you will learn the basics of junk journaling, which include making journals out of old paper bags, learning how to make personalised art out of scrap, and so much more! A basic starter kit is included in this workshop to help you get right to the fun stuff.\nI am Deepa, step into the world of Junk and Visual journaling with me for a fun junk journaling session that will help you turn something drab into something fab!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1524",
    "image": "https://attagalatta.com/admin/uploads/events/786762149.png",
    "performer": "Deepa Rao",
    "keywords": [
      "Journaling",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-22T18:00:00+05:30",
    "endDate": "2025-11-22T19:30:00+05:30"
  },
  {
    "name": "stE=mc² - Stem Workshop with Madhuri Katti",
    "description": "Join in for an interactive experiment-led science session by physics educator and writer Madhuri Katti and some of her students. The goal of the session is to show young students and adults a different and engaging way of thinking about science, history of scientific ideas and its effects on everyday life, by exploring fundamental topics via simple home-experiments. The experiments will be of three parts:\n- Fun with Forces: Explanation of the four fundamental forces of nature, and their effects. Demonstration of experiments with gravity and static electricity. \n- Magnets and Motors : construction of a simple motor with a battery, magnet, and copper wire. Discussion of electricity and magnetism.\n- Playing with fluids: demonstrations of dynamics of fluids involving surface tension, and diffusion. Light along with Fluids.\nAt the end, we hope to inspire the participants to be boldly curious and to recognise the importance of science in our everyday lives.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1520",
    "image": "https://attagalatta.com/admin/uploads/events/419880901.png",
    "performer": "Madhuri Katti",
    "keywords": [
      "Science and Technology",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-23T11:30:00+05:30",
    "endDate": "2025-11-23T13:30:00+05:30"
  },
  {
    "name": "The Stray Dogs of Landour Network: A True Story by a Failed Dog Trainer - Book Launch by Lalitha Krishnan",
    "description": "Lalitha Krishnan will introduce her new memoir in an interactive session. Released earlier this year, the book is available in both print and e-book formats on Amazon, Pothi.com, and Flipkart. It is a testament to the profound lessons of compassion, resilience, and belonging taught by free-ranging dogs.\nThe story begins in Landour, where Krishnan, a newly certified dog trainer fighting battles of her own, encounters a troubled stray named Pretty on her doorstep. With a training manual in hand, she intends to help Pretty find a home. But Pretty has a different plan, and with quiet intelligence, she leads Krishnan into her world, introducing her to her pup and the rest of the pack.\nInspired by the philosophy of Ubuntu (“I am because we are”), Krishnan finds herself feeding, training, and caring for a growing network of dogs in an international neighbourhood. In doing so, she begins to heal, learning that her canine companions have as much to teach her as she has to teach them. The dogs, with their innate wisdom and social dynamics, reshape Krishnan’s understanding of love and survival.\nThe Stray Dogs of Landour Network: A True Story by a Failed Dog Trainer features a foreword by the late travel writer Bill Aitken, who also contributed a chapter titled “Mussoorie Dogs and Dog Lovers I Love.” Krishnan recounts stories shared by authors Stephen Alter and Ganesh Saili, both residents of Landour. Her book is a tribute to the silent, unseen lives of the animals who share our world and the emotional truths they awaken within us.\nReview:\n“The Stray Dogs of Landour Network is a deeply personal, unflinchingly honest memoir that sits comfortably on the shelf alongside Helen Macdonald’s H Is for Hawk or Sy Montgomery’s The Soul of an Octopus. It is a story of survival, not just of dogs, but of people finding grace in the act of caring without conditions. \nA poignant, slow-blooming debut that blends environmental awareness with emotional depth. Lalitha Krishnan’s voice is one of rare integrity, grounded, observant, and quietly radical in its compassion.”\n — The Literature Today\nAbout the Author:\nLalitha Krishnan is a writer, podcaster, potter, and nature documenter based in Ranikhet in the Indian Himalaya. Her work explores the bonds between humans, animals, and the natural world. A certified dog trainer, Krishnan is passionate about dogs and wildlife and has contributed to publications including Dogs & Pups Magazine, Garhwal Post, RoundGlass Sustain, and Sanctuary Asia, among others.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1522",
    "image": "https://attagalatta.com/admin/uploads/events/1450796694.jpg",
    "performer": "Lalitha Krishnan",
    "keywords": [
      "Book Discussion",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-23T16:00:00+05:30",
    "endDate": "2025-11-23T17:15:00+05:30"
  }
]