[
  {
    "name": "Kalighat Painting Workshop - Painting Workshop",
    "description": "KALIGHAT PAINTINGS - TRADITIONAL ART MEETS THE MODERNITY\nBengal has a rich culture and is home to various art forms, such as music, literature, and dance. We shall learn about an art form, a thought-provoking art form with a potpourri of themes, from Hindu mythology to secular and social-based strokes, an art that is bold and vibrant—KALIGHAT PAINTINGS.\nOriginating from the 19th century in Kolkata centred on Goddess Kali during the colonial period, done on \"Patas\" (Square pieces of cloth) by the \"Patuas\" (Painters on cloth) on the banks of the Hoogli River near the Kalighat temple - a popular destination for pilgrims, localites, and foreign visitors, but then the paintings declined gradually during the early 20th century as printed reproduction aliened the handmade.\nHere comes the Jamini Roy who took the Kalighat painting back to its roots and modernised the paintings with deep traditional aspects.\nIn this workshop, we will learn about JAMINI ROY and his works in KALIGHAT PAINTINGS in detail while creating your own Kalighat Painting!\nNote: All Materials will be provided by the host.\nWhat will you take home?\nKnowledge of Indian Art Culture\nLearn an ancient art form\nCompleted piece of artwork done by yourself\nWhat do you need to bring?\nWater bottle to keep you hydrated.\nThis workshop includes all materials, if required kindly get an Examination Pad / Paper Board.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT875",
    "image": "https://attagalatta.com/admin/uploads/events/536369084.png",
    "performer": "Sindhoor Suryavamshi",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-04T11:00:00+05:30",
    "endDate": "2025-01-04T14:00:00+05:30"
  },
  {
    "name": "Sandalwood's Story - Book Reading and Discussion",
    "description": "Join award-winning author Shobha Tharoor Srinivasan for an engaging reading of her book, Sandalwood`s Story. Through vibrant illustrations and endearing characters, this tale introduces children to India’s flora and the cultural significance of trees, while inspiring self-confidence and humanity.\nPerfect for young readers and nature enthusiasts, this session brings storytelling to life and celebrates the magic of trees and their unique qualities. Don’t miss this opportunity to connect with a masterful storyteller!\nShobha Tharoor Srinivasan an esteemed children’s author, poet and voice-over artist is renowned for her diverse talents. With more than a dozen books published in India and the United States, her works, including Prince with a Paintbrush and Parvati the Elephant’s Very Important Day, resonate with young readers globally. Shobha’s poetry book, It’s Time to Rhyme was awarded Best Children’s Book of the Year in 2022 by Publishing Next. She has made notable contributions to education, her narratives and poems have been integrated into school curricula across India. Shobha’s distinct voice, honored with the National Film Award for Best Voiceover and Narration in 2022, enriches documentaries, educational programs, and audiobooks alike.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT883",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Shobha Tharoor Srinivasan",
    "keywords": [
      "Kids",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-04T11:00:00+05:30",
    "endDate": "2025-01-04T12:00:00+05:30"
  },
  {
    "name": "Mindful Momentum - Book Launch and Discussion",
    "description": "Procrastination and overthinking are common challenges that many people face in their daily lives. These twin troubles can feel like an inescapable loop, feeding off each other and creating a cycle that is difficult to break.\nBut what if there was a way to interrupt this cycle? What if a simple shift in mindset could help you tackle these issues head-on?\nThis book is a practical guide for students, professionals, and anyone who struggles with procrastination and overthinking. Packed with real-life examples, mindfulness exercises, and actionable strategies, it’s designed to help you break free from mental blocks and take meaningful action.\nPlease join on this occasion to celebrate this milestone together. Bring your curiosity, questions and love for books and knowledge!!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT872",
    "image": "https://attagalatta.com/admin/uploads/events/890295713.jpg",
    "performer": "Sushant Rajput",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-04T17:00:00+05:30",
    "endDate": "2025-01-04T18:30:00+05:30"
  },
  {
    "name": "Bazaar Bites - Book Signing",
    "description": "Imagine…\nThe joy of tasting fried mussels on Kozhikode beach…\nBeing awash in nostalgia as you eat a kachori in a 100-year-old Allahabad institution…\nEating singhara at a shop without a name and wondering how it became quite so famous…\nFalling under the spell of Dal Lake even as you tuck into skewers of tujh, grilled over coals…\nBazaar Bites takes you on a journey through India’s most vibrant street-food hubs and through their delicious and diverse offerings. Part travelogue, part food guide, this book, spanning over 40 Indian cities, also brings you up close with the vendors of street food, many of whom have been practising their craft over generations, and tells the captivating story of their passion, dedication and resilience. Come by to Atta Galatta on 4th January to get your book signed!\nABOUT THE AUTHORS\nPriya Bala is writer specializing in food. She is a restaurant critic of repute and the author of Foodprints – A Trail of Meals & Memories. She has forayed into cooking in professional settings and runs Yo Colombo, a Sri Lankan food brand, based on the principles of sustainability. As a chef and writer she is uniquely placed to understand the food industry.\nJayanth Narayanan began his career in the corporate world and was later drawn to the restaurant industry, with all its challenges and thrills.  An enterprising restaurateur, he runs Mani’s Dum Biryani, the popular quick service restaurant brand. Jayanth is an alumnus of BITS, Pilani, and holds an MBA from XLRI, Jamshedpur.\nTogether, Priya and Jayanth have co-authored Start Up Your Restaurant, and Secret Sauce – Inspiring Stories of Great Indian Restaurants",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT884",
    "image": "https://attagalatta.com/admin/uploads/events/1520685068.jpeg",
    "performer": "Jayanth Narayanan, \nPriya Bala,",
    "keywords": [
      "Books",
      "Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-04T17:00:00+05:30",
    "endDate": "2025-01-04T18:00:00+05:30"
  },
  {
    "name": "Don't Stop Acting 3.0 - Acting Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Acting Workshop in town. \nJoin fellow aspiring actors and actresses for an inspiring session of learning acting through basics at our Writers Club Meet event in the cozy ambiance of the library cafe. Our Acting workshop is designed for aspiring artists who wish to explore the fundamentals of acting and develop their performance skills in a supportive and engaging environment. This immersive workshop offers participants a thorough grounding in acting techniques, character development, and scene work, providing them with the tools needed to bring authenticity and depth to their performances.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no acting experience, as well as intermediate actors looking to refresh their skills. It is also suitable for anyone interested in improving their public speaking and presentation abilities.\nWorkshop Objectives:\n- To introduce participants to the basic principles of acting.\n- To develop participants` abilities to create believable and compelling characters.\n- To enhance participants` skills in scene study and script analysis.\n- To build participants` confidence in performing in front of an audience.\nKey Components involves learning theory and practicals of: \n- Acting Techniques\n- Character Development and Analysis\n- SCript Analysis and Interpretation\n- Understanding Director`s Vision\n- Conveying Emotions\n- Physicality and Movement of Camera\n- Improvization and Spontaneity\n- Voice and Diction\n- Working with Props and Costumes\n- Rehearsals and Performances\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Participating in workshop with enthusiasm.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT876",
    "image": "https://attagalatta.com/admin/uploads/events/1105108438.png",
    "performer": "Maddie Dawson",
    "keywords": [
      "Film",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-05T12:12:00+05:30",
    "endDate": "2025-01-05T15:33:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "Join us for a cozy, creative space where you can unplug, connect, and just be. This meetup is all about chill vibes—no agenda, no pressure. 🖍️✨\nWhether it’s your first time or your fourth, come as you are—dive into your own project or simply soak up the wholesome atmosphere. Each meetup has brought inspiring moments and wonderful people, and we’re excited to share it all again! 💜\nThere are 15 spots available, and this meetup is exclusively for LGBTQIA+ folks. Neurospicy and neurotypical folks are all welcome. 🌈🎨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT878",
    "image": "https://attagalatta.com/admin/uploads/events/1136766814.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-01-05T14:00:00+05:30",
    "endDate": "2025-01-05T17:00:00+05:30"
  },
  {
    "name": "Habits That Stick - Wellness and Self-Improvement Workshop",
    "description": "Ever wonder why your New Year`s resolutions usually fail after a couple weeks? Would you like support to establish habits that can last throughout 2025? If so, this workshop is for you. We`re going to explore how to make effective strategies so you don`t have to rely on willpower alone to establish habits. We`ll also cover how to track your habits and adjust your strategies week by week so that your habits stay fresh for the whole year. This work includes the best of Atomic Habits, Tiny Habits, Elastic Habits, etc. and transcends some of their limitations as well. Come join us for this unique experience!\nAbout the Trainer: Roy Jacob is a facilitator, trainer, mediator, and founder of the Conscious Communication Academy. He has been facilitating retreats for the past 13 years, including Conscious Communication, the India Youth Jam, the EcoJam, Authentic Relating, and team retreats for NGO`s and companies. He is also developing an app for Conscious Habits. Roy grew up in the U.S. before finding his calling and coming to India (where his roots are) in 2003. Apart from facilitating, he enjoys farming, simple living, and watching the stars at night.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT877",
    "image": "https://attagalatta.com/admin/uploads/events/1002932415.png",
    "performer": "Roy Jacob",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-05T17:00:00+05:30",
    "endDate": "2025-01-05T19:00:00+05:30"
  },
  {
    "name": "Story Frames: Unlocking the Power of Visual Interpretation - Workshop for Children",
    "description": "This 75-minute interactive workshop invites children aged 8 to 13 to explore the art of interpreting stories and fiction through visuals. Participants will delve into characters, themes, emotions, and plot points from any book or short story they have read using photographs, artwork, and craft. The session focuses on developing key skills like understanding symbolism, practising critical thinking, and engaging in self-reflection. Through this immersive experience, children will gain tools to analyze and interpret books in a meaningful way, enhancing their ability to connect with stories on a deeper level.\nAt the end of this workshop participants will,\nEnhance essential life skills such as critical thinking and making self-to-text connections in a fun, engaging, and experiential manner\nLearn how to use visuals to express their perspectives regarding a story - whether it is about the plot, emotions, themes, or characters\nDesign/Create a visual to demonstrate their understanding of any story they have read in the past\nReceive a short `how-to` guide that they can apply to future stories\nGet motivated to further engage in reading literature\nAbout SkilLit Readers\nSkilLit Readers is an initiative designed to cultivate life skills in children by blending literature with experiential learning. Our goal is to help children become self-aware, empathetic, collaborative, and socially responsible thinkers. We facilitate programs that explore characters, themes, and plot points in a book through engaging, hands-on activities involving music, writing, photography, imagery, speech, role-playing, mind mapping, movement, drawing, and crafts. Our offerings include both in-person and online sessions, spanning from single workshops to extended programs. We are also proud to be a platform that actively includes Indian literature in our curriculum and programs.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT886",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "SkilLit Readers",
    "keywords": [
      "Kids",
      "Workshop"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2025-01-11T11:00:00+05:30",
    "endDate": "2025-01-11T12:15:00+05:30"
  },
  {
    "name": "Pen & Latte 7.0 - Story Writing Workshop",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT879",
    "image": "https://attagalatta.com/admin/uploads/events/106178628.png",
    "performer": "Aristotle's Writers Club",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-11T11:11:00+05:30",
    "endDate": "2025-01-11T14:22:00+05:30"
  },
  {
    "name": "An Evening of Nature Poetry - Poetry Circle",
    "description": "\"There is only one question: how to love this world,\" wrote Mary Oliver in her eternal poem 'Spring'. While we turn inward to watch in wonder how this one immense world we inhabit transforms into many within us, we meet another wonder that language is, one that helps us make sense of the sensations. Join us for an hour of nature poetry reading with Sourabha Rao, a writer, poet, translator and budding wildlife conservation filmmaker, and her fellow poetry lovers as they take you through the rainforests of Āgumbe and the savannahs of Africa! From a caterpillar crawling on a leaf to a cheetah charging at an impala, all churning as moving images within the Atta Galatta auditorium. All we need are a few fellow nature lovers with us!\nSee you on 11 January at 5.30 PM to witness how everything in our more-than-human world can make all that is human more bearable and beautiful. And this one hour is simply a prologue to what we believe could be a lifelong love affair for you with nature poetry.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT888",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Sourabha Rao",
    "keywords": [
      "Poetry",
      "Poetry Circle"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-11T17:30:00+05:30",
    "endDate": "2025-01-11T18:30:00+05:30"
  },
  {
    "name": "Acupuncture Healing Energy Bootcamp - Wellness Workshop",
    "description": "Join us for an eye-opening and heart-opening session of healing at Atta Galatta on Saturday, 18th January, 11 AM to 12:30 PM\nIn this session you will:\nLearn about the ancient Chinese system of healing known as Acupuncture\nUnderstand how blocked and imbalanced energies in our bodies could lead to chronic physical and emotional ailments\nGet personalized treatment to unblock and balance your energies (no needles involved)\nHave an intense guided journalling and meditation session to uncover inner wounds and heal them\nGet tips for a more balanced life\nIdeal for those who suffer from recurring physical ailments, those who seek to break recurring unhealthy behavioural patterns, those seeking relief from stress and anxiety and for curious souls looking to understand their bodies and minds better.\nParticipants are requested to wear loose and comfortable clothing as we will be doing some light stretches during the session.\nPlease bring along a pen and a bottle of water.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT880",
    "image": "https://attagalatta.com/admin/uploads/events/1349227759.png",
    "performer": "Benazir",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-18T11:00:00+05:30",
    "endDate": "2025-01-18T12:30:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nJanuary Read: Sweet Malida: Memories of a Bene Israel Woman by Zilka Joseph\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT885",
    "image": "https://attagalatta.com/admin/uploads/events/235401023.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books and Literature",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-18T11:00:00+05:30",
    "endDate": "2025-01-18T13:00:00+05:30"
  },
  {
    "name": "Chapters Unsealed 7.0 - Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nSharing your views on favorite books.\nParticipating in the curated discussion.\nVoting for a Monthly Book Read.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT881",
    "image": "https://attagalatta.com/admin/uploads/events/972227345.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-01-19T11:11:00+05:30",
    "endDate": "2025-01-19T14:22:00+05:30"
  },
  {
    "name": "Cut Nib Calligraphy - Calligraphy Workshop",
    "description": "25th & 26th January 2025 - 2-Day Workshop - 6 Hours of Training - 2 Scripts\nCut Nib Calligraphy traces its roots back centuries, to ancient civilizations such as the Greeks, Romans, and Chinese, who used vivid chisel-tipped writing instruments to inscribe their languages and artistic expressions onto various surfaces.\nFast forward to the modern era, Cut Nib Calligraphy continues to thrive as both a traditional craft and a contemporary art form. Today, artists and enthusiasts worldwide explore its expressive potential, blending traditional techniques with modern innovations to create stunning works of calligraphy art in this 2-day workshop!\nWhat you will learn from this workshop:\n-Origin of Calligraphy\n-The meaning behind this art\n-Introduction to Tools\n-Understanding Stroke Variations\n-Exploring & Learning Two Letter Forms: Roman & Gothic\n-Promoting Continued Practise post workshop\nWhether you`re a seasoned calligrapher or a curious beginner, this workshop offers an opportunity to refine your skills and discover more about Calligraphy\nWhat do you need to bring?\nWater bottle to keep you hydrated\nThis workshop includes all materials if required kindly get an Examination Pad / Paper Board",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT882",
    "image": "https://attagalatta.com/admin/uploads/events/1853531469.png",
    "performer": "Sindhoor Suryavamshi",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-25T11:00:00+05:30",
    "endDate": "2025-01-25T14:00:00+05:30"
  },
  {
    "name": "Cut Nib Calligraphy - Calligraphy Workshop",
    "description": "25th & 26th January 2025 - 2-Day Workshop - 6 Hours of Training - 2 Scripts\nCut Nib Calligraphy traces its roots back centuries, to ancient civilizations such as the Greeks, Romans, and Chinese, who used vivid chisel-tipped writing instruments to inscribe their languages and artistic expressions onto various surfaces.\nFast forward to the modern era, Cut Nib Calligraphy continues to thrive as both a traditional craft and a contemporary art form. Today, artists and enthusiasts worldwide explore its expressive potential, blending traditional techniques with modern innovations to create stunning works of calligraphy art in this 2-day workshop!\nWhat you will learn from this workshop:\n-Origin of Calligraphy\n-The meaning behind this art\n-Introduction to Tools\n-Understanding Stroke Variations\n-Exploring & Learning Two Letter Forms: Roman & Gothic\n-Promoting Continued Practise post workshop\nWhether you`re a seasoned calligrapher or a curious beginner, this workshop offers an opportunity to refine your skills and discover more about Calligraphy\nWhat do you need to bring?\nWater bottle to keep you hydrated\nThis workshop includes all materials if required kindly get an Examination Pad / Paper Board",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT882",
    "image": "https://attagalatta.com/admin/uploads/events/1853531469.png",
    "performer": "Sindhoor Suryavamshi",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-01-26T11:00:00+05:30",
    "endDate": "2025-01-26T14:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT887",
    "image": "https://attagalatta.com/admin/uploads/events/10443690.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-02-23T07:00:00+05:30",
    "endDate": "2025-02-23T09:30:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT887",
    "image": "https://attagalatta.com/admin/uploads/events/10443690.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T07:00:00+05:30",
    "endDate": "2025-03-09T09:30:00+05:30"
  }
]