[
  {
    "name": "Golden Wings of Watercocks - Monthly Film Screenings",
    "description": "In a lush haor, Sultan, a young man seeking a fresh start, becomes entwined in a poignant tale of resilience and sacrifice. He joins a family haunted by tragedy, where he toils amidst the golden fields, forming bonds that defy the encroaching monsoon's wrath. Yet, as floods ravage their world, tragedy strikes once more, thrusting Sultan into a whirlwind of responsibility and love. Amidst shattered dreams and fleeting hope, their journey unfolds—a gripping saga of courage and determination against nature's merciless onslaught. Join them on a riveting adventure as they chase elusive dreams and find solace in the wings of imagination.\nTrailer: https://drive.google.com/file/d/1Lo5TXkaGeALWiXIlVenMb0FFcHu2vmYs/view",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT687",
    "image": "https://attagalatta.com/admin/uploads/events/2056426029.png",
    "performer": "ALT EFF Film Club",
    "keywords": [
      "Film",
      "Screening"
    ],
    "@type": "ScreeningEvent",
    "startDate": "2024-08-16T19:00:00+05:30",
    "endDate": "2024-08-16T21:30:00+05:30"
  },
  {
    "name": "Chapter Carnival 2.0 - Literary Meetup",
    "description": "Atta Galatta and Your View On Books, A Novel Club cordially invite you to the latest Library Meetup in town.\nJoin us for a innovative Library Meet wherein there`s over hundreds of books and you could pick a book in random and start reading together.\nHave an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nCome along with Empty Minds and fill it with rich literature from Atta Galatta’s Reading Section.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nReading minimum one chapter from a random book that you choose from the libary.\nParticipating in the ensuing curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT645",
    "image": "https://attagalatta.com/admin/uploads/events/1677113111.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-17T11:11:00+05:30",
    "endDate": "2024-08-17T14:22:00+05:30"
  },
  {
    "name": "Junior Magic and Energy Clowning Workshop - Magic and Clowning Workshop",
    "description": "Join us for a fun-filled family date: kids can learn magic tricks while adults dive into the art of clowning! Whether you’re with family, friends, or even if you’re alone, come along and make new friends!\nMagic Workshop (Ages 6-12)\nLet your kids shine with our Junior Magic Course! Designed to enhance creativity, storytelling, dexterity, stage presence, communication, and confidence through magic. Children will learn to perform magic tricks using everyday items found at home, enabling them to amaze wherever they go. This workshop empowers children with skills they can use anytime, anywhere. Conducted by Nikhil Raj illusionist, Bengaluru’s favorite magician who has been in the field or more than 15 years now.\nClowning Workshop (Ages 13-99)\nRediscover yourself through laughter with our Energy Clowning Workshop! Dive into a journey of playful action, speech, and thought exploration. This workshop creates a supportive environment for free expression, helping participants reconnect with their inner child and discover hidden strengths. Develop emotional intelligence for stress management and positive behavior through laughter and joy.\nWorkshop by Ronak Sharma who is a trainer and an author, has an experience in the field of arts for more than 12 years in theater and clowning. \nEvent Highlight: \nFinale Show by participants where family surprise each other by putting up a surprise show\nThis event promises to be a memorable experience for all ages, fostering creativity, laughter, and family bonding.\nTakeaway: Each child receives a magic kit to continue their magical journey at home.\nBonus: Techniques to relieve stress and embrace laughter addiction to the entire family",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT676",
    "image": "https://attagalatta.com/admin/uploads/events/1265594835.jpg",
    "performer": "Nikhil Raj, \nRonak Sharma Gupta,",
    "keywords": [
      "Magic and Clowning",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-08-17T14:30:00+05:30",
    "endDate": "2024-08-17T16:30:00+05:30"
  },
  {
    "name": "The Art Exchange - Meetup",
    "description": "Welcome to The Art Exchange, a social/art event for everyone!\nThis event is for artists, non-artists and everyone in between\nAll materials provided, no minimum skill required, just bring yourself!\nYou’re a piece of art away from new connections.\nAll materials will be provided.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT668",
    "image": "https://attagalatta.com/admin/uploads/events/2105138627.jpg",
    "performer": "Madhu Preetha",
    "keywords": [
      "Art",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-17T16:00:00+05:30",
    "endDate": "2024-08-17T18:00:00+05:30"
  },
  {
    "name": "Creative Writing Kids Workshop - Writing Workshop for Children",
    "description": "Does your child bring home entertaining stories about their day in school? Make up clever excuses for why they didn’t do their homework? Or ask you imaginative questions about dinosaurs, superheroes and outer space that you have no answers to?\nIf yes, your child might just be a born storyteller!\nThis Sunday, join us for a workshop that will help your kid/s present their innate creativity and original thinking onto paper.\nThe workshop will be conducted by an experienced writer who has her work published in Femina, Mid-Day, ScoopWhoop, and Fork Media Group, among other renowned content brands. She will share - in kid-friendly language - lessons from her childhood days that helped her develop a flair for creative expression and develop a unique writing style.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT667",
    "image": "https://attagalatta.com/admin/uploads/events/1267244791.png",
    "performer": "Ritu Ailani",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-08-17T17:00:00+05:30",
    "endDate": "2024-08-17T19:00:00+05:30"
  },
  {
    "name": "Harry Potter Book Discussion - Meetup",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT671",
    "image": "https://attagalatta.com/admin/uploads/events/1485208983.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-18T11:00:00+05:30",
    "endDate": "2024-08-18T12:00:00+05:30"
  },
  {
    "name": "Oil Painting Workshop - Art Workshop",
    "description": "Come, join me for an oil painting workshop. If this is your first dabble with paints, this fun and interactive step by step session is sure to keep you entertained, and provide the guidance for a canvas of your own creation. All the necessary materials will be provided. The only thing that you’re expected to bring along is your enthusiasm and art vibes.\nArt is an expression of the inner self and the world around us as we perceive it. Oil paints provide beautiful rich textures and add depth and substance to the subject.\nThe essence of this session is to get together and create artistic strokes that unite us in a bond of communal love and creativity.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT673",
    "image": "https://attagalatta.com/admin/uploads/events/1674022649.jpeg",
    "performer": "Lavaniya Deepak",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-08-18T11:00:00+05:30",
    "endDate": "2024-08-18T13:00:00+05:30"
  },
  {
    "name": "Infinitely Polar Bear - Mindful Cinema",
    "description": "\"Two emotions fighting each other to have control of you. Fights never end well. But being mindful around people who struggle with this fight every day is possible. Being at two poles of emotions is a conflict, confusion, embarrassment, and much more. Let`s know more about it!\"\nPrevention begins when we generate awareness and have empathy towards the happenings of our surroundings as well. Shraddha decided to screen cinema from the world to bring in some awareness about various aspects of mental health. The screening of the film will be followed by a discussion on the subject.\nOn 18th August 2024, we will screen the movie \"Infinitely Polar Bear\". It is an English movie with English subtitles on the father-daughter relationship.\nDirector and Writer: Maya Forbes\nCast: Mark Ruffalo and Zoe Saldana\nAfter the movie, there will be a facilitated discussion around \"Bipolar Disorder.\"\nFacilitator: Shraddha Modi, a psychologist and behavior therapist whose passion for mental health has motivated her to study and work in this field.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT672",
    "image": "https://attagalatta.com/admin/uploads/events/901977866.png",
    "performer": "Shraddha Modi",
    "keywords": [
      "Wellness and Health",
      "Film Screening"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-18T15:00:00+05:30",
    "endDate": "2024-08-18T17:00:00+05:30"
  },
  {
    "name": "Perspective Drawing Secrets - Drawing Workshop",
    "description": "Perspective Drawing for Everyone\nJoin us for a fun and exciting workshop called \"Perspective Drawing for Everyone\"! This event is perfect for all levels who want to learn how to turn 2D sketches into 3D.\nWhy It's Important:\n\nCreate Realistic Art: Learn how to make your drawings look real and three-dimensional. Imagine drawing a road that looks like it stretches far into the distance or a building that looks tall and grand. Perspective drawing makes your art pop off the page!\nBoost Your Imagination: Perspective drawing helps you bring your creative ideas to life. Whether you're designing a cool cityscape or a fantasy world, understanding perspective will make your drawings more believable and exciting.\nImpress Your Friends: Imagine showing your friends a drawing of a skateboard park that looks like you could step right into it! Learning perspective will make your artwork stand out and impress everyone who sees it.\nHave Fun with Art: Most importantly, perspective drawing is fun! You'll get to experiment with different techniques, learn new skills, and enjoy creating amazing artwork.\n\nJoin us for \"Perspective Drawing for Everyone\" and discover the magic of making your drawings come to life!\nWhat will be provided?\n\nAll the needed materials will be provided\nSte-by-step instructions to get acquainted with the concepts\n\nMentor\n\r\nRaju Dyapur (worldofpaintings.com) has been teaching Fine Art and Vedic Mathematics for more than 6 years and conducting workshops in India since 2014. His experience in drawing/fine art comes from his learning in school and college and the training he got from private lessons in Russia.\nHis artworks are in private collections in UK, Middle East, USA, Canada, Russia and Singapore and conducted hundreds of workshops across the nation and abroad.\nRaju Dyapur was selected as one of the artists for WTC The Hague Art Gallery, Netherlands",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT674",
    "image": "https://attagalatta.com/admin/uploads/events/398229918.jpg",
    "performer": "Raju Dyapar",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-08-18T16:00:00+05:30",
    "endDate": "2024-08-18T18:00:00+05:30"
  },
  {
    "name": "ColorFull: Exploring Self Through Art Therapy - Art Therapy",
    "description": "“ColorFull” is an art therapy session designed to help you explore and express your inner world through creative exploration of themes like safety and comfort while engaging with fellow participants in collaborative artwork.\nWhat to Expect:\nInclusive Environment: A safe and welcoming space for self-expression and reflection.\nNo Experience Needed: You don`t need to be an artist to participate. All you need is an open mind and a willingness to engage.\nArt Supplies Provided: We’ll provide all the materials you need, including colors and paper sheets. Just bring yourself!\nCreative Guidance: Guidance through the creative process with a focus on personal and collective exploration of common themes.\nSupportive Group Engagement: Participants are treated as members of a supportive group, where we will be attuned to each other’s expressions and creations, exploring common insights, and fostering a respectful and empathetic environment for everyone’s experiences.\nGoals:\nTo facilitate self-discovery and emotional release through creative expression.\nTo foster a sense of community and shared understanding among participants.\nTo create a collaborative artwork that reflects the group`s collective experiences and insights.\nWhether you`re an experienced artist or a beginner, this session offers a unique opportunity to explore your inner self and connect with others through the powerful medium of art. Join us and discover the transformative potential of creativity!\nAbout the Facilitator: Fizapreet is a trauma-informed, queer-affirmative counseling psychologist and expressive arts practitioner currently practicing in Indiranagar, Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT670",
    "image": "https://attagalatta.com/admin/uploads/events/408214262.jpg",
    "performer": "Fizapreet Dhillon",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-08-18T17:00:00+05:30",
    "endDate": "2024-08-18T19:00:00+05:30"
  },
  {
    "name": "Our Bones In Your Throat - Poetry Reading and Performance",
    "description": "Join us for a 1-hour poetry special by Megha Rao, author of Our Bones In Your Throat. Megha’s poems exploring abundant joy, grief, female rage, revival and life’s strange and beautiful ways, on stage.\nAfter the event, the poet will sign copies of her new novel, Our Bones in Your Throat.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT679",
    "image": "https://attagalatta.com/admin/uploads/events/1328414952.jpg",
    "performer": "Megha Rao",
    "keywords": [
      "Poetry",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-18T19:30:00+05:30",
    "endDate": "2024-08-18T20:30:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nAugust Read: Bhog Naivedya: Food Offerings to the Gods by Sujata Shukla Rajan\nWe assure you that you will relish every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT659",
    "image": "https://attagalatta.com/admin/uploads/events/577505300.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books and Literature",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-24T11:00:00+05:30",
    "endDate": "2024-08-24T13:00:00+05:30"
  },
  {
    "name": "Don't Stop Acting 1.0 - Acting Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Acting Workshop in town. \nJoin fellow aspiring actors and actresses for an inspiring session of learning acting through basics at our Writers Club Meet event in the cozy ambiance of the library cafe. Our Acting workshop is designed for aspiring artists who wish to explore the fundamentals of acting and develop their performance skills in a supportive and engaging environment. This immersive workshop offers participants a thorough grounding in acting techniques, character development, and scene work, providing them with the tools needed to bring authenticity and depth to their performances.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no acting experience, as well as intermediate actors looking to refresh their skills. It is also suitable for anyone interested in improving their public speaking and presentation abilities.\nWorkshop Objectives:\n- To introduce participants to the basic principles of acting.\n- To develop participants` abilities to create believable and compelling characters.\n- To enhance participants` skills in scene study and script analysis.\n- To build participants` confidence in performing in front of an audience.\nKey Components involves learning theory and practicals of: \n- Acting Techniques\n- Character Development and Analysis\n- SCript Analysis and Interpretation\n- Understanding Director`s Vision\n- Conveying Emotions\n- Physicality and Movement of Camera\n- Improvization and Spontaneity\n- Voice and Diction\n- Working with Props and Costumes\n- Rehearsals and Performances\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Participating in workshop with enthusiasm.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT646",
    "image": "https://attagalatta.com/admin/uploads/events/219029336.png",
    "performer": "MWM Movies",
    "keywords": [
      "Theatre",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-08-24T11:11:00+05:30",
    "endDate": "2024-08-24T14:22:00+05:30"
  },
  {
    "name": "Keepsake: A Short Story Collection - Book Signing",
    "description": "Join us for author Neha Gupta's book signing at Atta Galatta on 24th August, Saturday, at 3.30 PM, where she will be signing copies of her short story collection, Keepsake.\n“Life gives us stories to tell!”\nOld photographs, cherished letters, museums, flea markets and heirlooms. From the pressed flowers between the pages of a forgotten book to the humming of a vintage song, from nostalgic daydreams to soulful conversations, the art of keeping memories forever. Just like moments in life, some stories are light-hearted and some intense, each having a heart of its own. Keepsake is a beautiful collection of memories lived and remembered. \nCelebrating nostalgia and storytelling with a cup of tea and conversations.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT654",
    "image": "https://attagalatta.com/admin/uploads/events/1694388288.jpeg",
    "performer": "Neha Gupta",
    "keywords": [
      "Books",
      "Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-24T15:30:00+05:30",
    "endDate": "2024-08-24T16:30:00+05:30"
  },
  {
    "name": "Everything Sucks - Book Launch",
    "description": "Kashish Asif, a popular Instagrammer, navigates life at 18, accompanied by her widowed father, and occasionally present older sister. As her witty reels earn her a large following, she falls into an online battle with Sameer, an aspiring cook and budding Instagrammer. But their playful conflict soon gets blown out of proportion through an error of judgement.\nThen, unexpectedly, they meet in real life. And even more unexpectedly, sparks fly between them. When reality creeps in, and an unfortunate incident forces them to unplug from their phones, they will need to figure out how to deal with life and relationships away from the screens.\nIs it possible to find a real friend (or someone more than a friend) in a world where reactions are staged, people pretend to date each other for the likes, and the only constant is that everything really, really sucks?\nFrom the bestselling author of Asmara’s Summer, filmed as the popular web series Dil Dosti Dilemma, comes a pitch-perfect teenage drama about friendship, family, and finding love in unexpected places. Join us for the launch of this YA book at Atta Galatta on 24th August at 4 PM!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT675",
    "image": "https://attagalatta.com/admin/uploads/events/75829156.png",
    "performer": "Andaleeb Wajid",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-24T16:00:00+05:30",
    "endDate": "2024-08-24T17:00:00+05:30"
  },
  {
    "name": "What I Call Home - Playback Theatre Performance",
    "description": "Home can mean different things to each of us. For some it’s a city or town, for others it’s the memory of certain people, or events. To some, it’s an emotion while for some it is a dream. And for some, it could be something they have moved on from!\nCome, let’s get together and share with each other; our real-stories of whatever we call ‘home’ and watch as these stories are brought alive by the actors, on-the-spot!\nAbout Playback Theatre:\nMagical, creative, thought-provoking, reflective, unscripted...just like life itself. A format of improvisational, interactive theatre where the actors use their creativity and skill, to present an engaging and sensitive retelling of the audience members’ story, on-the-spot.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT680",
    "image": "https://attagalatta.com/admin/uploads/events/523996055.jpeg",
    "performer": "First Drop Theatre",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-25T17:30:00+05:30",
    "endDate": "2024-08-25T18:30:00+05:30"
  },
  {
    "name": "Park - Play",
    "description": "One park. Three men. Three Benches and yet not enough space for all.\nManav Kaul’s \"Park\" delves into the complicated relationship of humans with space. Who has the better right on the space? The ones who need it for convenience or the ones who have a history associated or the ones who actually occupy it now? Why are men ready to wage wars for a mere piece of land? Is it a matter of power, history, pride or just plain greed?\nThrough the lens of the park, Manav Kaul offers a commentary on the human condition, prompting the audience to reflect on their own lives and relationships.\nAavirbhaav Naatya Manch presents a play that takes place in a seemingly ordinary setting – a PARK – but transcends the mundane as it delves into the complexities of the characters’ lives.\nDirector - Avinash Jain & Vikash Kumar\nActors - Rahul Gome, Jayant Sethi, Yashodhar Upadhyay",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT677",
    "image": "https://attagalatta.com/admin/uploads/events/161060630.png",
    "performer": "Aavirbhaav Naatya Manch",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-31T16:30:00+05:30",
    "endDate": "2024-08-31T17:30:00+05:30"
  },
  {
    "name": "Park - Play",
    "description": "One park. Three men. Three Benches and yet not enough space for all.\nManav Kaul’s \"Park\" delves into the complicated relationship of humans with space. Who has the better right on the space? The ones who need it for convenience or the ones who have a history associated or the ones who actually occupy it now? Why are men ready to wage wars for a mere piece of land? Is it a matter of power, history, pride or just plain greed?\nThrough the lens of the park, Manav Kaul offers a commentary on the human condition, prompting the audience to reflect on their own lives and relationships.\nAavirbhaav Naatya Manch presents a play that takes place in a seemingly ordinary setting – a PARK – but transcends the mundane as it delves into the complexities of the characters’ lives.\nDirector - Avinash Jain & Vikash Kumar\nActors - Rahul Gome, Jayant Sethi, Yashodhar Upadhyay",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT677",
    "image": "https://attagalatta.com/admin/uploads/events/161060630.png",
    "performer": "Aavirbhaav Naatya Manch",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-08-31T19:00:00+05:30",
    "endDate": "2024-08-31T17:30:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Reflection Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other`s experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT682",
    "image": "https://attagalatta.com/admin/uploads/events/2080566301.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Social",
      "Support Group"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-09-08T17:00:00+05:30",
    "endDate": "2024-09-08T19:00:00+05:30"
  },
  {
    "name": "Returning Home - Workshop",
    "description": "How do I break free from the deep-rooted conditioning of shame, self-doubt and self-judgment and embrace my authenticity? How do I align with my life`s essence and emerge as a whole?\nIf you find yourself grappling with these questions,\nIf you are someone finding it challenging to navigate through your emotions and aspire to lead a harmonious life.\nOr a curious explorer willing to discover the mysteries of our bodies. We invite you to join the Audacious Circle where we dive deep into understanding life essence, the concept of audacious love and return to our bodies.\nThe Audacious Circle is an initiative by Yashika CG, an educator, author and yoga practitioner who is on a forever journey into the great unknown.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT669",
    "image": "https://attagalatta.com/admin/uploads/events/138855616.jpg",
    "performer": "Yashika C. G.",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-14T11:00:00+05:30",
    "endDate": "2024-09-14T14:00:00+05:30"
  },
  {
    "name": "Pen & Latte 4.0 - Story Writing Workshop",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT683",
    "image": "https://attagalatta.com/admin/uploads/events/419501552.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-15T11:11:00+05:30",
    "endDate": "2024-09-15T14:22:00+05:30"
  },
  {
    "name": "Screen Craft 2.0 - Screenplay Writing Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Screenplay Writing Workshop in town. \nOur Screenplay Writing workshop is an intensive program designed to guide aspiring screenwriters through the process of crafting compelling and marketable screenplays. This workshop provides participants with a solid foundation in screenplay structure, character development, dialogue writing, and industry-standard formatting, ensuring they are equipped to bring their stories to life on the big screen.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no screenwriting experience, as well as intermediate writers looking to refine their skills. It is also suitable for novelists, playwrights, or anyone interested in exploring the craft of screenwriting.\nWorkshop Objectives:\n- To introduce participants to the fundamentals of screenplay writing.\n- To develop participants` skills in creating engaging plots and well-rounded characters.\n- To enhance participants` abilities to write effective dialogue and visual storytelling.\n- To familiarize participants with the screenplay industry and submission processes.\nKey Components involves learning theory and practicals of: \n- Story and Character Development\n- Screenplay Structure\n- Dialogue Writing\n- Scene Construction\n- Visual Storytelling\n- Formatting and Style\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Writing a story based on a prompt.\n- Participating in the curated feedback discussion.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT685",
    "image": "https://attagalatta.com/admin/uploads/events/227598307.png",
    "performer": "MWM Movies",
    "keywords": [
      "Film",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-09-21T11:11:00+05:30",
    "endDate": "2024-09-21T14:22:00+05:30"
  },
  {
    "name": "Chapters Unsealed 4.0 - Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nBring along your favorite book and delve into a shared reading experience.\n \nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nSharing your views on favorite books.\nParticipating in the curated discussion.\nVoting for a Monthly Book Read.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT686",
    "image": "https://attagalatta.com/admin/uploads/events/1490616635.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-22T14:22:00+05:30",
    "endDate": "2024-09-22T17:55:00+05:30"
  },
  {
    "name": "Ranis of India - Storytelling",
    "description": "Ranis of India is a collection of stories from various oral, folk, mythical and historical narratives collected based on numerous travel and research over the last few years on the lesser-known or completely forgotten women rulers of this wonderful country by Vikram Sridhar.\nOver one hour, through oral story-telling smattered with folk songs, we travel the country, going deeper into many stories of Indian queens from myths, history and present times, whose stories need to be told and heard.\nFrom North to South, East to West there have been women rulers, administrators, changemakers who’ve changed and touched history strongly.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT681",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-28T20:00:00+05:30",
    "endDate": "2024-09-28T21:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT678",
    "image": "https://attagalatta.com/admin/uploads/events/1590760097.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-29T07:00:00+05:30",
    "endDate": "2024-09-29T09:30:00+05:30"
  },
  {
    "name": "Ranis of India - Storytelling",
    "description": "Ranis of India is a collection of stories from various oral, folk, mythical and historical narratives collected based on numerous travel and research over the last few years on the lesser-known or completely forgotten women rulers of this wonderful country by Vikram Sridhar.\nOver one hour, through oral story-telling smattered with folk songs, we travel the country, going deeper into many stories of Indian queens from myths, history and present times, whose stories need to be told and heard.\nFrom North to South, East to West there have been women rulers, administrators, changemakers who’ve changed and touched history strongly.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT681",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-09-29T20:00:00+05:30",
    "endDate": "2024-09-29T21:00:00+05:30"
  },
  {
    "name": "Wandering Thoughts - Reflection Circle - Women's Support Group",
    "description": "Atta Galatta and fallenphoenix2fly warmly invite you to our Women Support Group Meet, a safe and supportive gathering dedicated to providing emotional support and fostering a sense of community among women. Join us for an evening of connection, sharing, and mutual support in the comforting ambiance of our library café. This event is designed to create a judgment-free zone where women can be themselves and share their experiences openly.\nEvent Structure:\nIntroduction Session: Participants introduce themselves to the group.\nIcebreaker Game: A fun and engaging game to help participants get familiar with each other.\nListening Session: Each participant is given the opportunity to share what they are going through. This segment emphasizes silent support, without offering advice, to create a safe and non-judgmental space.\nPositive Action Segment: After the emotional sharing session, we engage in an uplifting activity to provide positive reinforcement and soothe the soul.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- Respect each other`s experiences and maintain confidentiality.\n- Provide silent support and refrain from offering unsolicited advice.\n- While one person is sharing their story, participants should refrain from interrupting. We will allow each person to share in turn, and if anyone wishes to respond or provide support, they will have their chance during their turn.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT684",
    "image": "https://attagalatta.com/admin/uploads/events/1778962806.png",
    "performer": "Aparajita Sharma",
    "keywords": [
      "Social",
      "Support Group"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-10-06T17:00:00+05:30",
    "endDate": "2024-10-06T19:00:00+05:30"
  }
]