[
  {
    "name": "Hook Book Day - Let's Get Hooked! - Children's Festival",
    "description": "Have you heard of the Sweet Shop Wars? Or asked too many questions like Cyrus the Whyrus? What if I Want A Pet is the book for you? Get Hooked at Hook book day brought to you by Atta Galatta! Hear from authors and illustrators who helped created your favourite Hook books, participate in fun activities and most importantly- stick your nose in a new book!\nThis special event brings together authors, storytellers, illustrators and other artists coupled with fun finger-food and snacks, for a day of readings, interactive discussions and roundtables! So join us at Atta Galatta on 16th November and let's get hooked!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT816",
    "image": "https://attagalatta.com/admin/uploads/events/1666739416.png",
    "performer": "Penguin",
    "keywords": [
      "Storytelling",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-16T10:30:00+05:30",
    "endDate": "2024-11-16T17:30:00+05:30"
  },
  {
    "name": "I Won't Wash My Hair - Book Reading",
    "description": "A girl who refuses to wash her hair, a dog named Riksha and chilli from Chile. Join author Aparna Kapur and a cast of colourful characters from I Won't Wash My Hair (a Hook Book illustrated by Ogin Nayam and published by Duckbill Books).\nAbout Aparna\nAparna Kapur writes books for children of all ages. She has been on various editorial teams, and currently is a consultant for HarperCollins Children's. She is often found poring over a book or pouring herself a large cup of coffee.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT811",
    "image": "https://attagalatta.com/admin/uploads/events/292569623.png",
    "performer": "Aparna Kapur",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-16T11:15:00+05:30",
    "endDate": "2024-11-16T11:45:00+05:30"
  },
  {
    "name": "Boy Bear - Interactive Session for Kids",
    "description": "Does Bear like to dance? Is bread his favourite food? Was he happy to leave his forest home and come live on the streets of Mumbai?\nAre all bears born with broken teeth…\nCome find the answers to these questions with Boy as he makes friends with a creature he’s lived with all his life yet never truly known.\nAbout Adithi Rao\nAdithi gobbles chocolate, takes long walks and smuggles treats to the friendly street dogs behind the backs of unfriendly neighbours. In her free time, she writes books and short stories, plays and film scripts. She is visiting faculty at the Srishti Manipal Institute of Art, Design & Technology, and often conducts writing workshops across the country.\nTwo of her books - Noon Chai and a Story and Candid Tales: India on a Motorcycle - were on the Parag Honour List.\nYou can find her at the chocolate store, or at www.adithirao.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT812",
    "image": "https://attagalatta.com/admin/uploads/events/2075679240.png",
    "performer": "Adithi Rao",
    "keywords": [
      "Books",
      "Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-16T12:00:00+05:30",
    "endDate": "2024-11-16T13:00:00+05:30"
  },
  {
    "name": "Cyrus the Whyrus - Interactive Session for Kids",
    "description": "Are you a Whyrus? Or maybe a Howrus? And have you done your Homework? Enter the Why-niverse with Lavanya Karthik in a fun filled session based on her books 'Cyrus the Whyrus' and 'Homework'. There will be quizzes, stories, some Why-ld ideas and a chance to compete in the Whylympic Games!\nAbout Lavanya Karthik\nLavanya Karthik is the award-winning author and illustrator of over 35 books for children of all ages. Her books have been translated into many languages and travelled the world. Lavanya stays in Mumbai where she writes, draws, eats a lot of chocolate and takes a lot of naps.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT817",
    "image": "https://attagalatta.com/admin/uploads/events/647588481.png",
    "performer": "Lavanya Karthik",
    "keywords": [
      "Books",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-16T14:00:00+05:30",
    "endDate": "2024-11-16T14:45:00+05:30"
  },
  {
    "name": "Mythology Marvels - Children's Day Special - Storytime for Children and Families",
    "description": "Indic Mythology is full of answers to the many whys of our culture. Join Lavanya Prasad and Meenu Sivaramakrishnan, as they explore and bring forth the marvellous stories from the Indic Mythology through music, dance and theatre.\nThis November, we are celebrating Children. Come and listen to lesser-known tales of the Gods when they were young. Adventures, challenges they faced it all Join us to listen to tales that enthral.\nLooking forward to meeting you all!\nAbout the Storytellers:\nLavanya Prasad & Meenu Sivaramakrishnan are passionate professional storytellers with mutual love for Music and Mythology. Mythology Marvels is their humble attempt to bring to light the treasures from Indian mythology (this time from around the world too) to the children and Families of Bengaluru through music, dance and theatre. Both Lavanya and Meenu run their respective storytelling ventures.\nPlease find more about them here.\nLavanya Prasad : www.talescope.in\nMeenu Sivaramakrishnan : www.kathagalatta.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT809",
    "image": "https://attagalatta.com/admin/uploads/events/943578637.png",
    "performer": "Lavanya Prasad, \nMeenu Sivaramakrishnan,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2024-11-16T14:30:00+05:30",
    "endDate": "2024-11-16T15:30:00+05:30"
  },
  {
    "name": "The Paper Plane Flew - Interactive Session",
    "description": "Let's draw an elephant together and send it flying into the world.\n\nAbout Sheena Deviah\nSheena Deviah is an illustrator and book designer who loves to play with words and imagery. She has illustrated several books for children (and adults) and lives in Bangalore with a toothless cat, Ramona.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT813",
    "image": "https://attagalatta.com/admin/uploads/events/54184216.png",
    "performer": "Sheena Deviah",
    "keywords": [
      "Drawing",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-16T15:00:00+05:30",
    "endDate": "2024-11-16T15:30:00+05:30"
  },
  {
    "name": "If Wishes Were Butterflies - Session",
    "description": "Come read the new Hook Book 'Gawa's Bag of good Regards' with Canato and join him in making some origami butterflies and birds.\n\nAbout Canato Jim\nCanato Jimo is a picture-book maker from Nagaland, currently working as an Art Director in Bangalore. He moonlights as a musician, loves to guzzle tea and pop bubble wrap, and is a recovering stationery addict.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT814",
    "image": "https://attagalatta.com/admin/uploads/events/2044565344.png",
    "performer": "Canato Jim",
    "keywords": [
      "Books",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-16T15:45:00+05:30",
    "endDate": "2024-11-16T16:45:00+05:30"
  },
  {
    "name": "I Want A Pet - Interactive Session",
    "description": "Guess what Jasbir gets when he says \"I WANT A PET'? Take part in TRING, TRUNG, TRANG! Make silly sounds and have fun with author Arundhati Venkatesh! \nBonus: a treasure hunt with clues from the book, I WANT A PET.\n\nAbout Arundhati Venkatesh\nArundhati Venkatesh writes terrifically funny books about terribly serious things like monsters, democracy, maths and science. She is the author of the bestselling Bookasura and the Petu Pumpkin series for ages 6 to 9, Junior Kumbhakarna and I Want a Pet for children 4 years and above. Her books have won several awards, including the Comic Con India Best Publication for Children Award and the SCBWI Crystal Kite Award for India, Middle East and Asia. Her three latest releases all happen to be hilarious books for ages 10+: PETU PUMPKIN: Freedom Fighter, RAMANUJAN: From Zero to Infinity, RAMAN & CHANDRASEKHAR: Lighting Up the Stars.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT815",
    "image": "https://attagalatta.com/admin/uploads/events/1412795286.png",
    "performer": "Arundhati Venkatesh",
    "keywords": [
      "Books",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-16T17:00:00+05:30",
    "endDate": "2024-11-16T17:30:00+05:30"
  },
  {
    "name": "Pen & Latte 6.0 - Story Writing Workshop",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT818",
    "image": "https://attagalatta.com/admin/uploads/events/2049366924.jpeg",
    "performer": "Aristotle's Writers Club",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-17T11:11:00+05:30",
    "endDate": "2024-11-17T14:22:00+05:30"
  },
  {
    "name": "Weaving A Story - A curated exploration of Bhujodi Sarees through stories",
    "description": "Join us for a curated storytelling morning - Weaving a story (An exploration of Bhujodi Sarees and textiles)\nAparna Jaishankar, in collaboration with Priyanka Rajwar and Roli Mishra,  will delve into stories of the symbolic significance of the colors and motifs, from the threads to the textured pallu . A curated collection of sarees from Vayaka India will be on display.\nWhether you're a lover of textiles, mythology, or just fascinated by Indian heritage, this event will wrap you in the magic of tradition.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT820",
    "image": "https://attagalatta.com/admin/uploads/events/971456739.jpg",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-17T12:00:00+05:30",
    "endDate": "2024-11-17T13:00:00+05:30"
  },
  {
    "name": "Read A Kitaab - Monthly Book Club",
    "description": "Read A Kitaab is an unbiased community of Readers, Booklovers, writers and artists. We strive to provide the community an ecosystem with an online library, book discussions, author meet, book of the month, monthly meets, newsletters & much more...\nRead A Kitaab is a calm & comfort space to be yourself, to discuss books and life with no bars on age/gender/ethnicity/political views etc.\nJoin us for the August meet on Sunday 17th November to discuss books on magical realism! Entry free.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT819",
    "image": "https://attagalatta.com/admin/uploads/events/1167171764.jpeg",
    "performer": "Anurag Kothari, \nEkta Bhandari,",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-17T16:00:00+05:30",
    "endDate": "2024-11-17T18:00:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nNovember Read: Whose Samosa is it Anyway? The Story of Where “Indian” Food Really Came From by Sonal Ved\nWe assure you that you will relish every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT794",
    "image": "https://attagalatta.com/admin/uploads/events/1512218646.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-23T11:00:00+05:30",
    "endDate": "2024-11-23T13:00:00+05:30"
  },
  {
    "name": "All-In: The Moments - Improv Comedy Show",
    "description": "9 improvisers take over the stage without any script. A few prompts from the audience are all that they want. Can they make things funny? Can they even come up with a story? They have 1.5 hours to prove.\nWhat is improv?\nImprov is not a play, there’s no script. It is also not standup, there are no tried and tested jokes. It is somewhere in between these two things. You’ll have to come to find out!\nWhy should you attend?\n\nYou are part of the script - your prompts will decide where the show will go\nYou can bring a date for a cool show\nYou can tell your Instagram friends that you attended a cool show",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT821",
    "image": "https://attagalatta.com/admin/uploads/events/1795373959.png",
    "performer": "All In Improv",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-21T17:30:00+05:30",
    "endDate": "2024-12-21T19:00:00+05:30"
  }
]