[
  {
    "name": "Hell Hath No Fury - Panel Discussion",
    "description": "Be very afraid.\nStories of revenge.\nThese women are mad as hell, bloodthirsty. And they are coming for you.\nHell Hath No Fury illuminates the electrifying space between love and hate.\nA sixty-something woman finds unexpected love; another abducts her nephew; a writer strikes a deal with the devil – each story bares its fangs. Startling, sinister and seductive, these women go after those who wronged them with a ferocious cunning, sometimes underhanded, sometimes operatic. A sisterhood of betrayed wives, beheaded princesses, the belittled and gaslighted...\nJoin us for a panel discussion with the editor of this anthology, Shinie Antony, and contributors Anuja Chandramouli, Jahnavi Barua and Madhavi Mahadevan. The discussion will be moderated by Karthik Venkatesh.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1008",
    "image": "https://attagalatta.com/admin/uploads/events/1201568166.jpeg",
    "performer": "Anuja Chandramouli, \nJahnavi Barua, \nKarthik Venkatesh, \nMadhavi Mahadevan, \nShinie Antony,",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-02-27T19:00:00+05:30",
    "endDate": "2025-02-27T20:00:00+05:30"
  },
  {
    "name": "Books, Brews and Poetry - Book Launch",
    "description": "Calling all poetic souls for an afternoon immersed in verses, books and coffee. Join us for a soulful reading session with authors Ankita and Chinchu. Share your thoughts, laugh, connect with the authors as they sign your book copies, participate in some fun literary games and win some cute goodies. All of this and more over steaming cups of coffee.\nLimited seats – Register to attend for free!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT972",
    "image": "https://attagalatta.com/admin/uploads/events/1194696520.jpg",
    "performer": "Chinchu Mathew",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-01T14:30:00+05:30",
    "endDate": "2025-03-01T17:00:00+05:30"
  },
  {
    "name": "Bounce, Hop, Raaga, Pop - Musical Tale for Young Minds",
    "description": "Author and music educator brings her bestselling book, Bounce Hop Raaga Pop to Atta Galatta. Get ready to be mesmerized as she intertwines math and music and takes you through a hopscotch game of raagas. The evening will be made more special, by a live classical performance by her students, accompanied by tabla.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT978",
    "image": "https://attagalatta.com/admin/uploads/events/485733855.jpg",
    "performer": "Shyama Panikkar",
    "keywords": [
      "Kids",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-01T16:00:00+05:30",
    "endDate": "2025-03-01T17:00:00+05:30"
  },
  {
    "name": "No Place to Call My Own - Book Release",
    "description": "An intimate, arresting portrait of millennial angst in a mercurial, volatile world.\nFeeling trapped in a society that’s quick to undermine her—constantly making assumptions about her religion, sexuality, ambition, worth—Sophia plunges headlong into a journey of questionable decisions through her twenties. We follow her through cities and towns as she tries to make sense of the old while confronting the new. But each move trails chaos in its wake.\nRestless and acerbic, she struggles to come to terms with the disintegration of her parents’ marriage, eerily mirrored in the political turmoil of twenty-first-century India. And crucial to Sophia’s story—which unfolds against the backdrop of the #MeToo movement, the 2020 Delhi riots and a global pandemic—is her complex, thorny friendship with Medha, a queer artist with travails of her own.\nHow does one even begin to fit in when apathy becomes a mode of survival? How is it possible to truly belong when one feels estranged from oneself? Sophia’s journey is not just her own but that of any young woman who finds herself caught ‘in between’—unable to back down and refusing to conform—and who doesn’t quite feel rooted to one place or identity.\nNo Place to Call My Own is an intimate, arresting portrait of millennial disquiet in a mercurial, volatile world. Join us for the Bangalore release of this book with the author, who will be in conversation with acclaimed poet Jeet Thayil,",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT987",
    "image": "https://attagalatta.com/admin/uploads/events/1539311763.jpg",
    "performer": "Alina Gufran, \nJeet Thayil,",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-01T18:00:00+05:30",
    "endDate": "2025-03-01T19:30:00+05:30"
  },
  {
    "name": "Poor Vanya - A Clown Re-imagination of Anton Chekhov's 'Uncle Vanya'",
    "description": "The only thing more comical than clowns in a Chekhov play is a Chekhov play in the clowns' hands!\nWitness the chaos as a troupe of silly and stupid clowns attempts to take on Anton Chekhov’s 'Uncle Vanya' – where personal rivalries (and romances), forgotten dreams (and lines), and a whole lot of backstage drama (that’s honestly more dramatic than the play itself) threaten to derail the entire production.\nWill they ever manage to get through a single rehearsal? Come find out in this uproarious and touching reimagining of a Chekhovian classic.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT964",
    "image": "https://attagalatta.com/admin/uploads/events/1756135228.png",
    "performer": "What If Productions",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-01T19:30:00+05:30",
    "endDate": "2025-03-01T21:00:00+05:30"
  },
  {
    "name": "Harry Potter Book Discussion - Meetup",
    "description": "For hard-core Potterheads age 12 and above!\nGet into the minds of the characters, ferret out the intricacies of the plot - enter the wizarding world and share your thoughts and insights!\nWill help if you have read all the Harry Potter books - this discussion will be based only on the books and not the movies.\nThe event is curated by Lahe Lahe Caravan and is being hosted at Atta Galatta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1003",
    "image": "https://attagalatta.com/admin/uploads/events/1536512166.png",
    "performer": "Sonali Bhatia",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-02T11:00:00+05:30",
    "endDate": "2025-03-02T12:30:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "Join us for a cozy, creative space where you can unplug, connect, and just be. This meetup is all about chill vibes—no agenda, no pressure. 🖍️✨\nWhether it’s your first time or your fourth, come as you are—dive into your own project or simply soak up the wholesome atmosphere. Each meetup has brought inspiring moments and wonderful people, and we’re excited to share it all again! 💜\nThere are 15 spots available, and this meetup is exclusively for LGBTQIA+ folks. Neurospicy and neurotypical folks are all welcome. 🌈🎨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT878",
    "image": "https://attagalatta.com/admin/uploads/events/1136766814.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-03-02T14:00:00+05:30",
    "endDate": "2025-03-02T17:00:00+05:30"
  },
  {
    "name": "how long is february? - A Fantasy in Three Parts - Digital Play Screening",
    "description": "how long is february? a fantasy in three parts.\nWritten and directed by Nisha Abdulla\nDuration of digital play: 60 mins\nIn English, Hindi, Malayalam (with English subs)\nSuitable for ages 14+\n15 years after the brutal events of February 2020 in Delhi, a nation reckons with the truth of what really happened. In parallel, there is the urgent matter of 72 arrested goats and an unfolding conspiracy.\n\"That which is denied must be imagined\" (Sartre)\nSet in an imagined future and based on real events, this is a project in narrative justice delivered via the performative. Using a satirical lens, the play questions the complicity and inaction of various groups involved in the denial of justice.\nSupported by The Edinburgh Festival Fringe Society and Pickle Factory Dance Foundation, Calcutta.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT994",
    "image": "https://attagalatta.com/admin/uploads/events/86977376.jpg",
    "performer": "Qabila",
    "keywords": [
      "Social Awareness",
      "Screening"
    ],
    "@type": "ScreeningEvent",
    "startDate": "2025-03-02T14:00:00+05:30",
    "endDate": "2025-03-02T17:00:00+05:30"
  },
  {
    "name": "The Perfect Ending: A Yogi's Fairytale - Book Launch",
    "description": "We are pleased to invite you to the story-telling discussion and book launch of 'The Perfect Ending, A Yogi's Fairytale'. For those on a journey of growth, this is a genre-bending novel at the intersection of romance, fantasy and transformational, spiritual, self-help. It is a fairytale about the Ultimate Reality that delves into the scientific principles of the Vedas, while also re-imagining the real ending of the French classic, 'Beauty and the Beast'.\nThe launch will be accompanied by a story-telling discussion for those embarking on their own writing quests. Where do you begin, if you want to write a book? We begin at the beginning, much like Dickens' Oliver Twist. A discussion on the key elements of storytelling: How to start and how to finish fulfilling your dream. A group of writers share their best insights. Join us!'",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1005",
    "image": "https://attagalatta.com/admin/uploads/events/731917317.png",
    "performer": "Anu Kalgudi",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-02T14:00:00+05:30",
    "endDate": "2025-03-02T15:00:00+05:30"
  },
  {
    "name": "Support Group - Support Group",
    "description": "Topic: Helplessness in Relationships\nPeople make up big cities but what makes up people’s lives, hopefully not loneliness. Loneliness is an intensely painful state which arises out of lack of intimacy and connectedness. People from every wake of life, even those with social contacts or pursuing successful careers can experience sadness from absence of belongingness. This painful experience is felt in a myriad of contexts such as breakups, disagreeing families, fear of rejection, unrelatability, shyness and so on.\nThis support group has been constituted to bring people struggling with disconnectedness in various contexts together for a shared experience of comfort, belongingness, laughter, guidance and above all to break the cycle of sustained loneliness.\nThe support is being organized and moderated by Nimesh George Mphil PhD who is a practicing psychologist based in Bangalore. This session will be co-moderated by Nimesh George & Gokul R, who are both practising psychologists in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1001",
    "image": "https://attagalatta.com/admin/uploads/events/1574923051.png",
    "performer": "Gokul R. , \nNimesh George,",
    "keywords": [
      "Wellness and Health",
      "Support Group"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-02T17:00:00+05:30",
    "endDate": "2025-03-02T18:30:00+05:30"
  },
  {
    "name": "Fevicol - An Improv Show",
    "description": "Fevicol - An Improv Show by the Reluctant Hustlers\nKitna bhi zor laga lo - tootega nahi! \nThe Reluctant Hustlers invite you to Fevicol — an improv show that celebrates the strong, magical bonds of friendship that tie us together!\nNo matter how unpredictable or wild life gets, friends are the glue that holds it all together. Friendships are messy, joyful, silly, and real — and so is this show that explores this unbreakable connection in a way only improv can - with humor, spontaneity, and heart. So gather your friends, come prepared to laugh till it hurts. Because, after all, some bonds are unbreakable!\nThe Reluctant Hustlers are a team of improvisers, actors, storytellers and movement artists who are passionate about Improv. Members of erstwhile Improv Comedy Bangalore, India’s leading Improv group in the pre-covid era, the Hustlers have performed at international improv festivals including Singapore, Manila, Thailand, Ireland and Bangalore as part of multiple ensembles.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1002",
    "image": "https://attagalatta.com/admin/uploads/events/1439103682.png",
    "performer": "The Reluctant Hustlers",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-02T18:30:00+05:30",
    "endDate": "2025-03-02T19:30:00+05:30"
  },
  {
    "name": "What's Food Got To Do With It?  - Food Writing Workshop",
    "description": "In this workshop we will explore ways in which we can approach writing about food, and how food, the senses, and memory, are inextricably linked. We will do a guided exercise, experiment with prompts to generate new work, and discuss techniques as I offer comments and guidelines. Sharing is encouraged to make the most out of this workshop! A handout of reading material will be provided.\nZilka Joseph was born in Mumbai, lived in Kolkata, and now lives in Michigan. Her work is influenced by Indian and Western cultures, and her Bene Israel roots. Her work has appeared in journals such as Poetry Magazine, Kenyon Review Online, Asian Literary Review, The Bombay Literary Review, as well as several international anthologies. She was nominated for awards such as Pen America and Pushcart, has been interviewed on NPR/Michigan Radio, and podcasts such as Rattlecast, Rivkush, and Culturico. Her chapbook Sparrows and Dust won a Notable Best Indie Book Award and was Notable Asian American Poetry Book. Her books Sharp Blue Search of Flame and In Our Beautiful Bones were Foreword INDIES prize finalists. The University of Michigan awarded her a Zell Fellowship, the Michael Gutterman prize, and the Elsie Choy Lee Scholarship. Sweet Malida, her new collection of poems and prose, was published in the US in February, 2024. An international edition will be published in India in November. Currently, she is a creative writing coach, a manuscript advisor, and a mentor to writers in her community. www.zilkajoseph.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1009",
    "image": "https://attagalatta.com/admin/uploads/events/1279998268.jpeg",
    "performer": "Zilka Joseph",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-07T19:00:00+05:30",
    "endDate": "2025-03-07T20:30:00+05:30"
  },
  {
    "name": "Pen & Latte - Story Writing Workshop",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.\nDisclaimer on Event Coverage:\nEvent highlights will be captured through photos and videos for showcasing the event in our social media accounts. All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT989",
    "image": "https://attagalatta.com/admin/uploads/events/1866651.png",
    "performer": "Aristotle's Writers Club",
    "keywords": [
      "Writing Workshop",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-08T11:11:00+05:30",
    "endDate": "2025-03-08T14:22:00+05:30"
  },
  {
    "name": "Women's Sound and Art Workshop - Wellness Workshop",
    "description": "Great things happen when women connect.\nSound is the source of this entire creation.\nDid you know that the sound of the musical notes have a profoundly positive impact on our chakras?\nWhether you receive the sounds from sacred singing bowls meant for the purpose of healing or well-being, or you sing the notes yourself, they bring in a sense of balance.\nAs this balance fosters feelings of joy and peace, it can aid creative expression in many forms.\nPainting is one such creative form that is closely associated with sound and music. The choice of colours, mood and theme, sensory and emotional experience while painting gets influenced by the presence of sound and music in the environment where art is taking place impacting the artistic process and the final creation.\nInspired by this, we have a similar collaboration with artists Shilpi, Ayuushi, Priyanka and Khusbu who aspire to hold a Sound & Art Workshop for women wishing to experience such intense joy and creativity on 8th March 2025, International Women’s Day.\nIt would be a treat to observe the participants flow with the sounds and express their art.\nTake away:\nPainting to add vibrancy to your room or your living. An ideal gift that you can make, gift and surprise anyone.\nThis is a wonderful opportunity to receive encouragement from peer women.\nWhat to Bring:\n\nYoga mat.\nShawl / stole.\nDrinking water bottle.\n\nNo prior art experience is necessary.\nParticipants should come with an open mind. All other materials will be provided.\nWear comfortable, light color cotton / linen clothing as absorbing the vibrations is easier.\nRegistration: Spaces are limited, so early registration is encouraged.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT932",
    "image": "https://attagalatta.com/admin/uploads/events/895204819.jpeg",
    "performer": "Ayuushi, \nKhusbu Goyal, \nPriyanka Sinha, \nShilpi,",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-08T15:00:00+05:30",
    "endDate": "2025-03-08T18:00:00+05:30"
  },
  {
    "name": "Ups and Downs, and Everything in Between - Playback Theatre Performance",
    "description": "First Drop Theatre presents Ups and Downs, and Everything in Between - stories of resilience , a Playback Theatre performance on 8th March 2025 (Saturday, 4:30 PM) at Atta Galatta, Indira Nagar\nUps and Downs - the flow of life. We have all been through this flow and have our stories to share; of the moments when we looked for the resilience to work through this phase. Sometimes, the resilience could be found, and sometimes, it was elusive.\nCome, let`s get together and share our life moments, of the ups and downs, and everything in between. And watch our actors bring the stories alive on stage, on-the-spot!\nPlayback Theatre - Magical, creative, thought-provoking, reflective, unscripted...just like life itself. A format of improvisational, interactive theatre where the actors will play back your real-life stories on-the-spot, in an authentic and respectful manner, using text, poetry, movement, metaphors, music and more!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1010",
    "image": "https://attagalatta.com/admin/uploads/events/1827607451.png",
    "performer": "First Drop Theatre",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-08T16:30:00+05:30",
    "endDate": "2025-03-08T18:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT887",
    "image": "https://attagalatta.com/admin/uploads/events/10443690.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T07:00:00+05:30",
    "endDate": "2025-03-09T09:30:00+05:30"
  },
  {
    "name": "Coffee and Conversations - Group Meetup",
    "description": "What about some Filter Coffee and Unfiltered conversations on a fine Sunday morning?\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment.\nWe at Listeners Circle are committed to building a community where there are no unsaid words, held back emotions and buried feelings because of the fear of being judged.\nAfter 50+ Editions of Tell your Story, Listeners Circle relaunching a lighter format - Coffee and Conversations!\nCoffee lightens us up. Coffee gives us clarity. Coffee refreshes up. Sip a coffee and speak your heart out without fear of judgment and listen without judging! Coffee is on us and the onus of conversation without judgment is on you.\nEvery word matters. Every emotion matters. Every feeling matters.\nThink about how it would feel to take an hour out of your fast-paced life and share your experiences and thoughts to people who listen to you without judging over a cup of Coffee? Also, listen to others without judging.\nListeners` circle Coffee and Conversations -This is an event to make that happen.\nBe a part of the Listener`s circle Coffee & Conversations - Edition 5.\nSpeak your mind without being judged. Speak your mind without any boundaries. No photography and videography without consent. Your stories stay within the four walls of the room and the hearts.\nWould you like to just listen? We have a place for you too.\nBook your passes in advance to avoid the last-minute sell outs.\nListeners Circle is an initiative to facilitate listening without judgment, hence giving a safe space for anyone to speak their heart out without the fear of judgment. We have done 50+ sessions over the last year, enabling people to voice their stories. Coffee & Conversations is our new format based on popular demand.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1004",
    "image": "https://attagalatta.com/admin/uploads/events/100251032.png",
    "performer": "The Listeners Circle",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-03-09T11:00:00+05:30",
    "endDate": "2025-03-09T13:00:00+05:30"
  },
  {
    "name": "Chapters Unsealed - Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nSharing your views on favorite books.\nParticipating in the curated discussion.\nVoting for a Monthly Book Read.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT990",
    "image": "https://attagalatta.com/admin/uploads/events/2142861459.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T14:22:00+05:30",
    "endDate": "2025-03-09T17:55:00+05:30"
  },
  {
    "name": "Gond Art Workshop - Art Workshop",
    "description": "India has a rich tradition of folk arts. The custodians of which are the many tribes that live in the interiors of various states. The Gonds, are the largest Adivasi Community in India and are Dravidian's whose origin can be traced to the pre-Aryan era. They are mainly found in Madhya Pradesh and its surrounding States. The word Gond comes from the Dravidian expression kond, meaning green mountain. In the Gond belief system, besides Bara Deo (Great God), every hill, river, lake, tree, and rock is inhabited by a spirit and therefore sacred. Gond paintings are fascinating, where the artists express their faiths and beliefs, world view, their visual expression and sense of identity, both as a collective, and as individuals. The motifs are further associated with the rich repertoire of the community and strongly show the interactions with the cosmic, natural and social worlds of humans at multiple levels and contexts. Participate in the Gond Painting Workshop, get a chance to appreciate the art form and create you very own Gond Art masterpiece on cartridge sheets with acrylic colours.\nTake away: One complete painting A3 size",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT985",
    "image": "https://attagalatta.com/admin/uploads/events/401686507.png",
    "performer": "Trishna Patnaik",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-03-09T16:00:00+05:30",
    "endDate": "2025-03-09T19:00:00+05:30"
  },
  {
    "name": "Loud Women - One Minute Theatre Festival 2025",
    "description": "Loud Women is a collection of 35 one-minute pieces performed by 25 women.\nPrepare to ponder, laugh and be entertained!\nCome celebrate Women’s Day with us!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1007",
    "image": "https://attagalatta.com/admin/uploads/events/1379779768.png",
    "performer": "Anita Mithra",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T18:00:00+05:30",
    "endDate": "2025-03-09T19:30:00+05:30"
  },
  {
    "name": "Love Stories from Indian Heritage - Storytelling",
    "description": "Love stories aren’t only about the hero and heroine for love can rarely exist in isolation. Zealous messengers, art and music as mood enhancers, food as aphrodisiacs, taboos and mores – all play a pivotal role in shaping stories of love. Vikram Sridhar and Aparna Jaishankar rummage through the passages of time to bring you various hues of love etched in our heritage through literature, architecture, songs and poetry through the all- encompassing art form of oral storytelling.\nAbout Aparna Jaishankar\nAparna Jaishankar is a Storyteller with a penchant for Indic mythology. She believes that there is no ONE version of any story. Her storytelling performances take a contemporary view of ancient tales. Aparna also works with educators in developing learning perspectives in the classroom and with organisations in building internal narratives.\nAbout Vikram Sridhar \nVikram Sridhar is a Performance Storyteller and theatre practitioner who believes in Storytelling as a strong medium for Conservation and Conversation, which is highly relevant in the modern context. Vikram combines his work and interest in Theatre, Social Work, and Conservation in his Storytelling and has performed for audience of various age groups across India.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT974",
    "image": "https://attagalatta.com/admin/uploads/events/1610460200.png",
    "performer": "Aparna Jaishankar, \nVikram Sridhar,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-09T19:00:00+05:30",
    "endDate": "2025-03-09T20:00:00+05:30"
  },
  {
    "name": "Poetic Brew - Poetry Meetup",
    "description": "Gather, Poetic Souls, for an afternoon divine, where verses entwine and words intertwine. In this literary realm, hearts open wide, For a Poetry Meet, let passion be our guide.\nInviting all Poetry enthusiasts 📚 to an In-Person Meet where you can indulge in creative poetry writing and reading session. \nEvent Sections:\n1. Icebreaker Extravaganza - Intro yourself & let`s play an interesting fun Game to break ice cubes.\n2. Poet`s Spotlight: Write a poem based on an innovative prompt letting your thoughts engage.\n<-- INTERMISSION: CHILL & CHAT -->\n3. Recital Stage: Take center stage for 5-7 minutes, discuss the verse that`s touched your head. As you share your verse, let passion reign.\n4. Verse of the Month & What Lies Ahead - Vote for the next Poetry Book to read.\n5. Say Butter - Click that Snap button for a group picture.\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Voting for a Monthly Book Read.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolising the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT936",
    "image": "https://attagalatta.com/admin/uploads/events/769771471.png",
    "performer": "Your View On Books",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-15T11:11:00+05:30",
    "endDate": "2025-03-15T17:55:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "Join us for a cozy, creative space where you can unplug, connect, and just be. This meetup is all about chill vibes—no agenda, no pressure. 🖍️✨\nWhether it’s your first time or your fourth, come as you are—dive into your own project or simply soak up the wholesome atmosphere. Each meetup has brought inspiring moments and wonderful people, and we’re excited to share it all again! 💜\nThere are 15 spots available, and this meetup is exclusively for LGBTQIA+ folks. Neurospicy and neurotypical folks are all welcome. 🌈🎨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT878",
    "image": "https://attagalatta.com/admin/uploads/events/1136766814.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-03-16T14:00:00+05:30",
    "endDate": "2025-03-16T17:00:00+05:30"
  },
  {
    "name": "Chapter Carnival - Library Meetup",
    "description": "Atta Galatta and Your View On Books, A Novel Club cordially invite you to the latest Library Meetup in town.\nJoin us for a innovative Library Meet wherein there`s over hundreds of books and you could pick a book in random and start reading together.\nHave an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nCome along with Empty Minds and fill it with rich literature from Atta Galatta’s Reading Section.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nReading minimum one chapter from a random book that you choose from the libary.\nParticipating in the ensuing curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT991",
    "image": "https://attagalatta.com/admin/uploads/events/830714749.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-03-23T11:11:00+05:30",
    "endDate": "2025-03-23T14:22:00+05:30"
  },
  {
    "name": "Thus Spake Shoorpanakha, So Said Shakuni - Theatre Performance",
    "description": "The protagonists, a man and a woman, are both waiting for a delayed flight in a small-town airport lounge. The woman provokes the man into conversation, setting of a series of narratives that feature two characters from the Ramayana and the Mahabharata: Shoorpanakha and Shakuni. Their lives and experiences are set in the context of this century, indicating that the stories of power, ambition and revenge span history and myth.\nThis script was found in The Drama Library by the Bhasha Centre.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT997",
    "image": "https://attagalatta.com/admin/uploads/events/704698497.jpg",
    "performer": "Jimmy Xavier, \nPoile Sengupta, \nSamragni Dasgupta, \nUrvashi H. V. ,",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "TheatreEvent",
    "startDate": "2025-04-06T19:00:00+05:30",
    "endDate": "2025-04-06T20:00:00+05:30"
  }
]