[
  {
    "name": "50 Above Fifty – India’s Biggest Senior Talent Event - Talent Hunt",
    "description": "🪩 LIVE Auditions in Bengaluru! 🎶\n \nAre you 50+ and ready to showcase your talent? Your stage awaits! 🌟\nStep into the spotlight and take your first step towards becoming India's Senior Superstar at Khyaal’s 50 Above 50 – India’s biggest talent hunt for seniors!\n📍 Venue: Atta Galatta, Bengaluru\n🎭 Choose your category — Singing, Dancing, Poetry, Art, Storytelling, Comedy & more!\n🎁 Stand a chance to win exciting cash prizes\n💰 Registration Fee: ₹999 only\n🎉 Exclusive Benefits for Participants:\n✅ Nominate yourself in 2 or more award categories\n✅ Get 1-year FREE membership to the Khyaal Club — India’s largest club for seniors!\n📲 Register now and let your talent shine: https://forms.gle/Pi8gwH4es8uN56nFA\n💻 Pay online at www.50above50.com or at the venue.\n🔗 For more details about the different categories, visit: https://www.50above50.com/categories",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1228",
    "image": "https://attagalatta.com/admin/uploads/events/1032048134.jpeg",
    "performer": "Khyaal",
    "keywords": [
      "Talent Hunt",
      "Talent Hunt"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-15T11:00:00+05:30",
    "endDate": "2025-06-15T18:00:00+05:30"
  },
  {
    "name": "Funkaar - Art Workshop for Adult Beginners",
    "description": "✨ Introducing FUNKAAR ✨\nA heartfelt initiative by me Naheed - Educator, Artist and Art Therapy Facilitator.\nFunkaar is my way of sharing art not just as an activity, but as a way of life. A space where observation, and self-awareness come together through thoughtfully designed, ability-based creative experiences. 💫\nWhether you're looking to relax, explore your creativity, or build stronger interpersonal and reasoning skills - Funkaar is here to hold space for you.\nItems to be brought by participants:\nArt paper or sketch book\nPencil\nEraser\nSharpener\nSome cotton wool or a small piece of cotton cloth",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1241",
    "image": "https://attagalatta.com/admin/uploads/events/754597810.jpg",
    "performer": "Naheed",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-06-15T11:00:00+05:30",
    "endDate": "2025-06-15T12:30:00+05:30"
  },
  {
    "name": "Hale Bottlee Hosa Wine – Episode 8: Contemporary Kannada Writing in the Thriller Genre - Kannada Literature Program",
    "description": "Hale Bottlee Hosa Wine – Episode 8\nTheme: Contemporary Kannada Writing in the Thriller Genre\r\n📍 Location: Atta Galatta\r\n📅 Date & Time: 15.06.2025 & 11:00 hrs morning\r\n🎟️ Entry: Free entry\nThe 8th edition of Hale Bottlee Hosa Wine continues its unique mission of bridging generations of Kannada writers by bringing contemporary and senior voices onto one dynamic stage. Each episode of this evolving literary series explores a distinct genre, sparking conversations across styles, sensibilities, and storytelling traditions.\n \nIn this episode, the spotlight is on Kannada thriller writing—a genre that spans political thrillers, mysteries, murder mysteries, science fiction, and medical sci-fi. Join us for an electrifying evening as some of the most exciting contemporary voices in Kannada literature delve into the craft of suspense and intrigue.\n \nFeaturing:\n\nKoushik Kooduraste – Known for his gripping political thrillers and genre-bending narratives\nBhageeratha – A master of layered mystery and dark psychological fiction\nDeeraj Poyyekenda – A bold new voice in speculative and science-based storytelling\n\nThe discussion will be moderated by Dr. Shantala, one of the finest female writers in the realm of medical fiction, whose deep understanding of both medicine and narrative craft promises to bring rich insight to the conversation.\nCome be a part of this literary exploration—where hale bottlee meets hosa wine, and timeless storytelling finds new flavor in thrilling forms.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1247",
    "image": "https://attagalatta.com/admin/uploads/events/790330125.jpeg",
    "performer": "Bhageeratha, \nDeeraj Poyyekenda, \nDr. Shantala, \nKoushik Kooduraste,",
    "keywords": [
      "Literary Discussion",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-15T11:00:00+05:30",
    "endDate": "2025-06-15T13:00:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "No agenda. No icebreakers. Just a cozy space, kind people, and time to just be—draw, journal, knit, doodle, zone out... whatever feels good. 💭🖍\nWe’ll have some optional art stuff, quiet corners, and probably a bit of wholesome chaos too. Bring a project or just bring yourself. That’s more than enough.\nThis space is exclusively for LGBTQIA+ folks. We haven’t opened it up to allies just yet—thank you for understanding. 🏳‍🌈\n🌈 Spots are limited—sign up!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1119",
    "image": "https://attagalatta.com/admin/uploads/events/1673568880.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-06-15T14:00:00+05:30",
    "endDate": "2025-06-15T17:00:00+05:30"
  },
  {
    "name": "Messy Hands Workshop - Clay Modelling Workshop",
    "description": "Clay is always the best medium to describe. So let's not worry about being dirty and get your hands messy in the pottery workshop. Let’s enjoy the beautiful gift of Mother Earth and let your kids have fun and dirty. This one-day pottery workshop is a great way to connect back to nature and tick your bucket list. Learn from experts how you can handle any clay in the best possible way. This class will feature demonstration of material, tools and process. In this unique workshop you learn:\n\nHandbuilding techniques like pinching and coiling.\nLearn how clay can be shaped into animals and creatures.\nGet the use of minimal tools to create wonders.\nWork with best quality terracotta clay.\n\nNothing needs to be carried. We provide all the tools and materials.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1236",
    "image": "https://attagalatta.com/admin/uploads/events/625066248.png",
    "performer": "Motley Roots",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-06-15T17:00:00+05:30",
    "endDate": "2025-06-15T19:00:00+05:30"
  },
  {
    "name": "Dance Yoga Fusion Workshop - Yoga and Dance Workshop for Teens and Adults",
    "description": "Dance - Yoga Fusion Workshop \nWhere Dance Meets Mindfulness \n*Celebrate International Yoga Day with a Unique Fusion Experience! 🌟*\nCalling all dance lovers and yoga enthusiasts! 🧘‍♂️💃\nJoin our beginner-friendly Dance Yoga Workshop, where music meets movement and ancient yogasanas come alive through dance.\n*Is this for you? 🤔*\n- Do you love music and want to move to the beat?\n- Are you curious about exploring yogasanas through dance?\n- Do you want to try something new and fun?\n*Then join us! 🎉*\n*Who can attend? 🌟*\n- Anyone curious about yoga\n- Dance enthusiasts\n- Music lovers\n- Adventurous souls looking to try something new\n*Benefits: 🌈*\n- Reap all the benefits of yoga\n- Have fun dancing to the rhythm\n- Get a great body-mind workout\n*Details: 📝*\n- Age: Teens & Adults\n- Bring: Your yoga mat\n- Wear: Comfortable clothes for free movement\n*Let`s dance, breathe, and unite! 🙏\nJoin us for an unforgettable experience that will leave you feeling energized, relaxed, and connected! 🌟",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1246",
    "image": "https://attagalatta.com/admin/uploads/events/750632998.png",
    "performer": "Dr. Meghna Vohra",
    "keywords": [
      "Yoga",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-06-15T17:00:00+05:30",
    "endDate": "2025-06-15T18:00:00+05:30"
  },
  {
    "name": "An Evening of Magic - Magic Show",
    "description": "An Evening of Magic is a most amazing magic show presented by `Nakul Shenoy & Friends’, featuring top entertainers and magic acts. Curated and hosted by the internationally-acclaimed mentalist Nakul Shenoy, each event in this series brings unique acts and performances by nationally and internationally acclaimed magicians, alongside some of the most notable up-and-coming stars of magic. This is an evening that is truly magical, and one you will want to experience many times over.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1244",
    "image": "https://attagalatta.com/admin/uploads/events/962160232.jpg",
    "performer": "Nakul Shenoy",
    "keywords": [
      "Magic",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-15T18:00:00+05:30",
    "endDate": "2025-06-15T19:00:00+05:30"
  },
  {
    "name": "Death of a Cult Leader - An Immersive Crime Solving Experience",
    "description": "25 suspects. 1 murder. 1 culprit. 🗡️\nDeath of a Cult Leader is a jaw-dropping murder mystery game by best-selling author, Varun Gwalani — and you’re invited to solve it! 🕵️\nIn this unique murder mystery game, you'll discover, decode, and deduce the true nature of the case you've been called to solve, and find out the murderer amongst you! 😱\nThe clues and red herrings are endless, but there can only be one killer and one motive. 👤\nGather your wits, trust no one, and prepare for an unforgettable night!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1245",
    "image": "https://attagalatta.com/admin/uploads/events/1630155699.jpeg",
    "performer": "Varun Gwalani",
    "keywords": [
      "Crime Fiction",
      "Roleplay"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-15T18:30:00+05:30",
    "endDate": "2025-06-15T19:30:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-17T17:00:00+05:30",
    "endDate": "2025-06-17T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-17T19:00:00+05:30",
    "endDate": "2025-06-17T18:00:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nJune Read: Following Fish by Samanth Subramanian\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1216",
    "image": "https://attagalatta.com/admin/uploads/events/1926618741.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Food",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-21T11:00:00+05:30",
    "endDate": "2025-06-21T13:00:00+05:30"
  },
  {
    "name": "Dum Dama Dum - Children's Theatre and Reading Festival",
    "description": "The Theatre and Reading festival Dum Dama Dum by Atta Galatta that began in 2017 unites two beautiful things in a child’s life, the love for drama and love for reading. The festival will have plays for children and families from various renowned theatre groups while on another level they can enter into a world of books from their favourite authors and publishers.\nThe Day Pass includes access to all scheduled plays. Final lineup TBA\nAdults and children require tickets.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1230",
    "image": "https://attagalatta.com/admin/uploads/events/2101298072.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Childrens Theatre",
      "Performance"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2025-06-21T11:00:00+05:30",
    "endDate": "2025-06-21T18:00:00+05:30"
  },
  {
    "name": "Tales of Tenali Rama - Theatre Performance for Kids",
    "description": "Tenali Rama and his tales are an evergreen part of everyone’s childhood. Growing with the stories of Tenali Rama and his ‘adventures’ in the court of Krishna Deva Raya kept children and adults rolling with laughter. BLT brings these beloved stories alive in a unique 2 people storytelling platform. Come and get tickled. Laugh with us.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1253",
    "image": "https://attagalatta.com/admin/uploads/events/196273114.jpeg",
    "performer": "Bangalore Little Theatre",
    "keywords": [
      "Childrens Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-21T11:00:00+05:30",
    "endDate": "2025-06-21T12:00:00+05:30"
  },
  {
    "name": "Just for Laughs - Children’s Interactive Theatre Performance",
    "description": "\"Just for laughs\" is a collection of gags/ short acts that include a variety of funny stories composed with the audience present.  Each gag is based on a different act and is around 5-10 minutes long. There will laughter tricks, a lot of physicality that will make the kids go awed.\nCast: Prithesh, Siddharth, Sumayya, Aiena, Darshan.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1252",
    "image": "https://attagalatta.com/admin/uploads/events/1505676654.png",
    "performer": "Bhandutvas",
    "keywords": [
      "Theatre",
      "Interactive Theatre Performance"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2025-06-21T15:00:00+05:30",
    "endDate": "2025-06-21T16:00:00+05:30"
  },
  {
    "name": "The Monster Who Could Not Climb A Tree - Puppet Show",
    "description": "This performance delves into the emotions of a 9-year-old boy, Avi. He has issues with anger, which only becomes worse when he learns that his parents have adopted a 3-year-old girl Neha. He has personified his anger as a Monster. He later learns that he can escape his Monster by climbing a tree. He feels emotions at a high intensity, but he is not sure how to deal with them. He is still exploring his emotions, while adapting to new changes. Although climbing a tree is not the ultimate solution for his issues. How does Avi learn to deal with his Monster? Does the Monster ever go away?",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1254",
    "image": "https://attagalatta.com/admin/uploads/events/655512695.png",
    "performer": "Story Quilt",
    "keywords": [
      "Childrens Theatre",
      "Puppet Show"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-21T17:00:00+05:30",
    "endDate": "2025-06-21T18:00:00+05:30"
  },
  {
    "name": "It’s Not You, It’s Me – Spilling the Situationship Tea - Theatre Performance",
    "description": "Get ready for an evening that’s equal parts laughter, nostalgia, and heart!\nJoin us as we unpack the beautiful mess of situationships, heartbreaks, and modern-day romance, all inspired by true stories from our actors’ lives. From ghosting to grand gestures, dating apps to old-school love letters — this performance is a rollercoaster through the ages of love.\nWhether you're a hopeless romantic or just romantically hopeless, this show has something for everyone.\nDate: 21st June (Saturday)\nTime: 6:30 PM to 7:30 PM\nVenue: Atta Galatta, Indiranagar\nCome fall in (and out of) love with us — one story at a time. ❤\nSeats are limited – don’t miss it!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1237",
    "image": "https://attagalatta.com/admin/uploads/events/1736112148.jpg",
    "performer": "Yours Truly Theatre",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "TheatreEvent",
    "startDate": "2025-06-21T18:30:00+05:30",
    "endDate": "2025-06-21T19:30:00+05:30"
  },
  {
    "name": "Love Stories from Indian Heritage - A Late Evening Story Time for Adults",
    "description": "Love stories aren’t only about the hero and heroine for love can rarely exist in isolation. Zealous messengers, art and music as mood enhancers, food as aphrodisiacs, taboos and mores – all play a pivotal role in shaping stories of love. Vikram Sridhar and Aparna Jaishankar rummage through the passages of time to bring you various hues of love etched in our heritage through literature, architecture, songs and poetry through the all- encompassing art form of oral storytelling.\nAbout Aparna Jaishankar\nAparna Jaishankar is a Storyteller with a penchant for Indic mythology. She believes that there is no ONE version of any story. Her storytelling performances take a contemporary view of ancient tales. Aparna also works with educators in developing learning perspectives in the classroom and with organisations in building internal narratives.\nAbout Vikram Sridhar \nVikram Sridhar is a Performance Storyteller and theatre practitioner who believes in Storytelling as a strong medium for Conservation and Conversation, which is highly relevant in the modern context. Vikram combines his work and interest in Theatre, Social Work, and Conservation in his Storytelling and has performed for audience of various age groups across India.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1210",
    "image": "https://attagalatta.com/admin/uploads/events/1977254080.png",
    "performer": "Aparna Jaishankar, \nVikram Sridhar,",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-21T19:00:00+05:30",
    "endDate": "2025-06-21T20:00:00+05:30"
  },
  {
    "name": "Storywalk Through Indiranagar - Story Walk",
    "description": "On a Sunday morning, walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore, Heritage and Ecology of the area. The walk will begin and culminate at ATTA GALATTA. The tales will revolve around historical, mythical and personal narratives weaved as we discover the area through the walk.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1188",
    "image": "https://attagalatta.com/admin/uploads/events/372238875.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-22T07:00:00+05:30",
    "endDate": "2025-06-22T09:30:00+05:30"
  },
  {
    "name": "Meet and Reparent - Wellness Workshop",
    "description": "✨ For the part of you that still longs to be seen, heard, and loved... ✨\nJoin us for a gentle, 2-hour journey to reconnect with your inner child — the tender, playful, and wise part of you that still lives within\nIn this guided workshop, we will:\n🫂 Explore the concept of the inner child & reparenting\n🌿 Create a safe space for reflection and healing\n🌀 Engage in guided practices to connect with your inner child\n🎨 Use art to integrate your experience\nNo prior experience needed — just an open heart and curiosity. This is your space to soften, slow down, and come home to yourself💜\n📅 22nd June (Sunday)\n🕚 11 AM – 1 PM\n📍 Atta Galatta, Bangalore\nAanchal Sharma is a psychotherapist with over three years of experience supporting young adults and adults in navigating life’s challenges.\r\nShe holds an MSc in Psychology from Queen Mary University of London, along with certifications in Hypnotherapy, Neurolinguistic Programming (NLP), and Timeline Therapy. She is also well-trained in Emotional Freedom Technique (EFT) and Inner Child Work.\nCo facilitator Jade (they/them),\nArtist and community support spaces/meetup facilitator",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1232",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Aanchal Sharma, \nJade,",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-06-22T11:00:00+05:30",
    "endDate": "2025-06-22T13:00:00+05:30"
  },
  {
    "name": "Learn Tarot in One Hour - Workshop",
    "description": "Join us for a transformative and interactive Tarot workshop led by Anuradha Shukla, author of the book The Intuitive Edge: A DIY Tarot Guide for Smarter Decisions in Love and Business.\nIn this power-packed one-hour session, you'll unlock the basics of Tarot, learn to connect with your inner wisdom, and even perform your first self-reading—no prior experience needed!\nWhether you're navigating love, work, or life changes, this session will empower you with a tool that blends mindfulness, symbolism, and intuition. Expect meaningful insights, hands-on card reading, and a fresh perspective on decision-making.\nWhat You’ll Experience:\n\nA quick yet powerful introduction to the Tarot deck\nLearn how to do a 3-card reading\nDecode symbols and trust your intuition\nGet a Tarot cheat sheet\n\nLimited seats. Reserve yours now and take the first step on your intuitive journey.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1239",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Anuradha Shukla",
    "keywords": [
      "Tarot Reading",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-06-22T12:30:00+05:30",
    "endDate": "2025-06-22T13:30:00+05:30"
  },
  {
    "name": "Read A Kitaab - Monthly Book Club",
    "description": "📚✨ Bangalore, we’re back! ✨📚\nJoin the Read A Kitaab community for our June Meetup. Let’s talk books, swap stories, and dive into the question we love asking — What are you reading? 💬\n🗓️ Date: Sunday, 22nd June\n⏰ Time: 4 PM to 6 PM\n📍 Venue: Atta Galatta, Indira Nagar\n🎟️ Entry is FREE but registration is a must!\n💬 DM us or ping on WhatsApp at 9082076420 to save your spot.\nBring your current reads, your bookish banter, and your coffee-loving selves! ☕📖",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1248",
    "image": "https://attagalatta.com/admin/uploads/events/1240450922.jpeg",
    "performer": "Anurag Kothari, \nEkta Bhandari,",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-22T16:00:00+05:30",
    "endDate": "2025-06-22T18:00:00+05:30"
  },
  {
    "name": "Queer Films & Feels - An Arts-Based Therapeutic Exploration of Queer Cinema",
    "description": "2 films, 2 therapists and 1 wholesome evening of queer conversations.\n\r\nJoin us in watching Desi Queer Films together:\r\n🗓️: 22nd June (Sunday)\r\n⏰: 4:00-5:30PM\r\n📍: Atta Galatta, Indiranagar\nWe are bringing two Kashish film festival nominations to Bangalore. Let’s come together to witness the work of Phelian and Soumyajit on the big screen.\n\r\nQueer films are a means of dialogue and emotional expression. So Shibili and I are collaborating to invite you to feel your feelings as we watch these films together. Let’s watch, create, eat and chat! Happy Pride to us all 🏳️‍🌈",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1250",
    "image": "https://attagalatta.com/admin/uploads/events/508057721.png",
    "performer": "Here Hear Therapy",
    "keywords": [
      "Films",
      "Film Screening"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-22T16:00:00+05:30",
    "endDate": "2025-06-22T17:30:00+05:30"
  },
  {
    "name": "Kuuk Aah? & Moda Moda - Screening of Two Films",
    "description": "Toto Funds the Arts & Atta Galatta are delighted to invite you to a screening of two short films by M.K. Abhilash, filmmaker, music producer and poet.  Abhilash will be in conversation with Srikanth Srinivasan, film critic and programmer.\nAbout the speakers:\nBorn on January 5, 1997, MK Abhilash is a filmmaker, music producer, and poet. His film Moda, Moda was shortlisted for the TOTO Award for Short Film 2025, while Kuuk Aah? was longlisted the previous year. He is part of Neelavarana, a Bangalore-based counter-culture collective that showcases Dalit-Bahujan aesthetics and narratives of the region.\nSrikanth Srinivasan is a film critic and programmer from Bangalore. His first book, Modernism by Other Means, published by Lightcube in New Delhi in 2021, is devoted to the films of Indian filmmaker Amit Dutta. Dutta is the director of the film Nainsukh (2010), which is the subject of Srikanth's second book, Still Lives, Moving Images, published by Museum Rietberg Zurich in 2023.\nWe hope to see you there!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1255",
    "image": "https://attagalatta.com/admin/uploads/events/1119401621.jpg",
    "performer": "M. K. Abhilash, \nToto Funds the Arts,",
    "keywords": [
      "Film",
      "Screening"
    ],
    "@type": "ScreeningEvent",
    "startDate": "2025-06-22T17:30:00+05:30",
    "endDate": "2025-06-22T18:30:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-24T17:00:00+05:30",
    "endDate": "2025-06-24T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-24T19:00:00+05:30",
    "endDate": "2025-06-24T18:00:00+05:30"
  },
  {
    "name": "Video Games: Lila / Maya - Magazine Launch",
    "description": "Video Games: Lila/Maya explores the rise of video games in India—their aesthetics, narratives, and the concerns of those who make them. It also looks at the interface of video games with theatre and cinema. Games are rapidly changing, and with them the definition of what a game is and what a game can do. From sweatshops which handled the back-end development of western AAA titles, to independent studios and artists that are increasingly embedding their work within the sociocultural and political milieus of the subcontinent—this pioneering volume, brings together the richness of their visual work with critical studies on where we stand in the field of video games in India.\nJoin Souvik Mukherjee, the Guest Editor of Video Games: Lila/Maya, Padmini Ray Murray, Founder of Design Beku, and Prabhash Tripathy, PhD scholar at JNU, for an insightful conversation on Video Games in India—their past, present and future.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1223",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "The Marg Foundation",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-27T19:00:00+05:30",
    "endDate": "2025-06-27T20:00:00+05:30"
  },
  {
    "name": "Handbuilding Pottery - Experience Workshop",
    "description": "Unleash your creativity and connect with clay in a calming, hands-on session by Maralu Earth!\nJoin us for a 2-hour immersive workshop where you’ll explore the art of hand-building pottery. Perfect for beginners and hobbyists alike, this session will guide you through the basics of working with clay — from shaping to finishing — in a warm, welcoming space.\nUnder our guidance, you’ll create your own ceramic pieces to cherish.\nWorkshop Highlights:\n• Create a keepsake miniature and a functional ceramic piece\n• Hands-on, personalized instruction throughout\n• All materials provided (tools, clay, and more)\n• Your creations will be fired and returned (shipping extra if needed)\n• Relaxing, mindful environment in the heart of the city\nNo prior pottery experience needed. Just bring your curiosity and a willingness to get your hands a little muddy!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1240",
    "image": "https://attagalatta.com/admin/uploads/events/833623.png",
    "performer": "Deepti Krishnan, \nMaralu Earth,",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-06-28T11:00:00+05:30",
    "endDate": "2025-06-28T13:00:00+05:30"
  },
  {
    "name": "Chapters Unsealed - Book Club",
    "description": "Atta Galatta and Your View on Books cordially invite you to the latest Bibliophile Meetup in town.\nJoin us for an enriching evening of literary discussion and camaraderie at our Book Club Meet event! Whether you`re a seasoned bibliophile or just discovering the joy of reading, all are welcome to share their insights, opinions, and favorite passages. Engage in lively conversations, exchange recommendations, and bond over our mutual love for literature. Don`t miss out on this opportunity to connect with fellow book enthusiasts and expand your literary horizons!\nBring along your favorite book and delve into a shared reading experience.\nWhat does it entail?\n- Involving in an ice breaker extravagant game.\n- Sharing your views on favorite books.\n- Participating in the curated discussion.\n- Discussing a Curated Monthly Book Read.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nEvent Sections:\n1. Icebreaker Extravaganza - Intro yourself & let's play an interesting fun Game to break ice cubes.\n2. Book Spotlight: This is your time to shine! Take the stage for 5-7 minutes and share your insights, thoughts, and love for any book. No slides required – just bring your passion and captivate your audience.\n       INTERMISSION: CHILL & CHAT\n3. Monthly Book Discussions - We will discuss about the books that were on vote list in previous CU and also vote for a new book to discuss in the next meet.\n4. Awards Galleria - A Surprising session for the participants.\n5. Say Butter - Click that Snap button for a group picture.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1206",
    "image": "https://attagalatta.com/admin/uploads/events/325929322.png",
    "performer": "Your View On Books",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-28T11:11:00+05:30",
    "endDate": "2025-06-28T14:22:00+05:30"
  },
  {
    "name": "50 Above Fifty – India’s Biggest Senior Talent Event - Talent Hunt",
    "description": "🪩 LIVE Auditions in Bengaluru! 🎶\n \nAre you 50+ and ready to showcase your talent? Your stage awaits! 🌟\nStep into the spotlight and take your first step towards becoming India's Senior Superstar at Khyaal’s 50 Above 50 – India’s biggest talent hunt for seniors!\n📍 Venue: Atta Galatta, Bengaluru\n🎭 Choose your category — Singing, Dancing, Poetry, Art, Storytelling, Comedy & more!\n🎁 Stand a chance to win exciting cash prizes\n💰 Registration Fee: ₹999 only\n🎉 Exclusive Benefits for Participants:\n✅ Nominate yourself in 2 or more award categories\n✅ Get 1-year FREE membership to the Khyaal Club — India’s largest club for seniors!\n📲 Register now and let your talent shine: https://forms.gle/Pi8gwH4es8uN56nFA\n💻 Pay online at www.50above50.com or at the venue.\n🔗 For more details about the different categories, visit: https://www.50above50.com/categories",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1228",
    "image": "https://attagalatta.com/admin/uploads/events/1032048134.jpeg",
    "performer": "Khyaal",
    "keywords": [
      "Talent Hunt",
      "Talent Hunt"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-28T16:00:00+05:30",
    "endDate": "2025-06-28T18:00:00+05:30"
  },
  {
    "name": "Crisp Creation - Cooking Workshop for Kids",
    "description": "This workshop titled, “Crisp Creations” connects children to fireless cooking and to bring not just their hands, but their hearts and art to healthy eating while they whip up delicacies interestingly. It is a two-hour engagement that aims at building a relationship with Conscious food and its consumption.\nThis workshop helps children who face the challenge of balancing nutrition with taste - which is often the only thing children care about! It aims at helping children to be more informed & connected to what they eat. The workshop shares the authors experience in creating delicious menus & even snacks which children gobble up.\nPassionate about creating tasty and healthy food, Santhilakshmy's journey started 25 years ago taking her to schools & educational forums as an advocate of tasty & nutritious meals, making a case for understanding our food better. Her background as a science teacher, parent & enthusiastic chef helps lend credibility to the meals she whips up. Testimony to this commitment is the sustainable & organic kitchens she created at some Schools in Bangalore.\nSanthilakshmy has been communicating on topics such as Millets in Your Daily Meals, Holistic Nutrition and Conscious Kitchen. Through her work, Santhilakshmy actively campaigns for our need to return focus to our habits, myths & fads, tradition, flavours & sustainability of culinary practices in India. She recently authored the book “Windows to Mindful Eating” that carefully combines these thoughts in words and coloured illustrations to stimulate the minds of adults and children alike.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1251",
    "image": "https://attagalatta.com/admin/uploads/events/239365757.png",
    "performer": "A. Santhilakshmy",
    "keywords": [
      "Food",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-06-28T16:00:00+05:30",
    "endDate": "2025-06-28T18:00:00+05:30"
  },
  {
    "name": "Celebrate World Localization Day! - Film Screening",
    "description": "In celebration of World Localization Day, foodwize invites you to a special screening of Planet Local: A Quiet Revolution. This powerful film highlights community-led solutions, featuring voices like Jane Goodall, Noam Chomsky and Naomi Klein. It’s a tribute to the quiet revolution happening worldwide through local food, economies and resilience. Stay back after the film for an open space to reflect and share stories.\nTrailer: https://youtu.be/3VKoisJfADM?si=Ycuh-tgdu5SYBtqm",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1258",
    "image": "https://attagalatta.com/admin/uploads/events/1785071919.jpg",
    "performer": "foodwize",
    "keywords": [
      "Ecology",
      "Film Screening"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-28T18:30:00+05:30",
    "endDate": "2025-06-28T20:30:00+05:30"
  },
  {
    "name": "50 Above Fifty – India’s Biggest Senior Talent Event - Talent Hunt",
    "description": "🪩 LIVE Auditions in Bengaluru! 🎶\n \nAre you 50+ and ready to showcase your talent? Your stage awaits! 🌟\nStep into the spotlight and take your first step towards becoming India's Senior Superstar at Khyaal’s 50 Above 50 – India’s biggest talent hunt for seniors!\n📍 Venue: Atta Galatta, Bengaluru\n🎭 Choose your category — Singing, Dancing, Poetry, Art, Storytelling, Comedy & more!\n🎁 Stand a chance to win exciting cash prizes\n💰 Registration Fee: ₹999 only\n🎉 Exclusive Benefits for Participants:\n✅ Nominate yourself in 2 or more award categories\n✅ Get 1-year FREE membership to the Khyaal Club — India’s largest club for seniors!\n📲 Register now and let your talent shine: https://forms.gle/Pi8gwH4es8uN56nFA\n💻 Pay online at www.50above50.com or at the venue.\n🔗 For more details about the different categories, visit: https://www.50above50.com/categories",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1228",
    "image": "https://attagalatta.com/admin/uploads/events/1032048134.jpeg",
    "performer": "Khyaal",
    "keywords": [
      "Talent Hunt",
      "Talent Hunt"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-29T11:00:00+05:30",
    "endDate": "2025-06-29T18:00:00+05:30"
  },
  {
    "name": "Mahabharata Magic: Draw Your Imagination! - A Mythology-Inspired Drawing Competition for Kids",
    "description": "🎨 \"Mahabharata Magic: Draw Your Imagination!\" 🌟\nA Mythology-Inspired Drawing Competition for Kids!\nJoin us for a delightful day where stories come alive and little hands bring epic tales to paper! ✨\n📚 Hosted by Ankita Aggarwal, author of children's book Mahabharata - Stories of Valor and Virtue, this unique event will begin with a short, engaging storytelling session from her book — retelling the grand Indian epic in a way that's fun, friendly, and perfect for young minds.\n🖍️ After the story, kids will get to draw scenes, characters, or anything inspired by the world of Mahabharata!\n🎨 Age Categories:\nTiny Artists (3–5 years)\nYoung Creators (6–8 years)\nJunior Illustrators (8+ years)\n🏆 Exciting prizes, lots of creativity, and a mythological adventure await!\n📍Atta Galatta, Indiranagar\r\n📋 Bring your own arts and crafts materials!\nChoose from the following time slots - 11 AM, 2 PM or 4 PM - and let your child’s imagination meet India’s greatest epic!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1231",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Ankita Aggarwal",
    "keywords": [
      "Drawing",
      "Competition"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-29T11:00:00+05:30",
    "endDate": "2025-06-29T18:00:00+05:30"
  },
  {
    "name": "Pebble Painting - Painting Workshop",
    "description": "Get ready for a colorful Sunday morning filled with creativity and joy! Join us for a Pebble Painting Workshop designed especially for kids aged 6 to 14 years.\nHeld at the warm and welcoming Atta Galatta, Bangalore, this hands-on session will take place on Sunday, 29th June, at 11 AM. Kids will explore their creativity by transforming simple pebbles into vibrant works of art. Guided by a passionate art instructor, the workshop encourages self-expression, fine motor skill development, and lots of fun!\nWhether your child loves doodling or is just discovering the joys of art, this workshop is the perfect weekend activity. All materials will be provided, and each little artist will take home their painted pebble masterpieces.\nCome join us and let your child experience the joy of painting, storytelling, and making art they can proudly display or gift!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1257",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Nandita NK",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-06-29T11:00:00+05:30",
    "endDate": "2025-06-29T13:00:00+05:30"
  },
  {
    "name": "Screen Craft - Screenplay Writing Workshop",
    "description": "Atta Galatta and MWM MOVIES cordially invite you to the latest Screenplay Writing Workshop in town. \nOur Screenplay Writing workshop is an intensive program designed to guide aspiring screenwriters through the process of crafting compelling and marketable screenplays. This workshop provides participants with a solid foundation in screenplay structure, character development, dialogue writing, and industry-standard formatting, ensuring they are equipped to bring their stories to life on the big screen.\nWho Should Attend?\nThis workshop is ideal for beginners with little to no screenwriting experience, as well as intermediate writers looking to refine their skills. It is also suitable for novelists, playwrights, or anyone interested in exploring the craft of screenwriting.\nWorkshop Objectives:\n- To introduce participants to the fundamentals of screenplay writing.\n- To develop participants` skills in creating engaging plots and well-rounded characters.\n- To enhance participants` abilities to write effective dialogue and visual storytelling.\n- To familiarize participants with the screenplay industry and submission processes.\nKey Components involves learning theory and practicals of: \n- Story and Character Development\n- Screenplay Structure\n- Dialogue Writing\n- Scene Construction\n- Visual Storytelling\n- Formatting and Style\nWhat does it entail:\n- Involving in an ice breaker extravagant game.\n- Writing a story based on a prompt.\n- Participating in the curated feedback discussion.\n- Following community guidelines.\nCommunity Guidelines:\n- Be open, be civil, be courteous, be kind, and have fun.\n- Listen more. Speak mindfully.\n- No monopolizing the conversation.\nDisclaimer on Event Coverage:\n- Event highlights will be captured through photos and videos for showcasing the event in our social media accounts.\n- All Event media will be shared with the participants upon request.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1207",
    "image": "https://attagalatta.com/admin/uploads/events/381927883.png",
    "performer": "Maddie Dawson",
    "keywords": [
      "Film",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-06-29T13:11:00+05:30",
    "endDate": "2025-06-29T16:44:00+05:30"
  },
  {
    "name": "Explore the Magic of Paper Quilling! - Paper Quilling Workshop",
    "description": "Join us for a fun and creative Underwater Paper Quilling Workshop at Atta Galatta, Bangalore, on Sunday, 29th June at 5:00 PM! Designed especially for children aged 8 and above, this hands-on session introduces the beautiful art of paper quilling in a fun, beginner-friendly way.\nParticipants will learn to roll, shape, and arrange colorful paper strips to create an enchanting underwater scene filled with fish, turtles, seaweed, and more! The background painting will be premade, so kids can focus solely on the exciting process of quilling and assembling their aquatic artwork.\nNo prior experience is needed — just bring your creativity and curiosity! All materials will be provided, and each child will go home with their very own framed quilled masterpiece.\nWhether your child is an art lover or just looking to try something new, this workshop promises a relaxed, engaging, and imaginative evening. Limited seats available — book now and let the creativity flow!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1256",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Nandita NK",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-06-29T17:00:00+05:30",
    "endDate": "2025-06-29T19:00:00+05:30"
  },
  {
    "name": "Reincarnations - Improv Show",
    "description": "Prana, Energy, Life Force - every culture has a different name for it, but we all intuitively know what it is: the essence that makes up everything around us. Isn’t it fascinating that we’re all made up of the same stuff, yet each form looks so different? Inspired by the narrative storytelling technique of Indian epics, seemingly unrelated stories will weave in and out of each other, forming a wonderful tapestry of intertwined stories. After successful runs in Berlin, Stockholm and Hanoi, Improv Lore is pleased to bring its signature show “Reincarnations” to Bengaluru! Completely unscripted, this show promises the audience unexpected twists, a glimpse into other worlds and a reminder that every ending is just another beginning.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1238",
    "image": "https://attagalatta.com/admin/uploads/events/695869911.jpeg",
    "performer": "Improv Lore",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-06-29T18:00:00+05:30",
    "endDate": "2025-06-29T20:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-01T17:00:00+05:30",
    "endDate": "2025-07-01T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-01T19:00:00+05:30",
    "endDate": "2025-07-01T18:00:00+05:30"
  },
  {
    "name": "Creative Jam - Bangalore Edition - Offline Jam",
    "description": "An offline jam for people who want to create, express, and connect —outside of their 9 to 5.\nExpect 2 hours of:\n\nFun intros with strangers\nOpen mic for your hidden talents\nQuick creative challenges\nPromises to self\nReal conversations (not networking)\nExciting goodies\n\nNo big talks. No panels.\nJust people like you—figuring things out.\n📍 Atta Galatta, Bangalore\n📅 6th July\nDM 9779618662 for tickets.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1209",
    "image": "https://attagalatta.com/admin/uploads/events/1696404509.png",
    "performer": "The Outsiders",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2025-07-06T17:00:00+05:30",
    "endDate": "2025-07-06T19:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-08T17:00:00+05:30",
    "endDate": "2025-07-08T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-08T19:00:00+05:30",
    "endDate": "2025-07-08T18:00:00+05:30"
  },
  {
    "name": "Misled Towards Truth - Book Launch",
    "description": "Crime Thriller Author Rakhi Haridas to Introduce New Book MISLED Towards TRUTH at Atta Galatta, Bangalore\nLovers of mystery, thrillers, and powerful storytelling are in for an exciting evening as acclaimed author and leadership coach Rakhi Haridas unveils her latest crime thriller, MISLED Towards TRUTH. The book introduction and author conversation event will take place on 12th July, 2025, from 4 PM to 5 PM IST at the iconic literary hub Atta Galatta, Indiranagar, Bangalore.\nThis one-hour literary gathering promises not just a book launch, but a deep and intimate conversation with the author about the creative journey, writing process, and mysteries behind the mystery.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1220",
    "image": "https://attagalatta.com/admin/uploads/events/795418773.png",
    "performer": "Rakhi Haridas",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-12T16:00:00+05:30",
    "endDate": "2025-07-12T17:00:00+05:30"
  },
  {
    "name": "Deevara Chittara - Book Launch",
    "description": "Center for Revival of Indigenous Art (CFRIA) a Bengaluru non-profit presents its seminal work on Chittara: 'Deevara Chittara: the artform, the people, their culture', a significant milestone in the documentation and celebration of this indigenous folk art from Karnataka. The book brings out the essence of Malenad region's rich cultural heritage, of which Chittara is an integral part. Join us for the launch of this meticulously crafted coffee table book (Co-authors Geetha Bhat and Smitha Tumuluru, with photography by Smitha Tumuluru and publication design and illustrations by Namrata Cavale). Engage with artists from the Deevaru community and gain insights into their cultural practices. Witness a Deevaru artist use a natural fibre brush and bring a Chittara painting to life, to the accompaniment of live singing, and join in thought provoking conversations around artists, remuneration, eco-friendly crafts, the role of women and the future of art.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1242",
    "image": "https://attagalatta.com/admin/uploads/events/1633808864.jpg",
    "performer": "Center for Revival of Indigenous Art",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-12T17:30:00+05:30",
    "endDate": "2025-07-12T18:30:00+05:30"
  },
  {
    "name": "Let's Talk About Attraction and Relationships - Wellness Workshop",
    "description": "As we evolved, humans became heavily dependent on each other for well being, survival and safety. Communal living helped individuals experience safety, belongingness and pride over painful experiences of fear, loneliness and shame. Among the many interpersonal developments consequent to communal living was the complex decision making of selecting a mating partner or a long-term romantic partner. The workshop attempts to delineate the factors involved in an individual decision making process pertaining to finding a partner and how those factors play out once the relationship begins to unfold.\nWhat can you expect from the workshop?\nA discussion on how gender roles have changed and gender specific expectations have changed over the years\nDefining one’s value\nDiscussion on how one perceives one value/ and relevance to be in the context of society and family\nDiscussion on value acquired in family of origin (attachment-based value)\nDiscussion on value acquired among peers/society/communities based on attributes like intellect, physical looks, social status, financial resources\nDynamic interaction between these two different systems of value.\nDo we tend to enhance our value through associating with a certain partner and if so how much does that play into attraction?\nWhat is power and control in a relationship\nHow much does unresolved memories contribute to our concept of value\nIntroducing the concept of exile and critical self\nWhy do we tend to seek affection from those who have hurt us?\nDeeper discussion in to Anatomy of shame and how much it contributes to attraction\nRegular refreshments will be provided.\nThe workshop is organised by Dr Mathai Fenn, Dr Nimesh George And Dr Gokul Ratakonda, all of whom are practising psychotherapists and psychologists.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1235",
    "image": "https://attagalatta.com/admin/uploads/events/1048681934.png",
    "performer": "Gokul R. , \nMathai Fenn, \nNimesh George,",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-07-13T14:30:00+05:30",
    "endDate": "2025-07-13T19:30:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-15T17:00:00+05:30",
    "endDate": "2025-07-15T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-15T19:00:00+05:30",
    "endDate": "2025-07-15T18:00:00+05:30"
  },
  {
    "name": "Journaling Workshop - Slow Journaling Workshop",
    "description": "Best friending journaling – a slow workshop to meet your journal like a true friend!\nJoin us for a gentle, expressive 2-hour journaling workshop designed for anyone looking to slow down, reflect, and reconnect with themselves and others. This isn’t about writing neatly or every day. It’s about using art, words, scraps, sketches, and stories to find meaning in the mess.\nWhether you’re a fresh-in-the-city soul, a quiet creator, or simply someone rebuilding after a life shift, this space is for you.\nWe’ll explore creative prompts, memory-based journaling, and playful scrapbooking techniques to help you best-friend your journal, one page at a time.\n🗓 Date: Sunday, 20th July 2024\n🕑 Time: 2:30 p.m. to 4:30 p.m.\n📍 venue: Attata Galatta, Bengaluru\n💸 Ticket: ₹299 (includes a cup of filter coffee ☕)\n🧺 Bring: your journal, small keepsakes or scraps, memories and a curious heart\nNo journaling experience needed—just come as you are.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1249",
    "image": "https://attagalatta.com/admin/uploads/events/1480031105.png",
    "performer": "Yukti",
    "keywords": [
      "Journaling",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-07-20T14:30:00+05:30",
    "endDate": "2025-07-20T16:30:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-22T17:00:00+05:30",
    "endDate": "2025-07-22T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-22T19:00:00+05:30",
    "endDate": "2025-07-22T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-29T17:00:00+05:30",
    "endDate": "2025-07-29T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-29T19:00:00+05:30",
    "endDate": "2025-07-29T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-05T17:00:00+05:30",
    "endDate": "2025-08-05T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-05T19:00:00+05:30",
    "endDate": "2025-08-05T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-12T17:00:00+05:30",
    "endDate": "2025-08-12T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-12T19:00:00+05:30",
    "endDate": "2025-08-12T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-19T17:00:00+05:30",
    "endDate": "2025-08-19T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-19T19:00:00+05:30",
    "endDate": "2025-08-19T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-26T17:00:00+05:30",
    "endDate": "2025-08-26T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-26T19:00:00+05:30",
    "endDate": "2025-08-26T18:00:00+05:30"
  }
]