[
  {
    "name": "Picture Books, Soundscapes, and the Art of Wonder - A Workshop by Barkha Sharda",
    "description": "That Book Store is Goa’s only fully curated bookstore of subsidised and preloved books. Started in 2021 as an endeavour to make books more relatable and accessible to readers of all ages but their joy has been in bringing picture books to bring out the child in you.\nThe workshop focuses on bringing back our lost sense of wonder in an otherwise cluttered life using a combination of a soundscape and curated picture books to find each of us a story to take back and treasure.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1611",
    "image": "https://attagalatta.com/admin/uploads/events/550685776.jpg",
    "performer": "Barkha Sharda",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-14T11:30:00+05:30",
    "endDate": "2026-01-14T13:00:00+05:30"
  },
  {
    "name": "Bachelor’s Wife and Other Stories - Book Launch by Ashok Subramanian & Shweta Hitesh Joshi",
    "description": "Atta Galatta hosts the launch of Bachelor’s Wife and Other Stories, a literary collection that revisits the Ramayana from its margins—through unheard voices, unnamed women, and lives lived in the shadows of epic events.\nThe evening features an interactive Ramayana quiz, a dialogue with the authors, and a cover reveal, followed by a conversation with the Chief Guest, Anuradha Goyal—author, columnist, public speaker, and founder of IndiTales, known for her work on Indian temples, scriptures, and cultural memory.\nThe session invites readers to reflect on myth, silence, and storytelling—how epics endure not just through heroes, but through those who waited, watched, and lived alongside them.\nThe event concludes with an audience Q&A, followed by high tea and book signing.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1626",
    "image": "https://attagalatta.com/admin/uploads/events/128083769.jpeg",
    "performer": "Ashok Subramanian, \nShweta Hitesh Joshi,",
    "keywords": [
      "Books and Literature",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-14T16:00:00+05:30",
    "endDate": "2026-01-14T18:00:00+05:30"
  },
  {
    "name": "The Bold Chronicles - Book discussion by Sarita Mandanna",
    "description": "History isn’t just a record of the past — it’s an adventure waiting to be discovered.\nHow do you turn the past into something that feels urgent, immersive, and impossible to put down? The Bold Chronicles, a new historical-fiction series by Sarita Mandanna for middle-grade and older readers, begins with a simple belief: that history is not a dusty account, but a living, breathing story.\nPublished by Aleph Book Company, the series spans 2,500 years of India’s vast and layered past. Each book plunges readers into a completely different world — from ancient battlefields and spies moving through Alexander’s invading armies, to scientists racing against time in India’s space programme. Every title is a standalone adventure, allowing readers to jump into any point in history. At the centre of each story is an unlikely young hero or heroine, thrust into events far larger than themselves, where quick thinking, courage, and determination matter just as much as the forces shaping history.\nThe First Adventures:\nThe War Elephants of Trigarta is set on the eve of Alexander the Great’s advance into India. Mili, the daughter of a respected general, forms an unbreakable bond with Nathu, a rare white elephant. As empires collide and the Battle of Hydaspes between Alexander and Porus looms, Mili is drawn into a world of danger, strategy, and survival — where the fate of a kingdom may rest on her resolve.\nSecrets Among the Stars leaps into contemporary India. Arya’s quiet summer with a secretive great-uncle — a brilliant former ISRO scientist — takes a sharp turn when a mysterious poem from the past resurfaces. What begins as a puzzle soon becomes a race against time, linking ancient ideas to modern science, and uncovering a secret that stretches from India’s earliest histories to the frontiers of space.\nTogether, the books in The Bold Chronicles offer a perfect blend of momentum, wonder, and discovery. It is a series that invites middle-grade and older readers to step across the centuries — and discover that the past is closer, richer, and more exciting than they ever imagined.\nAbout Author:\nSarita Mandanna is an author of literary fiction. Her debut novel Tiger Hills was translated into fourteen languages worldwide and longlisted for the Man Asian Literary Prize. Represented by David Godwin, she is a graduate of the Wharton Business School and the Indian Institute of Management. She is a private equity investor, and lives in Toronto with her husband and son.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1615",
    "image": "https://attagalatta.com/admin/uploads/events/1856700694.png",
    "performer": "Sarita Mandanna",
    "keywords": [
      "Book Discussion",
      "Book Talk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-14T18:30:00+05:30",
    "endDate": "2026-01-14T20:00:00+05:30"
  },
  {
    "name": "WITH HER HANDS: Art Journaling  - A women-only guided art journaling meetup to create, connect and chat freely!",
    "description": "Over two thoughtful hours, we create together, share our stories, and carve out a creative corner that feels safe, sincere, and ours. This meetup is shaped with the intention to make space for self-expression and community. Through guided journaling and art, we gently uncover what we’re carrying from the year gone by, and what we hope to carry forward in 2026. \nWhat you get:\n\nFilter coffee on the house\nAll art materials provided\nGuided facilitation for 2 hours\nIf you’ve been craving a space to create freely and meet women who get it, this is your circle!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1619",
    "image": "https://attagalatta.com/admin/uploads/events/833722169.png",
    "performer": "Women in the hood",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-16T17:00:00+05:30",
    "endDate": "2026-01-16T19:00:00+05:30"
  },
  {
    "name": "Daphne du Maurier Reader Meetup - A Group discussion for Literature Enthusiasts",
    "description": "Daphne du Maurier’s writing is a haunting blend of atmosphere, suspense, and psychological depth. With her gift for crafting moody landscapes, ambiguous characters, and stories that linger long after the last page, she draws readers into worlds where the familiar becomes unsettling and the ordinary glimmers with mystery. From windswept Cornish cliffs to shadowed manor houses, her narratives explore love, identity, obsession, and the quiet menace of the unknown.\nHer novels and short stories – whether it’s the iconic Rebecca, the eerie tension of Jamaica Inn, or the chilling brilliance of “The Birds” – continue to captivate generations of readers who crave storytelling that is both immersive and unsettlingly beautiful.\nWhether you have long been enthralled by du Maurier’s atmospheric prose or are just beginning to step into her shadowed, intriguing worlds, you are warmly invited to join us this month as we gather to discuss, reflect, and lose ourselves in her unforgettable stories.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1595",
    "image": "https://attagalatta.com/admin/uploads/events/2070546948.png",
    "performer": "Lakshmi Sankar",
    "keywords": [
      "Literary Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-17T11:00:00+05:30",
    "endDate": "2026-01-17T12:00:00+05:30"
  },
  {
    "name": "Art of Erotic Writing - A Workshop - Writing Workshop by Bhushan Korgaonkar",
    "description": "Sex is an inevitable part of our lives. Most of us indulge in either doing it, dreaming it, dreading it or otherwise thinking about it at some point in time. Years of social conditioning makes us consider it as ‘undesirable’, ‘immoral’ and ‘dirty’ but in fact, it is ‘desirable’, ‘natural’ and ‘healthy’.\nIn this workshop, you can learn to navigate the fine line between titillating and tacky, and discover how to craft compelling erotic content. Explore various aspects of sexuality and sensuality. Discover your niche and develop your skills in writing erotic content that resonates with your audience. Gain relevant information and techniques to enhance your writing, and take away valuable tips to apply to your own work.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1609",
    "image": "https://attagalatta.com/admin/uploads/events/1318485525.jpeg",
    "performer": "Bhushan Korgaonkar",
    "keywords": [
      "Writing Workshop",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-17T11:00:00+05:30",
    "endDate": "2026-01-17T14:00:00+05:30"
  },
  {
    "name": "Quiet Joys: A Gratitude Zine–Making Workshop - Workshop by Nitya Menon",
    "description": "Join us for an afternoon of quiet creativity. This workshop invites you to slow down, reflect on the small joys that often go unnoticed, and turn those moments into an 8-page gratitude zine. Through gentle prompts and simple illustration exercises, you’ll create a personal keepsake that captures what grounded you, moved you, or made you smile. It’s a reflective, hands-on session for anyone seeking a pause through creativity and mindful noticing. All materials will be provided, and no prior art experience is required.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1584",
    "image": "https://attagalatta.com/admin/uploads/events/1074968289.jpg",
    "performer": "Nitya Menon",
    "keywords": [
      "Zine Making",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-17T15:00:00+05:30",
    "endDate": "2026-01-17T16:30:00+05:30"
  },
  {
    "name": "Atta Galatta presents “The BWW Short Story Community” - Literary Meetup by Bhumika Anand",
    "description": "The BWW Short Story Community\nThis month we will discuss Gina Chung’s “Presence,” from her collection Green Frog. \nWhat this is:\nThis is a ticketed, curated literary and community event, presented by Bhumika Anand from the Bangalore Writers Workshop, where we will do a deep-dive analysis and discussion of a short story.\nYou get to join a reading community where you will get to read a pre-chosen short story a month.\nYou get to examine the story in terms of its literary merit, yes, but also in terms of writing craft and context, which will be very useful if you are an aspiring storyteller or writer.\nWho should join:\nIf you are above 18 years old, interested in storytelling, literature, or are an aspiring or published author, this is for you.\nIf you are new in the city and want to be part of a community and make friends over writing,storytelling, and literature, then this is for you.\nWhat does it entail:\nReading the prescribed story. \nParticipating in the curated discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolising the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1614",
    "image": "https://attagalatta.com/admin/uploads/events/1579219737.jpeg",
    "performer": "Bhumika Anand",
    "keywords": [
      "Books and Literature",
      "Book Talk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-17T16:00:00+05:30",
    "endDate": "2026-01-17T18:00:00+05:30"
  },
  {
    "name": "Kaayaa: Book Launch - Book Launch by Dr. Guruprasad Kaginele",
    "description": "Atta Galatta is delighted to host the launch of Kaayaa, the Kannada novel by acclaimed writer Guruprasad Kaginele, on 17th January, from 6:00 PM to 7:00 PM.\nSet largely in the United States, Kaayaa (which translates to Body) follows the life of Dr Bheem Malik, one of Manhattan’s most sought-after plastic surgeons, whose professional and personal worlds begin to unravel when his name surfaces in a MeToo scandal. As his career hangs in the balance and political ambitions close to him are threatened, the novel traces a reckoning with the past, forcing its characters to confront desire, power, love, and moral responsibility.\nThrough sharp satire and emotional depth, Kaayaa explores contemporary themes of sexuality, disease, marriage, and politics, while questioning society’s obsession with appearance and perfection. The novel lays bare characters caught between their real and imagined selves, each chasing a version of the American dream, only to discover its costs.\nA searing and honest meditation on beauty, ambition, and the human condition, Kaayaa reaffirms Guruprasad Kaginele’s voice as one of the most compelling in contemporary Kannada literature.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1616",
    "image": "https://attagalatta.com/admin/uploads/events/511150827.jpeg",
    "performer": "Dr. Guruprasad Kaginele",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-17T18:00:00+05:30",
    "endDate": "2026-01-17T19:00:00+05:30"
  },
  {
    "name": "In full Bloom: A Crochet Flower Workshop - Crochet Workshop",
    "description": "Step away from the noise of everyday life and spend a slow, joyful afternoon learning the art of crochet.\nIn Full Bloom is a beginner-friendly workshop where you’ll learn how to crochet a flower from scratch. Guided gently through the basics, this session is designed for absolute beginners and anyone curious about making something with their hands.\nThis workshop isn’t about perfection—it’s about the process. About slowing down, focusing on each stitch, and finding calm in the rhythm of making. By the end of the session, you’ll walk away with your own handmade crochet flower and the confidence to keep creating.\nAll materials will be provided. Just bring your curiosity.\nHosted by SlipStitch at Atta Galatta",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1622",
    "image": "https://attagalatta.com/admin/uploads/events/1159115621.png",
    "performer": "SlipStitch",
    "keywords": [
      "Crocheting",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-18T11:00:00+05:30",
    "endDate": "2026-01-18T14:00:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup by ADHD Queeple",
    "description": "Queer Quiet Hours is a low-pressure meetup for queer folks who want company without conversation being the main event.\r\nWe meet in person and spend time doing our own things side by side. Reading, drawing, journaling, knitting, scrolling, resting, all welcome.\r\nThe space is calm, not silent. Organic conversations do happen, and you’re welcome to talk or keep to yourself.\r\nWe’ll have some art supplies available to use, and you’re also very welcome to bring your own thing.\nThis space is exclusively for LGBTQIA+ folks. We haven’t opened it up to allies yet, thank you for understanding. 🏳️‍🌈\n🌈 Spots are limited, sign up through the link in bio!\n🗓️ 18th Jan, 2026\r\n⏰ 3 to 6 PM\r\n📍Atta Galatta, Indiranagar, Bangalore",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1620",
    "image": "https://attagalatta.com/admin/uploads/events/1795212448.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Community",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-18T15:00:00+05:30",
    "endDate": "2026-01-18T18:00:00+05:30"
  },
  {
    "name": "Bad Daughter Book Salon - Book Discussion by Sangeeta Pillai",
    "description": "BECAUSE GOOD GIRLS DON’T CHANGE THE WORLD. For every woman who has been told she's \"too much,\" this is a memoir about becoming exactly who you're meant to be.\nSangeeta Pillai was called a \"Bad Daughter\" for defying the rigid expectations placed on \"good Indian girls.\" But in her rebellion, she found her voice. From a harrowing childhood in a Mumbai slum-haunted by a violent father and the brutal murder of her mother-this is a story of resilience. With a fire in her belly, she\nbattled patriarchy, chased her dreams, and built a new life in London, creating a successful podcast to inspire other women. Yet, all her success couldn't outrun the past. Faced with debilitating mental health, she explored many healing avenues from psychotherapy, hypnotherapy, EMDR, acupuncture to Tantra. But to truly heal, she had to go back to her birthplace: tropical Kerala to confront her deep trauma. There, she experienced the most profound spiritual transformation in Kerala's ancient temples. Sangeeta's powerful, spiritual and deeply inspiring journey shows us that healing means finding your way back home to yourself. Bad Daughter is an inspirational feminist memoir for every woman who wants to break free. Ultimately, it's a reminder that the courage to be your authentic self can transform your own life - and the lives of those around you.\nAuthor Description:\nSangeeta Pillai grew up in a Mumbai slum. Today, she is recognised as a leading voice for South Asian feminism globally. Award-winning podcaster, writer and feminist activist, Sangeeta is the creator of Masala Podcast (all about cultural taboos) which won 6 British Podcast Awards, 1 Audio Production Award & Spotify SoundUp 2018 award. She's also the founder of South Asian feminist network Soul Sutras. Sangeeta has been featured extensively in the press from BBC Radio, Guardian, Metro, Cosmopolitan, Evening Standard, Stylist, Eastern Eye to Huffington Post. As well as on giant billboards in New York, London, Dublin, Cardiff & Glasgow. She is also the creator of the Masala Monologues series of writing workshops & theatre shows in the UK & the US. Sangeeta is a regular speaker at WOW Festival, Podcast Show London, Shameless Festival, Primadonna Festival as well as being a regular speaker on innumerable panels and podcasts.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1594",
    "image": "https://attagalatta.com/admin/uploads/events/1492321805.png",
    "performer": "Sangeeta Pillai",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-18T18:00:00+05:30",
    "endDate": "2026-01-18T19:00:00+05:30"
  },
  {
    "name": "Humzubaan: Hindi & Urdu Poetry Meet - Poetry Open Mic by Siddharth Surana",
    "description": "There are scores of Hindi/Urdu poetry enthusiasts in Bangalore and many established and budding poets. For long, a need was felt for a platform where good Hindi and Urdu poetry finds expression. Humzubaan, hosted by Siddharth Surana is an effort to bring together Hindi/Urdu literature enthusiasts together to celebrate the beauty of poetry. Our first meet up is happening on Friday, 23rd Jan at 6 PM at Atta Galatta.\nRecite your or your favourite author’s poems (with/without music) or simply soak in the magic of poetry. Submissions are open till 18th January - send your entries by clicking on the register button down below.\nWe will inform you if your poem is selected for the meet. If your poem is not selected, you’re welcome to attend as an audience, and try to perform the next time.\nPlease note:\n1. The poems can be your own original work or of another author. You need to mention it clearly and send in your entry in the above-mentioned form.\n2. Poems/songs should be in Hindi/Urdu only.\n3. If you’re planning to perform with music/props, please mention in the form. You would need to arrange for the instruments and set-up at the venue.\n4. The organizers’ decision regarding selected poems would be final.\n \nAbout the host:\nSiddharth is founder of AgriCentral, a digital platform serving 11 million farmers. He writes in Hindi, Urdu and English-mostly poems, short stories and essays but with long breaks. At least three books are jostling to come out of his mind on paper, for two decades, but none has seen the light of the day, as yet. Hopefully, it will change soon. By the way. he is also an avid trekker and a national-level gold medallist archer.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1632",
    "image": "https://attagalatta.com/admin/uploads/events/430694003.png",
    "performer": "Siddharth Surana",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-23T18:00:00+05:30",
    "endDate": "2026-01-23T19:00:00+05:30"
  },
  {
    "name": "Read & Play at Atta Galatta - A relaxed Saturday morning for young children and their families by Bachpan Manao",
    "description": "Children listen to short stories read by grandparents.\nThey can sit, move around, draw, or just listen quietly.\nAfter the stories, children move to art tables with paper, colours, and clay.\nThere are no instructions and no pressure to perform.\nAdults stay close while children explore and create at their own pace.\n \nThis session is designed for parents who want:\n– a calm, screen-free morning\n– a safe, familiar space\n– unstructured play and listening\nSat, 24 Jan | 11-12:30\nAtta Galatta\nStories, art, and time together.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1634",
    "image": "https://attagalatta.com/admin/uploads/events/515573238.jpeg",
    "performer": "Bachpan Manao",
    "keywords": [
      "Community",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-24T11:00:00+05:30",
    "endDate": "2026-01-24T12:30:00+05:30"
  },
  {
    "name": "Bangalore Storytelling Society January Meetup - A story telling meetup by BSS",
    "description": "The monthly meet-up for adults by the BANGALORE STORYTELLING SOCIETY, that began in 2013, aims to revive the traditional way of sharing tales amidst a gathering.  The theme this month is BLANK PAGE. The Lores can be from folklore , mythology, travels , books etc . If you would like to share a tale, do mail at bangalorestorytellingsociety@gmail.com\n\r\nIf you would like to listen, do join us at ATTA GALATTA  on the 24th of January, at 12pm.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1610",
    "image": "https://attagalatta.com/admin/uploads/events/1818823626.jpg",
    "performer": "Bangalore Storytelling Society",
    "keywords": [
      "Storytelling",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-24T12:00:00+05:30",
    "endDate": "2026-01-24T13:00:00+05:30"
  },
  {
    "name": "Atta Galatta presents “Let Poetry Be” - Poetry Open Mic by Palgun K. J.",
    "description": "This monthly gathering will see poetry coming to life, through reading, music, art and any other forms of artistic expression, at Atta Galatta. Listeners and performers are all welcome!\nDate: 24th January\nTime: 4pm \nVenue: Atta Galatta, Indiranagar\n \nEvent specifics & submission guidelines –\n1. Theme - Free Verse (any original work)\n2. Works can be original or of other poets, performed live\n3. All languages welcome\n4. Participants can read to music (acoustic instrument/s), dramatise, use props & costumes\n5. Each participant will enjoy 5 minutes of reading time\n6. Kindly submit your poem and name to letpoetrybe@gmail.com on or before 22nd Jan midnight. WE WILL NOT ACCEPT ATTACHMENTS OR LINKS. SUBJECT OF YOUR MAIL MUST READ AS 'Entry for-January LPB meet-up'\n7. You may also send entries that are not related to the theme\n8. The event will begin at 4pm sharp and will be held at Atta Galatta. Participants to report not later than 3:45 pm to hear about performance order and meet the host\n9. For any further clarifications, write to us at letpoetrybe@gmail.com\nYou are now welcome to flood our inbox!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1624",
    "image": "https://attagalatta.com/admin/uploads/events/1141370146.png",
    "performer": "Palgun K. J.",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-24T16:00:00+05:30",
    "endDate": "2026-01-24T18:00:00+05:30"
  },
  {
    "name": "Read A Kitaab - Book club",
    "description": "📚✨ Bangalore, we’re coming back with stories & conversations! ✨📚\nRead A Kitaab, in collaboration with Atta Galatta, invites you to our Bangalore Book Meet — a cozy gathering of readers, book lovers, and curious minds.\nLet’s talk about:\n📖 what we read\n🎯 our reading goals for 2026\n💬 the stories that shaped us (and the ones waiting on our shelves)\n🗓 Saturday, 24th January\n⏰ 4:00 PM – 6:00 PM\n📍 Atta Galatta, Bangalore\n✨ Entry free | Registration mandatory\n \nCome with your reading tales, leave with new bookish connections.\nBecause every city reads differently — and Bangalore, we can’t wait to read with you. 💛\n📩 Register now\n📞 9082076420\n📸 @readakitaab\n🌐 readakitaab.com",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1633",
    "image": "https://attagalatta.com/admin/uploads/events/1143066572.jpeg",
    "performer": "Read a Kitaab",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-24T16:00:00+05:30",
    "endDate": "2026-01-24T18:00:00+05:30"
  },
  {
    "name": "Brand Basics for First-Time Entrepreneurs - Workshop by Sudhir Kiran",
    "description": "A space for people who want to start or grow a business but feel lost in branding, storytelling, and marketing. This workshop will help entrepreneurs communicate better, build trust, and move forward with confidence without jargon or overwhelm.\nWho is this for?\nFirst-time entrepreneurs, professionals thinking of starting something on the side, freelancers who want clarity and confidence & MSME owners who wish to understand branding without jargon and students or anybody interested in starting a business.\nWhat do participants get from the workshop?\n\nClarity in their brand messaging\nA simple framework to build a business/ visual identity\nPractical marketing steps they can apply immediately\n\r\n\tEmail sudhirkirangn@gmail.com for more details.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1596",
    "image": "https://attagalatta.com/admin/uploads/events/1588876565.png",
    "performer": "Sudhir Kiran",
    "keywords": [
      "Business",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-25T11:00:00+05:30",
    "endDate": "2026-01-25T13:00:00+05:30"
  },
  {
    "name": "A Walk in the Backyard - A Nature Journaling Workshop",
    "description": "A Walk in the Backyard is a gentle, slow-paced nature journaling workshop designed to help you pause, observe, and reconnect with the small wonders around you. Inspired by the philosophy of John Muir Laws—observation, curiosity, and wonder—this session invites participants to look closely at everyday nature: backyard birds, leaves, flowers, insects, sounds, and fleeting moments that often go unnoticed.\nYou don’t need to be an artist or a writer. Nature journaling is not about perfection—it’s about paying attention. Through simple prompts, guided observation, and easy watercolor and drawing exercises, you’ll learn how to record what you see, feel, and wonder about in your own sketchbook.\nThis workshop is perfect if you want to:\n\nSlow down and be present in the moment\nBuild a regular nature journaling habit\nExplore watercolor and sketching in a relaxed, pressure-free way\nReconnect with your curiosity and childlike sense of wonder\nUse art as a calming, mindful practice\n\nBy the end of the session, you’ll walk away with:\n\nA completed nature journal page\nSimple tools and prompts you can reuse at home\nIncreased confidence in observing and expressing nature\nA calmer, more grounded state of mind\n\nAll materials will be provided.\nAbout the Facilitator\nThe workshop is facilitated by Charu Jain, a self-taught watercolor artist and illustrator with a deep love for storytelling and nature journaling.\nCharu’s work is rooted in gentle observation, expressive lines, and a playful, hand-drawn watercolor style. She believes art is a way to slow down, listen deeply, and build a personal relationship with the natural world. Her practice combines illustration, journalling, and storytelling to make creativity feel accessible rather than intimidating.\nThrough her workshops, Charu encourages participants to let go of “getting it right” and instead focus on noticing, wondering, and enjoying the process. Her sessions are known for being warm, inclusive, and thoughtfully guided—especially welcoming to beginners.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1635",
    "image": "https://attagalatta.com/admin/uploads/events/2001516150.png",
    "performer": "Charu Jain",
    "keywords": [
      "Journaling",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-25T13:30:00+05:30",
    "endDate": "2026-01-25T15:30:00+05:30"
  },
  {
    "name": "Ta Ka Dhi Mi - Book Launch by Shyama Panikkar",
    "description": "The event marks the launch of the much awaited book, Ta Ka Dhi Mi 2358, by author Shyama Panikkar. It is the 4th book in her series of music books for children. After the launch and a session by Shyama around the new book, her students will do a hindustani classical performance for the audience with live tabla.\nAll attendees need ticket. 1 ticket = 1 kid + 1 adult.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1598",
    "image": "https://attagalatta.com/admin/uploads/events/2146744333.jpeg",
    "performer": "Shyama Panikkar",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-25T16:00:00+05:30",
    "endDate": "2026-01-25T18:00:00+05:30"
  },
  {
    "name": "Launch of Three New Titles by Red River Authors - Book Launch by Red River Publications",
    "description": "Join us on 25th January, Sunday, from 5 pm to 7 pm, for the launch of books by Ankush Banerjee, Babitha Marina Justin, and Salini Vineeth, published by Red River.\nWe’re excited to unveil three unique books and to have an engaging discussion about these books and their themes – myth, memory, resilience, and gender identity.\nField Notes on Kindness by Ankush Banerjee is a collection of poems that are inspired from memories, anecdotes, and characters in the family, but recast them with an eye for detail and an attitude of pure wonder.\nThe Way Madmen Smell by Babitha Marina Justin is a collection of ten stories that move between the real, the unreal, and the surreal, weaving themes of love, loss, memory, betrayal, and resilience.\nThe Tree, The Well & the Drag Queen by Salini Vineeth is a novella that blends folklore, myth, and magic with a contemporary exploration of gender identity as it follows a queer person’s quest for freedom and authenticity.\nWe cordially invite you to an engaging literary discussion as we celebrate these three books!\nAbout the Authors:\nAnkush Banerjee is a Kochi-based poet, educator, book reviewer, and research scholar in masculinity studies. His work appears in numerous print and online platforms. This is his second book of poems.\nBabitha Marina Justin is a writer and visual artist who moves easily between a paintbrush and a pen. Her poetry lingers on memory, gender, and the small intimacies of everyday life, with a voice that can be tender one moment and uncompromising the next. She has written nine books, including three poetry collections, Of Fireflies, Guns and the Hills (2015), I Cook My Own Feast (2019), and Forty-Five Shades of Brown (2023). She also co-edited salt, pepper and silver linings: celebrating our grandmothers (2019), a tribute to resilience and inheritance.\nSalini Vineeth is a fiction writer and translator. She worked as an engineer for ten years before moving to full-time writing in 2019. Since then, she has published five books — Lost Edges (novel, 2023), Magic Square (novella, 2020), Everyday People (short story collection, 2019), and travel guides for Hampi and Badami. She has also translated four books from English to Malayalam. She is the fiction editor of Mean Pepper Vine, a quarterly literary magazine. salinivineeth.in",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1625",
    "image": "https://attagalatta.com/admin/uploads/events/675485021.png",
    "performer": "Red River Publications",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-25T17:00:00+05:30",
    "endDate": "2026-01-25T19:00:00+05:30"
  },
  {
    "name": "Aging (Un)Gracefully - Book Discussion with Lalita Iyer",
    "description": "In her memoir, Lalita reflects on ageing as something far more layered than simply “getting old”. She looks at it as a disruption — a moment when women begin to see themselves differently, take stock of friendships, rethink their roles, and slowly come into who they really are.\nShe asks simple but disarming questions: When do we actually become old? And how is coping with ageing any different from coping with puberty?\nThrough personal stories and observations, Lalita writes about losing estrogen, gaining perspective, building new tribes, and learning to live with bodies that are changing — with a mix of honesty, curiosity, and humour. For her, ageing becomes both a process of growing up and a kind of liberation.\nJoin us for an intimate reading and conversation around the themes of ageing, identity, and what it means to keep evolving.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1597",
    "image": "https://attagalatta.com/admin/uploads/events/625019098.jpeg",
    "performer": "Lalita Iyer",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-28T17:00:00+05:30",
    "endDate": "2026-01-28T18:00:00+05:30"
  },
  {
    "name": "Food In Literature - Book Club with Prachi Grover",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.  So, if viewing the world through the lens of food and literature interests you, then join us for a dialogue on “Food in Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we read our way through several powerful (and delicious) narratives.\nJanuary Read: In the Beginning there was Bombay Duck by Pronoti Datta\nWe assure you that you will enjoy every single bite! The session is free but registration is a must as we have limited spots available. \n \nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who love to read and eat!\nWhen: Saturday, 31st January, 2026 at 11 a.m.\nWhere: Atta Galatta Bookstore, Indira Nagar\nAges: 18+\nRegistration is mandatory (link in bio)\nCopies of the book are available at the store.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1582",
    "image": "https://attagalatta.com/admin/uploads/events/1865055897.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Literature",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-31T11:00:00+05:30",
    "endDate": "2026-01-31T13:00:00+05:30"
  },
  {
    "name": "Financial Freedom Starts with Awareness - A Financial Literacy Workshop by Aatmeeya",
    "description": "Financial Freedom Starts with Awareness is a financial literacy workshop organized by Aatmeeya, designed to help individuals build a strong foundation in personal finance and investing.\nThe workshop will be conducted by Sathwik N N, Co-Founder of Aatmeeya, who will simplify key financial concepts and guide participants on how to make informed investment decisions. The session focuses on practical knowledge that can be applied immediately, especially for beginners and working professionals.\nKey topics covered:\n\n\nIntroduction to Mutual Funds\n\n\nInvestment basics everyone should know\n\n\nPlanning short-term and long-term financial goals\n\n\n📅 Date: 31st January 2026\r\n⏰ Time: 3:00 PM – 5:00 PM\r\n📍 Venue: Atta Galatta, Indiranagar, Bengaluru\r\n💰 Fee: ₹299 only\nThis workshop is ideal for anyone looking to gain clarity, confidence, and awareness in their financial journey.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1617",
    "image": "https://attagalatta.com/admin/uploads/events/1624080254.jpg",
    "performer": "Sathwik N N",
    "keywords": [
      "Finance",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-01-31T15:00:00+05:30",
    "endDate": "2026-01-31T19:00:00+05:30"
  },
  {
    "name": "Collage Workshop – Cut, Paste & Create Stories! - Collage Workshop by The Healing Palette",
    "description": "Art enthusiasts, get ready for a playful and expressive creative evening!\nJoin us for a lively Collage Art Workshop, where textures, colors, patterns, and imagination come together to tell stories your way.\nIn this hands-on session, participants will be provided with all the materials required to create fun, bold, and expressive collages. You’ll explore layering, composition, storytelling through visuals, and intuitive creativity. Whether you’re a beginner or someone who loves experimenting with mixed media, this workshop promises a relaxed, joyful space to create, connect, and let your creativity flow freely.\nCome as you are and leave with a piece of art that feels uniquely you.\nEvent Details:\n• 📍 Location: Atta Galatta, Bangalore\n• 📅 Date: 31st January\n• ⏰ Time: 5:30 PM – 7:30 PM\n• ✂️ Materials: All materials will be provided\nLimited spots available—come cut, paste, and create something magical with us ✨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1631",
    "image": "https://attagalatta.com/admin/uploads/events/1547190804.jpeg",
    "performer": "The Healing Palette",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-01-31T17:30:00+05:30",
    "endDate": "2026-01-31T19:30:00+05:30"
  },
  {
    "name": "INDISHMAN  - Book reading by Dr Gopi Chandroth",
    "description": "Dr Gopi Chandroth, author of INDISHMAN – Reflections from India, Britain and the Sea, will be at Atta Galatta Bookstore in Indiranagar on 1 February, from 4.30 pm to 6 pm. He will talk about selected stories and engage informally with the audience. Signed copies of the book will be on sale.\n \nThe following are sample extracts from reviews on Amazon globally and on Goodreads:\n• India: “INDISHMAN reminded me of the lyrical beauty of Arundhati Roy, the vivid storytelling of Salman Rushdie, and the magic of García Márquez.”\n• UK: “A lovely meander through the vagaries of human nature. Each story warms the heart like a good malt whisky. A very well-written book; I defy anyone not to enjoy it.”\n• USA: “It (INDISHMAN) is hard to slot into a specific genre – the stories, reflections and gentle musings flit from rural Kerala to Nepal, from Southampton to the high seas with ease. They strike the perfect balance between being sharply observed and deeply memorable, yet light enough for an effortlessly enjoyable read, and never without a touch of humour and heart. Without a doubt, this has been the best six dollars and change I’ve spent in a very long time.”",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1600",
    "image": "https://attagalatta.com/admin/uploads/events/867047692.jpg",
    "performer": "Dr Gopi Chandroth",
    "keywords": [
      "Book Discussion",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-01T16:45:00+05:30",
    "endDate": "2026-02-01T18:00:00+05:30"
  },
  {
    "name": "Love Stories from Indian Heritage - A Storytelling Performance by Aparna Jaishankar and Vikram Sridhar",
    "description": "Love stories aren’t only about the hero and heroine, for love can rarely exist in isolation. Zealous messengers, art and music as mood enhancers, food as aphrodisiacs, taboos and mores – all play a pivotal role in shaping stories of love. Vikram Sridhar and Aparna Jaishankar rummage through the passages of time to bring you various hues of love etched in our heritage through literature, architecture, songs and poetry through the all- encompassing art form of oral storytelling.\n\nAbout Aparna Jaishankar\r\nAparna Jaishankar is a Storyteller with a penchant for Indic mythology. She believes that there is no ONE version of any story. Her storytelling performances take a contemporary view of ancient tales.Aparna also works with educators in developing learning perspectives in the classroom and with organisations in building internal narratives.\n\nAbout Vikram Sridhar\r\nVikram Sridhar is a Performance Storyteller, Theatre Practitioner.and a Narrative based Facilitator .  His Stories , Performance and Workshops for Children , Students , Adults and Families are rooted in Heritage , Ecology and Folklore deeply inspired from various communities of the soil . Based in Chennai and Bangalore , he travels the country extensively with his  Desi way of Storytelling",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1604",
    "image": "https://attagalatta.com/admin/uploads/events/1180907729.png",
    "performer": "Aparna Jaishankar, \nVikram Sridhar,",
    "keywords": [
      "Folklore",
      "Storytelling"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-06T19:00:00+05:30",
    "endDate": "2026-02-06T20:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Indiranagar - Story Walk by Vikram Sridhar",
    "description": "On a Saturday morning , Walk through the lanes of INDIRA NAGAR with Vikram Sridhar discovering the lanes through the Folklore , Heritage and Ecology of the area . The walk will begin and culminate at ATTA GALATTA . The tales will revolve around historical , mythical and personal narratives weaved as we discover the area through the walk .\n Date : 7th February ( Saturday)  2025\n Time : 10 AM\n Starting Point : Atta Galatta",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1608",
    "image": "https://attagalatta.com/admin/uploads/events/1890938241.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-07T07:00:00+05:30",
    "endDate": "2026-02-07T09:00:00+05:30"
  },
  {
    "name": "Gond Art - Workshop by Hues by Sindhoor",
    "description": "Our Gond Art workshop is your passport to explore the colorful tapestry of this ancient Indian folk tradition. Dive deep into the intricate techniques and whimsical motifs that define Gond art. Unleash your inner creativity as you paint your own vibrant masterpiece, infused with the spirit of tribal storytelling. \r\nTickets priced at INR 999/- 3 hours of workshop with Inclusive of all materials.\r\nContact +91 9513544920 for tickets & more details.\r\nGet ready for a joyous fusion of tradition and imagination that promises to ignite your artistic spark!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1603",
    "image": "https://attagalatta.com/admin/uploads/events/1582965496.jpeg",
    "performer": "Hues by Sindhoor",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2026-02-07T11:00:00+05:30",
    "endDate": "2026-02-07T14:00:00+05:30"
  },
  {
    "name": "A Story Walk Through Domlur - Story Walk by Vikram Sridhar",
    "description": "On a Sunday morning , Walk through the lanes of DOMLUR , from lores dating back in time from the Madras Presidency , Mysore State to the current IT , Banking and Retail sectors with Vikram Sridhar discovering the lanes through the Folklore , Heritage and Ecology of the rich area which is identified as a village. The walk will begin from Bhandutvas , a theatre collective , and culminate at the Bangalore International Centre . The tales will revolve around historical , mythical and personal narratives weaved as we discover the area through the walk . \nDate : 8th February  (Sunday)  2025\n Time : 7 AM\n Starting Point : Bhandutvas , Domlur\nDetails and GPAY : 9945799224",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1607",
    "image": "https://attagalatta.com/admin/uploads/events/1735873685.jpeg",
    "performer": "Vikram Sridhar",
    "keywords": [
      "History",
      "History Walk"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T07:00:00+05:30",
    "endDate": "2026-02-08T09:00:00+05:30"
  },
  {
    "name": "Ventriloquism Show & Workshop - Ventriloquism workshop by M. Santhosh Kumar",
    "description": "Mr. M. Santhosh Kumar is a qualified Company Secretary by Profession yet a  passionate Ventriloquism  Artiste. He  is an International Ventriloquism Artiste, a TEDX Speaker, Voice Coach. He is the only Indian Ventriloquism artiste attending the International  Ventriloquism Convention in the USA since 2012. He has performed & enthralled both Kids & Adults in various Countries like USA, UAE, UK, Germany & all over India.  He specialises in presenting our Indian Values Culture blending humour and learning using the Ventriloquism Art. He is the Winner of Outstanding Ventriloquism Artiste award for 2021. Awardee for exemplary work in puppetry and storytelling from Early Childhood Association of India.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1599",
    "image": "https://attagalatta.com/admin/uploads/events/1546739439.jpg",
    "performer": "M. Santhosh Kumar",
    "keywords": [
      "Puppetry",
      "Workshop + Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T16:00:00+05:30",
    "endDate": "2026-02-08T17:00:00+05:30"
  },
  {
    "name": "SHAAM-E-BAAZGASHT | Bengaluru Diaries - An Evening of Poetry, Conversations & Healing by Krishnendu Chatterjee",
    "description": "Shaam-e-Baazgasht is an intimate, cosy, and immersive poetry experience drawn from Baazgasht – Echoes of Words & Silence, a bilingual Hindi–English collection that journeys through unrequited love, longing, heartbreak, queerness, healing, and the quiet courage of letting go.\nMore than a performance, it is a gathering that invites presence.\nThrough selected poems from the Baazgasht series, the evening unfolds alongside the stories that birthed them — gentle, honest conversations with the poet on his own journey, interwoven with brief guided moments of breathing, mindfulness, and emotional reflection. Together, these elements create a space where words are not merely heard, but felt — allowing the audience to touch closure, clarity, and a softer, steadier kind of inner peace.\nShaam-e-Baazgasht | Bengaluru Diaries offers an evening of listening, pausing, and returning — to oneself.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1621",
    "image": "https://attagalatta.com/admin/uploads/events/983215955.png",
    "performer": "Krishnendu Chatterjee",
    "keywords": [
      "Poetry",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2026-02-08T17:30:00+05:30",
    "endDate": "2026-02-08T19:30:00+05:30"
  }
]