[
  {
    "name": "Nature of the Crime - Film Screening",
    "description": "The Square Circle Clinic is organising a public screening for HBO's original 'Nature Of The Crime', at Atta Galatta, Bangalore. Join us on 18th July at 7 PM for the first screening of the documentary in India.\nDirected by Ricki Stern and Jesse Sweet, the film explores the lives of Todd Scott, Chad Campbell, and Carlos Rebollo, three incarcerated men navigating the complex bureaucracy of the parole system in America. The film explores how parole boards effectively treat parole as an opportunity to resentence by denying parole to incarcerated individuals.\n\r\nPlease note that people will be accommodated on a first-come first-serve basis.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1295",
    "image": "https://attagalatta.com/admin/uploads/events/122500528.png",
    "performer": "The Square Circle Clinic",
    "keywords": [
      "Film",
      "Screening"
    ],
    "@type": "ScreeningEvent",
    "startDate": "2025-07-18T19:00:00+05:30",
    "endDate": "2025-07-18T20:00:00+05:30"
  },
  {
    "name": "The Bougainvillea Circle - Connection Circle",
    "description": "\"Sawubona\" a Zulu Greeting meaning, \"We See You\". At Bougainvillea Circles you are offered a space to be heard, seen, welcomed as you are. A non-judgmental, safe, trusted space where you are free to be all that you want to be. Nothing More, Nothing less. No Restrictions, no judgements, just an intimate group of people looking for a space to be real. A space where we`re all less alone for a little while. Where we are seen, how we want to be seen. Conversations, Connections, Community of Compassion. All that makes the world go round, after Love of course!\nRemember - Sawubona: We See You.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1292",
    "image": "https://attagalatta.com/admin/uploads/events/353043082.png",
    "performer": "Radhika Ghose",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-19T16:00:00+05:30",
    "endDate": "2025-07-19T17:30:00+05:30"
  },
  {
    "name": "A Kerala Story - For Better or Verse - Interactive Session",
    "description": "If Elephants Could Talk – An empowering tale that communicates the power even young children can have to change things around them.\nTwelve-year-old Meenakshi hasn’t spoken a word since her Amma passed away about six months ago. Teased and troubled at school, she finds her safe place in dance where she can escape from reality for a few hours. One day, she meets the temple elephant, Ganeshan, and an unusual friendship forms between them. But when the gentle Ganeshan is ill-treated, Meenakshi decides to speak up to save other elephants from a similar fate.\nCan Meenakshi find her voice again?\nWhat happens to Ganeshan?\nHow does she help the other elephants?\nFind out in this heart-warming and uplifting story of friendship, hope and healing!\nAbout Ranjeeta \nRanjeeta Raam grew up in a small town in Kerala, India, wishing that characters from her favourite books would step off the pages and become her friends. As an adult, she worked in different areas of writing, quitting her last job as a scriptwriter to become a full-time novelist. Ranjeeta loves novels in verse and believes in the economy of words to tell a powerful story. Writing brought her close to her culture and she hopes to bring out those aspects of it that are lesser known. If Elephants Could Talk is her first novel. She currently lives in Dubai with her husband, two daughters and two cats.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1291",
    "image": "https://attagalatta.com/admin/uploads/events/1744787030.png",
    "performer": "Ranjeeta Raam",
    "keywords": [
      "Children",
      "Interactive Session"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-19T17:00:00+05:30",
    "endDate": "2025-07-19T19:00:00+05:30"
  },
  {
    "name": "Tote Bag Printing Workshop - Sustainable Design",
    "description": "Let’s Craft a Greener Tomorrow – Sustainable Tote Bag Workshop\nEnjoy an evening of creative Sustainable Tote Bag-Making Workshop designed to bring together art, eco-consciousness, and community spirit, all within the warm, inspiring atmosphere of your space.\n🌿 About the Workshop\nThis hands-on session invites participants to design their own eco-friendly cotton tote bags, using sustainable materials and natural techniques such as acrylic painting, vegetable stamping, leaf printing, and freehand art. It’s not just a craft — it’s a celebration of mindful living and personal expression.\n✨ Workshop Highlights:\n🎨 Design & decorate your own reusable cotton tote bag\n🍃 Explore nature-inspired techniques like vegetable and leaf printing\n🌱 Promote eco-awareness and sustainable habits in a fun, creative way\n👜 Take home a unique, personalized tote — and a greener mindset!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1297",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Nisha Joseph",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-07-19T17:30:00+05:30",
    "endDate": "2025-07-19T19:30:00+05:30"
  },
  {
    "name": "What's Your Price, Mr. Shivaswamy? - Book Discussion",
    "description": "Having worked all his life, Shivaswamy eagerly awaits the serenity of retirement. But his plans are suddenly upturned when his attempts to buy a house are scuppered by unscrupulous builders. Suddenly, he realizes that he might have to join the workforce again. What follows is a tale of gentle satire that is also an intense human drama. Shivaswamy faces the toughest choice, one that threatens the values that have sustained him throughout his life.\nSet in contemporary Bengaluru, What’s Your Price, Mr Shivaswamy? is an elegantly crafted and deeply engaging story about a man torn between material necessities and spiritual aspirations. How much would you sacrifice for some peace of mind?\nTranslated into English by the author himself, this novel was originally published in Kannada as Ondondu Talegu Ondondu Bele. Join us for a discussion with the author on 19th July at 6.30 PM!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1290",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "M. R. Dattathri",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-19T18:30:00+05:30",
    "endDate": "2025-07-19T19:30:00+05:30"
  },
  {
    "name": "The Strangers' Choir - Pop-up Choir",
    "description": "The Strangers’ Choir is a pop-up choir. A transient, ever evolving group that is made of people who have never sung together before and might not ever again. All you need is a love of harmony.\nNo experience or auditions required.\nAt Atta Galatta, the choir will sing, surrounded by wisdom that echoes from the walls.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1300",
    "image": "https://attagalatta.com/admin/uploads/events/1630875573.png",
    "performer": "The Strangers' Choir",
    "keywords": [
      "Music",
      "Pop-up Choir"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-20T11:00:00+05:30",
    "endDate": "2025-07-20T13:45:00+05:30"
  },
  {
    "name": "Journaling Workshop - Slow Journaling Workshop",
    "description": "Best friending journaling – a slow workshop to meet your journal like a true friend!\nJoin us for a gentle, expressive 2-hour journaling workshop designed for anyone looking to slow down, reflect, and reconnect with themselves and others. This isn’t about writing neatly or every day. It’s about using art, words, scraps, sketches, and stories to find meaning in the mess.\nWhether you’re a fresh-in-the-city soul, a quiet creator, or simply someone rebuilding after a life shift, this space is for you.\nWe’ll explore creative prompts, memory-based journaling, and playful scrapbooking techniques to help you best-friend your journal, one page at a time.\n🗓 Date: Sunday, 20th July 2024\n🕑 Time: 2:30 p.m. to 4:30 p.m.\n📍 venue: Attata Galatta, Bengaluru\n💸 Ticket: ₹299 (includes a cup of filter coffee ☕)\n🧺 Bring: your journal, small keepsakes or scraps, memories and a curious heart\nNo journaling experience needed—just come as you are.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1249",
    "image": "https://attagalatta.com/admin/uploads/events/1480031105.png",
    "performer": "Yukti",
    "keywords": [
      "Journaling",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-07-20T14:30:00+05:30",
    "endDate": "2025-07-20T16:30:00+05:30"
  },
  {
    "name": "Robi's Garden - Theatre Performance for Kids",
    "description": "A small group of children is on an excursion to Jorasanko where Tagore’s ancestral home is located in Kolkata. They enter the courtyard theatre in Thakur-badi and sense a magical air surrounding them. The caretaker of the estate shares an important mantra of Robi-da with the children – that the first step in getting what you want in life is …. imagination. It is the surest way to have Robi-da’s stories come alive on the courtyard stage. And they do – in Robi’s Garden!\nThe presentation is by two actors only, with audience participation. In May 2024 the author of this play, Vijay Padaki, was honoured with the Lifetime Achievement Award by ASSITEJ, the international association for the promotion of Theatre for Young Audiences.\nDuration: 60 minutes. No intermission. The play will be preceded by a short quiz on Tagore and will be followed by a short Q&A session.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1296",
    "image": "https://attagalatta.com/admin/uploads/events/159448358.jpeg",
    "performer": "Minty Jain, \nVijay Padaki,",
    "keywords": [
      "Theatre",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-20T17:00:00+05:30",
    "endDate": "2025-07-20T18:00:00+05:30"
  },
  {
    "name": "An Evening of Magic - Magic Show",
    "description": "An Evening of Magic is a most amazing magic show presented by `Nakul Shenoy & Friends’, featuring top entertainers and magic acts. Curated and hosted by the internationally-acclaimed mentalist Nakul Shenoy, each event in this series brings unique acts and performances by nationally and internationally acclaimed magicians, alongside some of the most notable up-and-coming stars of magic. This is an evening that is truly magical, and one you will want to experience many times over.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1298",
    "image": "https://attagalatta.com/admin/uploads/events/459157861.jpg",
    "performer": "Nakul Shenoy",
    "keywords": [
      "Magic",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-20T18:00:00+05:30",
    "endDate": "2025-07-20T19:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-22T17:00:00+05:30",
    "endDate": "2025-07-22T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-22T19:00:00+05:30",
    "endDate": "2025-07-22T18:00:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nJuly Read: Beef, Brahmins & Broken Men by B.R.Ambedkar\nWe assure you that you will enjoy every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1281",
    "image": "https://attagalatta.com/admin/uploads/events/1779244125.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-26T11:00:00+05:30",
    "endDate": "2025-07-26T13:00:00+05:30"
  },
  {
    "name": "Deevara Chittara - Book Launch",
    "description": "Center for Revival of Indigenous Art (CFRIA) a Bengaluru non-profit presents its seminal work on Chittara: 'Deevara Chittara: the artform, the people, their culture', a significant milestone in the documentation and celebration of this indigenous folk art from Karnataka. The book brings out the essence of Malenad region's rich cultural heritage, of which Chittara is an integral part. Join us for the launch of this meticulously crafted coffee table book (Co-authors Geetha Bhat and Smitha Tumuluru, with photography by Smitha Tumuluru and publication design and illustrations by Namrata Cavale). Engage with artists from the Deevaru community and gain insights into their cultural practices. Witness a Deevaru artist use a natural fibre brush and bring a Chittara painting to life, to the accompaniment of live singing, and join in thought provoking conversations around artists, remuneration, eco-friendly crafts, the role of women and the future of art.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1242",
    "image": "https://attagalatta.com/admin/uploads/events/1971568061.jpg",
    "performer": "Center for Revival of Indigenous Art",
    "keywords": [
      "Books",
      "Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-26T11:30:00+05:30",
    "endDate": "2025-07-26T12:30:00+05:30"
  },
  {
    "name": "Make the Second Half Count - A Mid-Year Review Workshop",
    "description": "A Mid-Year Check-In Workshop using the Work-Life Planner Journal.\n📖🖊️ For anyone who wants to pause, reflect and reset — personally and professionally.\nWait, how is it July already?\nThe to-do lists, Zoom calls, life updates, overthinking spirals… and now suddenly half the year is gone?\nWhether you`re feeling proud, stuck, burnt out, or just confused — this workshop is your moment to pause and check in with yourself.\nThis isn’t just about goals.\nIt’s about how you felt doing all of it. What mattered. What didn’t. And what you want the rest of the year to feel like — in your work, life, energy, and self.\nJoin us for a guided 75-minute session that blends reflection, journaling, and realignment — using the Work-Life Planner Journal to help you reset with clarity (and a little gentleness).\n💬 In this workshop, you will:\n✅ Reflect on what’s worked and what hasn’t in the first half of 2025\n✅ Use powerful prompts from the Work-Life Planner Journal to assess where your energy has gone\n✅ Set meaningful personal and work goals for the second half of the year\n✅ Redefine “success” on your terms (not what Instagram told you)\nYou’ll laugh, you might cry, and most importantly — you’ll leave feeling lighter and clearer.\nNo pressure. Just presence.\nCome as you are. No journaling experience needed.\n🪑 Limited seats only (15 max)\n🎟️ INR 350 & INR 250 (early bird offer)  \n📍 Atta Galatta, Bangalore\n📔 Journal sheets + pens provided",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1265",
    "image": "https://attagalatta.com/admin/uploads/events/486642231.png",
    "performer": "Sonali Dutta",
    "keywords": [
      "Wellness and Health",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-07-26T17:00:00+05:30",
    "endDate": "2025-07-26T19:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-29T17:00:00+05:30",
    "endDate": "2025-07-29T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-07-29T19:00:00+05:30",
    "endDate": "2025-07-29T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-05T17:00:00+05:30",
    "endDate": "2025-08-05T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-05T19:00:00+05:30",
    "endDate": "2025-08-05T18:00:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "The next dates for Queer Quiet Hours are here!  \nQueer Quiet Hours is back — a cozy space to rest, make art, and just be. No pressure to talk, no need to perform. Just soft community vibes and gentle company. Bring your own project or come as you are. We'll have plenty of art stuff for you to use.\n✨ For LGBTQIA+ folks only. We haven't opened it up to allies yet.\n\r\n🆓 Free to join. Limited spots.\n\r\n📸 No photos taken without clear consent.\n\r\nSpots are limited - Sign up!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1275",
    "image": "https://attagalatta.com/admin/uploads/events/99240190.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-10T14:00:00+05:30",
    "endDate": "2025-08-10T17:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-12T17:00:00+05:30",
    "endDate": "2025-08-12T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-12T19:00:00+05:30",
    "endDate": "2025-08-12T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-19T17:00:00+05:30",
    "endDate": "2025-08-19T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-19T19:00:00+05:30",
    "endDate": "2025-08-19T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-26T17:00:00+05:30",
    "endDate": "2025-08-26T18:00:00+05:30"
  },
  {
    "name": "Hindustani Classical Vocal Classes - Weekly Classes",
    "description": "Meet Simran, a Hindustani Classical Vocalist and Teacher whose life has been harmoniously entwined with music since childhood. Disciple of Smt. Divya Shenoy, Simran's voice masterfully blends traditional rigor with emotional depth.\nFor her, music is more than art – it's a sacred, boundless journey of devotion.\nWith a rich multidisciplinary background in dance, painting, poetry, and theater, her teaching approach is innately creative.\nJoin her at Atta Galatta every Tuesday, where music transcends melody, becoming a haven to listen, to express and to belong!\nClasses will be on every Tuesday – 5 PM for children and 7 PM for adults. The monthly charges will be INR 2000 for one person. Trial classes available at INR 500 per class.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1218",
    "image": "https://attagalatta.com/admin/uploads/events/1797290386.jpg",
    "performer": "Simran Senani",
    "keywords": [
      "Music",
      "Weekly Classes"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-08-26T19:00:00+05:30",
    "endDate": "2025-08-26T18:00:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "The next dates for Queer Quiet Hours are here!  \nQueer Quiet Hours is back — a cozy space to rest, make art, and just be. No pressure to talk, no need to perform. Just soft community vibes and gentle company. Bring your own project or come as you are. We'll have plenty of art stuff for you to use.\n✨ For LGBTQIA+ folks only. We haven't opened it up to allies yet.\n\r\n🆓 Free to join. Limited spots.\n\r\n📸 No photos taken without clear consent.\n\r\nSpots are limited - Sign up!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1275",
    "image": "https://attagalatta.com/admin/uploads/events/99240190.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Wellness and Health",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-09-07T14:00:00+05:30",
    "endDate": "2025-09-07T17:00:00+05:30"
  }
]