[
  {
    "name": "Pen & Latte 6.0 - Story Writing Workshop",
    "description": "Atta Galatta and Aristotle’s Writers Club cordially invite you to the latest Writers Meetup in town.\nJoin fellow wordsmiths and storytellers for an inspiring afternoon of creativity at our Writers Club Meet event in the cozy ambiance of the library cafe. Whether you`re a seasoned author, aspiring novelist, or just passionate about penning your thoughts, this gathering is your opportunity to connect with like-minded individuals. Unleash your creativity and let your words flow in the company of kindred spirits at our Writers Club Meet.\nBring along your notebook, laptop or tablet and delve into a shared writing experience.\nWhat does it entail:\nInvolving in an ice breaker extravagant game.\nWriting a story based on a prompt.\nParticipating in the curated feedback discussion.\nFollowing community guidelines.\nCommunity Guidelines:\nBe open, be civil, be courteous, be kind, and have fun.\nListen more. Speak mindfully.\nNo monopolizing the conversation.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT818",
    "image": "https://attagalatta.com/admin/uploads/events/2049366924.jpeg",
    "performer": "Aristotle's Writers Club",
    "keywords": [
      "Writing",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-17T11:11:00+05:30",
    "endDate": "2024-11-17T14:22:00+05:30"
  },
  {
    "name": "Weaving A Story - A curated exploration of Bhujodi Sarees through stories",
    "description": "Join us for a curated storytelling morning - Weaving a story (An exploration of Bhujodi Sarees and textiles)\nAparna Jaishankar, in collaboration with Priyanka Rajwar and Roli Mishra,  will delve into stories of the symbolic significance of the colors and motifs, from the threads to the textured pallu . A curated collection of sarees from Vayaka India will be on display.\nWhether you're a lover of textiles, mythology, or just fascinated by Indian heritage, this event will wrap you in the magic of tradition.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT820",
    "image": "https://attagalatta.com/admin/uploads/events/971456739.jpg",
    "performer": "Aparna Jaishankar",
    "keywords": [
      "Storytelling",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-17T12:00:00+05:30",
    "endDate": "2024-11-17T13:00:00+05:30"
  },
  {
    "name": "Queer Quiet Hours - Meetup",
    "description": "Join us for a cozy, creative space where you can unplug, connect, and just be. This meetup is all about chill vibes—no agenda, no pressure. 🖍️✨\nOptional Activity: We’ll be making PRIDE posters for anyone who feels like joining in! 🖌️\nWhether it’s your first time or your fourth, come as you are—dive into your own project or simply soak up the wholesome atmosphere. Each meetup has brought inspiring moments and wonderful people, and we’re excited to share it all again! 💜\nThere are 15 spots available, and this meetup is exclusively for LGBTQIA+ folks. Neurospicy and neurotypical folks are all welcome. 🌈🎨",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT824",
    "image": "https://attagalatta.com/admin/uploads/events/1557432459.png",
    "performer": "ADHD Queeple",
    "keywords": [
      "Social",
      "Meetup"
    ],
    "@type": "SocialEvent",
    "startDate": "2024-11-17T14:00:00+05:30",
    "endDate": "2024-11-17T17:00:00+05:30"
  },
  {
    "name": "Main Narcissist Ban Na Chahti Hoon - Stand-Up Comedy Show",
    "description": "\"Main Narcissist banna chahti hoon\" is a poetic comedy (Pomedy) show written and performed by Somya Tewari. It’s like a tickle on your tummy that will make you laugh and cry and think and try all at once. Whether you are a narcissist or aspire to be, or someone who suffers because of someone else`s narcissism, this show is for you! 😀",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT825",
    "image": "https://attagalatta.com/admin/uploads/events/1921401119.jpg",
    "performer": "Somya Tewari",
    "keywords": [
      "Comedy",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-17T15:30:00+05:30",
    "endDate": "2024-11-17T16:30:00+05:30"
  },
  {
    "name": "Read A Kitaab - Monthly Book Club",
    "description": "Read A Kitaab is an unbiased community of Readers, Booklovers, writers and artists. We strive to provide the community an ecosystem with an online library, book discussions, author meet, book of the month, monthly meets, newsletters & much more...\nRead A Kitaab is a calm & comfort space to be yourself, to discuss books and life with no bars on age/gender/ethnicity/political views etc.\nJoin us for the August meet on Sunday 17th November to discuss books on magical realism! Entry free.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT819",
    "image": "https://attagalatta.com/admin/uploads/events/1167171764.jpeg",
    "performer": "Anurag Kothari, \nEkta Bhandari,",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-17T16:00:00+05:30",
    "endDate": "2024-11-17T18:00:00+05:30"
  },
  {
    "name": "Doodling Workshop - Doodling Workshop",
    "description": "Doodle Your Heart Out with Doodleshwari at Atta Galata!\nReady to scribble, giggle, and unleash your inner artist? Join Advaita, who is a doodler and illustrator on 17th November at 5:30 PM for a doodle workshop that’ll have you drawing your emotions like never before (stick figures welcome, tears optional!).\nNo experience needed—just bring your imagination and be prepared to express yourself one squiggle at a time. Let’s make some serious art… or seriously weird art.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT823",
    "image": "https://attagalatta.com/admin/uploads/events/367395608.png",
    "performer": "Advaita Jogalekar",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2024-11-17T17:30:00+05:30",
    "endDate": "2024-11-17T19:00:00+05:30"
  },
  {
    "name": "Food In Indian Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well.\nSo, if viewing the world through the lens of food and literature interests you, then join us to begin a dialogue on “Food in Indian Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we will be reading our way through several powerful (and delicious) narratives.\nNovember Read: Whose Samosa is it Anyway? The Story of Where “Indian” Food Really Came From by Sonal Ved\nWe assure you that you will relish every single bite!\nThe session is free but registration is a must as we have limited spots available.\nPrachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT794",
    "image": "https://attagalatta.com/admin/uploads/events/1512218646.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-23T11:00:00+05:30",
    "endDate": "2024-11-23T13:00:00+05:30"
  },
  {
    "name": "Nearly Nice Guy - Stand-Up Comedy Show",
    "description": "After touring all over the country with his \"Pure Veg Jokes\", India’s most viral English standup comic Saikiran is back with his brand new Stand-up comedy solo “NEARLY NICE GUY”. In this show he explores Why am I like this? Is it the genes or the lack of means? This show will spill the beans.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT826",
    "image": "https://attagalatta.com/admin/uploads/events/1818669170.png",
    "performer": "Sai Kiran",
    "keywords": [
      "Standup Comedy",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-11-23T18:00:00+05:30",
    "endDate": "2024-11-23T19:00:00+05:30"
  },
  {
    "name": "All-In: The Moments - Improv Comedy Show",
    "description": "9 improvisers take over the stage without any script. A few prompts from the audience are all that they want. Can they make things funny? Can they even come up with a story? They have 1.5 hours to prove.\nWhat is improv?\nImprov is not a play, there’s no script. It is also not standup, there are no tried and tested jokes. It is somewhere in between these two things. You’ll have to come to find out!\nWhy should you attend?\n\nYou are part of the script - your prompts will decide where the show will go\nYou can bring a date for a cool show\nYou can tell your Instagram friends that you attended a cool show",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT821",
    "image": "https://attagalatta.com/admin/uploads/events/1795373959.png",
    "performer": "All In Improv",
    "keywords": [
      "Improv",
      "Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2024-12-21T17:30:00+05:30",
    "endDate": "2024-12-21T19:00:00+05:30"
  }
]