[
  {
    "name": "Familiar Strangers - A workshop by Saachi & Pragya",
    "description": "Every day we encounter countless people, some friends, some strangers. Among the friends and strangers, there are familiar strangers: the people who appear regularly in our daily paths yet remain largely unseen.\nThis student-led workshop is built around using fiction to better understand these familiar strangers through noticing, mapping, and reimagining. Come sit, chat, and build new characters with us.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1459",
    "image": "https://attagalatta.com/admin/uploads/events/315802549.png",
    "performer": "Pragya Malu, \nSaachi Jain,",
    "keywords": [
      "Theatre",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-16T16:30:00+05:30",
    "endDate": "2025-10-16T19:30:00+05:30"
  },
  {
    "name": "Vrindaban, Present Please  - An Interactive play written and performed by Somudranil Sarkar",
    "description": "About the play \"Vrindaban, Present Please\" is an immersive, one-man interactive play set in a rural Indian village, where Samiran Banerjee, a Kolkata teacher, is transferred to a village school after a Supreme Court ruling. Assigned to a chaotic school once led by the mysteriously absent Salma Khatoon, Samiran's efforts to restore order only lead him deeper into unsettling events. From a water shortage to a snake in his room, his attempts to connect with the eccentric villagers only intensify his isolation. But behind it all, Samiran harbors a secret—someone named Vrindaban. Why does he hide this figure? Is it the only refuge in a world that refuses to understand him? The play unravels questions about isolation, hidden truths, and the blurred lines between personal and professional life.\nAbout the artist:  Somudranil Sarkar, a theatre maker from kolkata. He has over 25 years of experience in theatre and has had the privilege of training under some of the most respected names in the Bengali theatre circuit, including Rudraprasad Sengupta, Swatilekha Sengupta, Debshankar Halder, Sohini Sengupta, and Goutam Halder in Nandikar. He has also trained in mime under the guidance of mime guru Jogesh Dutta. Over the years, he has directed and acted in over 100 plays and curated various theatre workshops for diverse groups. Somudranil has received the Azhar Alam Young Director’s Award for his contribution to the field.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1431",
    "image": "https://attagalatta.com/admin/uploads/events/2101294310.png",
    "performer": "Somudranil Sarkar",
    "keywords": [
      "Theatre",
      "Interactive Play"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-17T19:00:00+05:30",
    "endDate": "2025-10-17T20:00:00+05:30"
  },
  {
    "name": "How to draw faces? - Character Design Workshop",
    "description": "Let’s draw some fun, interesting, and quirky faces! A workshop curated and crafted for beginners to understand the basics of shapes & character design. Bring your sharpened pencils and curiosity. Let’s put a face to your ideas!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1472",
    "image": "https://attagalatta.com/admin/uploads/events/1990089016.jpg",
    "performer": "Mounica Tata",
    "keywords": [
      "Art",
      "Interactive Workshop"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-18T11:00:00+05:30",
    "endDate": "2025-10-18T13:30:00+05:30"
  },
  {
    "name": "The Next Chapter - A book club for stories of renewal, purpose, and reinvention.",
    "description": "Join us for a morning of reflection, laughter, and meaningful conversation. The Next Chapter is not your typical book club, you don’t have to finish the book to be part of the circle. It’s a space to slow down, share experiences, and explore ideas that help us navigate change with curiosity and grace.\nThis month’s read, From Strength to Strength by Arthur Brooks, opens up a heartfelt conversation on what it means to redefine success, purpose, and peace as we move through life’s transitions.\nCome with an open mind, stay for the warmth of community, and maybe find your own “next chapter” along the way.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1475",
    "image": "https://attagalatta.com/admin/uploads/events/434135468.png",
    "performer": "Royina Baruah",
    "keywords": [
      "Book Club",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-18T11:00:00+05:30",
    "endDate": "2025-10-18T12:30:00+05:30"
  },
  {
    "name": "Making My Storybook - Workshop for Children by Shloka K.",
    "description": "Colors for the characters, words for the story, plain white pages to be filled with your child’s creativity.\n“Making My Storybook” is a hands-on book-making workshop for parents and their 3-5 year olds. This isn’t just doodles and colors, it’s a peek into your child’s world. A world shaped by everyday observations and experiences. This workshop opens up space for open-ended conversations with your child that may reveal cues about their interests, thoughts, and needs.\nSo, join us for an hour filled with colors, conversation, and creativity - and walk away with a storybook that’s uniquely yours.\nTakeaways from this workshop:\n- A storybook illustrated and authored by your child\n- An hour of conversational creativity\n- Insight into your child’s current interests and needs\n- Moments of bonding and joy with your child",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1462",
    "image": "https://attagalatta.com/admin/uploads/events/673922590.jpg",
    "performer": "Shloka K.",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "ChildrensEvent",
    "startDate": "2025-10-19T15:00:00+05:30",
    "endDate": "2025-10-19T16:00:00+05:30"
  },
  {
    "name": "Alchemy with Art - Art Workshop",
    "description": "Ever had that feeling that you are hungry for something more even though your tummy is full? \nWhat you truly crave is nourishment, of a deeper kind. At this workshop, you are shown how to make fun sacred and channel straight from your heart. To connect with the part of you that already has all the answers you seek. You are taught creative ways to look within and connect to your own magic. There will be mini soulful rituals, creative play, heart openers and deep listening to recharge you like never before.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1474",
    "image": "https://attagalatta.com/admin/uploads/events/504278230.png",
    "performer": "Harshitha",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-10-19T16:30:00+05:30",
    "endDate": "2025-10-19T18:30:00+05:30"
  },
  {
    "name": "Heart Beats Steady - Performance Workshop by Ishaa Parthan",
    "description": "Does the thought of performing or being in the spotlight make your heart beat wildly – but you still want to give performing a go? If yes, join us in this student-led performance workshop. You'll get a chance to overcome your stage fears through a series of playful and introspective theatre exercises that will hopefully 'steady your beating heart'!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1471",
    "image": "https://attagalatta.com/admin/uploads/events/1836360967.png",
    "performer": "Ishaa Parthan",
    "keywords": [
      "Theatre",
      "Workshop + Performance"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-23T15:00:00+05:30",
    "endDate": "2025-10-23T18:00:00+05:30"
  },
  {
    "name": "Food In Literature - Monthly Book Club",
    "description": "Our emotions and memories are intrinsically related to the food we eat and the genre of food literature combines them in a way that helps us connect not only to our past and our present, to different cultures, and communities, values and rituals, events both life-changing and mundane but to each other as well. So, if viewing the world through the lens of food and literature interests you, then join us for a dialogue on “Food in Literature” and to celebrate those stories and their diversity. Each month with Prachi Grover, we read our way through several powerful (and delicious) narratives. \nOctober Read: Desi Delicacies. \nEdited by Claire Chambers\nWe assure you that you will enjoy every single bite! The session is free but registration is a must as we have limited spots available. Prachi Grover is a culinary consultant and educator and is the founder of “From Words to Wok”; a community for people who to love to read and eat!\nCopies of the book are available at the store.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1449",
    "image": "https://attagalatta.com/admin/uploads/events/406224205.jpg",
    "performer": "Prachi Grover",
    "keywords": [
      "Books",
      "Discussion"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-25T11:00:00+05:30",
    "endDate": "2025-10-25T13:00:00+05:30"
  },
  {
    "name": "Hand Embroidery Workshop - Workshop by Swikruti Pradhan",
    "description": "About the Workshop\nUnwind from your busy schedules and join me for an enchanting Hand Embroidery Workshop. Hand embroidery is more than just a craft – it’s an experience.\nWhy attend?\nLearn a Mindful, Timeless Skill\nEmbroidery slows you down in the best way possible. It’s a meditative, hands-on way to unwind from busy schedules.\nConnect with Creativity & Community\nYou’ll meet others who share a love for handmade art and be inspired by the group's collective energy.\nTake Home Something You Made\nAt the end of the session, you’ll have a small, hand-embroidered piece – a keepsake of your effort and creativity.\nDate: October 25, 2025, Saturday \nTime: 4 to 6 PM\nAge: 15+\nFees: INR 1,200/- \nThis workshop includes all the materials.\nEach participant gets a cotton tote bag to embroider, which they will take back home.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1464",
    "image": "https://attagalatta.com/admin/uploads/events/777601568.png",
    "performer": "Swikruti Pradhan",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-10-25T16:00:00+05:30",
    "endDate": "2025-10-25T18:00:00+05:30"
  },
  {
    "name": "Atta Galatta presents “Let Poetry Be” - Poetry Open Mic",
    "description": "This monthly gathering will see poetry coming to life, through reading, music, art and any other forms of artistic expression, at Atta Galatta. Listeners and performers are all welcome!\n \nDate: 25th Oct\nTime: 4pm \nVenue: Atta Galatta, Indiranagar\n \nEvent specifics & submission guidelines –\n \n1. Theme - Free Verse (any original work)\n2. Works can be original or of other poets, performed live\n3. All languages welcome\n4. Participants can read to music (acoustic instrument/s), dramatise, use props & costumes\n5. Each participant will enjoy 5 minutes of reading time\n6. Kindly submit your poem and name to letpoetrybe@gmail.com on or before 23rd Oct midnight. WE WILL NOT ACCEPT ATTACHMENTS OR LINKS. SUBJECT OF YOUR MAIL MUST READ AS 'Entry for -Oct LPB meet-up '\n7. You may also send entries that are not related to the theme\n8. The event will begin at 4pm sharp and will be held at Atta Galatta. Participants to report not later than 3:45 pm to hear about performance order and meet the host\n9. For any further clarifications, write to us at letpoetrybe@gmail.com\n \nYou are now welcome to flood our inbox!",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1481",
    "image": "https://attagalatta.com/admin/uploads/events/620221886.png",
    "performer": "Palgun KJ",
    "keywords": [
      "Poetry",
      "Open Mic"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-25T16:00:00+05:30",
    "endDate": "2025-10-25T18:00:00+05:30"
  },
  {
    "name": "Nizhalgal Maarum Nodi: Book Discussion - Discuss the art of translation and storytelling across languages",
    "description": "Zero Degree Publishing presents a discussion on Nizhalgal Maarum Nodi, the Tamil translation of Vivek Shanbhag’s acclaimed Kannada novel Ooru Bhanga. Join Vivek Shanbhag and K. Nallathambi as they discuss the art of translation and storytelling across languages. The event will be held on 25 October 2025, from 6 to 7 PM at Atta Galatta, Indiranagar, Bengaluru.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1478",
    "image": "https://attagalatta.com/admin/uploads/events/1925941844.png",
    "performer": "Zero Degree Publishing",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-25T18:00:00+05:30",
    "endDate": "2025-10-25T19:00:00+05:30"
  },
  {
    "name": "Unmask the Art: Cherial Mask Making Workshop - Celebrate Traditional Indian Craftmanship",
    "description": "Immerse yourself in the vibrant world of Cherial masks, renowned for intricate designs and storytelling. Join our workshop to explore the history, significance, and craftsmanship of these iconic masks.\nCherial masks are a traditional Indian art form originating from Cheriyal village in Telangana's Warangal district. These vibrant masks are a modified version of Nakashi art and are known for their intricate designs and storytelling.\nTicket price also includes art material",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1458",
    "image": "https://attagalatta.com/admin/uploads/events/2047661376.png",
    "performer": "Dr. Sai Prenathy",
    "keywords": [
      "Art and Craft",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-10-25T18:30:00+05:30",
    "endDate": "2025-10-25T20:00:00+05:30"
  },
  {
    "name": "Georgette Heyer Reader Meetup - A Group discussion for Literature Enthusiasts",
    "description": "Georgette Heyer's blend of humor, clever dialogue, a brisk moving plot, historical accuracy and, of course, romance, is an absolute delight for all readers. You can escape into a world of leisure, populated by broad-shouldered noble lords and witty ladies who dreamt of love over a marriage of convenience ...Often set in Regency-era London, these novels revolved around the lives of the wealthy upper classes – society’s ton and their quirks.\nWhether you are a fan of many years or someone who is just starting out reading her novels you are more than welcome to join us to discuss and marinate in her world...",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1479",
    "image": "https://attagalatta.com/admin/uploads/events/2041528507.png",
    "performer": "Lakshmi Sankar",
    "keywords": [
      "Literary Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-26T11:00:00+05:30",
    "endDate": "2025-10-26T12:30:00+05:30"
  },
  {
    "name": "Fireworks: October Storytelling Meetup - for Adults by Bangalore Storytelling Society",
    "description": "*October Meetup Alert*\n Theme: Fireworks\n💥 Emotions that explode. Memories that crackle. Moments that sparkle. What are the fireworks in your story? 💥\nWe're lighting the fuse on October 26th, and you’re invited to set the stage ablaze at our next meetup for adults at the warm and welcoming Atta Galatta café!\n🗓️ Date: Saturday, October 26th\n📍 Venue: Atta Galatta, Bangalore\n🕐 Time: 1:00 PM – 2:00 PM\n🎙️ Theme: FIREWORKS\n📬 To Share Your Story: Write to us at\n📧 bangalorestorytellingsociety@gmail.com\n \n✨ Only 5 storytelling spots available – so send in your pitches pronto!\nWhether it's a night that ended in sparks, a Diwali that changed everything, or a love story that went off like a rocket – we want to hear your tale. \nCome for the stories, stay for the magic. You are most welcome to join us a s listeners too.\nLet’s set the afternoon alight, one story at a time. 🔥",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1476",
    "image": "https://attagalatta.com/admin/uploads/events/1299690930.jpg",
    "performer": "Bangalore Storytelling Society",
    "keywords": [
      "Storytelling",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-26T13:00:00+05:30",
    "endDate": "2025-10-26T14:00:00+05:30"
  },
  {
    "name": "Atta Galatta presents “Support Group” - Support Group by Nimesh George and Gokul R.",
    "description": "People make up big cities but what makes up people’s lives, hopefully not loneliness. Loneliness is an intensely painful state which arises out of lack of intimacy and connectedness. People from every walk of life, even those with social contacts or pursuing successful careers can experience sadness from absence of belongingness. This painful experience is felt in a myriad of contexts such as breakups, disagreeing families, fear of rejection, unrelatability, shyness and so on.\nThis support group has been constituted to bring people struggling with disconnectedness in various contexts together for a shared experience of comfort, belongingness, laughter, guidance and above all to break the cycle of sustained loneliness.\nThe support is being organized and moderated by Nimesh George Mphil PhD who is a practicing psychologist based in Bangalore. This session will be co-moderated by Nimesh George & Gokul R, who are both practising psychologists in Bangalore.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1467",
    "image": "https://attagalatta.com/admin/uploads/events/940105625.png",
    "performer": "Gokul R. , \nNimesh George,",
    "keywords": [
      "Wellness and Health",
      "Support Group"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-26T15:00:00+05:30",
    "endDate": "2025-10-26T16:30:00+05:30"
  },
  {
    "name": "Leadership in Action:  Inspiring Stories and Strategies for Growth - Book Launch Celebrations",
    "description": "📣 You're Invited: Book Launch Celebration\nLeadership in Action: Inspiring Stories and Strategies for Growth 🗓️ Date: 26-Oct-25 | 📍 Venue: Atta Galatta – The Book Store | 🕒 Time: 5PM – 6PM\n---\nFrom IT industry to big conglomerates, from steel plants to startups—this book has sparked conversations across industries.\nSince its release, Leadership in Action has resonated deeply with professionals navigating real-world challenges. With over 500+ copies sold across Kindle and print editions, and a 4.9-star rating on Amazon from 17+ verified reviews, the response has been nothing short of phenomenal.\n---\n💬 What Readers Are Saying:\n“I saw myself in these stories.” “It’s not just a book—it’s a movement.” “Finally, leadership that feels real.”\n---\n🔥 What to Expect at the Launch:\n· Live storytelling from featured leaders\n· Interactive leadership prompts from the book\n· Sneak peek into Padma’s upcoming books\n· Networking with changemakers, mentors, and readers\n---\n🎯 Why You Should Be There:\nWhether you're a mid-career professional, a founder, an HR leader, or someone seeking authentic growth—this event is your chance to connect, reflect, and lead with purpose.\nLet’s celebrate the stories that move us—and the strategies that shape us.\n📘 Leadership in Action is more than a book. It’s a call to rise.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1477",
    "image": "https://attagalatta.com/admin/uploads/events/504674153.jpg",
    "performer": "Padma Chankravadhanula",
    "keywords": [
      "Books and Literature",
      "Book Launch"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-26T17:00:00+05:30",
    "endDate": "2025-10-26T18:00:00+05:30"
  },
  {
    "name": "Bhang and Beyond - Book Signing by Akshaya Bahibala",
    "description": "We’re delighted to host an engaging session with Akshaya Bahibala, author of Bhang Journeys, a book that is part cultural history, part social commentary, and is also shaped by his own tryst with bhang. \nJoin us for an open and interactive conversation where you can chat with him, hear about his journey, and of course, get your copies signed",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1429",
    "image": "https://attagalatta.com/admin/uploads/events/2143283007.jpg",
    "performer": "Akshaya Bahibala",
    "keywords": [
      "Books",
      "Book signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-28T18:30:00+05:30",
    "endDate": "2025-10-28T19:30:00+05:30"
  },
  {
    "name": "Bhang and Beyond - Book Signing by Akshaya Bahibala",
    "description": "We’re delighted to host an engaging session with Akshaya Bahibala, author of Bhang Journeys, a book that is part cultural history, part social commentary, and is also shaped by his own tryst with bhang. \nJoin us for an open and interactive conversation where you can chat with him, hear about his journey, and of course, get your copies signed.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1482",
    "image": "https://attagalatta.com/admin/uploads/events/37696629.jpg",
    "performer": "Akshaya Bahibala",
    "keywords": [
      "Book Discussion",
      "Book Signing"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-10-28T18:30:00+05:30",
    "endDate": "2025-10-28T19:30:00+05:30"
  },
  {
    "name": "Land or Love? Book Reading and Discussion of Battle of Lands - Book Reading session",
    "description": "Join us for an engaging morning at Atta Galatta, Bengaluru’s beloved bookstore and cultural space, as Vandita Mishra discusses her latest book, Battle of Lands.\nRooted in the complexities of Indian families, Battle of Lands explores how love, ego, and the pursuit of inheritance intertwine to leave scars that echo across generations. Through its layered narrative, the book reflects on relationships fractured by property disputes and the silent emotional wounds carried within families, asking readers to ponder what truly endures: land or love.\nThe session will be followed by an audience interaction and book signing.\nVenue: Atta Galatta, Bengaluru\nDate and Time: November 1st, 11:30 AM- 1:00 PM\nEntry: Free",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1483",
    "image": "https://attagalatta.com/admin/uploads/events/217749942.jpeg",
    "performer": "Vandita Mishra",
    "keywords": [
      "Book Discussion",
      "Meetup"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-01T11:30:00+05:30",
    "endDate": "2025-11-01T13:00:00+05:30"
  },
  {
    "name": "ONCE UPON A BRUNCH - Sunday morning brunch and stories by Vikram Sridhar",
    "description": "Late weekend morning , brunch , stories like the ones from the olden times, meeting new people.\nWhat if they all come together?\nWeekend and late morning Brunch is an emotion . On the other hand, stories have always been an emotion too . What's common between the two is the rich heritage of food and stories. What if they come together?\nListen to these stories of the food as you enjoy your weekend Brunch set at a cozy location that has its own stories . A beautiful day starts with a lovely breakfast . And a morning with breakfast and stories . Every food we eat has a story to share .. Idli , Vada , bread , Paratha etc. Every breakfast comes after a long break and is eager to be eaten. A simple Weekend morning Brunch put together by Atta Galatta\nStorytelling around the food lores by Vikram Sridhar",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1466",
    "image": "https://attagalatta.com/admin/uploads/events/1770521456.png",
    "performer": "Vikram Sridhar",
    "keywords": [
      "Storytelling",
      "Performance and Menu Tasting"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-02T10:00:00+05:30",
    "endDate": "2025-11-02T12:00:00+05:30"
  },
  {
    "name": "Tarot & Intuition - An Afternoon of Insights",
    "description": "Step into an afternoon of soulful reflection and intuitive discovery with Anuradha Shukla — celebrated Tarot reader, life coach, and author of “The Intuitive Edge: A DIY Tarot Guide for Smarter Decisions in Love and Business.”\nIn a world full of noise, this gathering offers a quiet, meaningful space to reconnect with your inner wisdom. Through the ancient art of tarot, Anuradha gently guides participants to explore their emotions, clarify decisions, and realign with life’s deeper flow.\nThe session will feature:\nPersonal Tarot Readings – short, insightful sessions offering clarity and direction\nReflections on Intuition – understanding how to listen to the voice within\nGuided Conversations – linking tarot symbolism with everyday choices\nEnergy & Awareness Exercises – simple ways to ground and center yourself\nWhether you seek answers about love, career, or personal growth, this event invites you to pause, reflect, and trust your intuition. The experience is designed to help you leave lighter, calmer, and more attuned to your own path.\nCome with curiosity, stay with openness, and leave with a renewed sense of clarity.\nJoin us at Atta Galatta on 2nd November for an afternoon where spirituality meets insight — and where the tarot becomes a mirror to your soul.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1473",
    "image": "https://attagalatta.com/admin/uploads/events/eron.png",
    "performer": "Anuradha Shukla",
    "keywords": [
      "Wellness",
      "Personal Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-02T13:00:00+05:30",
    "endDate": "2025-11-02T15:00:00+05:30"
  },
  {
    "name": "Kannada Jamming - for Kannada Rajyotsava",
    "description": "🎶 Aaroha the band Presents: Kannada Jamming for Kannada Rajyotsava 🎶 \n This Kannada Rajyotsava, let’s come together to celebrate the spirit, culture, and soulful music of Karnataka! 💛❤️ Join Aaroha the Band for a special Kannada Jamming Session – an evening dedicated to the melodies that define our land. From timeless classics to contemporary hits that echo across generations, Aaroha brings you a heartfelt musical journey in the language of our roots. \n✨ Highlights of the Event: 🎵 Soulful Kannada songs and unplugged renditions 🎤 Sing-along moments with the audience Let’s celebrate Kannada Rajyotsava not just with words, but with the universal language of music. Come, sing, sway, and feel the pride of being a Kannadiga! \n📅 Date: 2nd November \n 🕒 Time: 6pm to 7:30pm \n📍 Venue: Atta Galatta, Indiranagar \n Let the beats of Karnataka’s heart resonate through every chord and every voice. Aaroha the Band invites you to be part of this musical tribute to Namma Kannada Nadu! 💛❤️",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1468",
    "image": "https://attagalatta.com/admin/uploads/events/342466238.jpg",
    "performer": "Aaroha the band",
    "keywords": [
      "Live Music",
      "Jamming"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-02T18:00:00+05:30",
    "endDate": "2025-11-02T19:30:00+05:30"
  },
  {
    "name": "Tara Goes Aahhhhh! - Book Reading by Garima Gupta",
    "description": "Facing Fears with Roars and Giggles! Ready for a story that doesn’t need words—just your eyes, your imagination, and all those big, bold feelings? Join Tara and her dino buddy on a wild, wordless adventure as they tackle their fears in the pop-up book Tara Goes Aahhhhh! with author Garima Gupta. It's a roar-some ride through emotions, courage, and friendship.\nAge: 4-8, accompanied by a parent.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1430",
    "image": "https://attagalatta.com/admin/uploads/events/338996915.jpg",
    "performer": "Garima Gupta",
    "keywords": [
      "Books",
      "Book Reading"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-08T11:00:00+05:30",
    "endDate": "2025-11-08T12:30:00+05:30"
  },
  {
    "name": "Pichwai Art Workshop - Art Workshop",
    "description": "Let`s witness Lord Krishna and his leelas through an art form - Pichwai Art, Pichwai means backdrops, these paintings were used as backdrops mainly in Srinathji's sanctum.\nIt is a traditional art form that dates back to the 16th century from the city of Nathdwara, Rajasthan.\nThese paintings portray Srinath ji and his leelas through bright and vivid colors.\nThe paintings are a way for us to connect with the Lord Krishna.\nThis art is soul-satisfying and divine, another art form to start with your basic art skill.\nYou need no prior knowledge of drawing or painting in order to attend this workshop.\nNO TRACING OR COPYING, You will be drawing on your own.\nSrinathji will be taught in this workshop and some of the required basic pichwai motifs.",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1470",
    "image": "https://attagalatta.com/admin/uploads/events/1129495751.png",
    "performer": "Sindhoor",
    "keywords": [
      "Art",
      "Workshop"
    ],
    "@type": "EducationEvent",
    "startDate": "2025-11-08T11:00:00+05:30",
    "endDate": "2025-11-08T14:00:00+05:30"
  },
  {
    "name": "Flash Jam 8 - Sing and Jam with Strangers",
    "description": "We’re a one-day choir of amateur singers that get together, sing and harmonise and jam our hearts out! That's right, experience or skill level is no bar - if you want to learn about vocal harmony, or just have fun and sing in a community, this is the place for you! This time, we’ll be performing Chiquitita, by ABBA! So come join us for a fresh, memorable weekend session :)",
    "url": "https://attagalatta.com/event_page.php?eventid=EVT1469",
    "image": "https://attagalatta.com/admin/uploads/events/1070288969.png",
    "performer": "Danish Abdi",
    "keywords": [
      "Live Music",
      "Jamming"
    ],
    "@type": "LiteraryEvent",
    "startDate": "2025-11-08T15:00:00+05:30",
    "endDate": "2025-11-08T17:00:00+05:30"
  }
]