[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "name": "Bengaluru Design Jam",
    "startDate": "2024-07-06T10:00:00+05:30",
    "endDate": "2024-07-06T17:00:00+05:30",
    "description": "http://OpenCity.in invites you to the Bengaluru Design Jam. Deliberate, analyse, interpret and present BBMP’s bye-laws through a visually accessible medium. Register at https://t.co/6VC41jwcIR for more details\n🗓️: 6th July 2024, Saturday | ⏰: 10:00 AM to 5:00 PM || 📍: Palace Road, Bengaluru 560052",
    "url": "https://www.bengalurusustainabilityforum.org/event/bengaluru-design-jam/",
    "keywords": [
      "In-person Event",
      "Partner Organisation Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Palace Road, Vasanth Nagar Bangalore 560052"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/06/opencity-design-jam.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "name": "CARBON Film Festival by Science Gallery Bengaluru",
    "startDate": "2024-07-06T10:00:00+05:30",
    "endDate": "2024-07-07T20:00:00+05:30",
    "description": "Carbon has been an invisible protagonist on the celluloid screen for a while now. Our lives are saturated with carbon, and the screen reflects its presence everywhere. Though unseen, carbon’s influence permeates our lives and finds reflection in countless stories on the big screen. This festival invites you on a journey from the barren grounds of an e-waste dump yard to the magical forests of the Western Ghats. We will showcase a distinctive collection of cinematic narratives centred on the theme of carbon and bring to life stories that span generations, reflecting both the past and the ever-evolving present. These stories of ambition, resilience, and perseverance will offer a deeper understanding of carbon and films, shedding light on the transformative power of carbon.\nThe festival strives to create an immersive environment where visitors can deeply interact with these ideas through various films and discussions. We are offering a wide array of films spanning different languages, including German, English, French, and Hindi, and genres, from documentary features and narrative features to docufictions and animated shorts. Filmmakers and scholars have been encouraged to create a colourful, interactive space that encourages people of all ages to consider carbon’s critical role in our lives and the global ecosystem. – Science Gallery Bengaluru",
    "url": "https://www.bengalurusustainabilityforum.org/event/carbon-film-festival-by-science-gallery-bengaluru/",
    "keywords": [
      "In-person Event",
      "Partner Organisation Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Rd, Stage 2, Domlur, Bengaluru, Karnataka 560071"
    },
    "inLanguage": "hi",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/06/carbon-ff-poster.jpeg"
  }
]