[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "11915-1732953600-1732986000@www.bengalurusustainabilityforum.org",
    "name": "Courses in Conservation Leadership 2025 ~ NCF India",
    "startDate": "2024-11-30T08:00:00+05:30",
    "endDate": "2024-11-30T17:00:00+05:30",
    "description": "NCF India is offering a wonderful set of courses to address the lack of adequate formal training in inter-disciplinary conservation research and  practice, which is essential  to create a strong cadre of well-trained and motivated conservation leaders and practitioners. The courses in Conservation Leadership are meant for Indian conservation practitioners and span essential conservation skills including project planning, fund raising, monitoring and evaluation of programmes, effective stakeholder engagement, and effective communication. \nThe courses aim to assist conservation practitioners in finding the best solutions to help them in their work. Read more on the courses here. \nClick here for specific course links to REGISTER NOW before 30 Nov. ",
    "url": "https://www.bengalurusustainabilityforum.org/event/courses-in-conservation-leadership-2025-ncf-india/",
    "keywords": [
      "External event",
      "In-person Event"
    ],
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/11/ncfindia_2024-11-14_hqjkfoga_CCL-Poster-2025.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "11807-1733040000-1733418000@www.bengalurusustainabilityforum.org",
    "name": "The Trialogue Days: Planetary Health from Different Perspectives—Mind the Gap ~ Swissnex India",
    "startDate": "2024-12-01T08:00:00+05:30",
    "endDate": "2024-12-05T17:00:00+05:30",
    "description": "The Trialogue Days: Planetary Health from Different Perspectives—Mind the Gap will take place from December 1 to December 5 at IISc central building. This multi- and transdisciplinary event will bring together more than 50 researchers, clinicians, journalists, and other professionals from Switzerland, Uganda, and India to discuss together how to address the new planetary health problems. \nREGISTER NOW!",
    "url": "https://www.bengalurusustainabilityforum.org/event/the-trialogue-days-planetary-health-from-different-perspectives-mind-the-gap-swissnex-india/",
    "keywords": [
      "External event",
      "In-person Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Indian Institute of Science, Bengaluru"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/11/Final-Young-Minds-Flyer-scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "11777-1733047200-1733072400@www.bengalurusustainabilityforum.org",
    "name": "Rooting for Tubers ~ Spudnik Farms",
    "startDate": "2024-12-01T10:00:00+05:30",
    "endDate": "2024-12-01T17:00:00+05:30",
    "description": "You don’t want to miss the 2024 Rooting for Tubers Festival! for a celebration of indigenous tuber crops, sustainable agriculture, and the diverse culinary traditions that highlight their potential. \n– Meet farmers, chefs, and food enthusiasts passionate about biodiversity\n– Fun workshops and talks on tuber crops and sustainable food systems\n– Creative installations and cultural performances \nRooting for Tubers is a vibrant celebration of the incredible world of tuber crops. The goal is to spread awareness about tuber crops and brainstorm potential strategies for bringing root & tuber crops into the mainstream. Ring in the last month of the year with the second edition of the Rooting For Tubers Festival. \nBOOK TICKETS NOW!",
    "url": "https://www.bengalurusustainabilityforum.org/event/rooting-for-tubers-spudnik-farms/",
    "keywords": [
      "External event",
      "In-person Event"
    ],
    "location": {
      "@type": "Place",
      "name": "St Johns Auditorium, Koramangala, Bengaluru, India"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/11/rooting-for-tubers-festival.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "11165-1732950000-1732957200@www.bengalurusustainabilityforum.org",
    "name": "Water Testing Walk ~ by ATREE",
    "startDate": "2024-11-30T07:00:00+05:30",
    "endDate": "2024-11-30T09:00:00+05:30",
    "description": "Join this walk at the Jakkuru lake – guided by Priyanka Jamwal of ATREE \nREGISTER NOW",
    "url": "https://www.bengalurusustainabilityforum.org/event/water-testing-walk-by-atree/",
    "keywords": [
      "External event",
      "In-person Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Jakkuru Lake"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/09/Screenshot-2024-09-14-at-15.00.59.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "11767-1732233600-1733356799@www.bengalurusustainabilityforum.org",
    "name": "ALL LIVING THINGS - Environmental Film Festival 2024",
    "startDate": "2024-11-22T05:30:00+05:30",
    "endDate": "2024-12-05T05:30:00+05:30",
    "description": "ALT EFF’s 2024 edition marks five years of driving large-scale climate action through the power of cinema, inspiring us to understand our place and role on this shared planet.\nJoin the movement, take charge, and spark a ripple of change. \nThe All Living Things Environmental Film Festival (ALT EFF) curates impact storytelling and experiential learning that is accessible, relevant to inspires awareness into action. Through pay-as-you-feel global online streaming & in-person community screenings, they showcase untold stories of regeneration, activism, crisis and hope. \nBangalore screenings between November 22nd to December 4th\nKEY DETAILS ABOUT #ALTEFF2024:\n🎥 100+ live screening events pan-India + globally (Ireland, Chile, Costa Rica, USA)\n🎥 72 films\n🎥 Streaming 🌏 online \nSEE | BOOK | REGISTER at www.alteff.in",
    "url": "https://www.bengalurusustainabilityforum.org/event/all-living-things-environmental-film-festival-2024/",
    "keywords": [
      "External event",
      "Hybrid Event"
    ],
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/11/alteff.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "11922-1732233600-1733097599@www.bengalurusustainabilityforum.org",
    "name": "November Tree Festival ~ Season Watch",
    "startDate": "2024-11-22T05:30:00+05:30",
    "endDate": "2024-12-02T05:30:00+05:30",
    "description": "Don’t miss this opportunity to celebrate the end of the year in one of the best ways possible! Season watch invites you to organize and go on tree walks around you and SeasonWatch your trees. Participate, Complete the festival challenges and win exciting prizes! \nWhen: 22 November – 1 December 2024 \nWhere: Anywhere in India! \nREAD MORE about the festival challenges here!",
    "url": "https://www.bengalurusustainabilityforum.org/event/november-tree-festival-season-watch/",
    "keywords": [
      "External event",
      "In-person Event"
    ],
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/11/seasonwatch-trees.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "11730-1727949600-1735059600@www.bengalurusustainabilityforum.org",
    "name": "Urban Ecology - a New Lens on Biodiversity",
    "startDate": "2024-10-03T10:00:00+05:30",
    "endDate": "2024-12-24T17:00:00+05:30",
    "description": "We’re excited to invite you to the Urban Ecology exhibition, a collaboration with the IIHS Library and Mihir Kulkarni from the IIHS School of Environment and Sustainability.\nUnderstanding urban ecological dynamics is crucial for developing strategies to mitigate biodiversity loss and promote nature conservation within cities and for improved sustainability. However, the process of urbanisation intertwines with social and economic factors, creating complex interactions that demand our attention. Urban ecology addresses these challenges by studying ecology in, of, and for the city. Through a series of engaging activities focussed on India, this quarter’s exhibition is curated to introduce a broader audience to this fascinating area of research. \nThe curated collection of books, publications and research articles delves into the complex interactions between cities, nature, and the social factors that influence them. \nThe exhibition is free and open to all; walk in and enjoy the curation. Don’t miss the dedicated corner showcasing publications from our Small Grants Programme Projects! ",
    "url": "https://www.bengalurusustainabilityforum.org/event/urban-ecology-a-new-lens-on-biodiversity/",
    "keywords": [
      "BSF event",
      "In-person Event",
      "Partner Organisation Event"
    ],
    "location": {
      "@type": "Place",
      "name": "IIHS Bangalore City Campus, Sadashiva Nagar"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/10/20241004_LibExhibition-Announcement_Page_1-scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "11160-1733734800-1734109200@www.bengalurusustainabilityforum.org",
    "name": "Basic Statistics in Environmental and Agricultural Sciences Using R ~ by APU",
    "startDate": "2024-12-09T09:00:00+05:30",
    "endDate": "2024-12-13T17:00:00+05:30",
    "description": "A Five-day professional development course for early career researchers, PhD scholars, and practitioners from NGOs, academia, and research institutes working in the field of environmental, agricultural, and allied sectors with no prior experience in R or statistics. \nApplication Deadline: 20 September 2024 \nAPPLY NOW!",
    "url": "https://www.bengalurusustainabilityforum.org/event/basic-statistics-in-environmental-and-agricultural-sciences-using-r-by-apu/",
    "keywords": [
      "In-person Event",
      "Partner Organisation Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Azim Premji University, Burugunte Village, Survey No 66, Bikkanahalli Main Rd, Sarjapura, Bengaluru, Karnataka, 562125, India"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/09/Basic-Stats_R_24_SM-creative-APU.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "11162-1731488400-1732640400@www.bengalurusustainabilityforum.org",
    "name": "Mountains of Life ~ by Azim Premji University",
    "startDate": "2024-11-13T09:00:00+05:30",
    "endDate": "2024-11-26T17:00:00+05:30",
    "description": "Celebrate nature and understand sustainability and climate change issues through a trilingual, multi-sensorial and immersive festival! \nImmerse yourselves in stories of mountains from India and around the world, alongside art installations, cultural performances, movies, installations, artefacts, interactive workshops and more! \nOpen to schools, colleges, organisations and the public. Advance Registration required. \nREGISTER NOW!",
    "url": "https://www.bengalurusustainabilityforum.org/event/mountains-of-life-by-azim-premji-university/",
    "keywords": [
      "In-person Event",
      "Partner Organisation Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Azim Premji University, Burugunte Village, Survey No 66, Bikkanahalli Main Rd, Sarjapura, Bengaluru, Karnataka, 562125, India"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/09/mol_poster-03-APU--scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "11926-1732809600-1732813200@www.bengalurusustainabilityforum.org",
    "name": "Webinar Series on Urban Ecology @ BSF-IIHS Library Exhibition",
    "startDate": "2024-11-28T16:00:00+05:30",
    "endDate": "2024-11-28T17:00:00+05:30",
    "description": "BSF in collaboration with Mihir Kulkarni of the School of Environment and Sustainability IIHS, and the IIHS Library Team is excited to invite you to a webinar series on Urban Ecology. These webinars have been specially curated to offer a range of diverse approaches and perspectives to the emerging field of Urban Ecology.  \nTraditionally, ecologists have focused on ‘pristine’ environments with minimal human impact to study biodiversity. However, with growing human population, urban centres are rapidly expanding globally, transforming natural landscapes and habitats, and significantly altering biodiversity patterns. The urban environment now stands as a novel, dynamic ecosystem, with urbanisation recognised as a pivotal force shaping global biodiversity. The process of urbanisation also intertwines with social and economic factors, creating complex interactions that demand our attention. Understanding urban ecological dynamics is crucial for developing strategies to mitigate biodiversity loss and promote nature conservation within cities, ultimately contributing to improved sustainability. Urban ecology addresses these challenges by studying ecology in, of, and for the city.  \nThe first webinar in the series is on 28 Nov 2024 by Prof Nishant Kumar \nAre cities “The Room of Requirement” for opportunistic animals?  \nGlobally, opportunistic taxa such as kites, macaques, street dogs, and livestock have adapted to living alongside humans, taking advantage of the ‘human niche’. While most humans occupy only 4% of Earth’s land in cities, their activities impact over 70% of the global environment. This has created a complex web of human-animal interactions, often characterised by tensions and conflicts. The speaker’s research in Delhi focuses on how these opportunistic scavengers exploit predictable food sources in urban areas, such as garbage dumps and ritual feeding sites. This influences behaviour in both animals and humans along the urban gradient. Historically, these interactions have provided benefits, but can also lead to problems like property damage, conflicts, and disease transmission.Notably, human-avian coexistence in South Asia represents a distinctive fusion of adopted Western infrastructure and unique Indian ethos. The webinar will look at why transdisciplinary research methodologies are indispensable for understanding and managing human-animal coexistence as we design more vibrant, “animated” tropical cities. \nNishant Kumar is faculty at Dr. B. R. Ambedkar University Delhi, and a DBT/Wellcome Trust UK India Alliance Fellow at Oxford University’s Biology Department (overseas host), where he completed his D.Phil. His team, THINKPAWS, studies resident and migratory commensals/wildlife in Delhi to understand human-animal interactions and zoonotic disease risks using a One Health approach. Nishant also promotes open science and innovative public engagement with science. He integrates natural and social sciences with humanities to address global challenges, fostering cross-disciplinary collaboration for human-animal coexistence. \nREGISTER NOW!",
    "url": "https://www.bengalurusustainabilityforum.org/event/webinars-on-urban-ecology-bsf-iihs-library-exhibition/",
    "keywords": [
      "BSF event",
      "Online Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Zoom Webinar"
    },
    "inLanguage": "en"
  }
]