[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "name": "Book discussion with Lakshmi Swaminathan and Chitra Vishwanath",
    "startDate": "2024-07-13T17:00:00+05:30",
    "endDate": "2024-07-13T19:00:00+05:30",
    "description": "Tune into this conversation between author Lakshmi Swaminathan and architect Chitra Vishwanath as they discuss the extraordinary life of Didi Contractor. This discussion will cover Lakshmi’s experience of compiling and editing the life and values of Didi Contractor, in her latest book A CALL TO RETURN: A JOURNEY WITH DIDI CONTRACTOR. \nAbout the speakers:  \nLakshmi Swaminathan is an architect from Chennai. After graduation, she worked in a conventional architecture office, taught in design schools, and pursued her passion for khadi textiles through weaving and block printing. In 2017, seeking inspiration for her own practice, she came to Kangra valley to spend a day with Didi in 2017. She ended up living with her for the next four years, and assisting her on multiple projects.  \nChitra Vishwanath is the founder and senior architect at Biome Environmental Solutions- an architectural firm based in Bangalore. Through their work they strive to showcase that an ecological design practice can be mainstream and relevant in various contexts, including geography, typology and scale, balanced by the client’s aspirations for aesthetics, functionality and budget.",
    "url": "https://www.bengalurusustainabilityforum.org/event/book-discussion-with-lakshmi-swaminathan-and-chitra-vishwanath/",
    "keywords": [
      "In-person Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Champaca Bookstore 7/1 Edward Road, Champaca Bookstore, Bengaluru, India"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/07/DidiCONTRACTOR-13Jul.webp"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "name": "CARBON Film Festival by Science Gallery Bengaluru",
    "startDate": "2024-07-06T10:00:00+05:30",
    "endDate": "2024-07-07T20:00:00+05:30",
    "description": "Carbon has been an invisible protagonist on the celluloid screen for a while now. Our lives are saturated with carbon, and the screen reflects its presence everywhere. Though unseen, carbon’s influence permeates our lives and finds reflection in countless stories on the big screen. This festival invites you on a journey from the barren grounds of an e-waste dump yard to the magical forests of the Western Ghats. We will showcase a distinctive collection of cinematic narratives centred on the theme of carbon and bring to life stories that span generations, reflecting both the past and the ever-evolving present. These stories of ambition, resilience, and perseverance will offer a deeper understanding of carbon and films, shedding light on the transformative power of carbon.\nThe festival strives to create an immersive environment where visitors can deeply interact with these ideas through various films and discussions. We are offering a wide array of films spanning different languages, including German, English, French, and Hindi, and genres, from documentary features and narrative features to docufictions and animated shorts. Filmmakers and scholars have been encouraged to create a colourful, interactive space that encourages people of all ages to consider carbon’s critical role in our lives and the global ecosystem. – Science Gallery Bengaluru",
    "url": "https://www.bengalurusustainabilityforum.org/event/carbon-film-festival-by-science-gallery-bengaluru/",
    "keywords": [
      "In-person Event",
      "Partner Organisation Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Rd, Stage 2, Domlur, Bengaluru, Karnataka 560071"
    },
    "inLanguage": "hi",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/06/carbon-ff-poster.jpeg"
  }
]