[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "12054-1734768000-1741194000@www.bengalurusustainabilityforum.org",
    "name": "CLIMATE LEADERSHIP PROGRAM x Resilient Cities (Bengaluru)~ SUSTERA",
    "startDate": "2024-12-21T08:00:00+05:30",
    "endDate": "2025-03-05T17:00:00+05:30",
    "description": "<aside> 💡 The Climate Leadership Program X on Resilient Cities is a professionally guided leadership program designed by SUSTERA Foundation to empower dedicated citizen leaders from Bangalore to tackle the city’s unique urban hazard challenges. In this 10-week intensive fellowship, selected few individuals aged 22 to 45 will gain an in-depth understanding of urban climate risks and the skills to address pressing environmental issues that impact Bangalore’s communities daily. \nThis fellowship focuses on real, actionable change, equipping participants with tools to tackle urban hazards that threaten the city’s sustainability, including water scarcity, urban heat, flooding, and air pollution. By the end of the program, participants will not only understand the complexities of these issues but also be prepared to lead community-driven initiatives for a resilient and sustainable Bangalore. \nCommitment Requirement: This program requires a commitment of approximately 10 hours per week along with 3 offline days for immersive, hands-on learning. \nNote: This program is designed for those ready to take initiative, build a resilient Bangalore, and lead impactful citizen movements for climate resilience. \nAPPLY NOW!  \nRegistration closes on 10 Dec 2024",
    "url": "https://www.bengalurusustainabilityforum.org/event/climate-leadership-program-x-resilient-cities-bengaluru-sustera/",
    "keywords": [
      "External event",
      "Hybrid Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Karnataka"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/12/CLPBengaluru2024.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "12123-1733011200-1740787199@www.bengalurusustainabilityforum.org",
    "name": "Asian Waterbird Census",
    "startDate": "2024-12-01T05:30:00+05:30",
    "endDate": "2025-03-01T05:30:00+05:30",
    "description": "The Asian Waterbird Census (AWC) takes place every year. This citizen science event is a part of the global International Waterbird Census (IWC) that supports the conservation and management of wetlands and waterbirds worldwide. \nBy using eBird and filling out an additional site form, one can participate in this multi-country effort to document the state of our wetlands and waterbirds. To take part, you simply visit a wetland and count the birds you see there. Join the 2025 Asian Waterbird Census (AWC). Count waterbirds at wetlands, upload to eBird, and fill out a site form to help document wetland and waterbird populations. Details here.",
    "url": "https://www.bengalurusustainabilityforum.org/event/asian-waterbird-census/",
    "keywords": [
      "External event",
      "In-person Event",
      "Online Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Karnataka"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/12/Screenshot-2024-12-14-at-11.57.23.png"
  }
]