[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "12054-1734768000-1741194000@www.bengalurusustainabilityforum.org",
    "name": "CLIMATE LEADERSHIP PROGRAM x Resilient Cities (Bengaluru)~ SUSTERA",
    "startDate": "2024-12-21T08:00:00+05:30",
    "endDate": "2025-03-05T17:00:00+05:30",
    "description": "<aside> 💡 The Climate Leadership Program X on Resilient Cities is a professionally guided leadership program designed by SUSTERA Foundation to empower dedicated citizen leaders from Bangalore to tackle the city’s unique urban hazard challenges. In this 10-week intensive fellowship, selected few individuals aged 22 to 45 will gain an in-depth understanding of urban climate risks and the skills to address pressing environmental issues that impact Bangalore’s communities daily. \nThis fellowship focuses on real, actionable change, equipping participants with tools to tackle urban hazards that threaten the city’s sustainability, including water scarcity, urban heat, flooding, and air pollution. By the end of the program, participants will not only understand the complexities of these issues but also be prepared to lead community-driven initiatives for a resilient and sustainable Bangalore. \nCommitment Requirement: This program requires a commitment of approximately 10 hours per week along with 3 offline days for immersive, hands-on learning. \nNote: This program is designed for those ready to take initiative, build a resilient Bangalore, and lead impactful citizen movements for climate resilience. \nAPPLY NOW!  \nRegistration closes on 10 Dec 2024",
    "url": "https://www.bengalurusustainabilityforum.org/event/climate-leadership-program-x-resilient-cities-bengaluru-sustera/",
    "keywords": [
      "External event",
      "Hybrid Event"
    ],
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/12/CLPBengaluru2024.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "12090-1737036000-1737045000@www.bengalurusustainabilityforum.org",
    "name": "Screening of 'Nilgiris - a Shared Wilderness'",
    "startDate": "2025-01-16T14:00:00+05:30",
    "endDate": "2025-01-16T16:30:00+05:30",
    "description": "The birthplace of sacred rivers, the land of thundering waterfalls and deep gorges, and home to the guardians of our climate, India’s first UNESCO Biosphere Reserve— the Nilgiris—encompasses the country’s largest network of protected areas. The Nilgiris: India’s Blue Mountains – delves into the intersection where wildlife and humans come face to face, shedding light on the delicate balance that has sustained this extraordinary landscape for ages. Featuring stunning 4K footage captured with advanced camera technology the film showcases the stories of remarkable wildlife — the elusive leopards and their playful cubs, the gaur peacefully navigating tea plantations, and the hornbills hunting for migratory dragonflies — all adapting to an ever-changing landscape. At its core, this is a story of hope, fragility, and interconnected futures. As the Nilgiris continues to hold secrets within its folds, one question remains: Can we preserve this magical yet imperfect wild habitat for future generations? \nA tale of a wilderness like no other, where humans and wildlife live within blurred boundaries. \nSandesh V. Kadur is a BAFTA Award-winning filmmaker, National Geographic Fellow & Explorer, and was recently named the second-ever Explorer Trustee of the National Geographic Society Board of Trustees. His groundbreaking documentaries have aired globally on networks like National Geographic, BBC, Netflix, Apple, Discovery Channel, and Animal Planet.",
    "url": "https://www.bengalurusustainabilityforum.org/event/12090/",
    "keywords": [
      "BSF event",
      "In-person Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Mount Carmel College Auditorium"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/12/mcc-16Jan-felis.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "12123-1733011200-1740787199@www.bengalurusustainabilityforum.org",
    "name": "Asian Waterbird Census",
    "startDate": "2024-12-01T05:30:00+05:30",
    "endDate": "2025-03-01T05:30:00+05:30",
    "description": "The Asian Waterbird Census (AWC) takes place every year. This citizen science event is a part of the global International Waterbird Census (IWC) that supports the conservation and management of wetlands and waterbirds worldwide. \nBy using eBird and filling out an additional site form, one can participate in this multi-country effort to document the state of our wetlands and waterbirds. To take part, you simply visit a wetland and count the birds you see there. Join the 2025 Asian Waterbird Census (AWC). Count waterbirds at wetlands, upload to eBird, and fill out a site form to help document wetland and waterbird populations. Details here.",
    "url": "https://www.bengalurusustainabilityforum.org/event/asian-waterbird-census/",
    "keywords": [
      "External event",
      "In-person Event",
      "Online Event"
    ],
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/12/Screenshot-2024-12-14-at-11.57.23.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "12096-1737021600-1737030600@www.bengalurusustainabilityforum.org",
    "name": "Field Ecology in India: Research execution to Science Communication",
    "startDate": "2025-01-16T10:00:00+05:30",
    "endDate": "2025-01-16T12:30:00+05:30",
    "description": "Join this workshop on Field Ecology in India: Research execution to Science Communication  led by Dr Nishant Kumar of Ambedkar University. \nThe concept that all humans possess an inherent biophilia positions ecologists as vital facilitators in South Asia, where they can engage with local communities rich in traditional knowledge. These communities are not only essential stakeholders in biodiversity conservation but also play a crucial role in promoting sustainable living practices. \nThis workshop will feature sessions designed to address contemporary challenges at the intersection of conservation and development, with a particular focus on shared well-being. Participants will engage in handson activities, including creating videos, posters, graphic designs, or comics, dedicated to various forms of science communication. These activities aim to reflect their commitment to effective outreach. The goal is to demonstrate how leveraging expertise and fostering collaboration with local communities can enhance public understanding of ecological principles and empower individuals to take meaningful action in preserving our planet’s biodiversity.",
    "url": "https://www.bengalurusustainabilityforum.org/event/field-ecology-in-india-research-execution-to-science-communication/",
    "keywords": [
      "BSF event",
      "In-person Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Mount Carmel College"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/12/mcc-16jan-nishant3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "12108-1735065000-1735070400@www.bengalurusustainabilityforum.org",
    "name": "Nilgiris-a shared wildnerness",
    "startDate": "2024-12-24T18:30:00+05:30",
    "endDate": "2024-12-24T20:00:00+05:30",
    "description": "This is the story of India’s first UNESCO Biosphere Reserve – the Nilgiris – one of Asia’s most intensively studied areas. A land of sacred peaks and secret creatures, lost in the mists of time, somewhere between folklore and magic. A land that has challenged conventional notions of wilderness and showcased nature’s remarkable ability to adapt and thrive in a new wilderness. This is the first feature-length documentary about this region that takes us on a journey of discovery and uncovers the many secrets that make this region so special. \nThis film was created as an educational project to foster awareness about the Nilgiris Biosphere Reserve and its enduring relationship with both people and nature. \nRSVP Here!",
    "url": "https://www.bengalurusustainabilityforum.org/event/12108/",
    "keywords": [
      "External event",
      "In-person Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Rd, Stage 2, Domlur, Bengaluru, Karnataka 560071"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/12/Screenshot-2024-12-20-at-15.31.40.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "11730-1727949600-1735059600@www.bengalurusustainabilityforum.org",
    "name": "Urban Ecology - a New Lens on Biodiversity",
    "startDate": "2024-10-03T10:00:00+05:30",
    "endDate": "2024-12-24T17:00:00+05:30",
    "description": "We’re excited to invite you to the Urban Ecology exhibition, a collaboration with the IIHS Library and Mihir Kulkarni from the IIHS School of Environment and Sustainability.\nUnderstanding urban ecological dynamics is crucial for developing strategies to mitigate biodiversity loss and promote nature conservation within cities and for improved sustainability. However, the process of urbanisation intertwines with social and economic factors, creating complex interactions that demand our attention. Urban ecology addresses these challenges by studying ecology in, of, and for the city. Through a series of engaging activities focussed on India, this quarter’s exhibition is curated to introduce a broader audience to this fascinating area of research. \nThe curated collection of books, publications and research articles delves into the complex interactions between cities, nature, and the social factors that influence them. \nThe exhibition is free and open to all; walk in and enjoy the curation. Don’t miss the dedicated corner showcasing publications from our Small Grants Programme Projects! ",
    "url": "https://www.bengalurusustainabilityforum.org/event/urban-ecology-a-new-lens-on-biodiversity/",
    "keywords": [
      "BSF event",
      "In-person Event",
      "Partner Organisation Event"
    ],
    "location": {
      "@type": "Place",
      "name": "IIHS Bangalore City Campus, Sadashiva Nagar"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/10/20241004_LibExhibition-Announcement_Page_1-scaled.jpg"
  }
]