[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "11020-1731196800-1731628799@www.bengalurusustainabilityforum.org",
    "name": "Back to Roots Residency ~ by Spudnik Farms",
    "startDate": "2024-11-10T05:30:00+05:30",
    "endDate": "2024-11-15T05:30:00+05:30",
    "description": "Back to Roots is a residency program by Spudnik Farms aimed at creating spaces for interdisciplinary learning and fostering cultural exchanges that stimulate food innovation necessary for healthier and more prosperous communities. The goal is to unite the culinary expertise of chefs with the profound insights of local farmers, pushing the boundaries of what’s possible in the world of food. \nSpudnik Farms, +91 7349632966 +91 9900606698 \nResidency Activities:  \n\nField trips and excursions to tuber-growing communities\nHands-on experience with tuber crop cultivation and harvesting\nWorkshops and talks by experts on tuber crops and sustainable agriculture\nCollaborative recipe development and cooking sessions\nCultural exchanges and community engagement activities\n\nSubmission Instructions: \n\nPlease submit your completed application form, along with any supporting materials (portfolio, website links, etc.) by 30th August 2024.\nSelected participants will be notified by the end of September.",
    "url": "https://www.bengalurusustainabilityforum.org/event/back-to-roots-residency-by-spudnik-farms/",
    "keywords": [
      "External event",
      "In-person Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Joida village"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/08/back-to-roots-residency-01-neelima.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "11025-1727688600-1727807400@www.bengalurusustainabilityforum.org",
    "name": "\"Children Need Nature\" - a national conference ~ by Karma Bhoomi Trust",
    "startDate": "2024-09-30T09:30:00+05:30",
    "endDate": "2024-10-01T18:30:00+05:30",
    "description": "The Children need Nature conference is being offered to all by Prakriya Green Wisdom School and Bhoomi College with Karma Bhoomi Trust as the organiser. \nAbout the Conference: Many thought leaders and educationists would agree that all of us, children as well as adults will benefit from connecting to Nature, living a lifestyle that values Nature more. In addition, today there is increasing scientific research as well, that makes it clear that children need Nature for multiple reasons, not only for their physical and mental health, but also to improve their cognitive and creative abilities as well as their socio-emotional and personal growth. It is also becoming increasingly clear that it is essential to foster future generations who have a greater connect with Nature and a greater willingness to engage in climate action and practices for sustainability. What the world needs more than ever before are custodians and stewards of nature! It has become an imperative in times of acute climate crisis and nature disconnect. \nThe purpose of this conference is to create a space for parents, educators and school administrators to share research findings and nature education practices and join a movement to include Nature education sessions in schools to care for the future of our children and the future of our planet. The organisers welcome you to be part of the conference! \nREGISTER NOW",
    "url": "https://www.bengalurusustainabilityforum.org/event/children-need-nature-a-national-conference-by-karma-bhoomi-trust/",
    "keywords": [
      "External event",
      "In-person Event"
    ],
    "location": {
      "@type": "Place",
      "name": "NIMHANS Convention Centre, Hosur Road, Bengaluru-560029"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/08/cnn-poster-21aug-Murtuza-Khetty.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "10985-1724319000-1724679000@www.bengalurusustainabilityforum.org",
    "name": "Jana Vana - festival of Forest, Wildlife and People",
    "startDate": "2024-08-22T09:30:00+05:30",
    "endDate": "2024-08-26T13:30:00+05:30",
    "description": "Bannerughatta Biological Park in association with Azim Premji University and All Living Things: Environmental Film Festival (ALT EFF) are hosting “Jana Vana”, a 5-day festival of Forest, Wildlife and People from August 22-26, 2024. \nThe festival will include : \n\n\n\nAn exhibition on the theme of ​“Climate Change and Biodiversity” – On all five days, the exhibition curated by Azim Premji University will have a dedicated resource person to take the participants through real-life stories and nature’s incredible creations documented nationwide.\nWorkshops for students and school teachers – The student workshop is tailor-made for students from Grade VII-XII, allowing them to explore the diversity which they encounter in their daily lives. This workshop will take place from 9.30 AM‑1.30 PM with a maximum of 120 participants per day on 22, 23 and 26 August 2024. A maximum of 30 students per school with two teachers can enroll for each of the workshops by filling out the Google form. A workshop for teachers will be held on 24 August for a maximum of 40 teachers from any school. This workshop will take place between 7 AM- 1:30 PM in the zoo premises.\nA film festival – On 24 and 25 August, ALT EFF will feature films from across the globe highlighting the interconnectedness of all life forms. Prior registration is required for the film festival, with a maximum of 120 participants per film.\n\nREGISTRATION LINKS \n\nRegistration link for student workshop\nRegistration for teachers’ workshop\nRegistration for film festival \n\nVisit event page for more details ",
    "url": "https://www.bengalurusustainabilityforum.org/event/jana-vana-festival-of-forest-wildlife-and-people/",
    "keywords": [
      "External event",
      "In-person Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Bannerughatta Biological Park, Bengaluru, India"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/08/janavana.jpg"
  }
]