[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "11160-1733734800-1734109200@www.bengalurusustainabilityforum.org",
    "name": "Basic Statistics in Environmental and Agricultural Sciences Using R ~ by APU",
    "startDate": "2024-12-09T09:00:00+05:30",
    "endDate": "2024-12-13T17:00:00+05:30",
    "description": "A Five-day professional development course for early career researchers, PhD scholars, and practitioners from NGOs, academia, and research institutes working in the field of environmental, agricultural, and allied sectors with no prior experience in R or statistics. \nApplication Deadline: 20 September 2024 \nAPPLY NOW!",
    "url": "https://www.bengalurusustainabilityforum.org/event/basic-statistics-in-environmental-and-agricultural-sciences-using-r-by-apu/",
    "keywords": [
      "In-person Event",
      "Partner Organisation Event"
    ],
    "location": {
      "@type": "Place",
      "name": "Azim Premji University, Burugunte Village, Survey No 66, Bikkanahalli Main Rd, Sarjapura, Bengaluru, Karnataka, 562125, India"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/09/Basic-Stats_R_24_SM-creative-APU.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "11730-1727949600-1735059600@www.bengalurusustainabilityforum.org",
    "name": "Urban Ecology - a New Lens on Biodiversity",
    "startDate": "2024-10-03T10:00:00+05:30",
    "endDate": "2024-12-24T17:00:00+05:30",
    "description": "We’re excited to invite you to the Urban Ecology exhibition, a collaboration with the IIHS Library and Mihir Kulkarni from the IIHS School of Environment and Sustainability.\nUnderstanding urban ecological dynamics is crucial for developing strategies to mitigate biodiversity loss and promote nature conservation within cities and for improved sustainability. However, the process of urbanisation intertwines with social and economic factors, creating complex interactions that demand our attention. Urban ecology addresses these challenges by studying ecology in, of, and for the city. Through a series of engaging activities focussed on India, this quarter’s exhibition is curated to introduce a broader audience to this fascinating area of research. \nThe curated collection of books, publications and research articles delves into the complex interactions between cities, nature, and the social factors that influence them. \nThe exhibition is free and open to all; walk in and enjoy the curation. Don’t miss the dedicated corner showcasing publications from our Small Grants Programme Projects! ",
    "url": "https://www.bengalurusustainabilityforum.org/event/urban-ecology-a-new-lens-on-biodiversity/",
    "keywords": [
      "BSF event",
      "In-person Event",
      "Partner Organisation Event"
    ],
    "location": {
      "@type": "Place",
      "name": "IIHS Bangalore City Campus, Sadashiva Nagar"
    },
    "inLanguage": "en",
    "image": "https://www.bengalurusustainabilityforum.org/wp-content/uploads/2024/10/20241004_LibExhibition-Announcement_Page_1-scaled.jpg"
  }
]