[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84287-1769176800-1769202000@bangaloreinternationalcentre.org",
    "name": "Futures - Day 1",
    "startDate": "2026-01-23T14:00:00+05:30",
    "endDate": "2026-01-23T21:00:00+05:30",
    "description": "Futures Hubba originated as an ideas-festival at BLR Hubba, where some of the brightest national and international minds play Nostradamus to connect the dots of a likely future for humanity. It is a gathering designed to hold space for contradictions and uncertainty in this technology-shifting era, and to explore what new forms of meaning can emerge between the known and the unknown. \nFutures is a space for collective imagination: it’s a space that holds tension between art and algorithm, ethics and innovation, intuition and data. It resists the safety of linear silos and instead operates at the intersections, where new ways of thinking are born from friction. Each session inside Futures is a deliberate provocation: a chance to expand what we consider knowledge, and to explore how interdisciplinary thinking might co-create more conscious futures. \nThe Future of Diplomacy | Philip Green | 2 PM\nThe death of diplomacy has been proclaimed many times: eclipsed by direct leader-to-leader engagement, an increase in open information, or the rise of non‑state actors. Yet in an increasingly contested world, diplomacy has proven not only resilient, but essential, particularly for Australia where domestic and international challenges are tightly interwoven. While the tradecraft of diplomacy has evolved to be faster, more digital, and more analytical; its fundamentals, such as value of personal relationships and deep-on‑the‑ground understanding, continue to endure. The diplomatic agenda has also widened to include technology, climate, space and the management of disinformation, which need to be supported by greater specialist expertise. Join Australian High Commissioner to India, Philip Green, for a perspective on the future of diplomacy and its continued centrality as an instrument of statecraft. \nThe Future Is Already Misunderstood | Riel Miller | 3 PM\nMost conversations about the future are trapped in prediction, control, and nostalgia disguised as progress. In this talk, renowned futurist Riel Miller dismantles the assumption that the future is something to be forecasted or managed, and argues instead that our real blind spot is imagination itself. This session challenges participants to confront their inherited ideas of “what comes next” and reclaim the future as a practice, not a destination. \nRe-Imagining Progress for a Depleted World | Navi Radjou | 4 PM\nToday, the world faces three types of depletion—affecting people, places, and the planet—which are all losing their vitality. Regenerating individuals, cities, and nature at the same time calls for a new perspective on progress. Rather than being straightforwardly linear, progress is more like a circular journey where the past and future connect synergistically to address complex modern challenges. Renowned management thinker Navi Radjou will demonstrate how India can lead the way in regenerative innovation, a groundbreaking approach designed to enhance the health and vitality of people, places, and the planet together. By blending its abundant traditional wisdom with futuristic technologies, India has the potential to set an example of positive growth that unlocks human potential and benefits both society and the environment. \nFeminist Futures: The Infrastructure of Equality | Kanta Singh | 5 PM\nThis talk contends that the next frontier of gender equality will be determined not in boardrooms or parliaments alone, but in the architecture of technology itself. Artificial intelligence, digital identity, fintech, and public data ecosystems are rapidly becoming the new gatekeepers of opportunity, yet they often replicate the very biases they claim to solve. The session examines how India can design technological systems that expand agency rather than entrench exclusion; how women can shape innovation rather than be shaped by it; and why feminist frameworks are essential for governing algorithms, capital flows, safety platforms, and care technologies. It makes the case that equitable futures require women not only participating in tech, but authoring its rules, ethics, and outcomes. \nTeaching AI to Wonder: Math Meets Machine | Yang-Hui He | 6 PM\nArtificial intelligence is no longer confined to crunching numbers: it is beginning to propose original theorems, sketch proofs and reveal new and unexpected patterns in the abstract world of mathematics and theoretical physics. Join Professor Yang-Hui He, one of the pioneers of AI-assisted mathematics, in exploring how AI is helping humans with new mathematical discoveries, and how in turn, we are teaching the machine how to wander and to perceive beauty. \nThe Architecture of Moral Imagination | Tenzin Priyadarshi Rinpoche | 7 PM\nA contemplative dialogue on ethics and empathy, exploring the moral frameworks that may shape the age of AI. \nResonant Futures: 432 Hz | Transmedia Performance by Murthovic x Thiruda | 8 PM\n432_Hz: Resonant Futures is an immersive audiovisual journey into a future India where all forms of communication—digital, emotional, biological, environmental—are conducted through harmonic resonance. Set in the year 2069, when electromagnetic signals have given way to vibrational networks rooted in ancient Indian sonic traditions, the performance brings together modular synths, generative visuals, AI-processed music, and speculative world-building to conjure a live cinema experience that blends mythology, futurism, and ecology. In this future, communication is no longer transmitted—it is felt. From the humming of banyan trees to the pulse of Himalayan resonance towers, the Indian subcontinent becomes a “Nada Web”: a landscape of vibratory sentience. \nAbout BIC Elsewhere: \nWhile the majority of our events find a home at our premises in Domlur, BIC Elsewhere represents our commitment to bringing conversations, arts, and culture directly to diverse audiences. Through this initiative, we collaborate with various venues, extending the reach of our events beyond our own space. These partnerships not only breathe life into our gatherings but also play a crucial role in cultivating an environment for the flourishing of arts and culture in the city. \nIn collaboration with: \n      \n",
    "url": "https://bangaloreinternationalcentre.org/event/futures-day-1/",
    "keywords": [
      "Business",
      "Development",
      "Gender",
      "Governance",
      "Management",
      "Philosophy",
      "Policy & Regulation",
      "Science",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Alliance Française de Bangalore, Thimmaiah Rd, opposite UNI, Kaverappa Layout, Vasanth Nagar, Bengaluru, Karnataka, 560001, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-82-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84379-1769273100-1769288400@bangaloreinternationalcentre.org",
    "name": "Futures - Day 2",
    "startDate": "2026-01-24T16:45:00+05:30",
    "endDate": "2026-01-24T21:00:00+05:30",
    "description": "Futures Hubba originated as an ideas-festival at BLR Hubba, where some of the brightest national and international minds play Nostradamus to connect the dots of a likely future for humanity. It is a gathering designed to hold space for contradictions and uncertainty in this technology-shifting era, and to explore what new forms of meaning can emerge between the known and the unknown. \nFutures is a space for collective imagination: it’s a space that holds tension between art and algorithm, ethics and innovation, intuition and data. It resists the safety of linear silos and instead operates at the intersections, where new ways of thinking are born from friction. Each session inside Futures is a deliberate provocation: a chance to expand what we consider knowledge, and to explore how interdisciplinary thinking might co-create more conscious futures. \nThe Fool Who Knows | Varun Marichi | 4:45 PM\nThe Fool Who Knows is a mime and physical-clowning performance that explores intelligence in an age of certainty. Through failure, hesitation, and embodied play, the fool reveals what rational systems often miss: that not-knowing is not a weakness, but a form of wisdom. In a world obsessed with control and prediction, this performance invites the audience to sit with uncertainty, and recognise it as the starting point of all futures. \nWhat is the Future of Art? | Reema Desai Gehi | 5:15 PM\nAmid global upheaval, what role is creative expression called upon to fulfil? How does it remain responsive in an age where technology has advanced beyond human comprehension, and where self-censorship quietly precedes its public counterpart? Can art, in its many forms, truly function as a living archive of the present moment? Reema Desai Gehi engages with these pressing inquiries as she reflects on the evolving landscape of art through the prism of ART India magazine’s 30th anniversary. \nHuman Dreams and Speculative Machines | Horst Höertner | 6 PM\nThe real disruption today is not AI, robotics, or digital culture: it is the shifting role of creativity itself. Art and technology have stopped reflecting the world and started constructing it. Drawing on 30 years working at the intersection of art and technology, Horst Hörtner shows how real innovation emerges when artists and technologists are given the freedom to challenge foundational assumptions. This lecture pulls back the curtain on how Ars Electronica turns experimentation into institutional practice, how it protects curiosity from bureaucracy, and why the future will belong to organizations that stop optimizing the present and start prototyping new realities. Art and tech will transform society. The only choice left is whether to participate, or be shaped by those who do. \nRise of Creative & Cultural AI Models | Caroline Pegram & Kartini Ludwig | 7 PM\nJoin Caroline Pegram and Kartini Ludwig as they chart the evolving fusion of music and machines, from the early days of algorithmic composition to today’s rise of generative sound factories. This session offers a clear foundation on how AI models are steering creative approaches, authorship, and performance and looks at the rise and possible uses of creative & cultural foundation models. The talk will extend beyond reflection, challenging attendees to consider how we might intentionally design fair and sustainable futures for music, where machines amplify and augment human creativity. There’ll be fresh insights, critical questions, and an invitation to rethink what it means to compose and create in an age of sonic mutation. \n2º: An Immersive Sonic Performance | Tarun Balani & Parizad D | 8 PM\n2° is a live audio-visual performance by drummer–composer Tarun Balani and visual artist Parizad D that shares stories and messages about the artists’ experience of climate change. The performance unfolds through shifting sonic textures, experimental ambient sounds and immersive visual worlds inviting the audiences to deeply listen and inhabit these worlds. As a part of the performance audiences are encouraged to reflect, share and contribute their own climate change stories and messages on postcards —linking sound and touch—creating a sensory dialogue. 2° serves as a reminder that every story and every voice matters and our individual stories have the power to begin conversations about climate equity, justice, and our shared responsibility to reimagine the future of our world. \nAbout BIC Elsewhere: \nWhile the majority of our events find a home at our premises in Domlur, BIC Elsewhere represents our commitment to bringing conversations, arts, and culture directly to diverse audiences. Through this initiative, we collaborate with various venues, extending the reach of our events beyond our own space. These partnerships not only breathe life into our gatherings but also play a crucial role in cultivating an environment for the flourishing of arts and culture in the city. \nIn collaboration with: \n      \n",
    "url": "https://bangaloreinternationalcentre.org/event/futures-day-2/",
    "keywords": [
      "Business",
      "Development",
      "Gender",
      "Governance",
      "Management",
      "Philosophy",
      "Policy & Regulation",
      "Science",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Alliance Française de Bangalore, Thimmaiah Rd, opposite UNI, Kaverappa Layout, Vasanth Nagar, Bengaluru, Karnataka, 560001, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-83-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84309-1769857200-1769864400@bangaloreinternationalcentre.org",
    "name": "Bookmarked",
    "startDate": "2026-01-31T11:00:00+05:30",
    "endDate": "2026-01-31T13:00:00+05:30",
    "description": "“A reader lives a thousand lives before he dies… The man who never reads lives only one.” — George R.R. Martin \nBegin your year surrounded by fellow readers in our cozy library. This silent reading session invites you to bring any book calling to you and settle into an hour of companionable quiet. \nAtta Galata adds to the experience with a curated selection of quick reads by Indian authors, perfect for browsing or discovery. After the reading hour, the silence gently gives way to conversation; an easy exchange about the books that stayed with you, surprised you, or shaped your 2025. \nThere’s something magical about a room full of people lost in their own worlds yet together in the same space. No pressure, no performance. Just pages, pauses, and the rare pleasure of reading in truly good company! \nThis event is part of our Programmes at the Library series at BIC. \nWe’re reimagining the BIC Library as a warm, welcoming space for connection and exploration. Through thoughtfully curated sessions, we aim to engage the diverse interests and ages within our community. Our goal is to create an enriching environment for discovery, experimentation, and collaboration, beyond the books on our shelves! \nWe welcome your ideas and input. If you have ideas for events or activities that align with our vision, we’d be delighted to hear from you. Please reach out to us at library@bangaloreinternationalcentre.org \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/bookmarked-16/",
    "keywords": [
      "Books",
      "Literature"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_BM1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84509-1769540400-1769546700@bangaloreinternationalcentre.org",
    "name": "Anunaada Murali Rasa",
    "startDate": "2026-01-27T19:00:00+05:30",
    "endDate": "2026-01-27T20:45:00+05:30",
    "description": "\n\n\n\n\n\nAn experience that lingers gently; a memory refusing to fade. \nThis performance unfolds through carefully chosen poetry, musical textures, and the delicate play between presence and absence. Through her descriptive movements, Sahana portrays a young maiden recalling Krishna not as distant divinity, but as a presence woven into lived moments: glimpses, fragrances, gestures, and the lingering sound of a flute. \nAccompanied by esteemed musicians, Raghuram Rajagopalan on vocals, Harsha Samaga on mridangam, Divya Ravi on nattuvangam, and Vivek V. Krishna on flute; the evening moves through verses where desire and devotion coexist without hierarchy, shaping an intimate portrait of remembrance and longing. \nWhat can we hold on to, when what we love is no longer tangible? \n\n\n\n\n\n\nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/anunaada-murali-rasa/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_AMR.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "84413-1769625000-1769634000@bangaloreinternationalcentre.org",
    "name": "Marching in the Dark",
    "startDate": "2026-01-28T18:30:00+05:30",
    "endDate": "2026-01-28T21:00:00+05:30",
    "description": "104 minutes | Marathi with English subtitles | Belgium, India, The Netherlands | 2024 \nWhat does courage look like when survival itself is an act of defiance? \nSet against the backdrop of India’s agrarian crisis, this film follows Sanjeevani, a young widow who refuses to be defined by loss or by the social isolation imposed on women like her. Determined to build a future for herself and her children, she finds strength not in solitary endurance, but in community; connecting with other widows who share their grief, their fears, and their resolve. Together, they transform private sorrow into collective resilience. \nFollowing the screening, filmmaker Kinshuk Surjan is joined by Kavita Kuruganti of Makaam, in conversation moderated by Swati Dandekar, to reflect on women farmers, labour, and the power of shared struggle. The session will close with a Q&A. \nIn collaboration with: \n\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/marching-in-the-dark/",
    "keywords": [
      "Agriculture",
      "Film",
      "Gender"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "mr",
    "workPresented": {
      "@type": "Movie",
      "name": "Marching in the Dark"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_MITD.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84399-1769625000-1769630400@bangaloreinternationalcentre.org",
    "name": "Who Owns India’s Past?",
    "startDate": "2026-01-28T18:30:00+05:30",
    "endDate": "2026-01-28T20:00:00+05:30",
    "description": "Just outside Madurai, beneath the scorching southern sun, the excavations at Keeladi have unsettled long-held ideas about India’s ancient history. \nSince its discovery in 2014, the site has emerged as one of the country’s most contested digs: celebrated by some as evidence of a thriving urban civilisation in South India, and questioned by others as political mythmaking. In her book The Dig, journalist and author Sowmiya Ashok traces this journey from serendipitous find to cultural flashpoint, traveling from Iron Age Tamil Nadu to Harappan Rakhigarhi, revealing how battles over the past shape our understanding of India’s layered identity today. \nSowmiya will be joined by archaeometallurgist Dr. Sharada Srinivasan whose pioneering work has brought to light insights into ancient mining and metallurgy, having also worked on Iron Age-Early Historic sites especially in Tamil Nadu. They will be in conversation with Pooja Prasanna, of The News Minute. Together they will explore how archaeology, science, and power intersect: revealing an ancient diversity that continues to shape contemporary India. \n",
    "url": "https://bangaloreinternationalcentre.org/event/who-owns-indias-past/",
    "keywords": [
      "Anthropology",
      "Books",
      "Culture",
      "History"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-2-1.png"
  }
]