[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "79631-1759075200-1759082400@bangaloreinternationalcentre.org",
    "name": "Mahua Has Always Mattered",
    "startDate": "2025-09-28T16:00:00+05:30",
    "endDate": "2025-09-28T18:00:00+05:30",
    "description": "Mahua, the flower of the forest, carries with it memory, resilience, and taste. Once central to community life, it is now being reclaimed as a symbol of pride, livelihood, and ecological care. \nWe begin with a screening of Mahua – Wild Dreams, Wild Harvest, a short documentary by Ganesh Tilgam and Priyanshu Raj (Green Hub Fellows). The film traces how ethical harvesting and community-led initiatives are bringing Mahua back into the heart of culture and economy. \nA panel discussion, Reviving Mahua: From Forest to Future, follows. Ecologists, writers, entrepreneurs, chefs, and community members open a many-sided conversation on Mahua’s cultural, ecological, and culinary significance. \nThe evening closes with a Mahua Tasting, where the flower’s delicate sweetness and earthy depth come alive in both savoury and sweet forms. Crafted in collaboration with chefs and food researchers, this tasting invites you to meet Mahua not just as a plant, but as an experience of flavour, memory, and possibility. \nA flower, a flavour, a memory: take Mahua with you in more ways than one. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/mahua-has-always-mattered/",
    "keywords": [
      "Agriculture",
      "Culture",
      "Environment",
      "Film",
      "Food",
      "Heritage",
      "Sustainability",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_MHAM.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79716-1759057200-1759062600@bangaloreinternationalcentre.org",
    "name": "Gandhi and Savarkar",
    "startDate": "2025-09-28T11:00:00+05:30",
    "endDate": "2025-09-28T12:30:00+05:30",
    "description": "Between Gandhi and Savarkar lies the story of India’s unresolved future. \nThe future of India has long been caught between two irreconcilable visions. Mohandas Karamchand Gandhi and Vinayak Damodar Savarkar were not just men, but embodiments of two enduring ideologies: Hind Swaraj and Hindutva. Their contest was never merely personal; it was a struggle over what India could, and should, become. \nPartition was one gash on the body of the nation, its scars still visible. Can India afford new wounds? To even attempt an answer, we must return to the old antagonisms – between communities, yes, but also within Hindu society itself. Few rivalries have been as sharp, or as consequential, as that between Gandhi and Savarkar. \nBased on his new book, Hindutva and Hind Swaraj, this talk reflects on the unresolved gulf between Gandhi and Savarkar. Not as history, but as a question that remains open: can such differences ever be bridged, or are they the fault lines of India’s future? \n",
    "url": "https://bangaloreinternationalcentre.org/event/gandhi-and-savarkar/",
    "keywords": [
      "Biography",
      "Books",
      "History",
      "Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_GS.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79257-1758911400-1758916800@bangaloreinternationalcentre.org",
    "name": "Played and Missed",
    "startDate": "2025-09-26T18:30:00+05:30",
    "endDate": "2025-09-26T20:00:00+05:30",
    "description": "Before the spotlights, who kept the women’s game alive? \nIn 2017, India’s women cricketers came heartbreakingly close to a World Cup win at Lord’s. That match lit a fire, changing how the country saw its women athletes, and laying the foundation for today’s Women’s Premier League – the first women’s sports league to turn profitable even before a single ball was bowled. \nIt’s the first time since that iconic evening at Lord’s that the Women’s World Cup is set to be hosted in India. \nThis session will celebrate those forgotten days when world cups in India were played in front of empty seats, even when the cricket itself was no less significant. Bringing these narratives to life are Karunya Keshav, Ananya Upendran, and Aayush Puthran. This is a chance to hear directly from some of the best storytellers on women’s cricket. \nIn collaboration with: \n \nBookmark is a dating app for readers, created by the founders of Cubbon Reads, where one swipes books, not looks. Through a virtual bookshelf and prompts, people can find book buddies across the world. \n",
    "url": "https://bangaloreinternationalcentre.org/event/played-and-missed/",
    "keywords": [
      "Books",
      "Gender",
      "Sports"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_PM.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79794-1759345200-1759350600@bangaloreinternationalcentre.org",
    "name": "KABIR: A Dance Production",
    "startDate": "2025-10-01T19:00:00+05:30",
    "endDate": "2025-10-01T20:30:00+05:30",
    "description": "How do centuries-old verses find new life in rhythm and movement? \nKABIR is a Bharatanatyam production that brings the timeless poetry of Sant Kabir into conversation with dance. What makes this work unique is the seamless weaving of Kabir’s Hindi verses into the expressive framework of Bharatanatyam, guided by the musical brilliance of Vidwan O. S. Arun. His evocative vocals create a living bridge between word and movement, allowing the spiritual depth of Kabir’s poetry to bloom on stage. \nConceived and choreographed by Varsha Akhouri, alumna and former faculty of the Kalakshetra Foundation, the production embodies both tradition and innovation. With her students carrying forward the performance, the piece becomes not just a retelling of Kabir’s verses but a passing on of artistic legacy. \nKabir’s words question dogma, transcend boundaries, and call us to simplicity, love, and self-realisation. In this production, poetry and dance converge to reveal their continued resonance with our fragmented world. \nA performance for the divine within and without. \nCredits:\nMusic and Vocals: O S Arun\nConcept and Choreography: Varsha Akhouri\nTabla: Martin\nMridangam: Shivaprasad\nSitar: Kishore\nFlute: Hariprasad\nSound engineer: Rakesh\nJathi: Sheejith Krishna\nLights: Venkatesh Krishna \nDancers:\nAsika Sajeevan\nAarathi S Nair\nDevika AC\nJisma K.K\nRoopesh PP\nShobhit Shivhare\nSreelakshmi EB\nSreeshna KM\nSreerejini NS \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/kabir-a-dance-production/",
    "keywords": [
      "Culture",
      "Dance",
      "Performing Arts",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-27-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "79839-1759950000-1759955400@bangaloreinternationalcentre.org",
    "name": "Sounds From the Library (#5)",
    "startDate": "2025-10-08T19:00:00+05:30",
    "endDate": "2025-10-08T20:30:00+05:30",
    "description": "Sounds From The Library returns for its fifth edition! \nAn intimate evening where conversation and performance intertwine in the cozy, listener-focused space of the BIC library. This hybrid series spotlights emerging voices from the Indian music scene, all past longlisted artists from the Toto Awards for Music. \nThis edition hosts RIVU from Kolkata, who is a Progressive Rock Guitarist/Producer and 2018 Longlister, a soundscape that’s as textured as it is emotional. Sharing the stage is The Sine Painter, a Bangalore-based electronic music producer and 2018 shortlister. \nMore than a gig, Sounds From The Library invites audiences into the creative lives of the artists; offering insight into their inspirations, processes, and personal journeys. With music that moves and conversations that linger, this is a rare chance to experience live performance in its most thoughtful form. \n\nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sounds-from-the-library-5/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sounds From the Library (#5)"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-29-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79993-1759257000-1759262400@bangaloreinternationalcentre.org",
    "name": "Beyond the Days of Wine and Roses",
    "startDate": "2025-09-30T18:30:00+05:30",
    "endDate": "2025-09-30T20:00:00+05:30",
    "description": "India’s first and only Master of Wine, Sonal C Holland, sits down with Harish Vasudev, Director at Museum of Art and Photography, to talk about her memoir One In A Billion and the remarkable journey which inspired her to write it. \nThis dialogue traces how Sonal walked away from a thriving corporate career and dared to pursue a career in wine even before India knew how to drink it. From knowing nothing about wine, she embarked on a gruelling decade-long pursuit of the world’s most respected wine qualification. It will also explore her rise as one of the most trusted and popular voices in the alcobev space, emphasising the importance of self-investment, ambition without a blueprint, and chasing success without shortcuts. \nIn this candid conversation, Sonal will reveal what it takes to build a market from scratch and to lead with vision when no roadmap exists. Drawing from years of entrepreneurship, leadership, and global experience, she will offer a rare perspective on creating impact and shaping an industry against the odds. A Q&A session with the audience will follow the fireside chat. \nPresented by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/beyond-the-days-of-wine-and-roses/",
    "keywords": [
      "Biography",
      "Books",
      "Food"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_BtDoWaR.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79674-1758999600-1759005000@bangaloreinternationalcentre.org",
    "name": "Rabia’s Journey | ராபியாவின் பயணம்",
    "startDate": "2025-09-27T19:00:00+05:30",
    "endDate": "2025-09-27T20:30:00+05:30",
    "description": "At its heart, The Dark Hours of the Night is a story about girlhood under constraint, about how adolescence, desire, and freedom are shaped and stifled within the walls of a conservative household. \nRabia’s journey, woven together with the lives of her friends and cousins, illuminates the subtle negotiations, unspoken rebellions, and fragile solidarities that mark women’s coming-of-age in a patriarchal world. The novel opens a conversation about the everyday intimacies of restriction and resistance: the ache of thwarted desire, the bonds of friendship, the weight of silence, and the difficult balance between compromise and courage. It asks what it means to grow up when the future has already been decided, and whether education, love, or even small acts of defiance can shift those boundaries. \nIn this session, Subodh Sankar and Salma will reflect on these resonant themes, of gender, family, power, and the search for selfhood, that lie at the centre of The Dark Hours of the Night and across Salma’s larger body of work. \nஇரண்டாம் ஜாமங்களின் கதை என்பது கட்டுப்பாடுகளின் நடுவே வளரும் பெண் சிறுவயதின் கதை. இளமையின் ஆசைகள், சுதந்திரத்தின் கனவுகள் மற்றும் எதிர்பார்ப்புகள், ஒரு மரபுவழி குடும்பத்தின் சுவர்களுக்குள் எவ்வாறு கட்டுப்படுத்தப்படுகின்றன என்பதை இந்த நாவல் வெளிப்படுத்துகிறது. \nராபியாவின் வாழ்க்கைப் பயணம், அவளது தோழிகள் மற்றும் சொந்தங்கள் இணைந்து, பெண்களின் வளர்ச்சிப் பாதையில் அமைதியான எதிர்ப்புகள், நுட்பமான சமரசங்கள், சொல்லப்படாத போராட்டங்கள் மற்றும் உறவுகள் எவ்வாறு உருவாகின்றன என்பதை சுட்டிக்காட்டுகிறது. இந்த நாவல் அன்றாட வாழ்க்கையில் காணப்படும் கட்டுப்பாடுகள் மற்றும் எதிர்ப்புகளைப் பற்றி உரையாடலைத் தொடங்குகிறது: நிறைவேறாத ஆசைகள், நட்பு பந்தங்கள், மௌனத்தின் சுமை, சமரசம் மற்றும் துணிச்சலின் இடைநிலைகள். எதிர்காலம் ஏற்கனவே தீர்மானிக்கப்பட்டிருக்கும் சூழலில் வளர்வது என்றால் என்ன, கல்வி, அன்பு அல்லது சிறிய எதிர்ப்புகள் கூட அந்த எல்லைகளை மாற்ற முடியுமா என்பதையும் கேட்கிறது. \nஇந்த உரையாடலில், சுபோத் சங்கருடன் சல்மா, இரண்டாம் ஜாமங்களின் கதை மற்றும் தனது விரிவான படைப்புகளின் மையத்தில் இருக்கும் பாலினம், குடும்பம், அதிகாரம் மற்றும் தனித்தன்மை தேடல் போன்ற கருக்களை ஆராயவுள்ளனர். \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/rabias-journey-%e0%ae%b0%e0%ae%be%e0%ae%aa%e0%ae%bf%e0%ae%af%e0%ae%be%e0%ae%b5%e0%ae%bf%e0%ae%a9%e0%af%8d-%e0%ae%aa%e0%ae%af%e0%ae%a3%e0%ae%ae%e0%af%8d/",
    "keywords": [
      "Books",
      "Gender",
      "Literature",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_RJ.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79829-1759343400-1759348800@bangaloreinternationalcentre.org",
    "name": "Reaching for the Stars",
    "startDate": "2025-10-01T18:30:00+05:30",
    "endDate": "2025-10-01T20:00:00+05:30",
    "description": "What does it take to dream beyond your time—and make those dreams real? \nVikram Sarabhai, founder of India’s space programme, imagined communication satellites that would educate people when even a modest rocket launch seemed audacious. He envisioned agricultural complexes powered by atomic energy, sea water turned drinkable, and a modern India fuelled by science and creativity. But Sarabhai was more than a scientist—he co-founded the Indian Institute of Management Ahmedabad, the National Institute of Design, the dance academy Darpana, and India’s first textile research cooperative, ATIRA. He also ran a thriving pharmaceutical company and launched India’s first market research organisation, ORG. \nAs India navigates its twenty-first century aspirations, this session revisits the humane, imaginative, yet pragmatic vision of a man who built enduring institutions. Drawing from Vikram Sarabhai: A Life, author Amrita Shah offers an intimate portrait of a multifaceted genius whose legacy continues to shape India’s present and future. She will be in conversation with Jahnavi Phalkey, exploring the many lives and lasting vision of this extraordinary builder of modern India. \nThe conversation will conclude with an audience Q&A. \n",
    "url": "https://bangaloreinternationalcentre.org/event/reaching-for-the-stars/",
    "keywords": [
      "Books",
      "History",
      "Science",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-28-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79280-1758997800-1759003200@bangaloreinternationalcentre.org",
    "name": "Lessons for Democracy",
    "startDate": "2025-09-27T18:30:00+05:30",
    "endDate": "2025-09-27T20:00:00+05:30",
    "description": "What happens when institutions bend, freedoms collapse, and silence rules? India once knew. \nFive decades may have passed, but the Emergency remains a stark reminder of how swiftly freedoms can be curtailed. In those 21 months, prisons filled, the press was silenced, and democratic institutions bent under the weight of authoritarian rule. The questions it leaves behind are urgent: what does this episode tell us about the fragility of democracy, and what echoes of it persist today? \nA new volume gathers reflections from scholars, writers, historians, journalists, and activists to probe this turbulent chapter and its continuing relevance. Joining the discussion are Peter Ronald de Souza, co-editor of the book, historian Janaki Nair, sociologist Chandan Gowda, and political scientist Rinku Lamba, in a conversation moderated by Thomas Abraham.  \nA Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/lessons-for-democracy/",
    "keywords": [
      "Books",
      "History",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_LfD.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79788-1759431600-1759436100@bangaloreinternationalcentre.org",
    "name": "Gandhi",
    "startDate": "2025-10-02T19:00:00+05:30",
    "endDate": "2025-10-02T20:15:00+05:30",
    "description": "Can dance translate the restlessness of a conscience, the weight of compassion? \nWith Gandhi, choreographer C P Satyajit reimagines the Mahatma’s life and philosophy through the timeless language of Bharatanatyam. This is not a chronological retelling, but a meditation on his ideals: his restless pursuit of truth, his unwavering sense of justice, his profound connection with people. \nThrough delicate abhinaya and layered rhythmic improvisations, the production traces Gandhi’s journey as both a leader and a seeker. Informed by the research of Dr. V R Devika, whose PhD explored Gandhi’s communication strategies, the work captures how his ideals might continue to move us, literally and metaphorically, today.\n\nIn this unique performance, every gesture is a reminder that truth and compassion remain unfinished tasks. \nCredits:\nConcept & Choreography: C P Satyajit \nDancers:\nKeerthana Ganesan\nDevikha S\nHemavathy Kalaiarasan\nParvathi Parameswar\nArchana Sivasubramanian\nAnjannaa Ashok \nMusicians\nM S Sukhi: Rhythm\nMonali Bala: Voice\nManonmani T: Sarangi \nOriginal Lighting Design: Martin Jose\nOperated by: Muthukumar R \nThe production is created by Bharata Kalanjali with the support of the Kaladham Trust and Sarvodaya International, Karnataka. \nIn collaboration with:\n \n  \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/gandhi/",
    "keywords": [
      "Dance",
      "History",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Gandhi-thumbnail.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "79300-1759258800-1759264200@bangaloreinternationalcentre.org",
    "name": "Rumi Meets Kabeer",
    "startDate": "2025-09-30T19:00:00+05:30",
    "endDate": "2025-09-30T20:30:00+05:30",
    "description": "A mehfil of mystics where two great voices of devotion find resonance across time and tradition.  \nThis performance weaves together song and story: the earthy nirguni verses of Kabeer alongside the soaring ghazals of Rumi. Tales from Rumi’s Masnavi unfold beside episodes from Kabeer’s life, drawing audiences into the philosophies that shaped them and the spiritual journeys they invite us to walk. \nThough born in different worlds, their words echo the same longing: love, surrender, and the search for the divine. More than a concert, the evening offers an immersion into mysticism itself. Music and poetry intertwine, creating spaces for reflection, wonder, and stillness.  \nThis is a celebration of unity in diversity through the timeless legacies of Kabeer and Rumi that continue to awaken the eternal within us. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/rumi-meets-kabeer/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Rumi Meets Kabeer"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/ThumbnailRK111.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79928-1759863600-1759869000@bangaloreinternationalcentre.org",
    "name": "Magdalana Mariam",
    "startDate": "2025-10-07T19:00:00+05:30",
    "endDate": "2025-10-07T20:30:00+05:30",
    "description": "\nThis work in chaste Malayalam is based on Mahakavi Vallathol Menon’s lyrical poem – Magdalana Mariam. The simple narrative introduces the arrival of the Messiah, Jesus of Nazareth, in the town of Galillee. In the same town lives  Mariam, a beautiful woman who having risen from poverty accumulates wealth by succumbing to ego and temptation. One night, she is jolted to a realization that she has long lived a life of spiritual hollowness. Her encounter with Christ and transformation through redemption serve as a background for this exquisite poetry. \n \n \nCredits: \nMusic: Dr. O.S. Arun \nConcept & Choreography: Anjana Anand \nLighting Design: Sneha Sheejith \n \n \n\nSupported by: \n \n\n  \n\n",
    "url": "https://bangaloreinternationalcentre.org/event/magdalana-mariam/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ml",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_MM-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79340-1759257000-1759264200@bangaloreinternationalcentre.org",
    "name": "A Fly on the Wall",
    "startDate": "2025-09-30T18:30:00+05:30",
    "endDate": "2025-09-30T20:30:00+05:30",
    "description": "82 minutes | English | 2024 | India \nWhat does it mean to face the end on one’s own terms—and in the company of friends?\n\nA Fly on the Wall, directed by Nilesh Maniyar and Shonali Bose, traces the final chapter in the life of Chika Kapadia, framed through the intimate lens of friendship. In a quiet Swiss town, loved ones gather from across the world to raise a last toast, while a filmmaker friend documents the delicate passage between celebration and farewell. What unfolds is a tender meditation on choice, companionship, and the courage to define one’s own ending. \nLayered with memory and emotion, the film draws viewers into a journey where the everyday collides with the profound, and where the act of bearing witness becomes as significant as the story itself. \nAfter the screening, directors Nilesh Maniyar and Shonali Bose will be present for an in-person discussion with Sandhya Kumar, followed by a Q&A with the audience. \nCheck out the trailer here \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-fly-on-the-wall/",
    "keywords": [
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_FOTW.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80002-1759685400-1759690800@bangaloreinternationalcentre.org",
    "name": "The Celestial Dance",
    "startDate": "2025-10-05T17:30:00+05:30",
    "endDate": "2025-10-05T19:00:00+05:30",
    "description": "The ancient Indian Panchanga, or Hindu calendar, is a remarkable synthesis of astronomy, mathematics, and cultural tradition. This unique event brings it alive using modern Stellarium astronomy software, where celestial movements will be visualised through simple planetary animations. \nParticipants will learn the meaning of terms like Masa, Paksha, Tithi, and Nakshatra, and discover why our festivals shift dates each year, why months have 30 or 31 days, why there are 12 zodiac signs, and why exactly 27 nakshatras govern the skies. These everyday questions find their answers in the ingenious design of the Panchanga. \nThe session also highlights the rich heritage of the Hindu school of astronomy. Flourishing for over 1,500 years and reaching a peak during the Vijayanagar period, with Kerala as its vibrant epicenter, this tradition produced profound insights into planetary motion and time. The ancient text Surya Siddhanta went even further, defining multiple scales of time—from a human day (sunrise to sunrise), to a day of the Pitrs (a lunar month), to a day of the gods (a solar year). It even stretched the imagination to the grand cosmic cycles of parardha—155.52 trillion years—down to the fleeting span of prana, a few seconds. \nBy blending science with storytelling, speaker S. Kishore Kumar will reveal how the Hindu calendar is not just a tool for marking festivals, but a timeless scientific framework that connects human life to the rhythms of the cosmos. \nIn collaboration with:\n   \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-celestial-dance/",
    "keywords": [
      "Philosophy",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_TCD.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "80013-1759662000-1759669200@bangaloreinternationalcentre.org",
    "name": "Adventures in Friendship",
    "startDate": "2025-10-05T11:00:00+05:30",
    "endDate": "2025-10-05T13:00:00+05:30",
    "description": "Step into a world where stories come alive! \nThis playful, imaginative psychodrama workshop invites children (ages 8–12) and their parents into a delightful exploration of friendship through three beloved tales—The Musicians of Bremen, Krishna and Sudama, and The Monkey and the Crocodile. Together, we’ll jump into the roles of these memorable characters, improvising new meanings and alternative endings, while joyfully navigating friendship’s adventures, challenges, and deeper meanings. \nExpect laughter, noise, creativity, and quiet reflections as we uncover essential lessons about friendship. Two unforgettable hours spent deepening bonds through story, play, and shared discovery. \nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \nIn collaboration with:\n \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/adventures-in-friendship/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Performing Arts",
      "Theatre",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Adventures in Friendship"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-30-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79626-1758911400-1758916800@bangaloreinternationalcentre.org",
    "name": "Music, Musicians and Musical Instruments at the Mughal Court",
    "startDate": "2025-09-26T18:30:00+05:30",
    "endDate": "2025-09-26T20:00:00+05:30",
    "description": "The Mughal court breathed in rhythm and melody.  \nFrom dawn prayers to twilight revelries, from joyous weddings to the thunder of battle, music augmented every moment of life. Painters of the time caught these echoes in colour: musicians in the durbar, women singing in the zenana, instruments poised in the naubatkhanas of gateways, songs rising even in hunting fields. \nIn this illustrated lecture, Dr. Asok Kumar Das will discuss the presence of music and musicians in a selection of paintings dating from the reign of Humayun (r.1530-40, 1555-56) to Shah Jahan (r.1628-1658). These exquisite paintings reveal an enduring ensemble of percussion, wind and string instruments, and performers of all genders and creeds making music for specific occasions. \nStep closer to an age where melody was power, poetry, and prayer all at once. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/music-musicians-and-musical-instruments-at-the-mughal-court/",
    "keywords": [
      "Heritage",
      "History",
      "Music",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_MM-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79950-1759057200-1759062600@bangaloreinternationalcentre.org",
    "name": "Up, Down and All Around!",
    "startDate": "2025-09-28T11:00:00+05:30",
    "endDate": "2025-09-28T12:30:00+05:30",
    "description": "The cat chased the rat. Up and down, inside and outside, everywhere they could fit. Did the cat catch the rat? \nFind out with us through this interactive read-aloud by Canato Jimo, the illustrator of The Rat in the Cat, written by Arundhati Venkatesh. \nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \nIn collaboration with:\n \nSupported by: \n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/up-down-and-all-around/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Books",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-940.jpg"
  }
]