[
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Main Tawaif",
    "startDate": "2024-05-22T19:00:00+05:30",
    "endDate": "2024-05-22T20:30:00+05:30",
    "description": "Main Tawaif is a presentation by Manjari Chaturvedi, under The Courtesan Project Series. 15 years in existence, the series is founded and conceptualised by Classical Dancer, Creator of Sufi Kathak, and Restorer of the Dance of Tawaifs, Manjari Chaturvedi. The Courtesan Project has become one of the most successful dance revival movements in today’s time. Giving a voice to the women and 100s of years of creative contribution to theatre, cinema and performing arts. \nThis performance is an exploration of the gender dynamics within the arts, unveiling the pivotal influence of women performers – the enigmatic Tawaifs and Baijis – of North India from the 16th to the 20th century. The performance is set as an intimate mehfil performance of how the Tawaifs would perform in yesteryears. Their music, their stories, their dance enacted by a single performer. \nThis is a bold statement that is needed to finally accord respect for the performance art of the Tawaif, to go beyond the drawing room sniggers and laughter associated with the word Tawaif, and to finally acknowledge their role in history. \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/main-tawaif/",
    "keywords": "Dance, Performing Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-451.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "Maagh: The Winter Within",
    "startDate": "2024-05-19T18:30:00+05:30",
    "endDate": "2024-05-19T20:45:00+05:30",
    "description": "2022 | 99 mins | Kashmiri, Urdu with English Subtitles | India/France/Qatar \nIn the last three decades, approximately eight to ten thousand cases of enforced disappearances have occurred in Kashmir. Mostly young men picked up by the Indian security forces, never to return home. Until now, more than six thousand unmarked graves have been discovered in Kashmir. The relatives of the disappeared persons believe that their loved ones may be buried in these graves, but the State refuses to conduct DNA tests to identify the bodies. \nIn the city of Srinagar, Nargis searches for her missing husband, Manzoor, until she is forced to hopelessly return to her village home. With a little help from a local man Yaseen, she silently toils away on an exquisite weave. But the quiet of the Kashmiri winter is like the silence of the graveyard, waiting to be shredded by what lies buried within. \nMaagh (The Winter Within) is a tragic tale of Kashmiris’ struggle for self-determination, and freedom from state oppression. An oppression, ripping apart the social fabric, under which, it is Nargis, a woman, who shows greater commitment to the ideas of justice and freedom. \nThe screening of the film will be followed by a discussion with Director, Aamir Bashir and Film Educator, Basav Biradar. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/maagh-the-winter-within/",
    "keywords": "Film, Society",
    "inLanguage": "ur",
    "workPresented": {
      "@type": "Movie",
      "name": "Maagh: The Winter Within"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/ThumbnailMaagh.png"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "ಅದ್ಭುತ ರಾಮಾಯಣ | Adbhuta Ramayana",
    "startDate": "2024-05-10T19:00:00+05:30",
    "endDate": "2024-05-10T20:15:00+05:30",
    "description": "Kannada | 70 mins | Suitable for all ages \nHow many Ramayanas? A hundred, two hundred, three hundred and so on. A.K. Ramanujan, a multilingual scholar, wrote an essay “Three Hundred Ramayanas: Five Examples and Three Thoughts on Translation” which scholarly narrates the existence of many Ramayanas in India and in South Asian countries. This play could be one amongst them, and this production is inspired by this essay. \nThroughout the Valmiki Ramayana, Sri Rama occupies the central stage as the main character. Many folk versions of Ramayanas (Chitrapata Ramayana, Ravana Chaya etc.) narrate the story of Sita. She occupies the centre stage. In Adbhuta Ramayana, Sita is the protagonist. She is not only a manifestation of Goddess Lakshmi but also the first force of creation known as Prakruti (Nature). Sita is the focus of the story rather than Rama, and it seeks to establish the greatness, courage, valour, strength, power, and potential of Womanhood which are traditionally so cherished. Sri Rama fails to subdue and vanquish Shatakhanta Ravana, who was ten times more powerful than his younger sibling Dashakhanta Ravana. Sita defeats this great demon and restores peace on earth by eliminating the courage of all evil-mongering demons representing vices and perversions. \nBased on Kandagal Hanamanta Rao’s Company Drama \nDirected by Rajani Garud\nAdapted for Puppetry by Prakash Garud\nMusic by Raghava Kammar\nProduced by Gombe Mane (Puppet House), Dharwad \nAbout Gombe Mane/Puppet House: \n \nPuppet House is a practicing centre for both theatre and puppetry. Founded in 1996 by Theatre Practitioners, Dr Prakash Garud and Rajani Garud, it has produced dramas and puppet plays for the last 25 years, with nearly 50 plays and 15 puppet plays to its credit. It regularly conducts theatre and puppetry workshops for children and young artists in Dharwad and other parts of the state. The core group is trained in theatre basically. \nPuppet House has undertaken several collaborative projects with the support of various organizations. It collaborated on an art project with the financial support of the India Foundation for the Arts, Bangalore, developing leather puppetry for contemporary audiences, particularly children. It also undertook an art education project for primary school children with support from the Sir Ratan Tata Trust, Mumbai. Additionally, it has participated in puppetry festivals and training programs organized by the Sangeet Natak Akademi, New Delhi. The Central Ministry of Culture Department, New Delhi and the Department of Kannada and Culture, Bengaluru have supported its theatre and puppetry endeavours. \nSome of Puppet House’s notable productions include plays like Mahamayi, Anjumallige, Shivaratri, Andhayug, King Lear, and children’s plays such as Panjara Shale, Pushparaani, and Emperor’s New Clothes. Its puppet plays comprise Gardhabha Manushya Prahasana, Hakki Haadu, Red Flower, Akata Vikata Vilakshana, Papu Bapu and Adbhuta Ramayana. \nPuppet House has actively participated in various festivals and events across India, including Bahurupi Festival Rangayana Mysuru (2007), Dharwad Utsav (2008), IFA Puppetry Workshop in New Delhi (2007), Putul Yatra in New Delhi and Lucknow (2011), Abhinaya Theatre Troupe in Thiruvananthapuram (2010), Putul Ranga Gandhi Sangha Festival in Agartala (2018), and Malebillu Children Theatre Festival by National School of Drama in Bengaluru and Mangaluru (2011). \nIn collaboration with the India Foundation for the Arts, Bengaluru and the Goethe Foundation Bengaluru Chapter, Puppet House organized the Kali-Kalisu Art education program for teachers in Karnataka, conducting Puppetry workshops in 2012. It also developed Puppetry for Child Labour Eradication programme in association with Nunhems & Bayers Company and the International Labour Organisation, Bengaluru. Over the last 20 years, Puppet House has regularly organised Puppet shows and workshops at schools in Karnataka, giving nearly 1000 shows in productions like A Man of an Ass, Bird’s Song, Akata Vikata Vilakshana, Red Flower, Papu Bapu, and Anche Mane in Schools, Colleges and cultural organisations. \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%85%e0%b2%a6%e0%b3%8d%e0%b2%ad%e0%b3%81%e0%b2%a4-%e0%b2%b0%e0%b2%be%e0%b2%ae%e0%b2%be%e0%b2%af%e0%b2%a3-adbhuta-ramayana/",
    "keywords": "Performing Arts, Theatre",
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "ಅದ್ಭುತ ರಾಮಾಯಣ | Adbhuta Ramayana"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-471.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "Travel Through Time",
    "startDate": "2024-05-17T19:00:00+05:30",
    "endDate": "2024-05-17T20:45:00+05:30",
    "description": "An evening of music on two pianos by Bangalore-based pianists who studied together at the Belarus Conservatory. They will perform a programme ranging from the eighteeth century to the contemporary, including the captivating rhythms of the Argentine composer Piazzolla. \nProgramme: \nV A Mozart: Sonata for Two Pianos in D major, K. 448\nJS Bach: Chorale from Cantata BWV 147\nJS Bach: Aria from Hunting Cantata, BWV 208/N 9\nJS Bach: Concerto for 2 Pianos C minor, BWV 1060\nJS Bach: Erbarme dich, mein Gott from BWV 244 \nInterval \nA Vivaldi: Summer from The Four Seasons, Op. 8/N2, RV 315\nA Vivaldi: Winter from The Four Seasons, Op. 8/N4, RV 297\nA Vivaldi: Rain, RV 737 arr. by G. Anderson\nC Guastavino: Las ninas de Santa Fe, Op. 2/N1\nC Guastavino: Muchacho Jujeño, Op. 2/N2\nMilhaud: Scaramouche, Op. 165bs\nA Piazzolla: Oblivion, arr. by J. Bragato\nA Piazzolla: Libertango, arr. by B.P\nG Vysotsky: Masala\n \nPresented by: \n \nSupported by:\n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/travel-through-time/",
    "keywords": "Music, Performing Arts",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Travel Through Time"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnailmay19.png"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Accelerating Expanding Universe",
    "startDate": "2024-05-27T18:30:00+05:30",
    "endDate": "2024-05-27T19:45:00+05:30",
    "description": "Dark energy is the leading candidate for the mechanism that is responsible for causing the cosmological expansion to accelerate. Bharat Ratra will describe the astronomical data which persuade cosmologists that (as yet undetected) dark energy and dark matter are by far the main components of the energy budget of the universe at the present time. He will review how these observations have led to the development of a quantitative “standard” model of cosmology that describes the evolution of the universe from an early epoch of inflation to the complex hierarchy of structure seen today. In this non-technical talk, he will also discuss the basic physics, and the history of ideas, on which this model is based. \nThis lecture is a part of RRI’s Vignyana Kathegalu, a series of popular talks on science. \nIn collaboration with Raman Research Institute, Bangalore. \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-accelerating-expanding-universe/",
    "keywords": "Science",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-462.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "Bangalore 1974",
    "startDate": "2024-05-29T19:00:00+05:30",
    "endDate": "2024-05-29T20:30:00+05:30",
    "description": "For ‘Bangalore 1974’, Konarak Reddy will perform a range of music from the 17th century to the present, which takes the audience through a meditative experience, while telling the musical story of Bangalore. You can expect to hear the stories behind Brahms‘ Lullaby, Handel’s Presto in D minor, and a Prelude in A that leads into ‘Somewhere Over the Rainbow’ by Harold Arlen, while listening to Konarak playing them live. You will hear about old music teachers of Bangalore like Marion Fewkes and Mr. Lumas, about a certain Nadaswaram player on Cavalry Road, about the Music Strip in Cubbon Park. You will also be privy to Konarak’s own compositions that span the range of his experiences, growing up in Bangalore, playing at venues like Rex Theatre and RSI, listening to bands at 3 Aces, being arrested during the Emergency at 58 St.Mark’s Road, reading Sri Aurobindo – personal experiences of a certain period of time in Bangalore, interpreted through music.  \nThis concert is part of a series of solo guitar concerts initiated to celebrate 50 years of Konarak Reddy’s music. Each concert is uniquely conceptualised, with a special set list. \nIn collaboration with: \n \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/bangalore-1974/",
    "keywords": "Culture*, History, Music, Performing Arts",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Bangalore 1974"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnailkonark.png"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Contemporary Expressions in Movement",
    "startDate": "2024-05-11T15:00:00+05:30",
    "endDate": "2024-05-11T18:00:00+05:30",
    "description": "Through various improvisational exercises and choreographic processes Contemporary Expressions in Movement seeks to introduce and make movement vocabularies accessible to participants. The workshop will employ movement phrases developed by Attakkalari’s contemporary movement practice, which is informed by contemporary dance, and draws its grammar and structure from embodied movement and somatic practices such as Yoga, Kalarippayattu, Bharatnatyam. \nDuring this 3-hour workshop, participants will be gently acquainted with and encouraged to keenly observe a set of movement phrases. They will be guided to find ways to embody these movement phrases. \nThe workshop will briefly cover: \n\nMovement exploration: Participants will engage in a series of movement exercises and improvisational activities designed to help them connect with and observe their bodies, exploring different ways of moving.\nChoreographic process: Participants will have the opportunity to work collaboratively to create short dance/movement pieces, using the techniques and principles they have learned during the workshop.\nPerformance: The workshop will culminate in a sharing session where participants will have the opportunity to perform their choreographic creations for each other.\n\nThis workshop is open to anyone with an interest in movement and dance, regardless of their previous experience. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/contemporary-expressions-in-movement/",
    "keywords": "Dance, Health & Wellness, Workshops",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-461.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "316. Echoes of AI",
    "startDate": "2024-05-10T00:00:00+00:00",
    "endDate": "2024-05-11T00:00:00+00:00",
    "description": "On the surface, an Indian doctor, a British poet, an UberEats courier in Pittsburgh, and a Chinese activist in exile have nothing in common. But they are in fact linked by a profound common experience―unexpected encounters with artificial intelligence. In her debut book Code Dependent, shortlisted for the inaugural Women’s Prize for Non-fiction 2024, Madhumita Murgia shows how automated systems are reshaping our lives all over the world, from technology that marks children as future criminals, to an app that is helping to offer medical diagnoses to a remote tribal community. \nBy highlighting the voices of ordinary people in places far removed from the cozy enclave of Silicon Valley, Madhumita explores the impact of this often-exploitative technology on individuals, communities, and our wider society. \nVidushi Marda, a lawyer and researcher, specialises in examining the socio-legal ramifications of data-driven technologies. Her research centers on technology regulation, asymmetric power dynamics, and fundamental rights. Through her endeavors, she collaborates with governments, corporations, and technical communities to promote social justice. \nTogether, they will discuss and unpack how AI can strip away our collective and individual sense of agency, and shatter our illusion of free will. AI has already infiltrated our day-to-day, through language-generating chatbots like ChatGPT and social media. But it’s also affecting us in more insidious ways. It touches everything from our interpersonal relationships, to our kids’ education, work, finances, public services, and even our human rights. It is already changing what it means to be human, in ways large and small, and Madhumita and Vidushi reveal what could happen if we fail to reclaim our humanity. \nIn this episode of BIC Talks, Author – Madhumita Murgia is in conversation with the Lawyer and Researcher – Vidushi Marda. This is an excerpt from a conversation that took place in the BIC premises in May 2024. \nSubscribe to the BIC Talks Podcast on your favorite podcast app! BIC Talks is available everywhere, including Apple Podcasts, Spotify, Google Podcasts, Castbox, Overcast, Audible and Amazon Music. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/316-echoes-of-ai/",
    "keywords": "Books, Podcast, Technology",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail316.png"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "ನಾಟ್ಯದೇವಚರಿತೆ | Natyadevacharite",
    "startDate": "2024-05-28T19:00:00+05:30",
    "endDate": "2024-05-28T20:15:00+05:30",
    "description": "Kannada | 75 mins | Suitable for Ages 8+ \n‘ನಾಟ್ಯದೇವಚರಿತೆ’ ನಾಟಕದ ಕಥಾವಸ್ತುವು ಹಾಸ್ಯ ಮತ್ತು ವಿಡಂಬನೆಯ ಮಿಶ್ರಣದಿಂದ ಕೂಡಿದೆ. ನಾಟಕವು ಶ್ರೀಮಂತ ವ್ಯಕ್ತಿಯೊಬ್ಬನ ಕುಟುಂಬದ ಸುತ್ತ ಸುತ್ತುತ್ತದೆ. ಆ ಶ್ರೀಮಂತನು ಧಾರ್ಮಿಕತೆಯ ಬೂಟಾಟಿಕೆಯನ್ನು ಪ್ರದರ್ಶಿಸುವ ಒಬ್ಬ ನಕಲಿ ಗುರುವಿನ ತಂತ್ರಕ್ಕೆ ಮಾರುಹೊಗುತ್ತಾನೆ. ಕಳ್ಳ ಗುರುವು ಶ್ರೀಮಂತ ವ್ಯಕ್ತಿಯ ಪ್ರಶ್ನಾತೀತ ಅನುಸರಣೆಯ ಲಾಭವನ್ನು ಪಡೆಯುತ್ತಾನೆ. ಇದರಿಂದ ಬೇಸೆತ್ತ ಕುಟುಂಬವು ಉಪಾಯವಾದ ಯೋಜನೆಯನ್ನು ರೂಪಿಸುವಲ್ಲಿ ತೊಡಗುತ್ತದೆ. ಈ ಯೋಜಬೆಯ ಬಲೆಯಲ್ಲಿ ಕಪಟ ಗುರುವು ಸಿಕ್ಕಿಬೀಳಿತ್ತಾನೆಯೇ ಎಂಬ ಕಾತುರತೆಯನ್ನು ಈ ಪ್ರಸ್ತುತಿಯು ಪ್ರೇಕ್ಷಕರಲ್ಲಿ ಉಂಟುಮಾಡುತ್ತದೆ. ನಾಟಕವು ಮುಖ್ಯ ವಿಷಯವಾದ ಧಾರ್ಮಿಕ ನಡವಳಿಕೆಯಲ್ಲಿನ ಅಪ್ರಾಮಾಣಿಕತೆ, ತಪ್ಪು ಜನರನ್ನು ನಂಬುವ ಅಪಾಯಗಳು ಮತ್ತು ಯಾರನ್ನಾದರೂ ಕುರುಡಾಗಿ ಅನುಸರಿಸುವುದನ್ನು ಹಾಸ್ಯದ ಲೇಪನದಲ್ಲಿ ತೋರಿಸುತ್ತದೆ. ಹಾಸ್ಯ ಮತ್ತು ವಿಡಂಬನೆಯ ಮೂಲಕ, `ನಾಟ್ಯದೇವಚರಿತೆ~ ಕುರುಡು ನಂಬಿಕೆಯ ಪರಿಣಾಮಗಳನ್ನು ಮತ್ತು ಧಾರ್ಮಿಕ ಬೂಟಾಟಿಕೆಗಳ ಹಾಸ್ಯಮಯ ಅಂಶಗಳನ್ನು ಬಿಚ್ಚಿಡುತ್ತದೆ. \nThe play ‘Natyadevacharite,’ revolves around a rich man who becomes vulnerable to a fake imposter guru pretending to be pious and religious. The plot unfolds through a mix of comedy and drama, revealing the guru’s insincerity. The guru takes advantage of the wealthy man`s unquestioning admiration. As the family plots a smart plan, the audience is invited to watch the unfolding events, wondering if the imposter will be caught. The main theme humorously explores the dishonesty in religious behavior, the risks of trusting the wrong people, and the outcomes of blindly following someone, all presented in a satirical manner. The play aims to entertain while shedding light on the dangers of blindly trusting those who manipulate religious appearances for personal gain. Through its mix of comedy and drama, ‘Natydevacharite’ unfolds a tale that prompts the audience to reflect on the consequences of misplaced trust and the humorous aspects of religious hypocrisy. \nAbout the Team \nSanchaya is a theatre group which has made a name for itself in the art and culture circles of Bangalore. Established in 1988, Sanchaya was the dream child of G. S. Rama Rao, a teacher at MES High School, Jayanagar, Bangalore. Fondly called GSR by Sanchayans, he envisioned the role of art and culture in moulding human personalities, and brought together his students to form a troupe. Aptly named Sanchaya (meaning “Coming together of”), it was intended to be a melting pot of drama, literature, and creativity. The team started out by putting together plays by the then students and now, founding members. The very first play “Vallabhapuriya Dantakathe” set the beginning for the wonderful journey that is in its 33rd year now. Many plays followed and with it, the transformation of the troupe from a student-centered group to a professionally managed popular theatre team. Today we have a repertoire of more than 40 plays. Along the way, we have had gratifying achievements that make us proud. We have reached theatre lovers across many cities in India. We have performed at “Bharat Rang Mahotsav” hosted by National School of Drama, New Delhi. The play “Pratibimbagalu” garnered wide critical acclaim for the multi-dimensional portrayal of a classic play. We have also organized many Theatre Festivals to provide a platform for young amateur teams to showcase their plays. With the vision of bringing all the theatre teams of Bangalore together, we organized a flagship event called “Ranga-Ugadi”. We call these endeavors “Enriching Theatre Brotherhood”. Not restricting our vista to plays alone, we have been organizing musical events as well. Sanchaya’s directorial repertoire includes prominent theatre artists like C.G. Krishnamurthy, R. Nagesh, S. Surendranath, Suresh Anagalli, Krishnamurthy Kavathar, S. K. Madhava Rao, Abbur Jayatheertha, Kathlu Satya, Iqbal Ahmed, Joseph John, Shashidhar Barighat, among others. It has groomed many artists who have become famous film and TV actors, producers, and directors today. We are also very proud of having enticed a whole new generation of youngsters towards theatre, keeping with the true spirit of GSR. Our theatre family, as we like to call it, has grown to include more than 200 members. \nಬೆಂಗಳೂರಿನ ಕಲಾ ಪ್ರಪಂಚದಲ್ಲಿ ಸಂಚಯ ತಂಡ ತನ್ನದೇ ಆದ ಛಾಪನ್ನು ಮೂಡಿಸಿದೆ. 1988ರಲ್ಲಿ ಸ್ಥಾಪನೆಯಾದ ಸಂಚಯ, ಎಂ.ಇ.ಎಸ್ ಪ್ರೌಢಶಾಲೆಯ ಶಿಕ್ಷಕರಾದ ಜಿ.ಎಸ್.ರಾಮರಾವ್ ಅವರ ಕನಸಿನ ಕೂಸು. ಜಿ.ಎಸ್.ಆರ್ ಮಾನವ ವ್ಯಕ್ತಿತ್ವವನ್ನು ರೂಪಿಸುವಲ್ಲಿ ಕಲೆ ಮತ್ತು ಸಂಸ್ಕೃತಿಯ ಪಾತ್ರವನ್ನು ಕಲ್ಪಿಸಿಕೊಂಡವರು. ಇದಕ್ಕಾಗಿ ಅವರು ತಮ್ಮ ವಿದ್ಯಾರ್ಥಿಗಳನ್ನು ಒಟ್ಟುಗೂಡಿಸಿ ತಂಡವನ್ನು ರಚಿಸಿದರು. ಸಂಚಯ (ಅಂದರೆ “ಒಟ್ಟುಗೂಡಿಸುವುದು”)ಎಂಬುದಾಗಿ ಸೂಕ್ತವಾಗಿ ಹೆಸರಿಸಲಾದ ಈ ತಂಡವು ನಾಟಕ, ಸಾಹಿತ್ಯ ಮುಂತಾದ ಹಲವು ಸೃಜನಶೀಲ ಕಲೆಗಳ ಸಮ್ಮಿಳನದ ಉದ್ದೇಶವನ್ನು ಹೊಂದಿದೆ. ಈ ತಂಡವು ಅಂದಿನಿಂದ ಇಂದಿನವರೆಗೆ ನಿರಂತರವಾಗಿ ನಾಟಕಗಳನ್ನು ಪ್ರದರ್ಶಿಸುತ್ತಾ ಬಂದಿದೆ. \n“ವಲ್ಲಭಪುರಿಯ ದಂತಕಥೆ”ಎಂಬ ನಾಟಕದಿಂದ ಅದ್ಭುತ ರಂಗಪಯಣಕ್ಕೆ ನಾಂದಿ ಹಾಡಿದ ನಮ್ಮ ತಂಡ ಈಗ್ಗೆ ಮೂರು ದಶಕಗಳನ್ನು ಕಂಡಿದೆ. ತಂಡವು ವಿದ್ಯಾರ್ಥಿ-ಕೇಂದ್ರಿತ ಗುಂಪಿನಿಂದ ವೃತ್ತಿಪರವಾಗಿ ನಿರ್ವಹಿಸಲ್ಪಡುವ ಜನಪ್ರಿಯ ನಾಟಕ ತಂಡವಾಗಿ ರೂಪಾಂತರಗೊಂಡಿದೆ. ಇಂದು ನಮ್ಮಲ್ಲಿ 40ಕ್ಕೂ ಹೆಚ್ಚು ನಾಟಕಗಳ ಸಂಗ್ರಹವಿದೆ. \nಸಂಚಯ ತಂಡವು ಭಾರತದ ಅನೇಕ ನಗರಗಳಲ್ಲಿ ರಂಗಭೂಮಿ ಪ್ರೇಮಿಗಳನ್ನು ತಲುಪಿದೆ. ನವದೆಹಲಿಯ ನ್ಯಾಷನಲ್ ಸ್ಕೂಲ್ ಆಫ್ ಡ್ರಾಮಾ ಆಯೋಜಿಸಿದ “ಭಾರತ್ ರಂಗ್ ಮಹೋತ್ಸವ”ದಲ್ಲಿ “ಪ್ರತಿಬಿಂಬಗಳು” ನಾಟಕವನ್ನು ಪ್ರದರ್ಶಿಸಿದ್ದೇವೆ. ಶಾಸ್ತ್ರೀಯ ನಾಟಕದ ಬಹು ಆಯಾಮದ ಚಿತ್ರಣಕ್ಕಾಗಿ ಈ ನಾಟಕವು ವಿಮರ್ಶಕರ ಮೆಚ್ಚುಗೆಯನ್ನು ಗಳಿಸಿತು. ರಾಜ್ಯದ ಇತರ ಹವ್ಯಾಸಿ ತಂಡಗಳಿಗೆ ಅವರ ನಾಟಕಗಳ ಪ್ರದಶನಕ್ಕಾಗಿ ವೇದಿಕೆಯನ್ನು ಒದಗಿಸುವ ಹಲವು ನಾಟಕೋತ್ಸವಗಳನ್ನು ಆಯೋಜಿಸಿದ್ದೇವೆ. ಬೆಂಗಳೂರಿನ ಎಲ್ಲಾ ನಾಟಕ ತಂಡಗಳನ್ನು ಒಂದೇ ವೇದಿಕೆಗೆ ತರುವ ಉದ್ದೇಶದಿಂದ “ರಂಗ-ಯುಗಾದಿ” ಎಂಬ ಕಾರ್ಯಕ್ರಮವನ್ನು ಆಯೋಜಿಸಿದ್ದೇವೆ. ನಮ್ಮ ಚಟುವಟಿಕೆಗಳನ್ನು ನಾಟಕ ಪ್ರದರ್ಶನಗಳಿಗಷ್ಟೇ ಸೀಮಿತಗೊಳಿಸದೆ, ಹಲವಾರು ಸಾಹಿತ್ಯ, ಸಂಗೀತ ಕಾರ್ಯಕ್ರಮಗಳನ್ನೂ ಆಯೋಜಿಸಿದ್ದೇವೆ. \nಕನ್ನಡ ರಂಗಭೂಮಿಯಲ್ಲಿ ಪ್ರಮುಖ ನಿರ್ದೇಶಕರಾದ ಸಿ.ಜಿ. ಕೃಷ್ಣಮೂರ್ತಿ, ಆರ್.ನಾಗೇಶ್, ಎಸ್.ಸುರೇಂದ್ರನಾಥ್, ಸುರೇಶ್ ಆನಗಳ್ಳಿ, ಕೃಷ್ಣಮೂರ್ತಿ ಕವತಾರ್, ಎಸ್.ಕೆ.ಮಾಧವ ರಾವ್, ಅಬ್ಬೂರು ಜಯತೀರ್ಥ, ಕತ್ಲು ಸತ್ಯ, ಇಕ್ಬಾಲ್ ಅಹಮದ್, ಜೋಸೆಫ್ ಜಾನ್, ಶಶಿಧರ್ ಭಾರಿಘಾಟ್ ಮುಂತಾದವರು ಸಂಚಯಕ್ಕಾಗಿ ನಾಟಕಗಳನ್ನು ನಿರ್ದೇಶಿಸಿದ್ದಾರೆ. ಪ್ರಸಿದ್ಧ ಚಲನಚಿತ್ರ ಮತ್ತು ಟಿವಿ ನಟರು, ನಿರ್ಮಾಪಕರು ಮತ್ತು ನಿರ್ದೇಶಕರಾದ ಅನೇಕ ಕಲಾವಿದರನ್ನು ಇಂದು ಸಂಚಯ ಅಲಂಕರಿಸಿದೆ. ಜಿ.ಎಸ್.ಆರ್ ಅವರ ನಿಜವಾದ ಸ್ಪೂರ್ತಿಯನ್ನು ಇಟ್ಟುಕೊಂಡು ಹೊಸ ಪೀಳಿಗೆಯ ಯುವಕರನ್ನು ರಂಗಭೂಮಿಯತ್ತ ಆಕರ್ಷಿಸಿದ್ದಕ್ಕಾಗಿ ನಾವು ತುಂಬಾ ಹೆಮ್ಮೆಪಡುತ್ತೇವೆ. ನಮ್ಮ ರಂಗಭೂಮಿ ಕುಟುಂಬ 200ಕ್ಕೂ ಹೆಚ್ಚು ಸದಸ್ಯರನ್ನು ಒಳಗೊಂಡು ಬೆಳೆದಿದೆ. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%a8%e0%b2%be%e0%b2%9f%e0%b2%bf%e0%b2%a6%e0%b3%87%e0%b2%b5%e0%b2%9a%e0%b2%b0%e0%b2%bf%e0%b2%a4%e0%b3%86-natyadevacharite/",
    "keywords": "Theatre",
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-473.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "A Home in the Constant Flux",
    "startDate": "2024-05-25T00:00:00+00:00",
    "endDate": "2024-05-27T00:00:00+00:00",
    "description": "Exhibition Opening: Saturday, 25th May | 2 pm\nExhibition on show until Sunday, 26th May | 8 pm \nWalkthrough with the Curator: \nSaturday, 25th May | 6 pm – 7 pm\nSunday, 26th May | 12:15 pm – 1:15 pm \nPanel Discussion:\nSunday, 26th May | 11 am – 12 pm \nThe exercise to retrace the intangible memories entwined with tangible objects is what created the research-based series of thirty-six photos A Home in the Constant Flux: A Call to the Verb Memory. The central idea of this photo-series is that during migration of people across geographies, the objects of love and necessity undergo the arduous ordeal, and that these, bearing the patina of age, create a desire to develop an understanding that personal histories are not isolated from the political selves. \nThe technique of cyanotypes, which is used to print the archival maps for A Home in the Constant Flux: A Call to the Verb Memory metamorphoses into a metaphor of capriciousness – endured by refugees. As the cartographic lines, in various shades of blue and white, overlap the digital images of the objects, they gesture at the fluidity of the memory only to find itself resistant to the burden of confinement around the refugees. The aesthetic of distortion – in the form of borders, the viscosity of the blues and whites, and the ballet of letters – epitomises the inevitability of embracing impermanence as one of the few constants in a life on the move. The element of distortion serves as a bridge between abstract and representation to encourage the viewer to navigate and map the photo series in order to question the boundaries of perception. \nThe panel discussion on the second day of the event will delve into the influence of visual representation on refugee narratives, particularly in light of the surge of imagery overpowering the social and print media in recent years. This influx frequently drowns out the individual voices of refugees, maintaining stereotypical visual stereotypes that confine visual language of that of a destitute ‘other’. Furthermore, the conversation will confront the inherent tendency to marginalize migrants through photography, highlighting the disparity between mainstream portrayals and the more empathetic and authentic depictions found in the research-based project A Home in the Constant Flux: A Call to the Verb Memory. \nIn collaboration with:\n \n  \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/a-home-in-the-constant-flux/",
    "keywords": "Heritage, History, Media, Photography, Politics, Visual Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-470.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "कहत गुरुदास | Kahath Gurudas",
    "startDate": "2024-05-14T19:00:00+05:30",
    "endDate": "2024-05-14T20:30:00+05:30",
    "description": "Pt. Vinayak Torvi has completed his 75 years. To celebrate his life and contribution to music field, his disciples and well wishers have come together and organised concerts in Mumbai, Pune, Delhi, Varanasi, Bangalore, Dharwad and San Francisco, USA. \nThis event will showcase his prowess as Guru and a composer, wherein his prime disciples will present few of his compositions. The programme will also include a performance by Pt. Torvi where he will join his disciples, to present one of the compositions. \nVocals:\nSiddhartha Belmannu\nDhananjay Hegde\nArchana Shenoy\nVibha Kinhal\nSrilakshmi Belmannu\nChinmay Joshi\nM.K. Narasimha \nTabla:\nRoopak Kallurkar \nHarmonium:\nBharat Hegde\n\n\n\n\n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%95%e0%a4%b9%e0%a4%a4-%e0%a4%97%e0%a5%81%e0%a4%b0%e0%a5%81%e0%a4%a6%e0%a4%be%e0%a4%b8-kahath-gurudas/",
    "keywords": "Music, Performing Arts",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "कहत गुरुदास | Kahath Gurudas"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-449.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "Exordium",
    "startDate": "2024-05-15T19:00:00+05:30",
    "endDate": "2024-05-15T20:15:00+05:30",
    "description": "Exordium is a modern Indian dance theatre production aimed at discussing the contemporary social and political human structures through innovative Indian dance. \nThe production presents 2 full length pieces Yele Oota (‘Grand meal’ in Kannada) and Jaaga Illa (lack of space in Kannada). Yele Oota talks about our response and participation as a human community in the food shortage and management crisis, particularly during covid, through intricately designed movement pieces and dramatic compositions, whereas, Jaaga Illa speaks of the impact of hyper-metropolitanism on cities (here we specifically talk about the impact on Bengaluru) through multiple retinal designs and innovative movement grammar performed on a small wooden box. \nDancers: Vishwakiran Nambi, Shrijani Rao, Priyanka Saxena, Simran Thakur, Ananya S Kashyap, Bhuvana V, Dinesh Kumar RA, Ranjini Hemanth\nMusic: Gopu Krishnan\nLyrics: Kiran Kaverappa\nCostumes: Sumukha P Tamankar\nProps: Vishwakiran Nambi\nPictures: Sushrutha \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/exordium/",
    "keywords": "Dance, Performing Arts, Society, Theatre",
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Exordium"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-450.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Caste in Modern India",
    "startDate": "2024-05-31T11:00:00+05:30",
    "endDate": "2024-06-02T20:00:00+05:30",
    "description": "Exhibition Opening: Friday, 31 May\nTimings: 11:00 am – 8:00 pm\nExhibition on show until Sunday, 2 June \nWalkthroughs:\nFriday, 31 May | 6:00 pm\nSaturday, 1 June | 11:30 am & 5:30 pm\nSunday, 2 June | 10:45 am \nConversations:\nInaugural Address – Friday, 31 May | 6:45 pm\nPanel Discussion – Sunday, 2 June | 11:30 am \nRailways and postal services were introduced in colonial India in the early 1850s. In due course, these new technologies made long-distance travel and communication widely accessible and affordable. In a parallel development, the introduction of limited representation in legislatures in the 1890s added urgency to tap the potential trans-local identities enumerated in the decennial censuses beginning in 1871-72. \nIn view of these developments, local communities, in particular, castes, tapped new technologies to connect with kindred groups across the country and combine to form pan-Indian communities. Post offices allowed members of these aggregate groupings to correspond with each other, while railways enabled them to meet periodically and devise strategies to capture a share in legislatures, educational institutions and public employment proportionate to their census population. Drawing upon philatelic material covering a century, the exhibition highlights the role of the postal system in this new politics. \nThe exhibition is divided into two broad parts that bring together correspondence and publications of several caste-based community organisations and individuals from across the country and the philatelic output of the post-colonial state. The exhibition has been curated by Vikas Kumar, who teaches economics at Azim Premji University. \nProf Gopal Guru will inaugurate the exhibition and deliver the inaugural address on May 31, 6:45 pm. He will comment on the exhibition and locate its images in the larger politics of visual culture. \nA Panel Discussion with Prof. Satish Deshpande, a distinguished social scientist who has made seminal contributions to our understanding of caste in independent India, Vaishna Roy, Editor-in-Chief, Frontline magazine and Vikas Kumar, Curator of the exhibit, will take place on 2 June, 11:30 am. \nIn collaboration with Azim Premji University, Bangalore \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/caste-in-modern-india/",
    "keywords": "Heritage, History, Visual Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-468.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Radical Peace: The Astavakra Gita in the Age of AI",
    "startDate": "2024-05-11T18:30:00+05:30",
    "endDate": "2024-05-11T20:00:00+05:30",
    "description": "The session will discuss the relevance of a relatively lesser-known but fundamental text of the Advaita Vedanta School of Hinduism called the Ashtavakra Gita at a time of global conflict. It will focus on the personal experience of the transformative and redeeming power of the text amidst the turmoil, grief, and uncertainty that is the fate of human life. \nThe talk by historian Hindol Sengupta will be followed by a Q&A session with the audience. \nPresented by:\n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/radical-peace-the-astavakra-gita-in-the-age-of-ai/",
    "keywords": "Culture*, History, Literature, Philosophy",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-474.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Rise and Fall of the Vanderbilts",
    "startDate": "2024-06-11T18:30:00+05:30",
    "endDate": "2024-06-11T20:00:00+05:30",
    "description": "Once upon a time, there was a family whose very name connoted wealth. The Vanderbilts had a vast empire built on freight through steamboats and railroads. Over a few generations, the wealth-worth billions in today’s money-had been frittered away and the business itself faded as new options came up in the freight business. Their story remains an enduring example of what happens when business leaders fail to embrace the future and transform. \nBusiness transformation is a dynamic topic that is explored by authors R Gopalakrishnan and Hrishi Bhattacharyya in their book Embrace the Future. A key lesson in the success or failure of such transformations lies in harmonising the art and science of change – the emotional and the rational – and striking the right balance between them. Both in life and in business, a compelling narrative that inspires the organisation is essential for effecting transformation. Equally important is viewing transformation as an ongoing effort integrated into the work culture, rather than solely reacting to crises. \nTheir book resonates with anyone who has encountered change—something prevalent in today’s ever-evolving business landscape. R Gopalakrishnan and Hrishi Bhattacharyya underscore that companies unwilling to adapt are bound to fade away. The authors will share their insight on how it’s imperative to draw lessons from the past, navigate the present, and prepare for the future. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-rise-and-fall-of-the-vanderbilts/",
    "keywords": "Books, Business, Nonfiction",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-428.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "सकल जानि हे नाथ | Sakal Jaani He Naath",
    "startDate": "2024-05-21T19:00:00+05:30",
    "endDate": "2024-05-21T20:15:00+05:30",
    "description": "Hindi, Bundelkhandi, Brajawali, Awadhi | 75 Mins | Suitable for Ages 16+ \nSakal Jaani he Naath is a comedy folk musical adapted from Vasant Deo’s Sudama ke Chawal. It revisits the famed mythological fable about Lord Krishna and his childhood friend Sudama. A Tragic-Comedy that explores the narrative of the contemporary human situation and is a satire on today’s man, his double standards and polluted mind. While the story and characters are the same, the ethos of these characters is what is seen today and in common life. The age-old tale and its characters have been used only as a reference. \nThe play runs parallel with Narottam Das’s Sudamacharit and their verses are sung in folk tunes of Doha and Behre Tavil. \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%b8%e0%a4%95%e0%a4%b2-%e0%a4%9c%e0%a4%be%e0%a4%a8%e0%a4%bf-%e0%a4%b9%e0%a5%87-%e0%a4%a8%e0%a4%be%e0%a4%a5-sakal-jaani-he-naath/",
    "keywords": "Performing Arts, Theatre",
    "inLanguage": "hi",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "सकल जानि हे नाथ | Sakal Jaani He Naath"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-472.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Nagari - Filming Urban Realities",
    "startDate": "2024-05-12T10:30:00+05:30",
    "endDate": "2024-05-12T13:00:00+05:30",
    "description": "The Nagari Short Film Competition is an annual competition designed to guide and develop films that focus on urban issues, specific to Indian cities. Nagari intends to be a bioscope for the city and through this lens, they explore diverse conditions and engage with urban issues.  \nSince 2020 Charles Correa Foundation has organised 4 editions of short, 7-minute films on urban India. The aim is to serve as a platform for filmmakers, architects, urban designers, and planners to present their visions of, and for, the city, thereby using film as a medium to make the public aware of the issues. \nThe previous editions have looked at themes such as Water in Urban India, People and Livelihoods, the Housing Inadequacy in rapidly growing towns and cities across India, and Reclaiming the Urban Commons through the Lens of Waste Management. This event will present a selection of the films from across four years of the festival. \nThe screenings will be followed by a brief discussion with Deepa Dhanraj, Writer and Independent Documentary Filmmaker and,  Shruti Parthasarathy, Filmmaker. A Q&A with the audience will follow. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/nagari-filming-urban-realities/",
    "keywords": "Architecture, Cities, Design, Development, Environment, Film",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-467.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Mom-edy Central",
    "startDate": "2024-05-12T19:00:00+05:30",
    "endDate": "2024-05-12T20:30:00+05:30",
    "description": "Get ready to laugh till you cry as Bangalore’s funniest comedians gather to roast the true queens of our lives – our moms! From their expert guilt-trips to their unbeatable cooking skills, no mom-ism is safe from our hilarious lineup. Join us for a night of laughter, love, and a whole lot of mom jokes as we celebrate Mother’s Day like never before! \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/mom-edy-central/",
    "keywords": "Performing Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-476.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "Asamana Anasuya",
    "startDate": "2024-05-12T18:30:00+05:30",
    "endDate": "2024-05-12T20:30:00+05:30",
    "description": "87 Minutes 15 Seconds | English & Telugu with English Subtitles | 2023 \nAsamana Anasuya (Incomparable Anasuya), is a documentary directed by Seetha Ratnakar as a tribute to her mother Vinjamuri Anasuya Devi.  \nVinjamuri Anasuya Devi was a musical prodigy who started giving concerts at the age of 7. Her first gramophone recording, Ayyo Koyyoda at age 8, ignited her lifelong love affair with folk music. She was a trailblazer who introduced folk songs on a concert platform when she was 11. Encouraged by the overwhelming response she started giving full length folk concerts along with her sister, Vinjamuri Seetha Devi. Popularly known as the Vinjamuri Sisters, they became a phenomenon that took the music world by storm.  \nAnasuya started composing music for her uncle, Devulapalli Krishna Sastri when she was 9 and became a sought-after music composer. She was multi-talented and excelled in music of every genre but folk music remained her passion. She dedicated her life to popularising and propagating traditional and folk songs. She bequeathed an invaluable legacy to posterity by categorising her vast collection into 7 volumes and publishing them along with lyrics and music notations. At the age of 80, Anasuya became a writer and published 4 books including her autobiography Asamana Anasuya, at the age of 94.  \nThe film screening will be followed by a discussion with Devina Dutt and a Q&A with the audience. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/asamana-anasuya/",
    "keywords": "Biography, Film, Music",
    "inLanguage": "te",
    "workPresented": {
      "@type": "Movie",
      "name": "Asamana Anasuya"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-439.jpg"
  }
]