[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "82763-1765735200-1765740600@bangaloreinternationalcentre.org",
    "name": "Born Vulnerable",
    "startDate": "2025-12-14T18:00:00+05:30",
    "endDate": "2025-12-14T19:30:00+05:30",
    "description": "We inherit more than genes at birth; we inherit environments. \nThis panel turns the spotlight on the Developmental Origins of Health and Disease (DOHaD), a growing body of science showing how conditions in the womb and early childhood shape lifelong risk for diabetes, heart disease, and other noncommunicable diseases. As India confronts a deepening NCD crisis, the deeper question this conversation raises is unsettling and urgent: if risk begins before birth, how do we protect a future we cannot yet see?  \nThe session will examine why early nutrition, air pollution, toxic exposures, and social environments matter as much as adult lifestyle. Dr Kalpana Balakrishnan will discuss how air and toxic exposures affect health beyond the lungs, while Dr Naveen Ramesh will address how nutrition, social systems, and public health responses come into play. The discussion will be moderated by Dr Ashok Vellodi. \nThis panel discussion invites a rethinking of public health itself, from treatment to prevention, from adulthood to the very start of life. A Q&A with the audience will close the session. \n",
    "url": "https://bangaloreinternationalcentre.org/event/born-vulnerable/",
    "keywords": [
      "Development",
      "Health & Wellness",
      "Public Health",
      "Science",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-Born-Vulnerable.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "82781-1765823400-1765828800@bangaloreinternationalcentre.org",
    "name": "Becoming Dravidian",
    "startDate": "2025-12-15T18:30:00+05:30",
    "endDate": "2025-12-15T20:00:00+05:30",
    "description": "How does ideology become actionable?  \nIn the padippakkam (reading rooms) of Tamil Nadu, ideas spread like wildfire. Pamphlets passed from hand to hand and conversations stretched endlessly. What began as intellectual restlessness soon crystallised into a shared civic consciousness.  \nThe Dravidian Pathway traces how this cultural churning transformed into one of India’s most enduring political movements. Vignesh Rajahmani’s study illuminates the Dravidian movement’s sophisticated synthesis of anti-caste thought, aspirations for socio-economic mobility, and an inclusive Dravidian–Tamil identity; an evolution that culminated in the emergence of the electorally formidable DMK. In his account, ideology is never abstract: it is lived, negotiated, and embodied by ordinary people seeking dignity and opportunity. \nIn this discussion, Rajahmani is joined by Dr. Srikrishna Ayyangar and Dr. Atreyee Majumder, to examine the strategies of Periyar E.V. Ramasamy, K. Kamaraj, C.N. Annadurai, and M. Karunanidhi, and consider how their ideas continue to shape Tamil Nadu’s political imagination in an age of rising majoritarianism. \nA Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/becoming-dravidian/",
    "keywords": [
      "Governance",
      "Policy & Regulation",
      "Politics",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_BD.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "82939-1765710000-1765715400@bangaloreinternationalcentre.org",
    "name": "The Realms of Dharma and of the Mahabharata",
    "startDate": "2025-12-14T11:00:00+05:30",
    "endDate": "2025-12-14T12:30:00+05:30",
    "description": "Dharma is difficult to translate, and even harder to understand.  \nIn this talk, scholar Frederick Smith draws on nearly five decades of study to illuminate how the concept of dharma moves, shifts, and comes alive across the subcontinent. By tracing regional retellings of the Mahabharata, he reveals how different communities have interpreted its moral tensions. Turning to modern literature such as U.R. Ananthamurthy’s Samskara, he connects these ancient debates to contemporary questions of responsibility, community, and moral action. With clarity and depth, Smith examines how ideas of dharma and adharma operate in the Sanskrit Mahabharata and how these ideas ripple outward into contemporary India.  \nA Q&A with the audience will follow, offering space for reflection and dialogue. \nIn collaboration with: \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-realms-of-dharma-and-of-the-mahabharata/",
    "keywords": [
      "Heritage",
      "In Memory",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_RoD.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "82621-1765391400-1765400400@bangaloreinternationalcentre.org",
    "name": "Inquilab di Kheti | Farming the Revolution",
    "startDate": "2025-12-10T18:30:00+05:30",
    "endDate": "2025-12-10T21:00:00+05:30",
    "description": "105 minutes | Punjabi, Hindi with English Subtitles | India, France and Norway | 2024 \nAt the edges of the capital, a nation gathered to defend its right to live with dignity. \nInquilab di Kheti documents the year-long farmers’ protests that unfolded during the COVID-19 lockdown in response to India’s new agricultural laws. Through patient, intimate observation, the film captures how hundreds of thousands of farmers across generations, religions, castes, and classes, came together to form resilient communities at Delhi’s borders. What emerges is a portrait not only of resistance, but of collective care, endurance, and moral resolve. \nFollowing the screening, filmmaker Nishtha Jain will be in conversation with Sandhya Kumar, closing with a Q&A session. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/inquilab-di-kheti-farming-the-revolution/",
    "keywords": [
      "Agriculture",
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "pa",
    "workPresented": {
      "@type": "Movie",
      "name": "Inquilab di Kheti | Farming the Revolution"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_IDK.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "82847-1765710000-1765715400@bangaloreinternationalcentre.org",
    "name": "The Roar and the Squeak!",
    "startDate": "2025-12-14T11:00:00+05:30",
    "endDate": "2025-12-14T12:30:00+05:30",
    "description": "The mighty lion and the tiny mouse return in a charming puppet show filled with sing-along songs and storytelling through handmade puppets. Children will then be guided through an art activity to create an animated lion – the imaginative storytelling version of the character on paper! \nA perfect blend of art, imagination, and storytelling: come and create your own jungle tale! \nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \nIn collaboration with: \n \n  \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-roar-and-the-squeak/",
    "keywords": [
      "Around the World in 50 Sundays"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-68-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "82745-1765305000-1765310400@bangaloreinternationalcentre.org",
    "name": "Adoor, Jaya, Shabana, Girish… How India’s Finest Filmmakers Were Made",
    "startDate": "2025-12-09T18:30:00+05:30",
    "endDate": "2025-12-09T20:00:00+05:30",
    "description": "What does it take to shape a filmmaker? How do you ‘make’ a Jaya Bachchan or an Adoor Gopalakrishnan?  \nRadha Chadha’s new book The Maker of Filmmakers: How Jagat Murari and FTII Changed Indian Cinema Forever takes us through the life and legacy of her father Jagat Murari, and the iconic film school he built. With uncanny consistency, FTII produced top talent: Jaya Bachchan and Shabana Azmi, Adoor Gopalakrishnan and Subhash Ghai, Shatrughan Sinha, Girish Kasaravalli, Mani Kaul, and many other cinema legends. His alumni became the big names of Bollywood, spearheaded the Indian New Wave, kickstarted regional language cinema, and helped usher television into the country. \nIt’s this extraordinary creative legacy that leads to the book’s tantalizing question: Did Jagat Murari have a secret formula? In conversation with author Radha Chadha, Ambassador Talmiz Ahmad, legendary filmmaker Girish Kasaravalli, and iconic cinematographer G.S. Bhaskar, this session will delve into how Jagat Murari and FTII shaped generations of filmmakers – and how their work transformed Indian cinema into the global powerhouse it is today. Both Radha and Talmiz grew up at FTII, where their fathers served as Principal and Vice Principal. \nThe session will include a montage of student film clips of iconic FTII alumni Jaya Bachchan, Shabana Azmi, Adoor Gopalakrishnan, Subhash Ghai, Mani Kaul, and others, as also an excerpt from Girish Kasaravalli’s award-winning student film Avsesh. A Q&A with the audience will be followed by book signings by the author. \nAbout BIC Elsewhere: \nWhile the majority of our events find a home at our premises in Domlur, BIC Elsewhere represents our commitment to bringing conversations, arts, and culture directly to diverse audiences. Through this initiative, we collaborate with various venues, extending the reach of our events beyond our own space. These partnerships not only breathe life into our gatherings but also play a crucial role in cultivating an environment for the flourishing of arts and culture in the city. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/adoor-jaya-shabana-girish-how-indias-finest-filmmakers-were-made/",
    "keywords": [
      "Books",
      "Film",
      "Media",
      "Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "Sabha BLR, No.44/A, Kamaraj Rd, Bharati Nagar, Shivaji Nagar, Bengaluru, Karnataka, 560042, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_MOFM-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "83081-1766084400-1766089800@bangaloreinternationalcentre.org",
    "name": "Dual Margam 7",
    "startDate": "2025-12-18T19:00:00+05:30",
    "endDate": "2025-12-18T20:30:00+05:30",
    "description": "Contrast becomes a catalyst for choreography in conversation! \nThis edition of Dual Margam brings together the leaping dynamism of Kuchipudi and the sensuous symmetry of Odissi, inviting audiences into a rare encounter between movement vocabularies. Kuchipudi enters with its theatrical lineage of swift footwork, buoyant jumps, and a dramatic pulse inherited from dance-drama traditions. Odissi counters with sculptural grace, curved lines, and a musicality that shimmers through every shift of the torso. \nSide by side, they reveal how classical technique carries the soul of a region; how mythology is interpreted through rhythm, how stories are shaped by cultural memory, and how two forms can diverge in grammar yet still speak to the same emotional truth. \nAn evening that showcases the extraordinary breadth of Indian performance traditions on a single stage. \nThe Dual Margam series curates two classical dance forms of India to highlight their similarities and differences. The solo performances honour traditional repertoire (the Margam), while the duet will juxtapose each unique form with another. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dual-margam-7/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_DM7.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "82510-1765566000-1765571400@bangaloreinternationalcentre.org",
    "name": "Sounds From the Library (#7)",
    "startDate": "2025-12-12T19:00:00+05:30",
    "endDate": "2025-12-12T20:30:00+05:30",
    "description": "The seventh edition of Sounds From the Library brings to you a unique flavour of hip hop! \nAn intimate evening where conversation and performance intertwine in the cozy, listener-focused space of the BIC library. This hybrid series spotlights emerging voices from the Indian music scene, all past longlisted artists from the Toto Awards for Music. \nFrom Pune, Moosa brings a fluid weave of R&B and his evolving alt–indie sensibilities, moving with ease between melody and groove. From Bengaluru, Kali grounds the evening in the rhythms of Kannada, fusing language with socially charged narratives to deliver a raw, unfiltered take on hip hop. Aditi Sreevathsa anchors the night as DJ and show emcee, bringing her experience as a seasoned music industry professional to shape the energy of the evening. \nMore than a gig, Sounds From The Library invites audiences into the creative lives of the artists; offering insight into their inspirations, processes, and personal journeys. With music that moves and conversations that linger, this is a rare chance to experience live performance in its most thoughtful form. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sounds-from-the-library-7/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sounds From the Library (#7)"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-66-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "83015-1765998000-1766003400@bangaloreinternationalcentre.org",
    "name": "Love In The Time of Algorithms",
    "startDate": "2025-12-17T19:00:00+05:30",
    "endDate": "2025-12-17T20:30:00+05:30",
    "description": "Swipe right on a night of laughter, love and longing. \nCreated by The Self Centre, Love in the Time of Algorithms is a contemporary theatre production that unpacks today’s wild world of dating and relationships through seven slice-of-life vignettes. From first dates that feel like job interviews to friends surviving the battlefield of bios, this play brings new-age love to the centre stage. A brutally honest yet tender look at how technology has changed the way we search for connection, and how even today, we are all ultimately human. \nWhether you’re single, taken, situationship-ing, healing, or simply curious, you’ll leave feeling seen, entertained, and maybe even a little hopeful! \nAbout The Self Centre: \n\n\n\n\n\n\n\n\nThe Self Centre is a space dedicated to exploring the self and the dilemmas of our times through theatre. It creates and curates work that responds to the pulse of the community, offering room for reflection, dialogue, and transformation. Its approach, described as transformational theatre, is rooted in the belief that performance can shift not only perspectives, but also possibilities for how people live and relate to one another. \n\n\n\n\n\n\n\n\n \nSupported by: \n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/love-in-the-time-of-algorithms/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Love In The Time of Algorithms"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-70-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "82921-1765567800-1765571400@bangaloreinternationalcentre.org",
    "name": "Superhero",
    "startDate": "2025-12-12T19:30:00+05:30",
    "endDate": "2025-12-12T20:30:00+05:30",
    "description": "\nWho is a hero without a villain? \nChoreographer Raghav Handa explores the complexities of power through a deeply physical and theatrical vocabulary. The work unfolds in a world where the familiar slips into the uncanny, creating a charged landscape that both unsettles and mesmerises. Through bold movement, striking imagery, and layered symbolism, Handa probes the dualities we carry within us: strength and fragility, courage and fear, dominance and surrender. \nRather than offering clear answers, Superhero invites audiences to sit with ambiguity. What does it take to stand tall in a fractured world? Can heroism exist without shadow, conflict, or contradiction? And when power transforms from something possessed to something shared, who do we become?  \nThis event is in partnership with Attakkalari Centre for Movement Arts. Superhero has been funded by Creative Australia and Centre for Australia-India Relations’ Maitri Grant program. Superhero is also supported by the Australian Consulate-General in Mumbai. \n\n\n\nIn collaboration with: \n\n               \n\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/superhero/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_SH.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "82976-1765650600-1765656000@bangaloreinternationalcentre.org",
    "name": "Eye of the Cyclone",
    "startDate": "2025-12-13T18:30:00+05:30",
    "endDate": "2025-12-13T20:00:00+05:30",
    "description": "Overwhelmed? Disoriented? Exhausted? \nIn this reflective session, Dr. Shyam Bhat draws on his expertise in psychiatry and integrative medicine to unpack the rising sense of disorientation shaped by hyperconnection, constant noise, and emotional overload. He explores how these forces fracture our inner clarity, and offers practical ways to rebuild a steadier sense of purpose. Drawing from both clinical experience and contemplative traditions, Dr. Bhat charts a path toward reconnecting with our values and rediscovering direction in an increasingly fast-paced world. \nA gentle invitation to pause, understand what’s unfolding within, and realign with what truly matters. \nThe talk will be followed by an audience Q&A. \nPresented by: \nNirvikalpa Integrated Therapy Foundation\nFounded by Dr. Shyam Bhat, the Nirvikalpa Integrated Therapy Foundation blends India’s philosophical and psychological wisdom with modern Western science to create a rigorous, evidence-based therapeutic model grounded in non-duality and transcendence. The foundation conducts scientific research, develops therapist-training programs, and shares integrative mental-health insights with the public. Its work aims to build a culturally rooted, systematic approach to therapy that strengthens resilience, deepens connection, and supports collective well-being. \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/eye-of-the-cyclone/",
    "keywords": [
      "Health & Wellness",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-67-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "82674-1765306800-1765312200@bangaloreinternationalcentre.org",
    "name": "A Junkyard Wonder",
    "startDate": "2025-12-09T19:00:00+05:30",
    "endDate": "2025-12-09T20:30:00+05:30",
    "description": "Consider the mess as masterpiece. \nA Junkyard Wonder, the eight-track debut by Ananya Sharma, is a deeply personal journey through the shifting terrain of self-image, moving between self-doubt, tenderness, love, and hard-won acceptance. Beneath Ananya’s soft-spoken, inward presence lies a lyricism that is unflinchingly honest, tracing how her relationship with herself has evolved over time. \nBuilt with contributions from over forty friends and collaborators across the world, A Junkyard Wonder unfolds as both collective creation and private reckoning. The record is shaped around five core lyrical pieces, held together by three interludes: The Flaw, The Discovery, and The Cure, each marking a pivotal emotional shift. \nIntimate, imperfect, and quietly expansive, this evening offers a mirror into negotiations with identity and becoming.  \nBand:\nAnurag Naidu\nKush Upadhyay\nBrecilla Dsouza\nShashank Das\nShivang Kapadia \nSupported by:\n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-junkyard-wonder/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "A Junkyard Wonder"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-64-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "83151-1765218600-1765223100@bangaloreinternationalcentre.org",
    "name": "Petite Maman",
    "startDate": "2025-12-08T18:30:00+05:30",
    "endDate": "2025-12-08T19:45:00+05:30",
    "description": "72 minutes | French with English subtitles | France | 2021 \nWriter & Director: Céline Sciamma\nStarring: Joséphine Sanz, Gabrielle Sanz, Nina Meurisse, Stéphane Varupenne\nComposer: Jean-Baptiste de Laubier \nA new way of seeing our mothers, our daughters, and ourselves. \nAfter eight-year-old Nelly loses her grandmother, she travels with her parents to the family home where memories linger like breath on glass. Wandering into the woods, she meets a girl her own age, Marion, whose face mirrors her own mother’s childhood photographs. What unfolds is a quietly radical conversation across time, told through the strange clarity of childhood compassion. \nDissolving the boundaries between generations, the film creates space for a mother–daughter relationship to be understood from the purest vantage: that of two children. Sciamma crafts a world where magic feels utterly natural, where grief can be shared, and where imagination becomes a tool for consolation.  \nIn just 72 tender minutes, Petite Maman asks how we inherit sorrow, and how we might finally lay it down. \nThis is the fourth film in our collaboration with MUBI. Once in two months we will bring a new film from the extensive MUBI collection to our beloved BIC audience! \nIn collaboration with: \n \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/petite-maman/",
    "keywords": [
      "Film",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Petite Maman"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-105.jpg"
  }
]