[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63497-1725993000-1725998400@bangaloreinternationalcentre.org",
    "name": "Story of an Unknown Indian",
    "startDate": "2024-09-10T18:30:00+05:30",
    "endDate": "2024-09-10T20:00:00+05:30",
    "description": "What does the life of an ordinary working-class Indian look and feel like? \nJoin us for a panel discussion discussing this and more with the author of The Many Lives of Syeda X Neha Dixit and commentator and editor Priya Ramani. \nIn her book The Many Lives of Syeda X  journalist Neha Dixit traces the story of one such faceless Indian woman, Syeda X, from the early 1990s to the present day. What emerges is a picture of a life lived under constant corrosive tension. \nResearched for close to a decade, in this book, we meet an unforgettable cast of characters for whom displacement, tragedy and hardships are the things they are used to. Written with empathy and deep insight, this book is a portal to a harsh world hidden away from elite Indians. It is the story of untold millions and a searing account of urban life in New India. \nThe discussion will be followed by a Q&A session with the audience. \nPresented by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/story-of-an-unknown-indian/",
    "keywords": [
      "Books",
      "Fiction",
      "Politics",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/POSTER_Thumbnail-copy-3-5.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63225-1725649200-1725653700@bangaloreinternationalcentre.org",
    "name": "मेरे ऐनक से | Mere Aenak Se",
    "startDate": "2024-09-06T19:00:00+05:30",
    "endDate": "2024-09-06T20:15:00+05:30",
    "description": "What happens when we begin to realise that perhaps what we see isn’t through clear eyes? \nWhat if we not just sense that many lenses exist in this world,\nBut also that each one of us has an endless supply of them. Lenses big and small\nLenses of all kinds\nDifferent lenses for different people\nDifferent lenses for different situations\nLenses Inspired by the learnings and un learnings of our individual and collective journeys. Lenses inspired by the biases and fears we wear as shields. \nAnd what happens when lenses begin to come off\nOne at a time? \nMeri Aenak Se is a journey a part of each one of us is on. A secret quest each human being is on, a quest of love, a quest for a world with that love\nSo one can surrender to it\nWe take these journeys while we travel on roads that are parallel to one another,\nas we live alongside each other\nBut we take these journeys in isolation.\n\nWhat would happen if suddenly, these journeys became aware of one another?\n\n\nAbout The Aahvaan Project \n\n\n\nThe journey of Aahvaan, a musical collective, has been nothing short of an odyssey. Beginning in late 2016, the past two years have been a watershed moment for the group, as they have traversed the length and breadth of the country, performing, conducting workshops, and enriching themselves through the experience. \nThroughout their tours, Aahvaan has continued to refine their musical style, fusing diverse genres and collaborating with like-minded artists to create a sound that they believe is a modern representation of Nirgun. This constant evolution has allowed them to connect with fellow travellers along the way, each encounter contributing to their artistic growth. \nAahvaan’s latest presentation, “Meri Aenak Se,” is an exploration of the differences in perception, attitudes, and actions that shape our individual experiences. It invites the audience to step into the shoes of another, to see the world through their eyes, and to share in their joys and struggles as if they were one’s own. \nThe original songs and stories, lovingly and thoughtfully curated by Vedi and Sumant, are a testament to Aahvaan’s commitment to storytelling. They cherish the opportunity to share their journey with audiences, fostering a deeper understanding and connection between individuals and cultures. \nAahvaan’s story is one of growth, exploration, and the power of music to bridge the gaps between us. Through their performances and workshops, they continue to inspire and captivate audiences, inviting them to embark on a journey of self-discovery and empathy. \n  \nSupported by \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%ae%e0%a5%87%e0%a4%b0%e0%a5%87-%e0%a4%90%e0%a4%a8%e0%a4%95-%e0%a4%b8%e0%a5%87-mere-aenak-se/",
    "keywords": [
      "Music",
      "Performing Arts",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "मेरे ऐनक से | Mere Aenak Se"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-17.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63616-1726599600-1726605000@bangaloreinternationalcentre.org",
    "name": "Patterns in Time",
    "startDate": "2024-09-17T19:00:00+05:30",
    "endDate": "2024-09-17T20:30:00+05:30",
    "description": "A piece of music can be considered a pattern in time… the strange thing is that it doesn’t really exist until it is being played… A great work also captures something of the era in which it was written and then travels through time via aural tradition… or in notated form to be performed hundreds of years later. \nPatterns in Time, a range of music from the 16th century to the present, takes the audience through a journey not only through time but also through geographies and cultures from all over the world. \nThe concert begins with Spanish music inspired by the Andalusian flamenco tradition and will proceed to Renaissance and Baroque standards by Dowland, Scarlatti and Bach. This will be followed by an extended and programmatic avant garde composition by the guitar virtuoso Pavel Steidl. \nThe second half of the recital will set off with some refreshingly tropical South American music and some tunes by Indian composers. This will be followed by music inspired by Turkey and end with Shamal, an improvisatory piece consisting of extended techniques and percussion featuring a blend of sonorities and rhythms from the Middle East and the Indian subcontinent. \n \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/patterns-in-time/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Patterns in Time"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-590.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63625-1727004600-1727010000@bangaloreinternationalcentre.org",
    "name": "Sitar Stories: Weaving the Past and Present in Music",
    "startDate": "2024-09-22T11:30:00+05:30",
    "endDate": "2024-09-22T13:00:00+05:30",
    "description": "This session presents an enthralling journey through the rich history of the sitar, beginning with its origins and evolution across centuries. The performance explores the sitar’s creation from natural elements, merging Persian and Indian musical traditions to symbolize its sacred and timeless nature. As the sitar travels through royal courts, it becomes a symbol of refinement and cultural prestige, before eventually establishing itself as a central instrument in Indian classical music. This concert highlights the transformation, showcasing the sitar’s rise as a solo instrument and its deep connection to Indian music. \nHonoring the contributions of legendary sitarists like Ustad Vilayat Khan and Pandit Ravi Shankar, this performance will illustrate their groundbreaking innovations that shaped the sitar’s modern identity and global influence. From classical Indian ragas to cross-cultural experiments, the sitar’s role in contemporary music will be explored, demonstrating its versatility and ongoing relevance in world music. Through a blend of storytelling and music, this performance celebrates the instrument’s enduring legacy and its profound impact on both classical and global music. \nPresented by \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sitar-stories-weaving-the-past-and-present-in-music/",
    "keywords": [
      "Culture*",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sitar Stories: Weaving the Past and Present in Music"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-591.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63157-1726167600-1726174800@bangaloreinternationalcentre.org",
    "name": "Harmonica Magic",
    "startDate": "2024-09-12T19:00:00+05:30",
    "endDate": "2024-09-12T21:00:00+05:30",
    "description": "Many years ago, in Detroit during a chance meeting with Jerry Murad of the Harmonicats, a commitment was made. Sulaiman Jamal met Jerry Murad at a harmonica convention, and he asked Sulaiman to continue playing the chromatic harmonica. He highlighted the versatility and beauty of the small instrument. That was Sulaiman’s motivation and inspiration to continue playing the unique instrument which he had actually put in cold storage. \nWhile Jerry had passed away many years ago, Sulaiman was reminded by a mutual friend that he had not fulfilled Jerry’s request – This concert is to do just that. \nThe theme of the concert is to cover some of the greatest Broadway and cinema themes, mainly from yesteryear which have warmed our hearts. \nThe evening will include favourites from Phantom of the Opera, The Wizard of Oz, Jesus Christ Superstar, Fiddler on the Roof and more. Not to forget the classics from The Beatles, Leonard Cohen, Simon and Garfunkel, and Big Band and Blues numbers. \nWith a group of extremely talented and accomplished musicians, the evening can’t be anything but memorable. The magic of the Harmonica and an incredible music ensemble awaits you. \nPresented by: \n \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/harmonica-magic/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Harmonica Magic"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-2_POSTER-17.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63492-1725647400-1725652800@bangaloreinternationalcentre.org",
    "name": "Demystifying Climate Change",
    "startDate": "2024-09-06T18:30:00+05:30",
    "endDate": "2024-09-06T20:00:00+05:30",
    "description": "Every day we hear something unusual. A fire here, a flood there, a storm surge, a cloudburst. These events affect all of us, our well-being, our health, our family, our work. Their frequency and intensity are increasing. Fortunately, however, we no longer lack explanations for these events. We know fossil fuels and the destruction of Nature by us humans are the primary reasons for the alarming acceleration in global warming. \nAwareness is the first step towards change, and Rajan Mehta’s Backstage Climate is an attempt to make you aware of global warming and climate change in a simple and interesting manner. It demystifies this grim reality—the science, the politics and the economics behind climate change. It also gives you a glimpse of the policies, technology and solutions that can help save the planet and ensure our survival. \nGoing slightly beyond mere awareness, the attempt is to help the reader connect the dots and develop a perspective on the reasons, impact and solutions that can help us avoid a climate crisis. \nRajan Mehta will be in conversation with Prem Panicker. The discussion will be followed by a Q&A session with the audience. \nPresented by \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/demystifying-climate-change/",
    "keywords": [
      "Climate Change",
      "Environment",
      "Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/POSTER_Thumbnail-copy-3-4.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63375-1725562800-1725567300@bangaloreinternationalcentre.org",
    "name": "Kathas in Kathak",
    "startDate": "2024-09-05T19:00:00+05:30",
    "endDate": "2024-09-05T20:15:00+05:30",
    "description": "Kathak, one of India’s most iconic classical dance forms, has continuously evolved over centuries, shaped by the dynamic interplay of poetry, politics, and cultural shifts. Imperative to its evolution are the poetic narratives and political landscapes that have informed and transformed both its content and form. \nIn this performance, Madhu Nataraj and the Natya STEM Dance Kampni present a space-temporal retelling of Kathak’s rich history. Through an array of rare, vintage, and contemporary choreographies, the dancers weave together the past and the present, allowing historical veracity to coexist with artistic resilience. \nThis unique performance delves into Kathak’s diverse journey across regions and eras, offering an insightful exploration of how artistic expression has both shaped and been shaped by the socio-political contexts of its time. From the courts of ancient kingdoms to the modern stage, the show showcases Kathak’s timeless beauty and enduring adaptability, all while celebrating the dance’s poetic spirit. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/kathas-in-kathak/",
    "keywords": [
      "Dance",
      "History",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-15.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63420-1725795000-1725798600@bangaloreinternationalcentre.org",
    "name": "Object Stories",
    "startDate": "2024-09-08T11:30:00+05:30",
    "endDate": "2024-09-08T12:30:00+05:30",
    "description": "You’ve read books. You’ve read comics. You’ve read magazines. But have you ever read an object? From ancient times, inventive humans have created objects to enrich their world. Join award-winning children’s author Devika Cariapa as she introduces her latest book, A Children’s History of India in 100 Objects and learn to read clues from some of these old material remains. Turn into ‘object detectives’ as tiny coins and crumbling pottery reveal secrets of the long-ago people who made them. Then, write your own exciting object stories. Discover a whole new way of understanding the past! \n",
    "url": "https://bangaloreinternationalcentre.org/event/object-stories/",
    "keywords": [
      "Culture*",
      "History",
      "Literature",
      "Visual Arts",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/POSTER_Thumbnail-copy-3-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63363-1725820200-1725825600@bangaloreinternationalcentre.org",
    "name": "AI: The Architect of Politics",
    "startDate": "2024-09-08T18:30:00+05:30",
    "endDate": "2024-09-08T20:00:00+05:30",
    "description": "Humanity stands on the brink of a new era defined by intelligence. Artificial intelligence is evolving at a breakneck pace, transforming not only business and daily life but also politics- both personal and the world’s. \nThis session draws from Juna Antonio March’s book Momentum that confronts the pivotal challenge of our age- the allure of extraordinary progress, juxtaposed against a world teetering on the edge of chaos, held back by outdated political structures. Momentum charts the trajectory of this new world and the path to avoid fatal collapse. \nThis session will shed light on how AI is dramatically reshaping the world by revolutionising various sectors, the challenges it presents, how we interact with technology and navigate our environments, how AI is increasingly influencing politics by shaping public discourse, campaign strategies, and policy decisions, thus, becoming instrumental in affecting strategic decisions of  politics and governance. \nJuna Antonio March will be in conversation with Tanuj Bhojwani. The discussion will be followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/ai-the-architect-of-politics/",
    "keywords": [
      "Books",
      "Fiction",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/POSTERS_Thumbnail-copy-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63385-1726254000-1726259400@bangaloreinternationalcentre.org",
    "name": "Her Voice",
    "startDate": "2024-09-13T19:00:00+05:30",
    "endDate": "2024-09-13T20:30:00+05:30",
    "description": "Her Voice by SaMaRaSa is an exploration of compositions that are created by women, or about women, set in the context of a Carnatic concert, but with a novel approach. The musicians explore the nuances of the raga, lyric and soul of the composition, while sharing what each piece means to them personally as women and artistes. Interspersed with spoken word and poetry, this concert will be an intimate yet exciting journey into the world of raga and rhythm. They will share inspirational stories of fearless artistes who conquered barriers within and without to leave a lasting legacy. \nPresenting the concert are three accomplished musicians – Manasi Prasad (vocals), Aditi Krishnaprakash (violin) and Deepika Sreenivasan (mridangam) who have travelled the world sharing their music. In addition, their academic and corporate credentials have enabled them to develop a world view that is unique, contemporary and relevant. \n‘SaMaRaSa’ – Sisters in Harmony, is a collective of women musicians who believe that music not only entertains and elevates, but can also create change. Through performances and ideas that celebrate women, SaMaRaSa aims to bring fresh ideas to the way Carnatic music is presented and performed. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/her-voice/",
    "keywords": [
      "Gender",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Her Voice"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-587.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63691-1725818400-1725823800@bangaloreinternationalcentre.org",
    "name": "Baaz Na Aayenge Hum Mohabbat Se | बाज़ न आएंगे हम मोहब्बत से | باز نہ آئیں گے ہم محبت سے",
    "startDate": "2024-09-08T18:00:00+05:30",
    "endDate": "2024-09-08T19:30:00+05:30",
    "description": "The foundation of Qawwali history in India, known as the Delhi Gharana, was laid by Hazrat Amir Khusro himself. Under his supervision, the Sangeet Qawwali Bachhe Sufi, also known as the Qawwal Bache Gharana music group, was formed. When Khusro came to Gulbarga in the Deccan region, the style of the Banda Nawaz brothers became prevalent and distinctive, rather than the traditional Qawwali. \nIn the Chishti school of thought, Qawwali holds a special place and is sometimes even accorded the status of worship. During this period, some Qawwali and music teachers of the Chishtiya lineage accompanied the Banda Nawaz brothers to the Deccan. These included the Banda Nawaz Nizami Sabri and other Banda Nawaz brothers known by various monikers. In Karnataka, they are referred to as Banda Nawaz Qawals. \nKarnatak Qawwali is one of the most popular musical styles in the Deccan, and its descendants continue to perform it. In Gulbarga Sharif, there is a branch of the Qawwali Brothers that is quite famous, known as the Banda Nawaz Brothers. This group includes Muhammad Tanveer Niazi, Salam Banda Nawaz, Khawaja Mian Banda Nawaz, and others. \nThe Sufi performers of Kalyana Karnataka are deeply connected with social alchemy, as they accompany every person, village, and Sufi of the region in public festivals and Urs celebrations, both large and small. These artists are truly public performers and can be considered ambassadors of Carnatic Sufi music in Kalyana Karnataka. The Banda Nawaz brothers’ Qawwali is the custodian of this revived Sufi music, belonging to the same family and keeping the tradition alive through successive generations. \nThe beautiful and colourful compositions of Kalyana Karnataka are presented at various festivals, with their unique tone and ideas. The group has been awarded the prestigious Kalyana Karnataka Award. Their style of Qawwali, infused with local Sufism, is unique and reveals the influence of Sufi sages and their company. \nThe Qawwali tradition in Kalyana Karnataka is both a preserver and innovator of this ancient art form. The performers are skilled in choosing meaningful words and delivering them so the audience is inevitable moved and often in raptures . Their music does more than entertain – it offers spiritual fulfillment and teaches listeners about Sufi ideas and poetry. \nWhat makes this style special is how it blends different elements. It captures the heart of Sufi poetry while maintaining a classical feel. At the same time, it creates a unique sound by mixing broader Indian music styles with specific South Indian (Carnatic) traditions. \nThis combination of traditional roots and regional adaptation makes Kalyana Karnataka’s Qawwali a rich and meaningful form of cultural expression. It speaks to people’s hearts, minds, and souls, connecting them to both ancient wisdom and contemporary experiences. \nTo delve deeper into this rich history and cultural synthesis, scholars Rehmat Tarikere and Syed Rauf Qadri will provide expert insights. Professor Tarikere, known for his extensive research on Sufi traditions in Karnataka, will elucidate the historical context and evolution of Qawwali in the region. Dr. Qadri, an authority on poetry, Islamic mysticism and its musical expressions, will explore the spiritual dimensions and poetic nuances of the Kalyana Karnataka Qawwali tradition. Together, these scholars will offer a comprehensive understanding of the syncretic culture and musical traditions that have shaped Qawwali in the Deccan and Kalyana Karnataka regions. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/baaz-na-aayenge-hum-mohabbat-se-%e0%a4%ac%e0%a4%be%e0%a4%9c%e0%a4%bc-%e0%a4%a8-%e0%a4%86%e0%a4%8f%e0%a4%82%e0%a4%97%e0%a5%87-%e0%a4%b9%e0%a4%ae-%e0%a4%ae%e0%a5%8b%e0%a4%b9%e0%a4%ac%e0%a5%8d%e0%a4%ac/",
    "keywords": [
      "Music",
      "Performing Arts",
      "Philosophy"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Baaz Na Aayenge Hum Mohabbat Se | बाज़ न आएंगे हम मोहब्बत से | باز نہ آئیں گے ہم محبت سے"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-18.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63449-1726081200-1726086600@bangaloreinternationalcentre.org",
    "name": "Ardha | The Incomplete Dream",
    "startDate": "2024-09-11T19:00:00+05:30",
    "endDate": "2024-09-11T20:30:00+05:30",
    "description": "Ardha – The Incomplete Dream is a solo work born out of a collection of essays contained in the book, Finding Radha by Namita Gokhale and Malashri Lal. Weaving together Bharatanatyam and spoken word, Ardha looks at Radha as the ‘adhara’ in whom the essence of Krishna is held. Beyond her oft-recognized status as Krishna’s lover and his chosen gopi, Radha is ‘Hladini Shakti’ – the potency that is half of Krishna, their spirits engaged in perpetual ‘Lila Hava’- the exchange of ornaments, attire, and souls. \nCould Radha be an illusion that, through her dhara (flow) of joy and pain in union and separation, symbolizes the yearning for something beyond, a yearning that exists in every human? What happened to Radha after Krishna left Mathura? Why is Krishna celebrated while Radha, is a mere shadow in her aradhana to him? \nCredits:  \n– Concept, Choreography, Dance, Spoken word: Vidhya Subramanian \n– Music Composition: Shreya Devnath \n– Sound track produced at Resound India and mixed and mastered by Sai Shravanam \n– Musicians: Keerthana Vaidyanathan, Shreya Devnath, Sivaprasad, Sruti Sagar, Sai Shravanam, Manonmani, Vidhya Subramanian \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/ardha/",
    "keywords": [
      "Dance",
      "Mythology",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-16.jpg"
  }
]