[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "80312-1760266800-1760272200@bangaloreinternationalcentre.org",
    "name": "Super Silly Sunday",
    "startDate": "2025-10-12T11:00:00+05:30",
    "endDate": "2025-10-12T12:30:00+05:30",
    "description": "Step into a world where just about anything can happen! \nIn this improv workshop, children will bring stories to life, play interactive games, and learn to respond creatively in the moment. Our facilitators foster a brave, playful space where mistakes become magic and shy voices grow bold. Perfect for budding actors, storytellers, or simply curious hearts ready to leap into imagination.  \nAs with every Sunday at BIC, every child will leave feeling proud, expressive, and inspired! \nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/super-silly-sunday/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Theatre",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-33-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80349-1761246000-1761251400@bangaloreinternationalcentre.org",
    "name": "अभद्र | Abhadra: Story of One, Struggles of Many",
    "startDate": "2025-10-23T19:00:00+05:30",
    "endDate": "2025-10-23T20:30:00+05:30",
    "description": "The rich traditions of Bhojpur shine in a Bharatanatyam narrative like no other! \nAbhadra, the first-ever Bharatanatyam production in the Bhojpuri language, tells a story that resonates far beyond its region. Through the elegance of classical dance, it explores the fragility of cultural heritage in the face of poverty, displacement, and migration. \nThe performance traces the journey of communities whose language, traditions, and very existence are often overlooked or challenged. At the same time, it celebrates the vibrancy, resilience, and spirit of Bhojpuri culture—its music, stories, and lived experiences. Every gesture, rhythm, and expression reflects the delicate threads that weave identity and memory. \nAbhadra invites audiences to witness the intertwining of art and life, showing how classical performance can illuminate contemporary social realities while preserving cultural richness. It is a reminder of that which can be lost and can endure, when traditions meet the challenges of modern life. \nExperience a story where heritage dances, struggles, and survives, leaving a lasting impression on both heart and mind! \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%85%e0%a4%ad%e0%a4%a6%e0%a5%8d%e0%a4%b0-abhadra-story-of-one-struggles-of-many/",
    "keywords": [
      "Culture",
      "Dance",
      "Heritage",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-35-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79979-1761157800-1761165000@bangaloreinternationalcentre.org",
    "name": "The Rasika",
    "startDate": "2025-10-22T18:30:00+05:30",
    "endDate": "2025-10-22T20:30:00+05:30",
    "description": "What do you really see when a classical dancer takes the stage? \nIs it the beauty of the movement, the rhythm of the music, or the story unfolding before your eyes? This evening invites you to look closer, to discover the richness within Indian classical dance; the traditional repertoire, the interplay of melody and rhythm, the subtle gestures that carry meaning, and the role of texts that shape interpretation. \nGuided by Dr. Sahana Das, a seasoned choreographer and researcher, the session opens up the world of classical dance in ways that both newcomers and longtime rasikas can enjoy. Adding depth and texture are dancers Kirti Ramgopal and Meghna Das, who bring their own artistry in Bharatanatyam and Odissi to the conversation. \nThrough reflection and performance, the evening gently unravels the intricacies of these timeless traditions, reminding us that dance is not just to be seen: it is to be experienced, understood, and felt! \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-rasika/",
    "keywords": [
      "Culture",
      "Dance"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_TR-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80598-1760639400-1760644800@bangaloreinternationalcentre.org",
    "name": "The Forgotten Bangalorean Soldiers",
    "startDate": "2025-10-16T18:30:00+05:30",
    "endDate": "2025-10-16T20:00:00+05:30",
    "description": "Half the troops defending Singapore in the Second World War were Indian, many of them from Bangalore and Mysore. Their wives and families waited anxiously at home, often for years with no word of their loved ones. Some of these 67,000 men joined the Japanese-backed Indian National Army to fight for India’s independence, others made daring escapes, staged double-crosses of the Japanese, or endured forced labour in Papua New Guinea where most never returned. Their families lived with silence, separation, and survival against odds, while the official memory of their sacrifices faded. This evening seeks to remember their courage and loss, and to restore their place in history through the stories of their descendants and the lens of Hazarika’s book. \nThis programme opens with the release of the book, The Forgotten Indian Prisoners of World War II, written by Gautam Hazarika, by Rear-Admiral Sampath Pillai, son of Brigadier MM Pillai, MC, of the Bombay Sappers. This will be followed by a Keynote Address from Maj General Kodendera Arjun Muthanna of the Garhwal Rifles, author, and nephew of General Kodandera S. Thimayya of the Indian Army and Major Kodandera P Thimayya of the INA. An Author Conversation with Gautam, led by Varun Khanna, will then explore the research and hidden histories that shaped this narrative. \nThe evening culminates by bringing together voices from the families whose lives were shaped by these events. Air Marshal Balatikalndra Uthaiah Chengappa, son of Jemadar Uthaiah of the 1st Mysore Infantry; Maheswari Chinnaswamy, daughter of Sapper Marimuthu of the Madras Sappers; and Aliyeh Rizvi, granddaughter of Major Mir Hussain Sarfaraz of the 1st Mysore Infantry, will share their memories and legacies. Together, these stories offer an intimate and moving view into a chapter of history that remains largely unacknowledged, yet continues to echo across generations. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-forgotten-bangalorean-soldiers/",
    "keywords": [
      "Bangalore",
      "Books",
      "History",
      "Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-34-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "80154-1760268600-1760274000@bangaloreinternationalcentre.org",
    "name": "Samyoga – Khayal Se Kriti Tak",
    "startDate": "2025-10-12T11:30:00+05:30",
    "endDate": "2025-10-12T13:00:00+05:30",
    "description": "Shared roots, divergent paths: listen as tradition and expression entwine! \nSamyoga brings together Hindustani and Carnatic music in a rare exploration of sound, emotion, and tradition. Conceptualised and presented by Dr. Radhika Joshi (Hindustani Vocal) and Manasi Prasad (Carnatic Vocal), the performance celebrates both the shared ancestry and the distinctive aesthetics of these classical systems. \nTraversing genres from the gravitas of classical forms to the devotion of Bhakti Sangeet and the lyrical beauty of Thumri and Jawali, each piece highlights how the two traditions converse, diverge, and find harmony. Beyond their mastery as performers, Radhika and Manasi are accomplished researchers, bringing deep theoretical understanding and insight into the evolution, structure, and nuances of Indian music. Through a seamless blend of narration and performance, Samyoga transforms listening into discovery, revealing connections and contrasts that are rarely experienced together. \nA morning of sound, story, and subtle interplay, offering a unique chance to see these two traditions in dialogue. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/samyoga-khayal-se-kriti-tak/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Samyoga – Khayal Se Kriti Tak"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_S-KSK.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "80339-1761332400-1761336900@bangaloreinternationalcentre.org",
    "name": "RumuRumuRumu..! | ರುಮುರುಮುರುಮು..!",
    "startDate": "2025-10-24T19:00:00+05:30",
    "endDate": "2025-10-24T20:15:00+05:30",
    "description": "The play is conceptualised along with actors from Bevinahalli-Sira who play the arai and Shahaney. They use the many stories they have grown up with and have experienced themselves in the play.\n\nThe instruments carry with them many stories of divinity and identities that are not allowed to cross the threshold. Where does the divinity end and where does caste begin?\n\nDirection by Shradha Raj with support from Jangama Collective and PCPA\n\n\nಶಿರಾ ಸೀಮೆಯ ‘ಬೇವಿನಹಳ್ಳಿ’ಯ ಅಪ್ರತಿಮ ಅರೆ ಮತ್ತು ನಾದಸ್ವರದ ಕಲಾವಿದರು ತಮ್ಮ ಕಲೆ ಮತ್ತು ಬದುಕಿನ ಅನುಭವಗಳನ್ನು ಬೆಸೆದುಕೊಂಡು ಕಟ್ಟಿರುವ ವಿಶೇಷ ಪ್ರಯೋಗ. ಹೊಸ ತಲೆಮಾರಿನ ಅನನ್ಯ ನಟಿ, ಬರಹಗಾರ್ತಿ, ಸಿನಿಮಾ ನಿರ್ದೇಶಕಿ ‘ಶ್ರದ್ದಾ ರಾಜ್’ ಅವರು ತಿಂಗಳ ಕಾಲ ಬೇವಿನಹಳ್ಳಿಯಲ್ಲಿ ಇದ್ದು ವಿಭಿನ್ನ ಪ್ರಕ್ರಿಯೆಯಲ್ಲಿ ಈ  ನಾಟಕವನ್ನು ಕಟ್ಟಿದ್ದಾರೆ.\n\nತಳ ಸಮುದಾಯಗಳ ಕಲೆ ಮತ್ತು ಕಲಾವಿದರ ಜೊತೆಗಿನ ಒಡನಾಟವನ್ನು ಒಂದು ಸಾಂಸ್ಕೃತಿಕ ಚಳುವಿಯೆಂದು ಭಾವಿಸಿ ಜಂಗಮ ತಂಡ ಹಿಂದೆ ‘ಕೇರಿ -ಹಾಡು’ ಪ್ರಯೋಗವನ್ನು ಮಾಡಿತ್ತು. ಚಂದ್ರಶೇಕರ್ ಅವರು ದಿಂಡಗೂರಿನ ‘ಸಾವಿತ್ರಿ ಬಾಫುಲೆ ಮಹಿಳಾ ಸ್ವಸಹಾಯ ತಂಡ’ಕ್ಕೆಅದನ್ನು ನಿರ್ದೇಶಿಸಿದ್ದರು. ಪ್ರಸ್ತುತ ಅರೆಯ ನಾದ ಮತ್ತು ಬದುಕಿನ ‘ ರುಮುರುಮುರುಮು’ ಜಂಗಮ ಭಾವಿಸುವ ಸಾಂಸ್ಕೃತಿಕ ಚಳುವಳಿಯ ಮುಂದುವರಿಕೆ. ಬೇವಿನಹಳ್ಳಿಯ ‘ ಜಿಗುರು ‘ ತಂಡ.\n\n\nIn collaboration with:\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/rumurumurumu-%e0%b2%b0%e0%b3%81%e0%b2%ae%e0%b3%81%e0%b2%b0%e0%b3%81%e0%b2%ae%e0%b3%81%e0%b2%b0%e0%b3%81%e0%b2%ae%e0%b3%81/",
    "keywords": [
      "Culture",
      "Heritage",
      "Music",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "RumuRumuRumu..! | ರುಮುರುಮುರುಮು..!"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_RRR.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80138-1760554800-1760559300@bangaloreinternationalcentre.org",
    "name": "Murta Maheswara",
    "startDate": "2025-10-15T19:00:00+05:30",
    "endDate": "2025-10-15T20:15:00+05:30",
    "description": "How many faces can a god wear, and how many can we see within ourselves? \nMurta Maheswara is an exploration of Lord Shiva beyond myth and ritual, a journey through the shifting facets of a god who embodies creation and dissolution, stillness and motion, silence and sound. In this performance, Shiva emerges not as an abstract deity, but as a living force: carefree, truthful, and boundless, mirroring the many layers of our own being. \nThrough three deeply symbolic themes, the performance reveals Shiva’s essence:\nPashupati, the ancient lord of all creatures, seen in the Harappan seals surrounded by trusting animals, both fierce and tender.\nShiva–Shakti, the eternal union of energy and awareness, where creation and destruction entwine in cosmic rhythm.\nDhwani–Pratidhwani, the origin and echo of sound itself, born from the beat of Shiva’s damaru and reverberating through the universe. \nIn tracing these facets, Murta Maheswara becomes a meditation on divinity, inviting us to listen, to feel, and perhaps even to find Shiva within ourselves. \nSupported by; \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/murta-maheswara/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-942.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "80121-1761850800-1761856200@bangaloreinternationalcentre.org",
    "name": "Travellers",
    "startDate": "2025-10-30T19:00:00+05:30",
    "endDate": "2025-10-30T20:30:00+05:30",
    "description": "What happens when sound stretches across time, memory, and place? \nAward-winning sarod musician and composer Soumik Datta breathes life into Travellers: a sonic journey that blends the evocative voice of the sarod with ambient soundscapes, spoken word, and Indian classical roots. Layered with field recordings and immersive textures, the performance moves fluidly between moments of stillness and pulse, carrying audiences across the invisible borders that divide lands, people, and memories. Each note unfolds a story, inviting reflection, connection, and wonder. \nPart of Soumik’s Melodies in Slow Motion Tour, the performance reaches concert halls, homes, heritage sites, and schools, touching communities often unheard, and reminding us how music bridges distance and difference. \nAn evening of sound that offers a rare chance to experience music in its fullest depth. \nTravellers is coproduced by Soumik Datta Arts, G5A In Residence & Arts Council England \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/travellers/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Travellers"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-32-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80330-1760812200-1760817600@bangaloreinternationalcentre.org",
    "name": "Interrogating the Constitution",
    "startDate": "2025-10-18T18:30:00+05:30",
    "endDate": "2025-10-18T20:00:00+05:30",
    "description": " The Constitution promises freedom, but really,  how free are we under its design? \nIn 2025, India’s Constitution turned seventy-five: a remarkable testament to endurance and adaptability. Yet, beneath its promise of liberty lies a constant negotiation of power. Gautam Bhatia examines the Constitution not just as a legal document, but as a dynamic terrain where visions of authority clash, intersect, and contend for supremacy. \nCentral to this story is the drift toward centralisation: power increasingly concentrated in the union executive. While certain elements of this concentration are embedded in the Constitution’s design, landmark Supreme Court judgments have, at key moments, accelerated the trend. This talk explores how these structures shape, channel, and sometimes constrain the possibilities for emancipation. \nThrough a careful reading of the Constitution’s text, history, and interpretations, Bhatia sheds light on the subtle (and often contested) mechanisms that govern India’s democracy. \nA Q&A will follow, giving audiences a chance to engage with these questions of power, freedom, and the ongoing relevance of India’s constitutional experiment. \nThe Vijay Nambisan Trust:\nThe Vijay Nambisan Trust was formed to perpetuate the cause of Humanities in its many spheres. The Vijay Memorial Lecture to be held every year is the first event to be sponsored by the Trust in partnership with the Bangalore International Centre. \nAbout Vijay Nambisan:\nOne of the best poet-writers of his generation, Vijay Nambisan is known as much for his poetry and prose, as he is for his reclusiveness. He dropped out of IIT Madras in his fourth year of engineering to pursue his love for the written word. He won the first All India British Council Poetry Prize in 1988, worked for a number of years in the literary section of The Hindu and published collections of poetry and prose in his inimitable style. He was married to surgeon and novelist, Kavery Nambisan. \n",
    "url": "https://bangaloreinternationalcentre.org/event/interrogating-the-constitution/",
    "keywords": [
      "In Memory",
      "Law"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_ItC.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80230-1760639400-1760647500@bangaloreinternationalcentre.org",
    "name": "Navalny",
    "startDate": "2025-10-16T18:30:00+05:30",
    "endDate": "2025-10-16T20:45:00+05:30",
    "description": "98 minutes | English, Russian and German | 2022 \nEnthralling and intimate, the Oscar-winning documentary Navalny, directed by Daniel Roher, unfolds with the pace of a thriller as it follows Russian opposition leader Alexey Navalny in his quest to identify the men who poisoned him in August 2020. Shot in Germany as the story unfolded, the film offers extraordinary access to the investigation while also portraying Navalny the man—a reformist leader who refuses to be cowed, even by an assassination attempt. \nThe documentary takes viewers inside the meticulous investigation into the shocking poisoning, revealing who was behind it. Navalny’s years-long campaign against corruption among Russia’s elites has earned him powerful enemies, particularly Vladimir Putin, who pointedly refuses to utter his name in public. In August 2020, Navalny was poisoned with a military-grade nerve agent in an elaborate attempt on his life. Despite official denials, independent investigations by Bellingcat, CNN, and others later linked the attack to the Kremlin. \nThe film Navalny is produced by Odessa Rae (RaeFilm Studios), Diane Becker and Melanie Miller (Fishbowl Films), Shane Boris (Cottage M), and Amy Entelis and Courtney Sexton (CNN Films), with Maria Pevchikh as executive producer. \nFollowing the screening, a discussion between Aakar Patel and Swati Dandekar will take place, followed by an audience Q&A. \nPlease note: Director Daniel Roher will not be present. \nViewer discretion: Children under 17 are restricted from viewing the film unless accompanied by an adult. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/navalny/",
    "keywords": [
      "Film",
      "Politics",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-941.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80491-1760725800-1760731200@bangaloreinternationalcentre.org",
    "name": "Antarctica: A Journey in Photographs",
    "startDate": "2025-10-17T18:30:00+05:30",
    "endDate": "2025-10-17T20:00:00+05:30",
    "description": "Step into one of the most remote and pristine places on Earth, without leaving Bangalore. In this immersive session, traveller, photographer, and storyteller Raksha Nagaraj takes you on an unforgettable journey to Antarctica through striking photographs and firsthand narratives of her expedition to the White Continent. \nThe talk reveals Antarctica’s awe-inspiring landscapes, towering icebergs, endless oceans, and surreal stretches of ice that few have ever seen. But it goes beyond scenery. Raksha’s photographs capture extraordinary encounters with wildlife: playful penguins, curious seals, and majestic whales, each image paired with stories that bring their behaviour to life in this extreme environment. \nAdding a scientific dimension, Raksha shares her experience participating in a Citizen Science program, where travellers assisted researchers by collecting plankton samples, studying fjord freshwater impact on seawater, and recording data critical to understanding climate change. These efforts highlight how exploration can meaningfully contribute to global research. Part personal narrative, part visual adventure, this session blends exploration, adventure, science, and storytelling. It reflects the wonder of standing at the edge of the world and the urgency of protecting such fragile ecosystems in a rapidly changing climate. \nJoin us for an evening of discovery, photography, and conversation, and see Antarctica as few have ever experienced it. Irrespective of whether you are an adventurer, nature enthusiast, or simply want to know about this beautiful white continent, this journey promises to inspire and perhaps spark dreams of your own voyage to Antarctica. \n",
    "url": "https://bangaloreinternationalcentre.org/event/antarctica-a-journey-in-photographs/",
    "keywords": [
      "Environment",
      "Photography",
      "Visual Arts",
      "Wildlife"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-Ant.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80099-1761476400-1761481800@bangaloreinternationalcentre.org",
    "name": "India’s Development Odyssey",
    "startDate": "2025-10-26T11:00:00+05:30",
    "endDate": "2025-10-26T12:30:00+05:30",
    "description": "What happens when one-sixth of the world’s population attempts the world’s most complex development experiment? \nCo-authored by renowned political scientist Devesh Kapur and former Chief Economic Adviser Arvind Subramanian, the book unpacks the country’s unique development model—an unprecedented blend of democracy, socialism, and liberalization—and explores how this singular trajectory continues to reshape global geopolitics and economics. An ambitious rethinking of how India, representing one-sixth of the world’s population, has taken a uniquely ‘precocious’ path to development. \nA Sixth of Humanity offers a comprehensive exploration of India’s extraordinary journey of nation-building and economic transformation since independence \nThe discussion will be followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/indias-development-odyssey/",
    "keywords": [
      "Books",
      "Development",
      "Economics",
      "History"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_IDO.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80781-1762068600-1762115400@bangaloreinternationalcentre.org",
    "name": "Krishna to Kaveri | ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ",
    "startDate": "2025-11-02T07:30:00+05:30",
    "endDate": "2025-11-02T20:30:00+05:30",
    "description": "Winding and binding, Karnataka’s great rivers have always been more than glorious waterways. From Krishna to Kaveri, our rivers are carriers of culture, stories, and transformation. As they flow across varied landscapes, they shape and are shaped by the people, traditions, and communities they touch. \nKrishna to Kaveri is a two-day celebration that draws from this natural rhythm, exploring how Karnataka’s cultural life is constantly moving, adapting, and renewing itself. From classical roots to contemporary reinterpretations, this festival offers a vibrant weekend that speaks to a new generation. Expect immersive workshops, indulgent cuisines and impactful performances!  \nWhether you’re a native Kannadiga or recently moved into Bangalore, this festival is for anyone who wants to connect more deeply with the cultural spirit of the region. Not as outsiders looking in, but as participants in a living, flowing cultural journey. \nLet the rivers lead. Let culture move. Let Karnataka unfold. \nಬಳಸುತ್ತಾ ಬೆಸೆಯುತ್ತಾ ಬೆಳೆಸುತ್ತಾ ಸಾಗುವ ಕರ್ನಾಟಕದ ನದಿಗಳು ವೈಭವದ ಜಲಹರಿವುಗಳು ಮಾತ್ರವಲ್ಲ. ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ ವ್ಯಾಪಿಸಿರುವ ನದಿಗಳು ಸಂಸ್ಖೃತಿಯ, ಕಥೆ-ಪುರಾಣಗಳ, ಪರಿವರ್ತನೆಯ ಚಲನಶೀಲ ವಾಹಕಗಳಾಗಿವೆ. ವೈವಿಧ್ಯಮಯ ಸುಂದರ ಭೂಪ್ರದೇಶಗಳ ನಡುವೆ ಮುನ್ನಡೆವ ಈ ನದಿಗಳು ಜನರನ್ನು, ಪರಂಪರೆಗಳನ್ನು, ಸಮುದಾಯಗಳನ್ನು ರೂಪಿಸುತ್ತಾ, ಪರ್ಯಾಯವಾಗಿ ರೂಪುಗೊಳ್ಳುತ್ತಾ ಸಾಗಿವೆ. \n ಈ ಸ್ವಾಭಾವಿಕ ಹರಿವಿನ ಲಯದಿಂದ ಹೊಮ್ಮಿರುವ ಎರಡು ದಿನಗಳ ಉತ್ಸವವೆ ‘ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ ʼ. ಕರ್ನಾಟಕದ ಸಾಂಸ್ಕೃತಿಕ ಬದುಕಿನ ನಿರಂತರ ಚಲನೆಯ, ಹೊಂದಾಣಿಕೆಯ, ಪುನಶ್ಚೇತನದ ಶೋಧನೆ. ಈ ಉತ್ಸವವು ಅಭಿಜಾತ ಬೇರುಗಳಿಂದ ವರ್ತಮಾನದ ಮರುವ್ಯಾಖ್ಯಾನಗಳವರೆಗೆ ಹುರುಪಿನ ವಾರಾಂತ್ಯದಲ್ಲಿ ಹೊಸಪೀಳಿಗೆಗೆ ಒಳನೋಟಗಳನ್ನು ಒದಗಿಸಲಿದೆ. ತಲ್ಲೀನಗೊಳಿಸುವ ಕಾರ್ಯಾಗಾರಗಳು, ರುಚಿಕರ ಆಹಾರ, ಆಕರ್ಷಕ ಸಾಂಸ್ಕೃತಿಕ ಕಾರ್ಯಕ್ರಮಗಳನ್ನು ಈ ಹಬ್ಬದಲ್ಲಿ ನಿರೀಕ್ಷಿಸಬಹುದು. \nನೀವು ಮೂಲ ಕನ್ನಡಿಗರಾಗಿರಿ ಅಥವಾ ಇತ್ತೀಚೆಗಷ್ಟೆ ಹೊರಗಿನಿಂದ ಬೆಂಗಳೂರಿಗೆ ಬಂದಿರುವವರೇ ಆಗಿರಿ. ಈ ನೆಲದ ಸಾಂಸ್ಕೃತಿಕ ಚೇತನದೊಂದಿಗೆ ಆಳವಾಗಿ ಬೆರೆಯುವ ಅವಕಾಶವನ್ನು ಈ ಹಬ್ಬ ನಿಮಗೆ ಒದಗಿಸುತ್ತದೆ. ಇಲ್ಲಿನ ಕಾರ್ಯಕ್ರಮಗಳನ್ನು ನೀವು ಹೊರಗಿನವರಾಗಿ ನಿಂತು ನೋಡುವ ಪ್ರೇಕ್ಷಕರಾಗದೆ ಒಂದು ಜೀವಂತ, ಸಾಂಸ್ಕೃತಿಕ ಯಾನದ ಭಾಗವಾಗಲು ಬನ್ನಿರಿ. \nಮುನ್ನಡೆಸಲಿ ನದಿಗಳು. ಪ್ರವಹಿಸಲಿ ಸಂಸ್ಕೃತಿ. ಗೋಚರವಾಗಲಿ ಕರ್ನಾಟಕದ ಸಿರಿ ವೈಭವ! \nDay 2 Schedule: \n7:30 AM – 9:00 AM: Yoga in Karnataka\nYoga Practice and History with Medha Bhaskar | Terrace \n10:00 AM – 11:30 AM: Songs from the Banks of Krishna and Kaveri\nA Concert with Chandana Bala Kalyan | Amphitheatre \n11:00 AM – 12:30 PM: Children’s Storytelling Session\nLibrary \n11:30 PM – 1:00 PM: 50 Years of Sandalwood\nKannada Cinema with SN Sreenivasa Murthy | Auditorium \n2:00 PM – 3:30 PM: Kannada Calligraphy\nLettering Workshop with Manjunath of Akshara Type Studio | Boardroom \n4:00 PM – 5:30 PM: Bhavageethe\nClassical Music Concert with Supriya Raghunandan | Auditorium \n4:00 PM – 5:30 PM: Chittara Folk Art for Kids\nChildren’s Workshop with Geetha Bhat | Library \n5:00 PM – 6:30 PM: Kannada Calligraphy\nLettering Workshop with Manjunath of Akshara Type Studio | Boardroom \n5:30 PM – 7:00 PM: History of Kannada Theatre\nHall 1 \n7:00 PM – 8:30 PM: Vasu Dixit Collective\nAuditorium \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/k2k25-day-2/",
    "keywords": [
      "Bangalore",
      "Books",
      "Culture",
      "Food",
      "Heritage",
      "Krishna to Kaveri",
      "Language",
      "Literature",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-day-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80324-1761476400-1761481800@bangaloreinternationalcentre.org",
    "name": "Drawn to Doodle",
    "startDate": "2025-10-26T11:00:00+05:30",
    "endDate": "2025-10-26T12:30:00+05:30",
    "description": "Tired of rescuing your walls from your little artist? This one’s for you!  \nSCRIBBLE is a playful celebration of messy creativity and fearless imagination! Inspired by the book of the same name, this hands-on session invites kids (and their grown-ups!) to splash colours, draw freely, and turn everyday spaces into canvases of imagination. It’s messy, marvellous, and full of laughter. Every line tells a story and every squiggle becomes art. \nLet loose this Sunday: no erasers, no rules, just pure joy! \nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/drawn-to-doodle/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Books",
      "Children's Books"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-37-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80318-1760871600-1760877000@bangaloreinternationalcentre.org",
    "name": "Will Lakshmi Find Her Pakshi?",
    "startDate": "2025-10-19T11:00:00+05:30",
    "endDate": "2025-10-19T12:30:00+05:30",
    "description": "Lakshmi the calf is looking for her perfect bird friend—but will any of them stay?  \nJoin us for a delightful reading of Lakshmi’s Little Bird, Sharanya Kunnath’s beautifully hand-painted picture book. Children will giggle, moo, and join Lakshmi on her sweet adventure of friendship and patience. After the story, make and decorate your very own postcard for a special friend—ready to be mailed with love! \nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/will-lakshmi-find-her-pakshi/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Books",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_WLFHP.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "80558-1761418800-1761424200@bangaloreinternationalcentre.org",
    "name": "Melodies of the Kaveri",
    "startDate": "2025-10-25T19:00:00+05:30",
    "endDate": "2025-10-25T20:30:00+05:30",
    "description": "The land nourished by the river is rich not only in greenery but also in song. Melodies of the Kaveri takes us on a musical journey along this ancient river, exploring the sacred Kshetras on its banks through the works of composers who found inspiration in its flow. \nFrom the evocative kritis of Sri Tyagaraja and Sri Muthuswami Dikshitar, to the soulful outpourings of the Haridasas such as Sripadaraya and Sri Kanakadasa, and the contributions of Tamil poets and composers, the performance brings together a vibrant tapestry of voices. Through their music, we trace the river’s path as both a physical and spiritual source of life, devotion, and creativity. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/melodies-of-the-kaveri/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Melodies of the Kaveri"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_MOTK.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "80772-1761991200-1762030800@bangaloreinternationalcentre.org",
    "name": "Krishna to Kaveri | ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ",
    "startDate": "2025-11-01T10:00:00+05:30",
    "endDate": "2025-11-01T21:00:00+05:30",
    "description": "Winding and binding, Karnataka’s great rivers have always been more than glorious waterways. From Krishna to Kaveri, our rivers are carriers of culture, stories, and transformation. As they flow across varied landscapes, they shape and are shaped by the people, traditions, and communities they touch. \nKrishna to Kaveri is a two-day celebration that draws from this natural rhythm, exploring how Karnataka’s cultural life is constantly moving, adapting, and renewing itself. From classical roots to contemporary reinterpretations, this festival offers a vibrant weekend that speaks to a new generation. Expect immersive workshops, indulgent cuisines and impactful performances!  \nWhether you’re a native Kannadiga or recently moved into Bangalore, this festival is for anyone who wants to connect more deeply with the cultural spirit of the region. Not as outsiders looking in, but as participants in a living, flowing cultural journey. \nLet the rivers lead. Let culture move. Let Karnataka unfold. \nಬಳಸುತ್ತಾ ಬೆಸೆಯುತ್ತಾ ಬೆಳೆಸುತ್ತಾ ಸಾಗುವ ಕರ್ನಾಟಕದ ನದಿಗಳು ವೈಭವದ ಜಲಹರಿವುಗಳು ಮಾತ್ರವಲ್ಲ. ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ ವ್ಯಾಪಿಸಿರುವ ನದಿಗಳು ಸಂಸ್ಖೃತಿಯ, ಕಥೆ-ಪುರಾಣಗಳ, ಪರಿವರ್ತನೆಯ ಚಲನಶೀಲ ವಾಹಕಗಳಾಗಿವೆ. ವೈವಿಧ್ಯಮಯ ಸುಂದರ ಭೂಪ್ರದೇಶಗಳ ನಡುವೆ ಮುನ್ನಡೆವ ಈ ನದಿಗಳು ಜನರನ್ನು, ಪರಂಪರೆಗಳನ್ನು, ಸಮುದಾಯಗಳನ್ನು ರೂಪಿಸುತ್ತಾ, ಪರ್ಯಾಯವಾಗಿ ರೂಪುಗೊಳ್ಳುತ್ತಾ ಸಾಗಿವೆ. \n ಈ ಸ್ವಾಭಾವಿಕ ಹರಿವಿನ ಲಯದಿಂದ ಹೊಮ್ಮಿರುವ ಎರಡು ದಿನಗಳ ಉತ್ಸವವೆ ‘ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ ʼ. ಕರ್ನಾಟಕದ ಸಾಂಸ್ಕೃತಿಕ ಬದುಕಿನ ನಿರಂತರ ಚಲನೆಯ, ಹೊಂದಾಣಿಕೆಯ, ಪುನಶ್ಚೇತನದ ಶೋಧನೆ. ಈ ಉತ್ಸವವು ಅಭಿಜಾತ ಬೇರುಗಳಿಂದ ವರ್ತಮಾನದ ಮರುವ್ಯಾಖ್ಯಾನಗಳವರೆಗೆ ಹುರುಪಿನ ವಾರಾಂತ್ಯದಲ್ಲಿ ಹೊಸಪೀಳಿಗೆಗೆ ಒಳನೋಟಗಳನ್ನು ಒದಗಿಸಲಿದೆ. ತಲ್ಲೀನಗೊಳಿಸುವ ಕಾರ್ಯಾಗಾರಗಳು, ರುಚಿಕರ ಆಹಾರ, ಆಕರ್ಷಕ ಸಾಂಸ್ಕೃತಿಕ ಕಾರ್ಯಕ್ರಮಗಳನ್ನು ಈ ಹಬ್ಬದಲ್ಲಿ ನಿರೀಕ್ಷಿಸಬಹುದು. \nನೀವು ಮೂಲ ಕನ್ನಡಿಗರಾಗಿರಿ ಅಥವಾ ಇತ್ತೀಚೆಗಷ್ಟೆ ಹೊರಗಿನಿಂದ ಬೆಂಗಳೂರಿಗೆ ಬಂದಿರುವವರೇ ಆಗಿರಿ. ಈ ನೆಲದ ಸಾಂಸ್ಕೃತಿಕ ಚೇತನದೊಂದಿಗೆ ಆಳವಾಗಿ ಬೆರೆಯುವ ಅವಕಾಶವನ್ನು ಈ ಹಬ್ಬ ನಿಮಗೆ ಒದಗಿಸುತ್ತದೆ. ಇಲ್ಲಿನ ಕಾರ್ಯಕ್ರಮಗಳನ್ನು ನೀವು ಹೊರಗಿನವರಾಗಿ ನಿಂತು ನೋಡುವ ಪ್ರೇಕ್ಷಕರಾಗದೆ ಒಂದು ಜೀವಂತ, ಸಾಂಸ್ಕೃತಿಕ ಯಾನದ ಭಾಗವಾಗಲು ಬನ್ನಿರಿ. \nಮುನ್ನಡೆಸಲಿ ನದಿಗಳು. ಪ್ರವಹಿಸಲಿ ಸಂಸ್ಕೃತಿ. ಗೋಚರವಾಗಲಿ ಕರ್ನಾಟಕದ ಸಿರಿ ವೈಭವ! \nDay 1 Schedule: \n10:00 AM – 10:50 AM: Inauguration\nPooja Kunitha, Somana Kunitha, Flag Hoisting & the State Anthem | Ground Floor Foyer \n11:00 AM – 12:30 PM: Hindustani Classical Concert\nVinayak Torvi | Auditorium \n11:00 AM – 12:30 PM: The Great Story Hunt\nChildren’s Storytelling with Seema Karanth | Library \n1:30 PM – 2:30 PM: Kannada 101\nLearn Basics with Kannada Gottilla | Boardroom \n2:00 PM – 3:30 PM: Quiz\nKarnataka Quiz with Thejaswi Udupa | Hall 1 \n3:00 PM – 4:00 PM: Magic Show\nChildren’s Magic Show with Nakul Shenoy & Friends | Library \n3:00 PM – 4:30 PM: Kannada 101\nLearn Basics with Kannada Gottilla | Boardroom \n4:00 PM – 5:30 PM: Songs of the People\nLearn Kannada Folk Songs with Shilpa Mudbi | Amphitheatre \n5:30 PM – 6:30 PM: Prathibimba\nA Multi-Medium Tribute to Jnanpith Laureate Da. Ra. Bendre with Pratibha Ramaswamy and Janani Murali | Auditorium \n7:30 PM – 9:00 PM: 100 Years of Grooving!\nA Century of Music, Inspiration, and Innovation in Bangalore | Auditorium \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/k2k25-day-1/",
    "keywords": [
      "Bangalore",
      "Books",
      "Culture",
      "Film",
      "Food",
      "Krishna to Kaveri",
      "Language",
      "Performing Arts",
      "Society",
      "Visual Arts",
      "Workshops",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-day-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79949-1760293800-1760299200@bangaloreinternationalcentre.org",
    "name": "Sovereigns of the Sea: Omani Ambition in the Age of Empire",
    "startDate": "2025-10-12T18:30:00+05:30",
    "endDate": "2025-10-12T20:00:00+05:30",
    "description": "Who truly ruled the Indian Ocean in the age of Empire? \nBased on the book Sovereigns of the Sea: Omani Ambition in the Age of Empire, this talk reimagines the Indian Ocean: not as a passive backdrop to European expansion, but rather as a dynamic political arena where Asian and Western imperial aspirations collided and converged through the long nineteenth century. \nShifting the focus from European powers to the Omani Sultans, it challenges the notion of the Ocean as an uncontested British lake. The Sultans of Oman emerge as astute players who navigated the ambitions of Europeans seeking slaves, cloves, and ivory, while staying rooted in their own cultural world. They built strategic alliances with Indian financiers and merchants, asserting their vision of sovereignty and empire. \nForegrounding these often-overlooked Asian imperial ambitions, the talk opens new ways of thinking about power, politics, and connection across the Indian Ocean—and redefines how global history is written. \nAbout Prof. Satish Chandra \nProf. Satish Chandra (1922–2017) was one of India’s foremost historians and a towering authority on Medieval Indian history. Over a distinguished four-decade career, he taught at leading universities across the country such as Allahabad University, Aligarh Muslim University, Delhi University, Rajasthan University, and finally the Jawaharlal Nehru University (JNU). He co-founded the Centre for Historical Studies at JNU with S. Gopal, Bipin Chandra, and Romila Thapar. As Chairman of the University Grants Commission, he helped shape academic life in India. Deeply committed to intellectual exchange, he also co-founded the Society for Indian Ocean Studies in 1985. A thoughtful historian taking a Marxist approach to the field, Prof. Chandra’s work bridged eras and ideas, leaving an enduring mark on the study of India’s past. \n",
    "url": "https://bangaloreinternationalcentre.org/event/sovereigns-of-the-sea-omani-ambition-in-the-age-of-empire/",
    "keywords": [
      "History",
      "In Memory",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-2-7.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "80405-1760468400-1760473800@bangaloreinternationalcentre.org",
    "name": "Kutiyattam Balivadham",
    "startDate": "2025-10-14T19:00:00+05:30",
    "endDate": "2025-10-14T20:30:00+05:30",
    "description": "When the curtain is removed we see Sugreeva sitting in a mood of deep sorrow and dejection. Sugreeva expresses through hand gestures and facial expression his agonies and his hardships on living alone in a solitary wood. \nSugreeva, for fear of his elder brother Bali, has taken refuge in the Malyavan Mountain. Hounded out of his palace, Sugreeva bemoans his sad lot, living alone in the forest facing the rigours of nature. He sees around him in the forest, a reflection of his own mental state. “My good God, will my miseries never end? Exposed to the sun, drenched by the rains, shivering in the cold and open to the winds, I live in the forest. Would I ever see a normal comfortable life? He decides to take a leaf and tried to go deep into the issue. First he sees that there is no Friend but there is foe. At that time, he sees a deer running away frightened hearing a hunter’s bow. On taking shelter in a cave, it is frightened to see a lion in it. When he takes up the leaf and looks a second time, he sees Friend and foe. In another angle, he sees a snake hiding in a hole fearing Garuda flying in the sky. Then, Hanuman comes and allies with him. Looking a third time, he sees that he has Friend but there is no foe. In a direction, a peacock dances seeing the dark clouds and a forest fire starts. Later he sees that it rains and the fire ends. Then, seeing Rama and Lakshmana on the banks of the river Pamba, he asks Hanuman, Please go and find the truth behind it and kindly bring them here and make them join hands with me. Sugreeva sees Hanuman returning with Rama & Lakshmana .Here, with the fire as witness, the scene of Sugreeva making friends with Rama is acted out. Together with Rama, Lakshmana, and Hanuman, Sugreeva returns to Kishkindha and boldly challenges Bali to battle \nOn the Stage:\nSugreeva: Nepathya Sreehari Chakyar\nMizhavu: Kalamandalam Manikandan, Nepathya Jiensh\nEdakka: Kalanilayam Rajan\nThalam: Dr. Indu G.\nMake-up: Kalamandalam Satheesan\nTroupe: Nepathya, Moozhikkulam \nThis is the seventh edition of the ‘All For Dance’ series presented by Kalavaahini in association with BIC curated by Malavika Sarukkai. The ‘All For Dance’ series is presented every quarter at BIC to spotlight some of the best of classical dance from across India. The event is managed by Shreya Nagarajan Singh Arts Development Consultancy. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/kutiyattam-balivadham/",
    "keywords": [
      "Culture",
      "Dance",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Kutiyattam Balivadham"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-KB.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80257-1760266800-1760272200@bangaloreinternationalcentre.org",
    "name": "Planet of the Apps",
    "startDate": "2025-10-12T11:00:00+05:30",
    "endDate": "2025-10-12T12:30:00+05:30",
    "description": "A cab in five minutes. Groceries in ten. Biryani in twenty.  \nWho really powers your fast, effortless digital life?\n\nOTP Please! (Penguin Random House) uncovers the hidden human stories behind South Asia’s booming app economy. Vandana Vasudevan takes readers into the lives of gig workers racing against the clock, small sellers navigating the algorithm, and the restless customers who keep tapping ‘Order Now.’ From India’s hyperlocal delivery boys to Pakistan’s ride-hail drivers, Nepal’s app startups to Bangladesh’s e-marketplace sellers, the book reveals the invisible ecosystem that fuels our digital ease – and the costs it quietly extracts. \nVandana will be in conversation with Mekin Maheshwari, serial entrepreneur, early Flipkart leader, and Founder & CEO of Udhyam Learning Foundation, exploring the realities, challenges, and humanity behind the apps we use every day. \nAn insightful morning unpacking the human side of technology, offering perspectives that linger long after the screen goes dark. \n",
    "url": "https://bangaloreinternationalcentre.org/event/planet-of-the-apps/",
    "keywords": [
      "Books",
      "Business",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-3-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "80610-1760871600-1760900400@bangaloreinternationalcentre.org",
    "name": "Screening the Mind",
    "startDate": "2025-10-19T11:00:00+05:30",
    "endDate": "2025-10-19T19:00:00+05:30",
    "description": "Cinema has immense power to shape societal narratives around mental health, meaningful, accurate portrayals are not yet mainstream. Last year at Manotsava 2024, a panel discussion explored how Indian cinema is beginning to move beyond stereotypes, shifting from sensationalism to more empathetic, everyday depictions that normalize therapy, emotional vulnerability, and recovery. Meaningful, intentional representation on the silver screen can encourage open conversations, challenge stigma, reshape public perception, and become a force for social change. \nAs a lead-up to the next edition of Manotsava – RNP, NIMHANS & NCBS are putting together a film showcase that will explore mental health through contemporary Indian cinema, offering audiences a view into diverse psychological experiences and societal perspectives.  \nThe screening will feature 6 films including Shonali Bose’s Margarita with a Straw, which sensitively portrays disability and sexuality and Amol Palekar’s Dhoosar,exploring Alzheimer’s and caregiving. \nFestival Schedule: \n11:00 am – 11:20 am: Khidki\n16 mins | Hindi with English subtitles | Director: Anhad Mishra\nKhidki tells the moving story of an elderly man whose closest bond is with the world outside his window. Alone in a city that has left him behind, he finds comfort in its everyday rhythms. But when he must leave the home—and the view—that has sustained him for years, he confronts a devastating question: can he survive without the only thing keeping him alive? \n11:20 am – 1:00 pm: Dhoosar\n1 hr 40 min | Marathi with English subtitles | Director: Amol Palekar\nDhoosar traces the emotional journey of a daughter who returns home to find her mother battling Alzheimer’s. As the illness reshapes memory and identity, it also transforms the bonds of family, revealing the quiet struggles and shifting realities of those left to cope. \n2:30 pm – 2:50 pm: Invisible Chains\n18 min | Kannada with English subtitles | Director: Maya Chandra\nInvisible Chains is a documentary under the “Drug-Free Karnataka” (Nashe Mukta Karnataka) campaign—an initiative by the Karnataka State Police with MAYA Films and Manipal Foundation. Through first-person accounts, it portrays the impact of substance use on mental, physical, and emotional health. With insights from experts and legal voices, it highlights the challenges of recovery and the consequences of drug-related offenses, while calling for greater awareness and collective action. \n3:00 pm – 3:30 pm: Enso\n30 min | Kannada with English subtitles | Director: Megha Havanje\nEnso is the story of a father and daughter navigating the trauma of an unexpected loss, as they search for healing and a way forward together. \n3:45 pm – 4:30 pm: Swagatam\n45 min | Hindi with English subtitles | Director: Sukriti Tyagi\nSwagatam follows the lives of a young married couple in a small Maharashtrian town. When the husband, living with schizophrenia, wishes to attend his friend’s wedding, the film offers a sensitive look at his experience—moving beyond the usual stereotypes to portray the everyday realities of living with the condition. \n4:40 pm – 7:00 pm: Margarita with a Straw\n2 hr 20 min | English & Hindi with English subtitles | Director: Shonali Bose\nMargherita with a Straw tells the story of a young woman—romantic at heart and a quiet rebel—who navigates life in a wheelchair with unshaken spirit. Living with cerebral palsy, she sets out on a journey of sexual discovery that challenges her relationships and her sense of self. In the midst of these conflicts, she ultimately finds strength in the depth of her closest bonds. \nPresented by: \n         \n",
    "url": "https://bangaloreinternationalcentre.org/event/screening-the-mind/",
    "keywords": [
      "Film",
      "Health & Wellness",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "mr",
    "workPresented": {
      "@type": "Movie",
      "name": "Screening the Mind"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-36-1.jpg"
  }
]