[
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "77132-1755198000-1755203400@bangaloreinternationalcentre.org",
    "name": "मुक्ति | Mukti - Liberation in Song",
    "startDate": "2025-08-14T19:00:00+05:30",
    "endDate": "2025-08-14T20:30:00+05:30",
    "description": "Oftentimes, the most powerful revolutions begin in verse. \nWith stirring narratives and emotional melodies, Mukti – Liberation in Song invites audiences to embark on an introspective journey, guided by the verses of poets who dared to dream beyond boundaries. The programme juxtaposes live performances of classical and folk compositions in multiple languages with immersive narration. Enhanced by a simulcast slideshow that spotlights the rich tapestry of Indian poetry, this event explores the perennial quest for freedom. \nFrom Tyagaraja’s desire to break free from worldly attachments to Akka Mahadevi’s defiance of patriarchal norms, each performance encapsulates a unique facet of liberation. Basavanna and Chokkamela’s verses resonate with resistance against caste barriers, advocating universal equality. Kabir’s timeless words soar with a similar spirit, calling upon souls to shatter dogmatic chains. \nThis evening, we honor the enduring spirit of Mukti and celebrate the poets whose voices envisioned a world where freedom isn’t just a political concept, but a universally human truth. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%ae%e0%a5%81%e0%a4%95%e0%a5%8d%e0%a4%a4%e0%a4%bf-mukti-liberation-in-song/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "मुक्ति | Mukti - Liberation in Song"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-19-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "77743-1756569600-1756576800@bangaloreinternationalcentre.org",
    "name": "And, Salt to Taste",
    "startDate": "2025-08-30T16:00:00+05:30",
    "endDate": "2025-08-30T18:00:00+05:30",
    "description": "Haven’t we all been to enough discussions where we have felt, “If only the moderator asked more interesting questions!” Whether it is a book launch, a post-screening chat with a filmmaker or a panel discussion on issues that matter to us, the role of the moderator is a critical but often taken-for-granted ingredient. A good moderator has a point of view and – like ‘salt to taste’ in any dish – makes the conversation deep, engaging and participative. Good moderators build context, make delicate – sometimes pointed – enquiries, navigate difficult terrains, potential conflicts and uncomfortable truths with grace and humour, all the while maintaining the integrity and forward momentum of the conversation. They also assess the temperature and shifting temperament of the room, and strive to be the audience’s representative, in turn challenging and coaxing those they are conversing with. \nIn this interactive workshop participants will explore various tools and techniques that will enable them to learn how to become an effective and critical moderator. Through exercises, group discussions and feedback, the workshop will impart practical knowledge on styles and strategies participants can choose from to suit both their personalities as well as the needs of a particular discussion. Finally, it will also provide tips to build confidence and cope with the last minute butterflies-in-the-stomach that is the worry of anyone who has ever – or never – walked onto a stage! \nIf you are keen on building a safe and inclusive space, and respectful and inspiring conversations, if you have an opinion but are interested in engaging with others’, if you are – or want to be – moderate in truth, temperate in style and obdurate in quest, then this workshop is for you. \n",
    "url": "https://bangaloreinternationalcentre.org/event/and-salt-to-taste/",
    "keywords": [
      "Language",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_salt.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77112-1755802800-1755808200@bangaloreinternationalcentre.org",
    "name": "Dual Margam 5",
    "startDate": "2025-08-21T19:00:00+05:30",
    "endDate": "2025-08-21T20:30:00+05:30",
    "description": "When rhythm takes flight and grace stands still, something timeless begins to move. \nOn our next evening of Dual Margam, two powerful classical traditions come together in a rare conversation of contrast and convergence. The soaring, drum-led dynamism of Pung Cholom from Manipur, and the grounded, sculptural flow of Odissi from Odisha. \nTraditionally, in Pung Cholom, dancers become percussionists: leaping, spinning, and drumming in mid-air with ecstatic energy and astonishing control. In contrast, Odissi unfolds in slow, sinuous arcs, where each gesture and every glance evokes poetry, myth, and devotion. \nIn this special performance, the two rhythmic traditions of Pung Cholom and Odissi are interwoven and contrasted: bringing fire to form, and pulse to poetry as the dances come together with complementary aesthetics. \nThe first in a two-part Odissi-Manipuri conversation, this evening unfolds through two male bodies and will be revisited next month through the feminine form. \nThe Dual Margam series curates two classical dance forms of India to highlight their similarities and differences. The solo performances honour traditional repertoire (the Margam), while the duet will juxtapose each unique form with another. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dual-margam-5/",
    "keywords": [
      "Dance",
      "Heritage",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_DM5-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77762-1755257400-1755262800@bangaloreinternationalcentre.org",
    "name": "Handlooms—Past, Present and Future",
    "startDate": "2025-08-15T11:30:00+05:30",
    "endDate": "2025-08-15T13:00:00+05:30",
    "description": "What does it take to keep a centuries-old craft alive in the 21st century? \nJoin us for a compelling panel discussion on the journey of Indian handlooms, where they’ve come from, where they stand today, and what the road ahead might look like. Titled Handlooms—Past, Present and Future, this conversation brings together iconic voices who have shaped, preserved, and championed India’s rich textile heritage. \nFrom policy and preservation to design and storytelling, the panel will explore the layered realities behind India’s handwoven traditions, especially in a time when fast fashion dominates and artisan livelihoods face uncertainty. \nThe discussion features Laila Tyabji, founder of Dastkar and pioneering craft revivalist; Ratna Krishna Kumar, patron of traditional arts and crafts; Nandita Das, actor, director and social advocate with a deep interest in handloom; and Chandra Jain, textile revivalist and presenter of River Weaves : Brocades of Banaras. The session will be moderated by award-winning writer and cultural commentator Shoba Narayan. \nExpect reflection, insight, and real questions: What must change? What must endure? And how can each of us – designers, buyers, storytellers, citizens, help ensure that India’s handloom story continues to be written? \nThis panel discussion is part of the River Weaves: Brocades of Banaras exhibition, an immersive experience & exhibition that invites visitors into the world of Banarasi handloom, one of India’s most exquisite and storied textile traditions. Presented by Chandra Jain and designed by Siddhartha Das Studio, the exhibition is a tribute to the artistry, symbolism, and sustainability embedded in every thread of Banaras brocade. \n",
    "url": "https://bangaloreinternationalcentre.org/event/handlooms-past-present-and-future/",
    "keywords": [
      "Culture",
      "Heritage",
      "Society",
      "Sustainability",
      "Textiles"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-26-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "77391-1755451800-1755460800@bangaloreinternationalcentre.org",
    "name": "Thampu | The Circus Tent",
    "startDate": "2025-08-17T17:30:00+05:30",
    "endDate": "2025-08-17T20:00:00+05:30",
    "description": "130 minutes | Malayalam with English subtitles | 1978 | G Aravindan \nA circus tent rises by the river, and with it a world both real and imagined. \nThampu (The Circus Tent) is a luminous blend of documentary and fiction, capturing the arrival of a travelling circus to a quiet village on the banks of Kerala’s Bharatapuzha river. Featuring real circus performers, local villagers, and a cast of non-actors, the film becomes a portrait of the everyday lives that unfold around a spectacle. \nDirected by G. Aravindan and shot by Shaji N. Karun, Thampu marked the second collaboration between two of Indian cinema’s most visionary artists. Filmed in stark black and white on a modest budget, it is a masterclass in restraint and imagination. Every frame holds the weight of directorial decisions: what is showcased, and what is obscured. \nRecently restored by the Film Heritage Foundation and digitised by the National Film Archive of India, Thampu has been rediscovered by global audiences. From the Cannes Classics to the British Film Institute’s Treasures segment, and most recently at the Festival of 3 Continents in Nantes, its revival is a tribute to Aravindan’s enduring cinematic voice. \nFilmmaker and scholar Dr. Soudhamini will introduce the film and moderate a post-screening Q&A. \nNote: This special screening concludes a two-day tribute to the creative partnership between director G. Aravindan and cinematographer-turned-director Shaji N. Karun – both of whom we remember with great reverence. BIC aims to pay homage to the iconic duo, and the Parallel Cinema movement they pioneered, through the screening of two films bound by their unique, shared cinematic vision. Read more about the first film in our tribute here. \n",
    "url": "https://bangaloreinternationalcentre.org/event/thampu-the-circus-tent/",
    "keywords": [
      "Film",
      "In Memory"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ml",
    "workPresented": {
      "@type": "Movie",
      "name": "Thampu | The Circus Tent"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-25-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77181-1755111600-1755117000@bangaloreinternationalcentre.org",
    "name": "Bahinabai Chaudhari - The Voice of the Soil",
    "startDate": "2025-08-13T19:00:00+05:30",
    "endDate": "2025-08-13T20:30:00+05:30",
    "description": "\nFrom the furrows of the earth rises a voice: quiet, wise, and enduring. \nBahinabai: Echoes of the Earth is a Bharatanatyam performance that brings to life the deeply moving poetry of Bahinabai Chaudhari, a farmer-poet whose simple, profound verses speak of toil, tenderness, and inner strength.  \nConceptualized and performed by Vaishnavi Dhore, this piece blends classical dance with Marathi ovi (verse), folk rhythms, and classical music to reimagine Bahinabai’s world. With evocative storytelling and expressive movement, this performance bridges the rural and the urban, the past and the present. \nFor the everyday woman is a philosopher, poet, and pioneer! \n\n\nSupported by:\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/bahinabai-chaudhari-the-voice-of-the-soil/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "mr",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-21-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77638-1754823600-1754829000@bangaloreinternationalcentre.org",
    "name": "Feelings Big & Small",
    "startDate": "2025-08-10T11:00:00+05:30",
    "endDate": "2025-08-10T12:30:00+05:30",
    "description": "Little hearts have the biggest feelings. \nIn this engaging workshop, children (aged 4+) and their parents are welcomed into a shared space where feelings become easier to see, name, and understand. Through storytime, music, movement, and art, children are guided to tune into their inner world. Kids will dance through their moods, draw out their feelings, and playfully explore what it means to be calm, frustrated, or excited. \nAlongside, parents will discover tools to better understand their child’s emotional world and connect more deeply. There will be space for questions and discussions on child behaviour. \nAll materials are provided, including colours, worksheets, and take-home resources. \nWith calming breath-work, openhearted conversations, and creative activities, this 90-minute session turns emotional learning into a shared family story. One that continues long after the workshop ends! \n",
    "url": "https://bangaloreinternationalcentre.org/event/feelings-big-small/",
    "keywords": [
      "Books",
      "Health & Wellness",
      "Theatre",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-20-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "77133-1754823600-1754829000@bangaloreinternationalcentre.org",
    "name": "Music of the Kirana Gharana",
    "startDate": "2025-08-10T11:00:00+05:30",
    "endDate": "2025-08-10T12:30:00+05:30",
    "description": "A single note can carry centuries of devotion. \nThe Kirana Gharana tradition of Hindustani classical music reveals itself slowly. Like dawn breaking across a silent sky, it is characterised by a meditative approach. Known for its graceful meend (glides) and evocative sargams (musical phrases), this musical evening invites deep listening and quiet awe. \nAcclaimed vocalist Pandit Milind Chittal brings the essence of this lineage to life. With his masterful control and emotive phrasing, he leads audiences through the delicate unfolding of ragas, where each swara (note) holds a world of feeling, and every silence has meaning. \nThis is more than a performance; it’s a conversation across time, held in melody and breath. \nLet the music find its way to where words cannot reach. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/music-of-the-kirana-gharana/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Music of the Kirana Gharana"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-14-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "77384-1755365400-1755374400@bangaloreinternationalcentre.org",
    "name": "Piravi | The Birth",
    "startDate": "2025-08-16T17:30:00+05:30",
    "endDate": "2025-08-16T20:00:00+05:30",
    "description": "103 minutes | Malayalam with English subtitles | 1989 | Shaji N Karun \nOne man waits by the river. Every morning, every evening. The bus never comes. \nPiravi (The Birth) is a quiet, devastating meditation on loss, hope, and the personal toll of political violence. Based on the life of Prof. T.E. Eachara Warrier, Piravi is an intimate elegy for a missing son and a father’s unyielding prayer. With unforgettable performances from Lakshmi Krishnamoorthy and Archana, the film has earned nearly 30 international awards, standing as a poignant reminder of how political tragedies are always deeply, painfully personal. \nInspired by the real-life story of Prof. T.E. Eachara Warrier, whose son disappeared during India’s Emergency in 1976 while studying at the Regional Engineering College in Calicut, Piravi captures the slow unraveling of a family consumed by grief. It is a heartrending portrayal of personal loss and the impact of political oppression. \nKarun’s directorial debut film will be introduced by filmmaker and scholar Dr. Soudhamini, who will also moderate the post-screening Q&A. \nNote: This special screening concludes a two-day tribute to the creative partnership between director G. Aravindan and cinematographer-turned-director Shaji N. Karun – both of whom we remember with great reverence. BIC aims to pay homage to the iconic duo, and the Parallel Cinema movement they pioneered, through the screening of two films bound by their unique, shared cinematic vision. Read more about the second film in their tribute here.\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/piravi-the-birth/",
    "keywords": [
      "Film",
      "In Memory"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ml",
    "workPresented": {
      "@type": "Movie",
      "name": "Piravi | The Birth"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-24-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77398-1755889200-1755893700@bangaloreinternationalcentre.org",
    "name": "Deva Nartana",
    "startDate": "2025-08-22T19:00:00+05:30",
    "endDate": "2025-08-22T20:15:00+05:30",
    "description": "Rooted in Hindu philosophy and echoing the cycles of creation and destruction, the ten incarnations of Vishnu, Deva Nartana, are reimagined through four classical dance traditions: Bharatanatyam, Mohiniattam, Odissi, and Kathak. \nPerformed by Saji Menon (Mohiniattam), Namrata Mehta (Odissi), Bhakti Deshpande (Kathak), and Prachi Saathi (Bharatanatyam), this collaborative production draws on the symbolism of the Avataras as metaphors of cosmic evolution and divine intervention. \nWith music specially composed by twelve acclaimed musicians, Deva Nartana is a heartfelt offering, an immersive experience of myth, movement, and devotion through the language of classical Indian dance. \nCredits: \nMusic Direction and Arrangement: Satish Krishnamurthy \nMusic composition:\nSatish Krishnamurthy\nManoj Desai\nJateen Sahoo \nVocals:\nManoj Desai\nSatish Venkatesh\nJateen Sahoo\nSangeet Murli \nPercussion:\nMaddalam & Edakkya – Nambishan Sir\nMridangam, Ghatam & Ganjira – Satish Krishnamurthy\nMardala – Rohan Dahale\nTabla – Vivek Mishra\nPakhawaj – Omkar Dalvi\nFlute – Vijay Tambe\nSarangi – Sangeet Mishra\nViolin – ShivaKumar Anantharaman\nSound Engineer – Tapan Da, Trio Studio \nResearch Guidance:\nRishiraj Pathak\nPartho Pawgi \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/deva-nartana/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-29-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77036-1754764200-1754769600@bangaloreinternationalcentre.org",
    "name": "The Indo-Pacific Outlook: An Australian Perspective",
    "startDate": "2025-08-09T18:30:00+05:30",
    "endDate": "2025-08-09T20:00:00+05:30",
    "description": "As global power dynamics continue to shift, the Indo-Pacific sits at the heart of a rapidly evolving strategic and economic landscape. In this timely and wide-ranging session, Peter Varghese, former Australian Foreign Secretary and High Commissioner to India, offers a perspective shaped by decades of diplomacy and deep engagement with the region. \nHis address will explore the complex forces redefining the Indo-Pacific: from the sharpening rivalry between the US and China, to China’s expanding influence and the evolving policy direction in Washington. The session will also examine how key regional players (India, Japan, Korea, Indonesia) are shaping their own responses to these pressures, and what this means for the broader security of the region. \nAlongside geopolitics, the conversation will turn to trade tensions, economic nationalism, and the slowing pace of globalization; factors that now cast long shadows over our economic future. Can traditional regional institutions hold, or will more agile, interest-based minilateral groups take their place? \nFollowing his presentation, Peter Varghese will converse with Latha Reddy, Nitin Pai, and Ranjan Mathai. The evening concludes with an audience Q&A, inviting reflections on a region that will shape the 21st century. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-indo-pacific-outlook-an-australian-perspective/",
    "keywords": [
      "International Relations",
      "Policy & Regulation",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-4-8.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "77886-1757755800-1757872800@bangaloreinternationalcentre.org",
    "name": "Storytelling Theatre Workshop",
    "startDate": "2025-09-13T09:30:00+05:30",
    "endDate": "2025-09-14T18:00:00+05:30",
    "description": "Storytelling is as old as mankind itself. In recent years there has been a resurgence in Storytelling, applying the narrative process in a wide range of settings, drawing from a variety of origins: in therapy, in community development, in toastmasters clubs, in management, in personal growth labs and so on. It may well become something of a bandwagon soon. \nBangalore Little Theatre (BLT) has developed a unique genre of storytelling theatre, presenting fully rehearsed performances, but in storytelling format. It is called the Courtyard programme. The main features of the programme are:\n– Performances in a variety of spaces, not necessarily a stage\n– Usually smaller numbers, in intimate surroundings\n– Typically two actors – even one as sometimes done\n– No staging requirements of sets, costumes, lights, etc. Just good performance! \nWhat will not be easily seen about Storytelling Theatre is that it requires a specialized approach to content and scripting and, therefore, a specialized technique in performance. Those who have seen BLT performances such as Robi’s Garden and Shakespeare By Any Other Name will understand this readily. \nStorytelling Theatre in India is a relatively new form that is still evolving. Participants in the workshop will be contributing to its development. \nWho is this workshop for? \nThis workshop is meant for those who are already well into the theatre arts and are committed to future work in either theatre making or performance, but with a special interest in Storytelling Theatre. It is not meant for mere “orientation” or armchair exploration. It will be a doing workshop, covering such objectives as:\n– To examine and appreciate different forms of Storytelling\n– To look at the special needs of storytelling theatre\n– To explore the unique skill sets needed in the actor for the above – in body, voice and mind\n– To make a beginning in creating a community of theatre storytellers, committed to developing the form.\n– The last objective is significant. It is accepted that there can be a limited amount of coverage in a two-day workshop. We hope to continue as a community of storytelling theatre makers. \nPlease note: The workshop will be for a limited number of participants. All interested in the workshop are requested to register early. BIC reserves the right to finalize the list of participants. There will be no walk-in registrations at the workshop.  \n",
    "url": "https://bangaloreinternationalcentre.org/event/storytelling-theatre-workshop/",
    "keywords": [
      "Education",
      "Performing Arts",
      "Theatre",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Storytelling Theatre Workshop"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-1-7.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77860-1755428400-1755433800@bangaloreinternationalcentre.org",
    "name": "Beary Kind",
    "startDate": "2025-08-17T11:00:00+05:30",
    "endDate": "2025-08-17T12:30:00+05:30",
    "description": "What does it mean to be kind? \nCan small acts of care make a big difference? In this heartwarming session for children aged 4 and above, we explore the power of kindness through stories, conversation, and creative play. \nAlongside Give Me a Hug by Nick Vujicic, we’ll also read A Village is a Busy Place by Rohima Chitrakar & V. Geetha and So Small That You Cannot See It by Hervé Millet — each offering a different lens on empathy, community, and wonder. \nJoin us for a gentle morning of connection, sharing, and hugs (the real and the storybook kind)! \n",
    "url": "https://bangaloreinternationalcentre.org/event/beary-kind/",
    "keywords": [
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-33-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77225-1756492200-1756497600@bangaloreinternationalcentre.org",
    "name": "Seven Ways to See the World",
    "startDate": "2025-08-29T18:30:00+05:30",
    "endDate": "2025-08-29T20:00:00+05:30",
    "description": "When do we dream up stories? \nThis Is How I Draw, published by Pratham Books, invites you inside the curious, creative minds of seven of India’s most beloved picture-book creators. With warmth and honesty, the artists open up their sketchbooks (and their thoughts) to show us how stories are born from everyday life, quiet moments, wild ideas, and everything in between. \nA perfect event for anyone who’s ever picked up a pencil and wondered, what if…? \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/seven-ways-to-see-the-world/",
    "keywords": [
      "Books",
      "Design",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-32-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77749-1755255600-1755720000@bangaloreinternationalcentre.org",
    "name": "River Weaves",
    "startDate": "2025-08-15T11:00:00+05:30",
    "endDate": "2025-08-20T20:00:00+05:30",
    "description": "Exhibition Opening: 11:00 am | Friday, 15 August\nTimings: 11:00 am – 8:00 pm\nExhibition on show until Wednesday, 20 August \nWalkthroughs:\nAug 15 | 5:30 pm\nAug 16 | 12:00 pm & 5:30 pm\nAug 17 | 12:00 pm & 5:30 pm\nAug 18 | 12:00 pm & 5:30 pm\nAug 19 | 12:00 pm & 5:30 pm\nAug 20 | 12:00pm \nConversation:\nPanel Discussion – Friday, 15 August | 11:30 am – 1 pm \nRiver Weaves: Brocades of Banaras is an immersive experience & exhibition that invites visitors into the world of Banarasi handloom, one of India’s most exquisite and storied textile traditions. Presented by Chandra Jain and designed by Siddhartha Das Studio, the exhibition is a tribute to the artistry, symbolism, and sustainability embedded in every thread of Banaras brocade. \nFrom shimmering motifs inspired by Mughal gardens and temple carvings, to rare handwoven sarees dyed using natural dyes after a gap of 125 years, River Weaves presents a textured narrative of tradition and revival. It highlights the unseen processes behind each masterpiece, degumming, spinning, dyeing, and weaving, while also centring the voices of the weavers, many of whom have inherited and protected this craft for generations. \nBut this tradition is withering. Fewer artisans are able to sustain the work, and the next generation is stepping away. Through this exhibition, we hope to rekindle awareness and inspire a return to wearing and supporting these textiles, because unless people continue to buy, the craft will not survive. \nRiver Weaves is more than a showcase, it’s a call to action. Every Banarasi brocade is not just fabric, but a living story of skill, memory, and community. \nThe concept and vision for the exhibition were conceived by Chandra Jain, a long-time advocate of India’s crafts and textiles. The exhibition has been curated by Chiara Nath and Siddhartha Das of Siddhartha Das Studio, an award-winning, multi-disciplinary practice known for its powerful storytelling of India’s cultural heritage. The studio specializes in museums, interpretation centres, exhibitions, and craft installations. Their design brings together historical depth and contemporary relevance, inviting visitors to engage meaningfully with the legacy of Banaras Brocade. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/river-weaves/",
    "keywords": [
      "Culture",
      "Design",
      "Heritage",
      "Textiles",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-27-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77338-1754478000-1754856000@bangaloreinternationalcentre.org",
    "name": "Un.Divided Identities",
    "startDate": "2025-08-06T11:00:00+05:30",
    "endDate": "2025-08-10T20:00:00+05:30",
    "description": "Exhibition Opening: 11 am | Wednesday, 6 Aug\nExhibition Timings: 11 am – 8 pm\nExhibition on show until: 8 pm | Sunday, 10 Aug \nWalkthroughs:\n4 pm | Saturday, 9 Aug (followed by a ‘meet the team’ at 5 pm)\n4 pm | Sunday, 10 Aug \nPartition: Memory, Responsibility, and Voice (Panel Discussion): 11 am – 12:30 pm | Saturday, 9 Aug | Auditorium \nUn.Divided Identities is an interactive choice-based digital exhibition on the 1947 Partition of the Indian subcontinent. Originally launched online in 2022 by ReReeti in partnership with the British Council and Glasgow Life Museums, this exhibition is now being reimagined as a physical, immersive experience. It is especially relevant for young people who have only ever encountered Partition through textbook chapters and distorted narratives. \nCurated by ReReeti, designed by Aditi Dhamija, and in collaboration with the Bangalore International Centre, this exhibition urges participants to deeply feel the emotional weight of forced, mass migration. The digital interactives serve as the core touch point, but the stories extend beyond the screen. Spilling into the physical space as tactile, atmospheric, and visually compelling encounters, visitors navigate through stories of displacement – stories based on real accounts of families. You will face difficult choices on behalf of characters, driven by fear, survival, and the need to protect their families. \nWhile Partition impacted families across the subcontinent, its realities are often distant in southern India. This exhibition opens space for reflection and conversation, prompting visitors to connect personally with questions of identity, loss, memory, and inter-generational resilience. \nThe hope is to change how future generations choose to carry our history forward. \nPlease note: Kids below age 6 will not be allowed inside the Gallery space. \nClick here to know more about the Panel Discussion. \nIn collaboration with:\n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/un-divided-identities/",
    "keywords": [
      "History",
      "Politics",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_UI-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77379-1754823600-1754829000@bangaloreinternationalcentre.org",
    "name": "Aah! Aha! Ha-ha!",
    "startDate": "2025-08-10T11:00:00+05:30",
    "endDate": "2025-08-10T12:30:00+05:30",
    "description": "Are we teaching children what to think, or how to think? When our children focus on rote learning and exam-based academic progress, how do we nurture the inventive Indian who can fuel the imagination of the world with creativity, critical thinking and problem-solving? What if classrooms became labs of imagination, not factories of repetition? \nThese are the questions that the Agastya International Foundation set out to answer 25 years ago, by designing a curiosity-driven, experiential learning model that has transformed education across India. Today, their vision of sparking curiosity, nurturing creativity and instilling confidence and caring has impacted over 25 million schoolchildren and 300,000 teachers in government schools across 23 Indian States. \nAn acclaimed new book from Penguin Random House, The Moving of Mountains traces Agastya’s extraordinary journey in reshaping the classroom by replacing rote learning with hands-on experiments, creative projects and interactive models in science, art and ecology. \nJoin us in a discussion of why this powerful vision for curiosity-driven, experiential learning is critical to the future of India, and has caught the imagination of scientists, industry leaders, educationists and policy makers alike. \nThe discussion will be followed by a Q&A session. \n",
    "url": "https://bangaloreinternationalcentre.org/event/aah-aha-ha-ha/",
    "keywords": [
      "Books",
      "Education"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-15-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77116-1755109800-1755115200@bangaloreinternationalcentre.org",
    "name": "Confessions of a Lobbyist",
    "startDate": "2025-08-13T18:30:00+05:30",
    "endDate": "2025-08-13T20:00:00+05:30",
    "description": "Insider accounts from political aides, bureaucrats, and diplomats have long illuminated the workings of power—but even more enigmatic were the lobbyists. Operating in the shadows, often invisible to public scrutiny, they were intimately privy to clandestine negotiations, back-channel discussions, and subtle bureaucratic skirmishes. In his new roman-à-clef For No Reason At All, Ramjee Chandran shines a light on this hidden world. \nChandran—well‑known in Bangalore as a journalist, publisher, and podcaster—has, until now, remained silent about his time as a lobbyist in 1980s New Delhi, a pivotal era just before major economic reforms took hold. \nDrawing from real events, the novel charts the journey of a young lobbyist caught in a high-stakes conflict over silicon metal—a material deemed strategically vital. Central to the drama is Metkem Silicon, which, in collaboration with the Indian Institute of Science in Bangalore, devoted 17 years to developing indigenous silicon metal technology. Yet their efforts collided with a rival scheme spearheaded by the Department of Electronics, which wanted to bypass local innovation and import U.S. technology. \nWhat ensued was a four‑year bureaucratic war: media leaks, secret memorandums, and the covert involvement of the Soviets and other intelligence agencies—culminating in a final decision placed in the hands of Prime Minister Rajiv Gandhi. \nSet against the backdrop of Cold War Delhi on the cusp of liberalisation, the novel paints a vivid portrait of a nation—and capital—torn between ideologies and ambitions. The Soviet Union may have vanished, lobbyists have receded from public corridors, and few can claim first‑hand knowledge of that era. \nIn Confessions of a Lobbyist, Siddharth Raja—a lawyer, historian, and bibliophile—sits down with Ramjee Chandran to peel back the layers of this story, offering an insider’s glimpse into a world that feels at once distant and disarmingly relevant. \n",
    "url": "https://bangaloreinternationalcentre.org/event/confessions-of-a-lobbyist/",
    "keywords": [
      "Books",
      "Economics",
      "Fiction",
      "Governance"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-16-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77663-1754764200-1754769600@bangaloreinternationalcentre.org",
    "name": "Beyond the Horizon",
    "startDate": "2025-08-09T18:30:00+05:30",
    "endDate": "2025-08-09T20:00:00+05:30",
    "description": "India’s reaching for the stars, and you’re invited. \nWith esteemed space scientist Dr. B R Guruprasad and senior aerospace journalist Chethan Kumar, this event offers a deep-dive into the impact of the recently successful AXIOM-4 mission. Moderated by veteran journalist and writer Vijay Mruthyunjaya, you can expect sharp insights, grounded analyses, and inspiring takes on the future of India’s space odyssey. \nJoin us for an expedition to the new frontier! \n",
    "url": "https://bangaloreinternationalcentre.org/event/beyond-the-horizon/",
    "keywords": [
      "Science",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_BTH.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77232-1755196200-1755201600@bangaloreinternationalcentre.org",
    "name": "Code Red: Climate in the Dock",
    "startDate": "2025-08-14T18:30:00+05:30",
    "endDate": "2025-08-14T20:00:00+05:30",
    "description": "It’s here. The climate crisis is no longer a distant warning.  \nClimate Change: The Policy, Law, and Practice is a vital intervention. A book that gathers decades of global negotiations, Indian legal battles, and emerging climate jurisprudence into one urgent and accessible narrative. From courtroom precedents to cutting-edge policy, from carbon markets to constitutional rights, it examines how law can both shape and respond to the climate emergency. \nAuthor and legal expert Jay Cheema draws from his experience as Amicus Curiae to the Supreme Court of India in a landmark carbon emissions case. Guiding us through the evolving legal architecture of climate action and accountability, his presentation will be followed by an incisive conversation with an interlocutor to explore the tensions and hopes within the climate discourse. An open Q&A will close the session. \nReshaping landscapes, displacing lives, and challenging our very systems of governance, this crisis can no longer be sidelined. Forests burn where there was once monsoon green, rivers swell as glaciers retreat, and the ancient cycle of India’s six ritus feels increasingly unfamiliar. The chaos predicted by climate scientists in the 50’s is increasingly creeping into our reality.  \nBecause the climate crisis is not only legal and political, but deeply personal. \n",
    "url": "https://bangaloreinternationalcentre.org/event/code-red-climate-in-the-dock/",
    "keywords": [
      "Books",
      "Climate Change",
      "Law",
      "Policy & Regulation"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-18-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77570-1754847000-1754852400@bangaloreinternationalcentre.org",
    "name": "Populisms in India",
    "startDate": "2025-08-10T17:30:00+05:30",
    "endDate": "2025-08-10T19:00:00+05:30",
    "description": "Populism in India wears many faces; sometimes divisive, sometimes empowering, often both at once.  \nIn this event we bring together eminent scholars of Indian democracy and political history. Join Ashutosh Varshney and Mahesh Rangarajan, moderated by Sudhir Krishnaswamy, for a critical conversation on the book’s arguments, and implications, for how we understand populism, democracy, and political modernization in India today. \nThe conversation will centre political scientist Srikrishna Ayyangar’s new book, A Logic of Populism: India and its States (Cambridge University Press, 2025). Drawing from diverse state-level case studies, Ayyangar argues that populists in India operate not merely by claiming to speak for ‘the people’, but by dividing society in ways that claim to serve a broader common good. Through this lens, populism is not a singular ideology, but a political method. One that adapts itself to India’s democratic context in distinct, often surprising ways. \nA Q&A with the audience will follow the discussion. \nTea will be served from 5 PM. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/populisms-in-india/",
    "keywords": [
      "Books",
      "Law",
      "Nonfiction",
      "Politics",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-79.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77673-1755369000-1755374400@bangaloreinternationalcentre.org",
    "name": "Acts of Attention",
    "startDate": "2025-08-16T18:30:00+05:30",
    "endDate": "2025-08-16T20:00:00+05:30",
    "description": "A poet’s prerogative is to witness life. \nSiddhartha Menon’s poetry belongs to a modern practice, going back to around 1900, of creating poems through spells of intense attention to non-human life for its own sake. This evening will begin with a conversation between Menon and Prashant Keshavmurthy on how two of Menon’s six poem collections – The Compass Bird (2023) and Lone Pine (2025) – relate to this modern poetic practice. Together, they’ll trace the lineage of a quiet but radical poetic tradition that resists metaphor, transcends language, and pulls attention. \nWhile the natural world has always been a favourite muse of the human mind, select poets have found powerful anecdotes to draw their readers in. Pushing past the self-centred gaze so familiar to us, the lyrical observations of this style asks us to witness the fascinating creatures with whom we share this world.  \nClosing with a Q&A open to the audience, this event promises insights, inspiration, and immersion. \n",
    "url": "https://bangaloreinternationalcentre.org/event/acts-of-attention/",
    "keywords": [
      "Books",
      "Literature",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-22-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77128-1755023400-1755028800@bangaloreinternationalcentre.org",
    "name": "The Great Trigonometrical Survey",
    "startDate": "2025-08-12T18:30:00+05:30",
    "endDate": "2025-08-12T20:00:00+05:30",
    "description": "A scientific quest, a vast subcontinent and an imperial impulse. \nThe Great Trigonometrical Survey combined all these, resulting in one of the most astounding projects in the history of science. This talk by writer, Meera Iyer takes you through the GTS story, beginning with its origins in Bangalore and going all the way to the Himalayas. The intrepid surveyors handled devilishly delicate instruments, braved the monsoons, fell prey to disease, all in their quest for inch-perfect maps. Besides some of the most famous people in the GTS including William Lambton and George Everest, the talk will also speak about some of the forgotten Indians who were a part of this extraordinary work, and the relevance of the GTS today. \nA Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-great-trigonometrical-survey/",
    "keywords": [
      "Books",
      "Design",
      "History",
      "Nonfiction",
      "Science",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-8-7.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "77173-1756483200-1756488600@bangaloreinternationalcentre.org",
    "name": "The Worlds We Build",
    "startDate": "2025-08-29T16:00:00+05:30",
    "endDate": "2025-08-29T17:30:00+05:30",
    "description": "Five picture-book makers. One room full of ideas. \nStep into the imaginative world of children’s book illustration with Deepa Balsavar, Ogin Nayam, Pankaj Saikia, Priya Kuriyan, and Rajiv Eipe. All master storytellers who draw what they see, feel, and dream. \nThis hands-on workshop offers a rare glimpse into their sketchbooks and creative journeys. Learn how everyday moments become unforgettable visuals, how characters come to life with just a few strokes of your brush, and how illustration transforms into storytelling. \nThe session includes interactive demos, a Q&A with the artists, and a guided drawing activity that invites you to look closely, draw freely, and think like a storyteller. \nJoin us and learn how to make your pictures worth more than a thousand words! \nPlease note: \n\nA limited number of slots are available for the workshop.\nThe workshop is ideal for illustrators, designers, librarians and educators–anyone who works with picture books.\nTo be considered for a seat, please submit your work/portfolio through the RSVP form.\nAll mediums are welcome, but submissions should be compiled into 1 PDF and under 10MB.\nParticipants will be selected based on the work/ portfolio shared in this form.\nPlease ensure details and links attached in the form are accessible and correct.\nIf selected, please carry your preferred drawing materials and a sketchbook with you.\n\nSubmission Deadline: August 15, 9:00 PM IST\nSelected participants will be notified on August 22. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-worlds-we-build/",
    "keywords": [
      "Books",
      "Design",
      "Visual Arts",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_TWWB.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77306-1755630000-1755635400@bangaloreinternationalcentre.org",
    "name": "Kalatra: The Eternal Consort",
    "startDate": "2025-08-19T19:00:00+05:30",
    "endDate": "2025-08-19T20:30:00+05:30",
    "description": "At the edge of legend and longing, two women wait for the same god. \nKalatra is a dance-theatre work by Keelaka Dance Company that reimagines the story of Murugan and his two consorts (Valli and Devanai) not as divine footnotes, but as women bound by love, rivalry, and fate. In the classical Hindu tradition, Murugan’s union with both is a symbol of completeness, of sacred balance. But in Sri Lanka’s local poetic lore, a quieter, more human story unfolds. \nThe journey begins in Kataragama, where Murugan is worshipped not just by Hindus, but by Buddhists, Muslims, and indigenous tribes. Each finds a reflection of their own devotion in his form. Here, the story of Valli takes root, even as the shrine of Devanai turns away. Locals say she cannot bear to see her lord walk each night to Valli’s side. \nBlending Bharatanatyam and contemporary dance, Kalatra draws from mythology, regional poetry, and imagined memory. Presented by the Keelaka Dance Company, conceived by Jyotsna Shourie and Aneesha Grover, with music by Daniel B George, OS Arun, and Madstarbase. \nA performance where myth breathes, and devotion speaks! \nIn Collaboration with: \n \n  \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/kalatra-the-eternal-consort/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-23-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77143-1755025200-1755028800@bangaloreinternationalcentre.org",
    "name": "Mosaics of Motion",
    "startDate": "2025-08-12T19:00:00+05:30",
    "endDate": "2025-08-12T20:00:00+05:30",
    "description": "Like ink on paper, a dancer on stage brings stories to life through gesture, rhythm, and the quiet intensity of perfection. \nIn this specially curated evening, the National Youth Ballet Company presents a selection of Pas Seuls (solo variations) and ensemble works that celebrate both classic repertoire and fresh interpretation. Ballet, with its rich vocabulary of movement, is a timeless form of storytelling; one that carries emotion, history, and character in every turn and leap. From the mischievous Swanhilda of Coppélia to the grace of the Lilac Fairy from Sleeping Beauty, the bold spirit of Sylvia, the charm of the Nutcracker’s Tea Dance, and a fiery Jazz Waltz, each piece invites the audience into a world of layered characters and expressive movement. \nThe evening culminates with excerpts from The Cave of Wonders; a preview of Aladdin The Ballet, the upcoming production by The Lewis Foundation of Classical Ballet. \nThis event is an invitation to witness dedication, beauty, and the enduring power of dance. \nIn collaboration with: \n \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/mosaics-of-motion/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-10-2.jpg"
  }
]