[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81390-1763314200-1763319600@bangaloreinternationalcentre.org",
    "name": "Judge and Be Judged: Musings on the Top Court",
    "startDate": "2025-11-16T17:30:00+05:30",
    "endDate": "2025-11-16T19:00:00+05:30",
    "description": "As the Supreme Court of India completes seventy-five years, how do we understand its role in shaping the country’s institutions and democratic ideals? Has it remained a counter-majoritarian voice, and how has it navigated questions of accountability, transparency and constitutional promise? \nJoin us for a conversation that brings together former judges, lawyers and scholars to reflect on the Court’s evolving legacy, drawing from the book [In]complete Justice: The Supreme Court at 75. The discussion features Justice S. Muralidhar, Justice N. Santosh Hegde, Dr. Aditya Sondhi and Radhika Chitkara, as they explore the intersections of law, legitimacy and justice in contemporary India.\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/judge-and-be-judged/",
    "keywords": [
      "Law"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_JaBJ.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81344-1762887600-1762893000@bangaloreinternationalcentre.org",
    "name": "Damaru- Duality",
    "startDate": "2025-11-11T19:00:00+05:30",
    "endDate": "2025-11-11T20:30:00+05:30",
    "description": "The Damaru, as an instrument, manifests the flow of energy between Purusha and Prakriti through its very shape. In it is contained the origin of sound; sound that is the genesis of creation and movement. Conceptualized and choreographed by Vidhya Subramanian, the work brings together an ensemble of eight dancers – Vidhya Subramanian, Anu Bhaskararaman, Anisha Parameswaran, Archa Shajukumar, Manasa Vijaychander, Pranathi Ramadorai, Sandhya Venkiteshwaram and Subashree S. DAMARU highlights the dualities present within us as well as in the universe—sound and silence, stillness and movement, creation and dissolution, male and female, self and other, union and separation – in each of us exists the duality that the universe holds.  \nSparsha Dance Ensemble, founded by eminent Bharatanatyam dancer Vidhya Subramanian,  creates new work that brings together concept, process and intense training. Choreographed and directed by Vidhya Subramanian, Damaru is Sparsha’s first ensemble work and has received excellent audience feedback. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/damaru-duality/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-44-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81291-1762801200-1762806600@bangaloreinternationalcentre.org",
    "name": "Tat Tvam Asi - Finding Thyself",
    "startDate": "2025-11-10T19:00:00+05:30",
    "endDate": "2025-11-10T20:30:00+05:30",
    "description": "Tat-Tvam Asi is a meditative dance production that explores the essence of surrender as a path to self-realisation, through the lives of Andal, Radha, and Chaitanya Mahaprabhu—each a yogi in their own right. Drawing from the Bhagavad Gita, where Krishna says, “As all surrender unto Me, I reward them accordingly, ” this work reflects the multiple ways one can find the divine: through devotion, knowledge, or selfless action. The production unfolds as a series of  vignettes—Andal’s karmic service, Radha’s longing rooted in bhakti, and Chaitanya Mahaprabhu’s ecstatic sankeertana—interwoven with Krishna ’s own voice as the sutradhar (narrator). From the chariot of Jagannatha in Puri to the quiet sanctum of a temple, the narrative reveals the beauty of total surrender, dissolving the ego in divine love. Blending classical dance traditions such as Bharatnatyam and Gaudiya Nritya with original music and poetic texts, Tat-Tvam Asi is a journey into Krishna Tattvam—the omnipresence of the divine within and around us. \nThe depth of this timeless message and wisdom (familiar to many Vedantic scholars and Indians) was explored by Neha through the many coloured hues of devotion (bhakti) found in ancient lores and cultures. Neha chose the beloved pastoral God Krishna as the focus of bhakti of the devotee. Neha’s approach to Tat Tvam Asi is episodic. Fragments from Andal, Radha and Chaitanya Mahaprabhu were revisited and evoked with compelling conviction through her intense abhinaya. Neha Mondal has conceptualized Tat-Tvam Asi after years of deep reflection on the nature of devotion and surrender. Her creative process involved studying scriptures, poetry, and the lives of Andal, Radha, and Chaitanya Mahaprabhu to understand their spiritual journeys. She collaborated closely with scholars, musicians, and writers to shape a narrative that is both intimate and universal. As a dancer rooted in tradition yet open to exploration, Neha wove together movement, music, and storytelling to evoke the transformative power of bhakti. This production is a culmination of her artistic introspection and spiritual inquiry, brought to life through dance. \nCredits \nConcept & Choreography: Neha Mondal \nScript: Smt. Priya Krishnadas\nLyrics: Dr. C.K. Jayanthi\nMusic: Shri Balakrishnan Karippalil\nCompilation & Recording: Biju James\nCostumes: Sandhya Raman\nVocals : Binu V Nair / Vasudha Gopal\nScript & Research : Smt. Priya Krishnadas\nSankirtana composition : Mrs. Mahua Mukherjee\nNattuvangam : Shri Balakrishnan Karippalil\nViolin – Easwar Ramakrishnan\nPercussions : Vedakrishnan / Sruthi Raj\nFlute : Sruthi Sagar\nVeenai : Anjani \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/tat-tvam-asi-finding-thyself/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_TTA.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81415-1762540200-1762545600@bangaloreinternationalcentre.org",
    "name": "Bureaucratic Better Halves",
    "startDate": "2025-11-07T18:30:00+05:30",
    "endDate": "2025-11-07T20:00:00+05:30",
    "description": "The Other Side of Diplomacy offers a rare glimpse into the untold stories of those who stand beside diplomacy: the spouses of foreign diplomats from India. Through essays that are poignant, humorous, and disarmingly personal, the anthology captures the emotional landscape of belonging everywhere and nowhere at once. \nIn this conversation, panellists reflect on cultural crossings, reinvention, and the art of finding home amid constant change: a journey as relatable as it is extraordinary. \n",
    "url": "https://bangaloreinternationalcentre.org/event/bureaucratic-better-halves/",
    "keywords": [
      "Books",
      "Defence & security",
      "International Relations",
      "Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-45-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81336-1762128000-1762214399@bangaloreinternationalcentre.org",
    "name": "390. Confessions of a Lobbyist",
    "startDate": "2025-11-03T05:30:00+05:30",
    "endDate": "2025-11-04T05:30:00+05:30",
    "description": "Insider accounts from political aides, bureaucrats, and diplomats have long illuminated the workings of power—but even more enigmatic were the lobbyists. Operating in the shadows, often invisible to public scrutiny, they were intimately privy to clandestine negotiations, back-channel discussions, and subtle bureaucratic skirmishes. In his new roman-à-clef For No Reason At All, Ramjee Chandran shines a light on this hidden world. \nChandran—well‑known in Bangalore as a journalist, publisher, and podcaster—has, until now, remained silent about his time as a lobbyist in 1980s New Delhi, a pivotal era just before major economic reforms took hold. \nDrawing from real events, the novel charts the journey of a young lobbyist caught in a high-stakes conflict over silicon metal—a material deemed strategically vital. Central to the drama is Metkem Silicon, which, in collaboration with the Indian Institute of Science in Bangalore, devoted 17 years to developing indigenous silicon metal technology. Yet their efforts collided with a rival scheme spearheaded by the Department of Electronics, which wanted to bypass local innovation and import U.S. technology. \nWhat ensued was a four‑year bureaucratic war: media leaks, secret memorandums, and the covert involvement of the Soviets and other intelligence agencies—culminating in a final decision placed in the hands of Prime Minister Rajiv Gandhi. \nSet against the backdrop of Cold War Delhi on the cusp of liberalisation, the novel paints a vivid portrait of a nation—and capital—torn between ideologies and ambitions. The Soviet Union may have vanished, lobbyists have receded from public corridors, and few can claim first‑hand knowledge of that era. \nIn Confessions of a Lobbyist, Siddharth Raja—a lawyer, historian, and bibliophile—sits down with Ramjee Chandran to peel back the layers of this story, offering an insider’s glimpse into a world that feels at once distant and disarmingly relevant. \nIn this episode of BIC Talks, Ramjee Chandran will be in conversation with Siddharth Raja. This is an excerpt from a conversation that took place in the BIC premises in Aug 2025. \nSubscribe to the BIC Talks Podcast on your favourite podcast app!\nBIC Talks is available everywhere, including Apple Podcasts, Spotify, Google Podcasts, Castbox, Overcast, Audible, and Amazon Music. \n",
    "url": "https://bangaloreinternationalcentre.org/event/390-confessions-of-a-lobbyist/",
    "keywords": [
      "Books",
      "Economics",
      "Fiction",
      "Governance",
      "Podcast"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-7-7.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80961-1762686000-1762689600@bangaloreinternationalcentre.org",
    "name": "Tales From Far and Wide",
    "startDate": "2025-11-09T11:00:00+05:30",
    "endDate": "2025-11-09T12:00:00+05:30",
    "description": "Are you ready to open a treasure chest of tales?\n\nGeeta Ramanujam brings a trove of magical tales to life with her signature warmth and energy. From faraway lands to familiar places, her stories connect generations and fill hearts with laughter and wonder. Each story comes with a little secret: how she first heard it!  \nA joyful hour where words come alive and imaginations soar! \nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \nIn collaboration with:\n \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/tales-from-far-and-wide/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Children's Books",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-43-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80897-1762281000-1762286400@bangaloreinternationalcentre.org",
    "name": "What's The Film About?",
    "startDate": "2025-11-04T18:30:00+05:30",
    "endDate": "2025-11-04T20:00:00+05:30",
    "description": "17 minutes | English | 2024 | India \nWhat’s The Film About? follows Indian filmmaker Poorva Bhat during a camping weekend with her two children, as she tries to find the right way to talk about safe and unsafe touch. What unfolds is a tender and honest tug-of-war between a mother and her children, as they navigate discomfort, curiosity, and care while attempting to have a crucial conversation. \nPremiered at Visions du Réel, one of Europe’s leading documentary film festivals, the film has since travelled widely, screening at festivals including the BFI London Film Festival and IDFA, where it won the Best Youth Documentary (9–12) award. It also received a Special Mention at the European Children’s Film Festival and continues its journey across international and Indian festivals. \nCelebrated for its light-hearted yet thoughtful approach to a sensitive subject, What’s The Film About? opens up space for parents, educators, and caregivers to reflect on how such conversations can take place within families and classrooms. \nThe screening will be followed by a discussion and an audience Q&A, focusing on how adults can foster safer, more open dialogue with children on this important topic. \n",
    "url": "https://bangaloreinternationalcentre.org/event/whats-the-film-about/",
    "keywords": [
      "Education",
      "Film",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_wtfa_.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81436-1762540200-1762545600@bangaloreinternationalcentre.org",
    "name": "Homecoming",
    "startDate": "2025-11-07T18:30:00+05:30",
    "endDate": "2025-11-07T20:00:00+05:30",
    "description": "Conversations around mental health often remain confined to whispers, held back by silence, stigma, and fear. Yet when lived experiences are shared, they open windows into understanding, empathy, and change. This session reflects on how personal storytelling can transform pain into purpose, inviting us to see resilience and healing in new, deeply human ways. \n\n\n\n\n\n\n\n\n\n\n\nFeaturing Neha Kirpal and Dr. Nandini Murali, co-authors of Homecoming: Mental Health Journeys of Resilience, Healing and Wholeness, Westland Books and the India Mental Health Alliance bring to you a discussion featuring seven participants, the two co-authors and five contributors, bringing together voices of women from across urban India navigating a wide spectrum of mental health conditions. Through their journeys, marked by courage, vulnerability, and renewal, they challenge the idea of brokenness and reimagine what it means to be whole.\n\n\n\n\n\nThe session will be followed by a Q&A session with the audience. \n\n\n\n\n\n\n\nPresented by: \n          \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/homecoming-2/",
    "keywords": [
      "Books",
      "Health & Wellness",
      "Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_HC-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "81426-1762974000-1762980300@bangaloreinternationalcentre.org",
    "name": "Defending the Caveman",
    "startDate": "2025-11-12T19:00:00+05:30",
    "endDate": "2025-11-12T20:45:00+05:30",
    "description": "Language: English \nDefending the Caveman is a hilariously insightful one‑man comedy play centered around the ways men and women relate. After a swift exit from a house party our actor sees a vision and gets visited by the mysterious Caveman. \nIt has played in over 50 countries and won hearts worldwide for its playful, energetic storytelling. It has been praised for being both comedic, and tender; energetically playful, and informative. \nCredits:\nDirector : Heeba Shah\nExecutive Producer: Oskar Eiriksson\nGeneral Manager: Torfi Geir Simonarson\nProducer (India): Jiten Bhagat\nAssistant Producer, Assistant Director : Rohaan Unvala\nLight Designer: Yael Chrisna\nSound Designer: Varun Gupta\nArt Director/ Set Designer: Vivek Jadhav\nStage Manager : Sambhav Singh\nLight Operator and Projectionist: Romil Krishnani\nSound Operator: Sambhav Singh \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/defending-the-caveman/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Defending the Caveman"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_dtc.jpg"
  }
]