[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69551-1737910800-1737914400@bangaloreinternationalcentre.org",
    "name": "Do You Know the Story of Your State?",
    "startDate": "2025-01-26T17:00:00+05:30",
    "endDate": "2025-01-26T18:00:00+05:30",
    "description": "You were born in an Indian state. You live and study in an Indian state. You, like every other Indian, call at least one state home. Your state is a big part of your identity. And yet, do you know the story of how your state was created? \nCome listen to the incredible origin stories of each of India’s twenty-eight states and eight union territories, spanning from Independence until today. The state that wasn’t even a part of India until 1975; the union territory that had a prime minister for a single day; the state that had three capitals; and the union territory that has beaches on both coasts! The session also includes a fun quiz that you don’t want to miss! \nWe at BIC have put together a day, full of events at our Library, to celebrate the 76th year of the Indian Constitution with kids at the heart of our programmes. Through stories, quizzes, and fun-filled sessions, we aim to get young minds thinking a little bit more in depth about our constitution and country.  \nYou can view the other two events here and here. \n",
    "url": "https://bangaloreinternationalcentre.org/event/do-you-know-the-story-of-your-state/",
    "keywords": [
      "Books",
      "History",
      "Language",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-60.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69272-1737657000-1737662400@bangaloreinternationalcentre.org",
    "name": "Conversations with Kabir",
    "startDate": "2025-01-23T18:30:00+05:30",
    "endDate": "2025-01-23T20:00:00+05:30",
    "description": "This is a BIC Elsewhere event at Sabha: An Arts and Crafts Shaale \nKabir and other Bhakti and Sufi poets are constantly talking to us, as friends, as fellow seekers, as brothers and sisters. But what are they really saying? \nThis session explores the message of the mystics and engages in a dialogue with them, through songs, stories and reflections. \nAbout BIC Elsewhere: \nWhile the majority of our events find a home at our premises in Domlur, BIC Elsewhere represents our commitment to bringing conversations, arts, and culture directly to diverse audiences. Through this initiative, we collaborate with various venues, extending the reach of our events beyond our own space. These partnerships not only breathe life into our gatherings but also play a crucial role in cultivating an environment for the flourishing of arts and culture in the city. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/conversations-with-kabir/",
    "keywords": [
      "Faith",
      "Music",
      "Performing Arts",
      "Philosophy"
    ],
    "location": {
      "@type": "Place",
      "name": "Sabha: An Arts and Crafts Shaale, No.44/A, Kamaraj Rd, Bharati Nagar, Shivaji Nagar, Bengaluru, Karnataka, 560042, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Conversations with Kabir"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-28.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68537-1737570600-1737576000@bangaloreinternationalcentre.org",
    "name": "Out of the Middling Middle",
    "startDate": "2025-01-22T18:30:00+05:30",
    "endDate": "2025-01-22T20:00:00+05:30",
    "description": "Midlife is a phase when we find ourselves pulled in multiple directions—across work, home, health, friendships, and hobbies. \nIn this session, Ravi Venkatesan delves into themes from Deepak Jayaraman’s recent book, Play to Potential. The book offers a nuanced exploration of how to unlock human potential—not just professionally but holistically—by embracing life’s highs and lows. Drawing from his acclaimed Play to Potential podcast and his experiences as a coach, Deepak introduces the FLAVOUR framework, a practical guide to navigating the intricate interplay of family, aspirations, values, and relationships. \nDeepak emphasises that life is a team sport, with family serving as an essential support system. He argues that personal growth and achievement are deeply intertwined with our family contexts, a perspective often overlooked in self-help literature, particularly in cultures where family plays a central role. \nA key insight of the book is the recognition that life unfolds in seasons, shaped by transitions—some intentional, others unexpected. Using real-life examples and case studies, Deepak illustrates how navigating these transitions thoughtfully is vital to realising our potential. \nThis discussion will resonate with anyone in their 30s to 60s, offering valuable strategies to lead a multi-dimensional, purposeful life. A Q&A session will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/out-of-the-middling-middle/",
    "keywords": [
      "Books",
      "Health & Wellness",
      "Nonfiction",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-691.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69209-1737903600-1737909000@bangaloreinternationalcentre.org",
    "name": "The Constitution and its Makers",
    "startDate": "2025-01-26T15:00:00+05:30",
    "endDate": "2025-01-26T16:30:00+05:30",
    "description": "The Indian Constitution, which came into force on 26 January, 1950 was prepared by the Constituent Assembly over a two and a half year period through a process of discussion and debate. There were close to 300 members in the Constituent Assembly. Besides the known members of the Assembly like Dr BR Ambedkar and Jawaharlal Nehru, several others contributed to the making of the Constitution. \n10 Makers of the Indian Constitution introduces you to some of these makers. What were the lives of these makers like? What were their achievements? What were their contributions to the Constitution and to India in general? There are fascinating stories that lie hidden. \nWe at BIC have put together a day, full of events at our Library, to celebrate the 76th year of the Indian Constitution with kids at the heart of our programmes. Through stories, quizzes, and fun-filled sessions, we aim to get young minds thinking a little bit more in depth about our constitution and country.  \nYou can view the other two events here and here. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-constitution-and-its-makers/",
    "keywords": [
      "Books",
      "History",
      "Policy & Regulation",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Karthik-T.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69348-1737907200-1737912600@bangaloreinternationalcentre.org",
    "name": "Nature's Wild Child",
    "startDate": "2025-01-26T16:00:00+05:30",
    "endDate": "2025-01-26T17:30:00+05:30",
    "description": "India has a unique relationship with the mango. It is all over our cultural life and festivals. Our emotional life and our social existence. Our markets and our countryside. It is the only fruit that is a festival unto itself. Each year, cities organize their own mango festivals that are extremely popular events. No other fruit seems to have a comparable role anywhere else. The mango seems intimately familiar to almost all Indians, nay, all residents of South Asia. Yet we are unaware of the wider role of the mango fruit, leaves, flowers, trees, orchards and groves in almost every facet of our lives through our known and unknown history. In politics, economics, land ownership, infrastructure, ecological (and psychological) health, propaganda, diplomacy, ecology, festivities, funerals, weddings, seduction, poetry, the arts, architecture… \nDrawing from the recently published bestseller Mangifera indica: A Biography of the Mango, this discussion will join the ubiquitous excitement around mangoes to look towards avenues untrodden, histories unconsidered, festivals abandoned. The event will take place close to the time that marked India’s myriad spring festivals, the symbol of which was the mango flower. The known mango is a bridge to a lot about us that is either unknown or goes unacknowledged. \nThe author, Sopan Joshi will be in conversation with Venu Madhav Govindu which will be followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/natures-wild-child/",
    "keywords": [
      "Books",
      "Culture",
      "Environment",
      "Food",
      "Heritage",
      "Nonfiction",
      "Science"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-695.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69289-1737745200-1737750600@bangaloreinternationalcentre.org",
    "name": "Dido and Aeneas",
    "startDate": "2025-01-24T19:00:00+05:30",
    "endDate": "2025-01-24T20:30:00+05:30",
    "description": "Dido and Aeneas in Bangalore is a unique collaboration project, bringing together some of the finest musicians from India and Sweden, in a performance of one of the most beloved chamber operas from the Baroque-period. Experience the passionate drama through stirring instrumental music, dance, arias and choirs – a must-see-hear in Bangalore in 2025! \nDido and Aeneas is based on Book IV of Virgil’s epic The Aeneid. It is one of the earliest known English operas, and one of the most important and often performed operas written in the Baroque period. It is also Henry Purcell’s only true opera; that is, his only all-sung dramatic work. \nWhat is most remarkable for such an important work in the opera repertoire, is that so little about it is known. A copy of a libretto from the 1700’s exists (possibly from the first performance), so we know it originally was composed as a Prologue and Opera. However, the music for the Prologue, the end of the act II Grove scene, and several dances have been lost, and indeed no score exists in Purcell’s handwriting. \nMoreover, the dates of composition and the first performance are uncertain. It is known, through references in letters, that it was performed at a girls’ school in Chelsea, London, some time before the end of 1689. However, some scholars argue that the opera was composed and performed for the Royal Court of either James II or Charles II with a date as early as 1684, and argue that the reference in the Prologue to the joy of a marriage between two monarchs is an allegorical one. \nWhatever history of the opera is waiting to be uncovered, what we do know, and perhaps most important of all, is that Purcell’s Dido and Aeneas is a deeply moving and unforgettable opera. \nDido, Queen of Carthage – Maria Forsström, mezzo-soprano\nAeneas, Trojan hero – Rahul Bharadwaj, baritone\nBelinda, Dido’s confidante and handmaiden – Tanisha Herbert Rozario, soprano\nSecond Lady – Rachel Mathew, soprano\nSorceress – Sangita Santosham, mezzo-soprano\n1st Witch – Rebekah Alexander, soprano\n2nd Witch – Ketki Herlekar, soprano\nA Sailor – Benson Chacko, tenor\nA Spirit – Nora Alexy, alto \nViolin – Carol George & Arun Rozario\nViola – Maria Winiarski\nCello – Kristina Winiarski\nBass – Jasiel Peter\nHarpsichord – Rebecca Thomas Colaco\nPercussion – Akshay Nagmule\nGuitar – Ryal Sequiera\nConductor – Sofia Winiarski \nCappella Bangalore\nThe Bangalore Men \nConductor – Jonas Olsson \nDancers from The Lewis Foundation of Classical Ballet\nChoreographer: Iryna Hryshukova\nDancers: Iryna Hryshukova, Elina Wisung, Ramya Manikam, Tanvi Agarwal \nIn collaboration with Legato School of Music and The Lewis Foundation of Classical Ballet \n   \nSupported by the Swedish Arts Council and the Swedish Arts Grants Committee \n     \n",
    "url": "https://bangaloreinternationalcentre.org/event/dido-and-aeneas/",
    "keywords": [
      "Dance",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Dido and Aeneas"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/dido.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68620-1737657000-1737662400@bangaloreinternationalcentre.org",
    "name": "American Dream, Indian Style",
    "startDate": "2025-01-23T18:30:00+05:30",
    "endDate": "2025-01-23T20:00:00+05:30",
    "description": "Kamala Harris. Nikki Haley. Vivek Ramaswamy. Fareed Zakaria. It is virtually impossible to turn on CNN, read the Wall Street Journal, go to a hospital, attend a university, or browse a bookstore without encountering a sea of Indian names and faces. In her new book, Indian Genius: The Meteoric Rise of Indians in America, author and journalist Meenakshi Ahamed provides fascinating portraits of the Indian Americans at the forefront of the wave of Indian success stories. \nIn this session, Meenakshi draws from her book to provide us with fascinating portraits of a number of well-known figures who have excelled in their fields. Based on a series of interviews and full of fresh and surprising stories, the session will give readers unprecedented insight into the personal strengths that made these extraordinary individuals’ public achievements possible. \nThe talk will be followed by a discussion with Nirupama Rao, Ambassador & Former Foreign Secretary, GoI followed by an audience Q&A. \n",
    "url": "https://bangaloreinternationalcentre.org/event/american-dream-indian-style/",
    "keywords": [
      "Books",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-693.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69287-1737828000-1737833400@bangaloreinternationalcentre.org",
    "name": "Getting Grounded",
    "startDate": "2025-01-25T18:00:00+05:30",
    "endDate": "2025-01-25T19:30:00+05:30",
    "description": "Bangalore International Airport, the first Greenfield Airport in India and one of the fastest growing airports in the world, continues to strive to create a meaningful impact not just for its customers but also for the community and environment in which it operates. Popularly called an airport in a garden, it serves to be a delightful experience for travellers having won over 100 distinctions and Indian and International awards including Best Airport, Best passenger Experience and Best Employer, Best Greefields Airport etc. \nBeyond its design and success however, BIAL has made a commitment to the environment and sustainability, as highlighted in state of the art water, solid waste and energy management and community engagement. \nWhat does it take to make an airport sustainable? What does it take to make an airport stay grounded yet fly above the rest? Join us for a conversation about the behind the scenes BIAL story which is an example that it’s possible to stay committed to core sustainability values in a profit driven business. \n",
    "url": "https://bangaloreinternationalcentre.org/event/getting-grounded/",
    "keywords": [
      "Architecture",
      "Bangalore",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-696.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69124-1737484200-1737489600@bangaloreinternationalcentre.org",
    "name": "The Making of Modern Karnataka",
    "startDate": "2025-01-21T18:30:00+05:30",
    "endDate": "2025-01-21T20:00:00+05:30",
    "description": "Karnataka is one of India’s most diverse states, as rich in literary and cultural traditions as it is in democratic struggles and political churns. The 20th century witnessed the birth of a modern Kannada renaissance, accompanied by the emergence of a powerful social conscience.  Against this backdrop, one young man’s quest to explore his vibrant historical roots leads to an ambitious attempt to unpack the region’s social and cultural histories. \nRama Bhima Soma is an enterprise of translation and rediscovery, packed with stories and conversations. The book explores a dizzyingly wide sweep of Karnataka’s contemporary history—the life and times of legends like Kuvempu and Shivaram Karanth; the fall of Socialism and the rise of the Hindu Right; the intellectual ruminations of U.R. Ananthamurthy, D.R. Nagaraj and M.M. Kalburgi; the wildly popular television serials of T.N. Seetharam and the community-centred one-woman theatre shows of Du Saraswathi; a brief history of Naxalism in Karnataka and glimpses of other complicated legacies of the 1970s’ Left. \nMarshalling a diverse range of literary and scholarly resources, framed through biographical sketches and immersive reportage, this session will reanimate some pivotal moments in the making of modern Karnataka. A Q&A session with the audience will follow. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-making-of-modern-karnataka/",
    "keywords": [
      "Books",
      "Culture",
      "Heritage",
      "History",
      "Politics",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-694.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69685-1738175400-1738180800@bangaloreinternationalcentre.org",
    "name": "The Thief Who Stole My Heart",
    "startDate": "2025-01-29T18:30:00+05:30",
    "endDate": "2025-01-29T20:00:00+05:30",
    "description": "This talk by commences by introducing the audience to the sacred bronzes created by a master sculptor around the year 1000, and suggests that his inspiration may well have been child-saint Sambandar’s opening hymn that hails god Shiva as “the thief who stole my heart.” \nVidya Dehejia explores this sensuous imagery before moving to ask questions of this material that have not been asked before. Where did the Cholas acquire the copper required to cast the many temple bronzes that are solid heavy pieces of metal? Why were the Cholas obsessed with island Sri Lanka? What were the circumstances that permitted the creation of hundreds of temples and vast numbers of sacred bronzes despite the constant warfare that the Chola monarchs were engaged in? What was the source of the extraordinarily vast number of pearls that, together with coral, rubies and diamonds, were embedded in gold jewelry gifted to adorn temple bronzes? Why did the Cholas cover the walls of their temple walls with inscriptions– some 13,000 in total – using temple walls as if they were the public records office? \nA Q&A session with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-thief-who-stole-my-heart/",
    "keywords": [
      "Culture",
      "Design",
      "Faith",
      "Heritage",
      "History",
      "Society",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-32.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69606-1737916200-1737921600@bangaloreinternationalcentre.org",
    "name": "Chamber Music through the Ages",
    "startDate": "2025-01-26T18:30:00+05:30",
    "endDate": "2025-01-26T20:00:00+05:30",
    "description": "Chamber music from various eras, presented by pianist Natallia Kapylova, born in Belarus and now residing in Bangalore, with visiting artists from Sweden, Kristina Winiarski (cello), Maria Winiarski (viola) and Maria Forsström (mezzo-soprano). \n \nSupported by Furtados, Steinway & Sons, the Swedish Arts Council and the Swedish Arts Grants Committee \n        \n             \n",
    "url": "https://bangaloreinternationalcentre.org/event/chamber-music-through-the-ages/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Chamber Music through the Ages"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-62.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69353-1738407600-1738413000@bangaloreinternationalcentre.org",
    "name": "The Grandeur of Gwalior",
    "startDate": "2025-02-01T11:00:00+05:30",
    "endDate": "2025-02-01T12:30:00+05:30",
    "description": "Gwalior – A Land Where Even a Child’s Cry Finds Tune \nExperience the grandeur of Gwalior, the cradle of Hindustani vocal music, where the echoes of enchanting ragas have resonated through time. Celebrating the legacy of the Gwalior Gharana, the evening promises a mesmerizing journey through a repertoire of compositions in its distinctive style. \nImmerse yourself in the rich tapestry of khayal, khayalnuma, tappa, tap-tarana, bandish ki thumri, bol-banaav ki thumri, and ashtapadi, each capturing the essence of this unparalleled tradition. The performance will be interwoven with anecdotes, stories of legendary masters, and rare compositions passed down through generations, showcasing the journey of this music from the courts of kings to the embrace of the common folk. \nRuturaj Kolpe, a disciple of Vidushi Dr. Meeta Pandit, will present this morning concert in an intimate baithak setting, accompanied by Shantanu Deshmukh on the tabla and Vighnesh Bhagwat on the harmonium. This is an invitation to step into a time warp, where the echoes of a bygone era and the majesty of Gwalior’s musical heritage come alive. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-grandeur-of-gwalior/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Grandeur of Gwalior"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-31.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69543-1737889200-1737894600@bangaloreinternationalcentre.org",
    "name": "Mission Young Citizens",
    "startDate": "2025-01-26T11:00:00+05:30",
    "endDate": "2025-01-26T12:30:00+05:30",
    "description": "Who says children don’t understand civic rights? \nA 13-year-old girl’s drive led to a toilet being built in her village for the first time. A young boy’s call to the municipal corporation fixed a dangerous pothole. When given an opportunity, young citizens of India are more than capable of bringing about real change. \nThis event will see young change makers talk about their experiences – the challenges, solutions and vision for the future, an activity for youngsters to understand the process of how to report to civic authorities followed by a quiz for all ages on India by Quiz Master Berty Ashley. \nIn collaboration with:\n \n  \nWe at BIC have put together a day, full of events at our Library, to celebrate the 76th year of the Indian Constitution with kids at the heart of our programmes. Through stories, quizzes, and fun-filled sessions, we aim to get young minds thinking a little bit more in depth about our constitution and country.  \nYou can view the other two events here and here. \n",
    "url": "https://bangaloreinternationalcentre.org/event/mission-young-citizens/",
    "keywords": [
      "Governance",
      "Policy & Regulation",
      "Society",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-59.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69560-1738089000-1738094400@bangaloreinternationalcentre.org",
    "name": "Swept Away",
    "startDate": "2025-01-28T18:30:00+05:30",
    "endDate": "2025-01-28T20:00:00+05:30",
    "description": "How on earth did Stephen Huyler find himself pedalling a bicycle rickshaw at the Indian border on his twentieth birthday? Intriguing stories like this define Huyler’s life and his metamorphosis into a leading documentarian of the cultures and peoples of India. \nEarly in his career as an anthropologist and art historian, Stephen Huyler recognized that most of the world had little access to feeling the pulse of the peoples of South Asia. In the fifty-two years since his unusual first entry into India, Stephen has traversed the subcontinent dozens of times by a wide variety of transportation in order to conduct a detailed survey of India’s village and other subcultures. \nHis innate friendliness has always opened doors, while his skills as a writer and photographer have allowed him to create books and museum exhibitions of material never before recorded. \nThis session draws on Huyler’s book Transformed By India, exploring his many encounters, from maharajahs to musicians, Dalits to Brahmins, politicians to potters. Tying all the many stories together is the innate strength and creative capacity for improvement expressed everywhere in the subcontinent. \nIn this session, Stephen Huyler will be in conversation with Sandhya Mendonca. This will be followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/swept-away/",
    "keywords": [
      "Books"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-700.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69337-1737570600-1737577800@bangaloreinternationalcentre.org",
    "name": "Homai Vyarawalla",
    "startDate": "2025-01-22T18:30:00+05:30",
    "endDate": "2025-01-22T20:30:00+05:30",
    "description": "2006 | 71 minutes | English \nHomai Vyarawalla was born in 1913 into a priestly family in Navsari, Gujarat. She was the first woman photojournalist in the country. Beginning her career as a photographer with the Bombay Chronicle and later the Far Eastern Bureau of the British Information Services, she soon came to be known for her compelling photographic images taken both before and after independence. \nShe has a rare collection of interesting photographs of Pandit Jawaharlal Nehru, Dr. Radhakrishnan and Mahatma Gandhi. She worked as a freelancer for SPAN, Life and many international publications and finally gave up photography in 1970. She was married to Maneckshaw Vyarawalla who was himself a photographer. \nSPARROW Documentary presents Homai Vyarawalla, a film that delves into the life of India’s first woman photojournalist. The documentary showcases her life and work, featuring a conversation with filmmaker Sabeena Gadihoke at her home in Baroda, where she recollects her childhood days, education, and photojournalism career. \nWith a career spanning several decades, Homai Vyarawalla captured pivotal events and figures during the Indian independence movement and beyond. She retired in 1970 and was awarded the Padma Vibhushan in 2011, a year before her passing on January 15, 2012. This documentary highlights her trailblazing role in a male-dominated field, featuring her remarkable photographs that document historic moments in India. \nThe screening will be followed by a Q&A session with C S Lakshmi. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/homai-vyarawalla/",
    "keywords": [
      "Film",
      "Photography"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-27.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69281-1738175400-1738180800@bangaloreinternationalcentre.org",
    "name": "शून्यता–समानता | Emptiness–Equality",
    "startDate": "2025-01-29T18:30:00+05:30",
    "endDate": "2025-01-29T20:00:00+05:30",
    "description": "In this musical introduction to The Notbook of Kabir, Anand will demonstrate how Kabir often translates and improvises on––and returns to––the Buddha. What is the relationship between Sunnyata (शून्यता, the void) and Samaanta (समानता, equality)? How does the raga that is nirgun (निर्गुण), beyond form and quality (गुण), enfold, embody and inform form, and help us experience both being and nothingness? \nFollowing a brief performance, Anand will be in conversation with Kotiganahalli Ramaiah, poet, playwright, translator and song-writer renowned in the Kannada world. \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%b6%e0%a5%82%e0%a4%a8%e0%a5%8d%e0%a4%af%e0%a4%a4%e0%a4%be-%e0%a4%b8%e0%a4%ae%e0%a4%be%e0%a4%a8%e0%a4%a4%e0%a4%be-emptiness-equality/",
    "keywords": [
      "Music",
      "Performing Arts",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "शून्यता–समानता | Emptiness–Equality"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-699.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69417-1737891000-1737896400@bangaloreinternationalcentre.org",
    "name": "Building Bridges: The Journey Towards Equality and Fraternity",
    "startDate": "2025-01-26T11:30:00+05:30",
    "endDate": "2025-01-26T13:00:00+05:30",
    "description": "This panel will examine how the principles of equality and fraternity have shaped India’s democratic journey over the past 75 years. They will explore the relevance of these constitutional values in addressing contemporary challenges in the daily lives of Indian citizens like social inequities and polarisation. The discussion will also highlight the indigenous roots of these values within Karnataka’s rich philosophical and cultural traditions. Through diverse perspectives, the panel will reflect on how these constitutional values can be actualised in governance, culture, policy, and daily life. \nThis session is the fourth in the series titled ‘We the People’ to celebrate 75 years of our Constitution. As part of this series, DAKSH, in collaboration with BIC, is organising a series of lectures and panel discussions on various aspects of the Constitution. \n\n\n\n\nThe discussion will be conducted in both English and Kannada. \n\n\n\n\nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/building-bridges-the-journey-towards-equality-and-fraternity/",
    "keywords": [
      "Development",
      "Governance",
      "Law",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-697.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69200-1738089000-1738096200@bangaloreinternationalcentre.org",
    "name": "Aradhana Saraswati",
    "startDate": "2025-01-28T18:30:00+05:30",
    "endDate": "2025-01-28T20:30:00+05:30",
    "description": "The concert pays homage to the Goddess Saraswati, revered through the ages as the embodiment of the four essentials of a discerning human life: Speech (Vaani), the foundation of communication and expression; Music (Sangeet), the universal language of harmony and emotion; Wisdom (Buddhi), the guiding light of understanding and insight; and Discrimination (Vivek), the power to discern and choose wisely. \nThrough a journey of timeless raags and original compositions, our musicians delve into these eternal qualities, reflecting the grace and profundity that the Goddess represents. This celebration is not just a tribute to Saraswati but a call to connect with the divine essence of creativity, intellect, and balance within us all. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/aradhana-saraswati/",
    "keywords": [
      "Faith",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Aradhana Saraswati"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-698.jpg"
  }
]