[
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69281-1738175400-1738180800@bangaloreinternationalcentre.org",
    "name": "शून्यता–समानता | Emptiness–Equality",
    "startDate": "2025-01-29T18:30:00+05:30",
    "endDate": "2025-01-29T20:00:00+05:30",
    "description": "In this musical introduction to The Notbook of Kabir, Anand will demonstrate how Kabir often translates and improvises on––and returns to––the Buddha. What is the relationship between Sunnyata (शून्यता, the void) and Samaanta (समानता, equality)? How does the raga that is nirgun (निर्गुण), beyond form and quality (गुण), enfold, embody and inform form, and help us experience both being and nothingness? \nFollowing a brief performance, Anand will be in conversation with Kotiganahalli Ramaiah, poet, playwright, translator and song-writer renowned in the Kannada world. \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%b6%e0%a5%82%e0%a4%a8%e0%a5%8d%e0%a4%af%e0%a4%a4%e0%a4%be-%e0%a4%b8%e0%a4%ae%e0%a4%be%e0%a4%a8%e0%a4%a4%e0%a4%be-emptiness-equality/",
    "keywords": [
      "Music",
      "Performing Arts",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "शून्यता–समानता | Emptiness–Equality"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-699.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69767-1738782000-1738787400@bangaloreinternationalcentre.org",
    "name": "Traversing Sonic Terrain",
    "startDate": "2025-02-05T19:00:00+05:30",
    "endDate": "2025-02-05T20:30:00+05:30",
    "description": "Nishad Pandey (guitar) and Aman Mahajan (piano) perform and delve into the creation of the abstract, contemporary, and often improvised music, that defines their signature style as Tinctures. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/traversing-sonic-terrain/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Traversing Sonic Terrain"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-704.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69513-1738868400-1738873800@bangaloreinternationalcentre.org",
    "name": "Electric Raagas",
    "startDate": "2025-02-06T19:00:00+05:30",
    "endDate": "2025-02-06T20:30:00+05:30",
    "description": "Alec Goldfarb, known for his innovations in Hindustani Classical Music, brings his unique approach to the BIC in an evening of evocative and boundary-defying performance. Blending the rich tradition of Indian ragas with the expressive versatility of the electric guitar, Alec reimagines the art of classical music, creating a soundscape that is both timeless and contemporary. Drawing on his Jazz and Western Classical backgrounds, the Alap, Jor, Jhalla presentation is augmented by lush harmonies and textures. \nThis is a rare opportunity to experience the intersection of tradition and modernity, where Alec Goldfarb’s innovative artistry invites audiences into a transformative musical journey. He will be accompanied by Ajinkya Galande on tabla. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/electric-raagas/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Electric Raagas"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-706.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "63762-1740769200-1740772800@bangaloreinternationalcentre.org",
    "name": "The Earthquake",
    "startDate": "2025-02-28T19:00:00+05:30",
    "endDate": "2025-02-28T20:00:00+05:30",
    "description": "\n54 minutes | English, Hindi, Kannada | Suitable for 13+ Years\nTrigger Warnings: Themes of Loneliness \n\n\n\n\nDo you ever feel alone, even when surrounded by people? Do you crave connection, even when it cracks a little? \nMira and Sameer meet every week, their meeting as familiar as the apple they share. They speak. Someone leaves. They do this again. And again. Mira goes on a boat ride. Sameer stays in a bubble. There is silence. And again. Mira and Sameer are friends… Yet, their unspoken words scream louder than their conversations. \nThis is a story of cycles. Of coming together, drifting apart, and all the spaces in between. \nWhat happens when we finally face our truth? Maybe we hear a strange noise… \nThis is an adaptation of “Bhūmikampa – Das Erdbeben” which received funding for International Cultural Projects from The Department of Arts and Culture of the City of Munich \n\n\nFrom the Playwrights (Samragni Dasgupta and Marvin Krause):\nTwo young artists from India and Germany meet on a farm in Bengaluru as part of an exchange program. They get to know each other and realise that cultural differences are just one aspect of human connection. They come together to develop something together. But what?The idea for this collaboration started with a conversation about loneliness. Above all, how loneliness is a common factor for young people in all countries. From loneliness to the intricacies of human relationships, two people began an intensive writing process to explore the many facets of human connection.\n\nFrom the Director:\n“Mira and Sameer find themselves on a bench, surrounded by unspoken words. ‘The Earthquake’ delves into the essence of human relationships—our connections, routines, distances, and all the spaces in between. It asks us what it means to be truly seen or heard. What happens when we finally face the unspoken truths in our interpersonal relationships?”\n\n\n  \nCredits: \nPlaywrights: Marvin Krause and Samragni Dasgupta\nDirector: Samragni Dasgupta \nCast: \nMira: Yamuna Kali\nSameer: Naman Roy \nThe Earthquake received the Internationaler Kulturprojekte Grant 2023 from the Landeshauptstadt München Kulturreferat (City of Munich). \nProduced by     \n\nWith Support from \n\n \n\n",
    "url": "https://bangaloreinternationalcentre.org/event/the-earthquake/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "The Earthquake"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-599.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69693-1738695600-1738701000@bangaloreinternationalcentre.org",
    "name": "A Classical Western Music Piano & Violin Duo",
    "startDate": "2025-02-04T19:00:00+05:30",
    "endDate": "2025-02-04T20:30:00+05:30",
    "description": "Join us for an enchanting evening featuring the extraordinary talents of Neville (pianist) and Sophia Schrader (violinist), as they present a program of Mozart, Fauré, Ravel, and Claude Bolling. \n \nPresented by: \n \nSupported by \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-classical-western-music-piano-violin-duo/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "A Classical Western Music Piano & Violin Duo"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-701.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "69469-1738868400-1738873800@bangaloreinternationalcentre.org",
    "name": "Yogi Mattu Bhogi",
    "startDate": "2025-02-06T19:00:00+05:30",
    "endDate": "2025-02-06T20:30:00+05:30",
    "description": "90 Minutes | Kannada | For Ages 16 years and above \nYogi Mattu Bhogi is a free adaptation of the 7th-century play, Bhagavadajjukam (Sanskrit, ‘bhagavat’ – hermit; ‘ajjuka’ – harlot), also known in English as The Ascetic and The Courtesan. One of the oldest surviving plays in Sanskrit literature, it is a fine example of a ‘prahasana’, or farce. Layered in witty exchanges about dharma, it is centered around the transmigration of souls between the two titular characters leading to confusion and chaos for the supporting characters who have no answer to the absurdity of it all. \nThrough this retelling in Kannada, Mahesh Dattani, plays around with the idea of gender: its expression, perception, spectrum and the exploration of what one truly is with a confrontation of stereotypes using humour and catharsis. Infused with Yakshagana, the play comes alive when the classic Sanskrit text and the physicality of theatre gels seamlessly with the traditional dance theatre form from coastal Karnataka. \nCredits:\nAdaptation and Direction: Mahesh Dattani\nKannada Translation: Vishvajith Madhavamurthy\nYakshagana Choreography: Guru Bannanje Sanjeev Suvarna\nMusic Composition: Poornima Bhojraj\nSet Design: Mahesh Dattani\nLight Design: Trisha Shetty, Bhavya Bharadwaj, Pallavi Kodagu\nLights Execution: Trisha Shetty, Bhavya Bharadwaj\nCostume Design: Shruti Bangera\nMusic: Amrit P\nProduction Manager: Venumadhav Bhat\n(Initial) Poster Design: Gopalkrishna Bhat\n(Initial) Poster Artwork: Shruti Bangera\nAssistant Directors: Trisha Shetty and Kritika Verma\nProduction Assistants: Atharv Mishra and Amrutha \nAbout Punaha Theatre:\nPunaha, a theatre company based in Udupi, is dedicated to the art of storytelling through the transformative power of performance. ‘Punaha’, is derived from the Kannada (Σನಃ), Hindi (पुनः) and Sanskrit word, meaning “repeat,” or “to do it again”. They are a group of professional theatre artists, academicians, and working professionals who love theatre, and the idea of repetition and riyaaz involved in it. ‘Punaha’ symbolizes their commitment to revisit and reimagine classic narratives while exploring contemporary themes that resonate with today’s audience. It also is the idea of us as humans trying, failing but definitely starting again, starting Punaha. Among their ongoing productions are Girish Karnad’s Agni Aur Barkha (translated into Hindi by Ram Gopal Bajaj) and Harold Pinter’s The Caretaker. Agni Aur Barkha was previously adapted to the stage in Kannada as Agni Mattu Male. Yogi Mattu Bhogi is our fourth production overall in collaboration with Sahitya Akademi awardee, Mahesh Dattani. Punaha hopes to create a thriving theatre culture in the small coastal city of Udupi, develop their plays thriftily and tour them to other cities, big and small. Reflecting the multilinguistic atmosphere of the city, their intention is to not be bound by the constraints of a single language, producing plays primarily in English, Hindi, and Kannada. \nIn collaboration with: \n \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/yogi-mattu-bhogi/",
    "keywords": [
      "Literature",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Yogi Mattu Bhogi"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-703.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69685-1738175400-1738180800@bangaloreinternationalcentre.org",
    "name": "The Thief Who Stole My Heart",
    "startDate": "2025-01-29T18:30:00+05:30",
    "endDate": "2025-01-29T20:00:00+05:30",
    "description": "This talk by commences by introducing the audience to the sacred bronzes created by a master sculptor around the year 1000, and suggests that his inspiration may well have been child-saint Sambandar’s opening hymn that hails god Shiva as “the thief who stole my heart.” \nVidya Dehejia explores this sensuous imagery before moving to ask questions of this material that have not been asked before. Where did the Cholas acquire the copper required to cast the many temple bronzes that are solid heavy pieces of metal? Why were the Cholas obsessed with island Sri Lanka? What were the circumstances that permitted the creation of hundreds of temples and vast numbers of sacred bronzes despite the constant warfare that the Chola monarchs were engaged in? What was the source of the extraordinarily vast number of pearls that, together with coral, rubies and diamonds, were embedded in gold jewelry gifted to adorn temple bronzes? Why did the Cholas cover the walls of their temple walls with inscriptions– some 13,000 in total – using temple walls as if they were the public records office? \nA Q&A session with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-thief-who-stole-my-heart/",
    "keywords": [
      "Culture",
      "Design",
      "Faith",
      "Heritage",
      "History",
      "Society",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-32.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69353-1738407600-1738413000@bangaloreinternationalcentre.org",
    "name": "The Grandeur of Gwalior",
    "startDate": "2025-02-01T11:00:00+05:30",
    "endDate": "2025-02-01T12:30:00+05:30",
    "description": "Gwalior – A Land Where Even a Child’s Cry Finds Tune \nExperience the grandeur of Gwalior, the cradle of Hindustani vocal music, where the echoes of enchanting ragas have resonated through time. Celebrating the legacy of the Gwalior Gharana, the evening promises a mesmerizing journey through a repertoire of compositions in its distinctive style. \nImmerse yourself in the rich tapestry of khayal, khayalnuma, tappa, tap-tarana, bandish ki thumri, bol-banaav ki thumri, and ashtapadi, each capturing the essence of this unparalleled tradition. The performance will be interwoven with anecdotes, stories of legendary masters, and rare compositions passed down through generations, showcasing the journey of this music from the courts of kings to the embrace of the common folk. \nRuturaj Kolpe, a disciple of Vidushi Dr. Meeta Pandit, will present this morning concert in an intimate baithak setting, accompanied by Shantanu Deshmukh on the tabla and Vighnesh Bhagwat on the harmonium. This is an invitation to step into a time warp, where the echoes of a bygone era and the majesty of Gwalior’s musical heritage come alive. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-grandeur-of-gwalior/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Grandeur of Gwalior"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-31.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "69842-1738494000-1738503000@bangaloreinternationalcentre.org",
    "name": "ಕನ್ನೇಶ್ವರ ರಾಮ | Kanneshwara Rama",
    "startDate": "2025-02-02T11:00:00+05:30",
    "endDate": "2025-02-02T13:30:00+05:30",
    "description": "\nKannada with (English Subtitles) | 1977 |118 minutes  \nMovie star Gajasimha becomes a successful politician despite gangster Thimmaya’s traps. Karate expert Avinash and foreign secret agent Mary work to expose the criminals. \nThis month’s film featured in our informal film club is ಕನ್ನೇಶ್ವರ ರಾಮ | Kanneshwara Rama (1977) \nBased on S. K. Nadig’s novel “Kannayya Rama,” the 1977 Kannada political film “Kanneshwara Rama” was directed by M. S. Sathyu as his second feature after “Garm Hava.” The film premiered at the International Film Festival of India and achieved both critical and commercial success during its 1989 theatrical release, completing a 100-day run. The film features an ensemble cast including Anant Nag, Shabana Azmi (in her Kannada debut), and Amol Palekar. \nSet in 1920s India, the story follows Kanneshwara Rama, a defiant peasant who becomes a legendary outlaw after confronting local injustice. After a prison stint where he encounters Gandhi’s followers, he joins and eventually leads a group of bandits, becoming a Robin Hood-like figure who aids the poor and challenges feudal authority. His journey is complicated by his relationship with Malli, a former bandit’s mistress, and his growing ambition to establish his own principality. \nThe film, which was later screened at the 2017 Bengaluru International Film Festival, explores themes of rebellion, justice, and loyalty against the backdrop of India’s independence movement. Through Rama’s transformation from peasant to folk hero, it examines the complex relationship between individual leadership and collective causes. \nDirection & Production \n\nDirector: M. S. Sathyu\nProduction Company: Sharadha Movie Productions\nProducers: Moola Brothers\n\nWriting \n\nBased on the novel by: S. K. Nadig\nScreenplay: S. K. Nadig\n\nCast \n\nAnant Nag as Kanneshwara Rama\nShabana Azmi as Malli\nAmol Palekar as Dacoit Chenneera\nB. V. Karanth as Junja\nShimoga Venkatesh as Narayanappa\nC. R. Simha as Police officer at Jail\nTom Alter as British Police officer\n\nVoice dubbed by C.R. Simha\n\n\n\nTechnical \n\nCinematography: Ishan Arya, Ashok Gunjal\nEditing: S. Chakravarthy\nMusic: B. V. Karanth\nLyrics: N. Kulkarni\n\nAbout B•Cinematic \n\nCalling all cinephiles! BIC is thrilled to present B•Cinematic, an initiative dedicated to celebrating the most essential, impactful, and artistically significant cinematic works from across the state and the country. \nAt B•Cinematic, our mission is to curate and share those remarkable films that is a must-watch (or re-watch) experience for every passionate cinema lover. From groundbreaking classics to under-appreciated gems, our carefully curated selection will take you on an unparalleled (pun not intended) cinematic journey through the ages. \nThrough curated screenings, insightful discussions, and engaging analyses from distinguished cinematic voices, we aim to not only watch these films together but to truly appreciate their craftsmanship, cultural impact, and intellectual depth. Our vibrant community of film aficionados will collectively rediscover Indian cinema’s most stunning and enduring masterpieces. \nSo join us on this quest to experience the films that have defined and redefined the art form. Don’t miss out on crossing these essential works off your bucket list. Because to truly live, you must first watch the films that make life worth living. \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%95%e0%b2%a8%e0%b3%8d%e0%b2%a8%e0%b3%87%e0%b2%b6%e0%b3%8d%e0%b2%b5%e0%b2%b0-%e0%b2%b0%e0%b2%be%e0%b2%ae-kanneshwara-rama/",
    "keywords": [
      "Film",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "ಕನ್ನೇಶ್ವರ ರಾಮ | Kanneshwara Rama"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-707.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69560-1738089000-1738094400@bangaloreinternationalcentre.org",
    "name": "Swept Away : Being in the Moment",
    "startDate": "2025-01-28T18:30:00+05:30",
    "endDate": "2025-01-28T20:00:00+05:30",
    "description": "Despite what many people think, India is a land of constant change, innovation and movement. Ephemerality and constant adaptation are woven into Indian philosophies, religions, and customs – whether darshan with a deity, drawing with powdered rangoli or kolams in the early morning, chanting a mantra, practicing yoga, immersing oneself in Aarthi or in offerings to the Divine. Each requires a pause in the rush of daily life. Duty to others, to society, and to the future, is suspended for the moment of being present. \nStephen Huyler has spent his life observing and listening, mesmerized by these very Indian expressions, resulting in six illustrated books, and over 25 museum exhibitions abroad as well as in India. \nThis session draws on Huyler’s book Transformed By India, exploring his many encounters, from maharajahs to musicians, Dalits to Brahmins, politicians to potters, from layered traditions to recent innovations, of India’s momentary arts. \nStephen Huyler will be in conversation with Sandhya Mendonca. This will be followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/swept-away-being-in-the-moment/",
    "keywords": [
      "Books",
      "Nonfiction",
      "Philosophy",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-700.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69856-1738407600-1738519200@bangaloreinternationalcentre.org",
    "name": "Sci560 Film Festival",
    "startDate": "2025-02-01T11:00:00+05:30",
    "endDate": "2025-02-02T18:00:00+05:30",
    "description": "Explore Bengaluru’s scientific, cultural, and urban heritage through the lens of cinema at the Sci560 Film Festival! \nThis two-day event features a lineup of thought-provoking films, including Down the Drain by Nitya Misra and In Search of Gold by Basav Biradar, each followed by insightful discussions with the filmmakers and experts. The festival highlights stories of the city, its environmental challenges, and its historical legacy, offering a unique perspective on Bengaluru’s multifaceted identity. \nEnd each day with engaging activities, including a Bengaluru-themed quiz and a virtual scavenger hunt to test your curiosity and knowledge. This festival is part of Sci560: Science in the City, an ongoing exhibition exploring the city’s history through a military-industrial-academic lens. Don’t miss this cinematic journey celebrating the spirit of Bengaluru! \nFestival Schedule: Download the full schedule here. \nDay 1 | 1 Feb | Saturday | 11:00 am – 6:00 pm \n11:00 am – 10:05 am: Opening remarks \n11:05 am – 11:27 am: Down the Drain\nDocu-fiction | English and Kannada | India | Nitya Misra\nThis is a documentary-fiction film about Bangalore’s sewage, told from the perspective of a woman who accidentally flushes a watch down the toilet. In tracing the journey that the watch takes from the toilet, the woman gets glimpses into the pipes and people that make up the sewage system in the city, and observes the system as well as its parts through conversations with different people. \n11:27 am – 12:00 pm: Discussion with Nitya Misra and Veena Srinivasan \n12:00 pm – 12:05 pm: Introduction by Usha Rao and Gautam Sonti \n12:05 pm – 1:32 pm: Our Metropolis\nDocumentary | English, Kannada, Tamil, Telugu, Hindi | India | Gautam Sonti and Usha Rao \n1:32 pm – 2:15 pm: Break \n2:15 pm – 2:18 pm: A Stroke of Genius\nDocumentary Short | English | Vishnu Tenkalya \n2:18 pm – 2:23 pm: HeadbangerLore\nDocumentary Short | English | Devadri Bhattacharya and Shrivathsa Srikanth \n2:23 pm – 2:28 pm: Madiwalas of Bangalore\nDocumentary Short | English and Kannada | Rehaan Diaz \n2:28 pm – 2:33 pm: Letter by Letter\nDocumentary Short | English | Pooja Saxena \n2:33 pm – 2:38 pm: Reviving Legends\nDocumentary Short | Kannada | Sharan G C \n2:15 pm – 2:18 pm: Tale of Two Wheels\nDocumentary Short | English and Kannada | Jayavartheni Krishnakumar, Namrata Narendra and Suraj Devaraj \n2:42 pm – 3:16 pm: A Family in Bangalore \nDocumentary | English | India | Paul Zills \n3:16 pm – 5:26 pm: Pushpaka Vimana\nFeature | NA | India | Singeetam Srinivasa Rao \n5:30 pm – 6 pm: Bengaluru Snap Hunt \n\nDay 2 | 2 Feb | Sunday | 11:00 am – 6:00 pm \n11:00 am – 11:36 am: Tracing the Arc\nDocumentary | English | India | Pankaj Bhutalia \n11:36 am – 11:45 am: Anatomy + Humanities: The Animated Life of SL Bhatia\nDocumentary Short | Kannada | India | Meera K \n11:45 am – 11:50 pm: Introduction by Gautam Sonti and Carol Upadhya \n11:50 am – 12:18 pm: Fun @ Sun\nDocumentary | English | India | Gautam Sonti and Carol Upadhya \n12:18 pm – 12:23 pm: Introduction by Gautam Sonti and Carol Upadhya \n12:23 pm – 12:49 pm: July Boys\nDocumentary | English | India | Gautam Sonti and Carol Upadhya \n12:49 pm – 1:15 pm: Discussion with Gautam Sonti and Carol Upadhya \n1:15 pm – 2:00 pm: Break \n2:00 pm – 2:34 pm: In Search of Gold\nDocumentary | Tamil and English | India | Basav Biradar \n2:34 pm – 3:00 pm: Discussion with Basav Biradar, Nirmal Raj and Palahalli Vishwanath \n3:00 pm – 3:05 pm: Babasaheb in Bangalore\nExperimental short | English and Kannada | India | Mahishaa \n3:05 pm – 3:07 pm: Kaathu Mela Kuppai Keezha\nExperimental short | Kannada | India | Group4 \n3:07 pm – 3:24 pm: Presence\nDocumentary short | English, Hindi and Kannada | India | Ekta Mittal and Yashaswini Raghunandan \n3:24 pm – 4:00 pm: Distance\nDocumentary | English, Hindi and Kannada | India | Ekta Mittal and Yashaswini Raghunandan \n4:00 pm – 4:40 pm: Above the Din of Sewing Machines\nDocumentary | Kannada | India | Surabhi Sharma \n4:40 pm – 5:00 pm: Break \n5:00 pm – 6:00 pm: Bengaluru Quiz: How Well Do You Know the City? \n\nInteractive Installations | 1 & 2 Feb | Sat & Sun | 11:00 am – 6:00 pm \nStick-er-alli Bengaluru: Mark your Bengaluru! Add stickers to a giant city map to highlight your most frequented areas and spots. \nHale Bengaluru, Fresh Memories: Share your oldest Bengaluru memory on a post-it and stick it to our wall of nostalgia! \nCity Soundscapes: Capture Bengaluru in 10 seconds! Record and upload your city’s sounds to create an audio collage. Listen to how our city sounds! \nTime Capsule: Bengaluru 2025: Leave a little piece of 2025 behind! Add notes, photos, or objects to our time capsule for future Bengalureans. \nIn collaboration with: \n \nScience Gallery Bengaluru (SGB) is a not-for-profit public institution for research-based engagement targeted at young adults working at the intersection of the human, natural, and social sciences, and engineering, art, and design. SGB’s public engagement model moves beyond participation, and towards proactive involvement through ever-changing research festivals anchored by interdisciplinary exhibitions, programmes, and public events consisting of research-based engagements led by artists and scholars from diverse backgrounds. SGB is established with the founding support of the Government of Karnataka and three academic partners—Indian Institute of Science, National Centre for Biological Sciences, and Srishti Institute of Art, Design and Technology. \n",
    "url": "https://bangaloreinternationalcentre.org/event/sci560-film-festival/",
    "keywords": [
      "Bangalore",
      "Cities",
      "Culture",
      "Film",
      "Heritage",
      "History",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "te",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-708.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69716-1739646000-1739651400@bangaloreinternationalcentre.org",
    "name": "All We Imagine as Khayal",
    "startDate": "2025-02-15T19:00:00+05:30",
    "endDate": "2025-02-15T20:30:00+05:30",
    "description": "Hindustani (North Indian Classical) Music is a 2,000 year-old tradition that has thrived despite the onslaught of invasions and uprisings – while constantly evolving into new forms. ‘Khayal’, meaning ‘Imagination’, is the art of improvising and elevating content, with the classical compositions as a core. \nAshwin, Abhay and Gaurav will take you on a time-lapsed journey to and through Hindustani music in its various forms, while pulling back the curtain and providing context through the imagery of this timeless tradition. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/all-we-imagine-as-khayal/",
    "keywords": [
      "Heritage",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "All We Imagine as Khayal"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-702.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69739-1739903400-1739908800@bangaloreinternationalcentre.org",
    "name": "Exploring the Temples of the Deccan",
    "startDate": "2025-02-18T18:30:00+05:30",
    "endDate": "2025-02-18T20:00:00+05:30",
    "description": "Of all regions of India, the Deccan has the most diverse architectural traditions, nowhere better shown than in the variety of stone temples sponsored under a succession of dynasties which ruled peninsular India over some 700 years. To illustrate this unique diversity, Michell explores religious monuments at lesser-known sites. He begins with Early Chalukya temples overlooking the Tungabhadra river at Alampur, and ends with the imposing Kakatiya monument at the out of the way village of Palampet, both in Telangana. In between, he discusses the Nolamaba period shrines at Nandi and Shravana Belgola, and those of the Later Chalukyas at Sudi, Kuruvatti and Lakkundi, all in Karnataka. He concludes with the little visited Hoysala period shrines at Belavadi, Mosale and Agraha Bachhahalli. \nThe lecture will be followed by a Q&A Session with the audience. \nImage credit – Surendra Kumar \nIn collaboration with:\n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/exploring-the-temples-of-the-deccan/",
    "keywords": [
      "Architecture",
      "Design",
      "Faith",
      "Heritage",
      "History"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-705.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69200-1738089000-1738096200@bangaloreinternationalcentre.org",
    "name": "Aradhana Saraswati",
    "startDate": "2025-01-28T18:30:00+05:30",
    "endDate": "2025-01-28T20:30:00+05:30",
    "description": "The concert pays homage to the Goddess Saraswati, revered through the ages as the embodiment of the four essentials of a discerning human life: Speech (Vaani), the foundation of communication and expression; Music (Sangeet), the universal language of harmony and emotion; Wisdom (Buddhi), the guiding light of understanding and insight; and Discrimination (Vivek), the power to discern and choose wisely. \nThrough a journey of timeless raags and original compositions, our musicians delve into these eternal qualities, reflecting the grace and profundity that the Goddess represents. This celebration is not just a tribute to Saraswati but a call to connect with the divine essence of creativity, intellect, and balance within us all. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/aradhana-saraswati/",
    "keywords": [
      "Faith",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Aradhana Saraswati"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-698.jpg"
  }
]