[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63497-1725993000-1725998400@bangaloreinternationalcentre.org",
    "name": "Story of an Unknown Indian",
    "startDate": "2024-09-10T18:30:00+05:30",
    "endDate": "2024-09-10T20:00:00+05:30",
    "description": "What does the life of an ordinary working-class Indian look and feel like? \nJoin us for a panel discussion discussing this and more with the author of The Many Lives of Syeda X Neha Dixit and commentator and editor Priya Ramani. \nIn her book The Many Lives of Syeda X  journalist Neha Dixit traces the story of one such faceless Indian woman, Syeda X, from the early 1990s to the present day. What emerges is a picture of a life lived under constant corrosive tension. \nResearched for close to a decade, in this book, we meet an unforgettable cast of characters for whom displacement, tragedy and hardships are the things they are used to. Written with empathy and deep insight, this book is a portal to a harsh world hidden away from elite Indians. It is the story of untold millions and a searing account of urban life in New India. \nThe discussion will be followed by a Q&A session with the audience. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/story-of-an-unknown-indian/",
    "keywords": [
      "Books",
      "Fiction",
      "Politics",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/POSTER_Thumbnail-copy-3-5.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63812-1727026200-1727031600@bangaloreinternationalcentre.org",
    "name": "Unpacking Economic Freedom in the Constitution",
    "startDate": "2024-09-22T17:30:00+05:30",
    "endDate": "2024-09-22T19:00:00+05:30",
    "description": "This discussion will explore how the Constitution of India frames the concept of economic freedom. We often think of the constitutional guarantee of freedom in terms of the freedom of speech and expression. This discussion moves beyond this framing to examine the oft-ignored aspect of economic freedom for individuals and organisations. \nThe panellists will discuss the balance between state intervention and individual economic rights, exploring issues like onerous licensing and compliance requirements for businesses, property rights and the right to trade occupation, profession and business. They will also discuss the evolving interpretation of these rights by the judiciary and how constitutional provisions have shaped economic policies and reforms in India over time. \nThis session is the second in the series titled ‘We the People’ to celebrate 75 years of our Constitution. As part of this series, DAKSH, in collaboration with BIC, are organising a series of lectures and panel discussions on various aspects of the Constitution. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/unpacking-economic-freedom-in-the-constitution/",
    "keywords": [
      "Development",
      "Economics",
      "Governance",
      "Policy & Regulation",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63616-1726599600-1726605000@bangaloreinternationalcentre.org",
    "name": "Patterns in Time",
    "startDate": "2024-09-17T19:00:00+05:30",
    "endDate": "2024-09-17T20:30:00+05:30",
    "description": "A piece of music can be considered a pattern in time… the strange thing is that it doesn’t really exist until it is being played… A great work also captures something of the era in which it was written and then travels through time via aural tradition… or in notated form to be performed hundreds of years later. \nPatterns in Time, a range of music from the 16th century to the present, takes the audience through a journey not only through time but also through geographies and cultures from all over the world. \nThe concert begins with Spanish music inspired by the Andalusian flamenco tradition and will proceed to Renaissance and Baroque standards by Dowland, Scarlatti and Bach. This will be followed by an extended and programmatic avant garde composition by the guitar virtuoso Pavel Steidl. \nThe second half of the recital will set off with some refreshingly tropical South American music and some tunes by Indian composers. This will be followed by music inspired by Turkey and end with Shamal, an improvisatory piece consisting of extended techniques and percussion featuring a blend of sonorities and rhythms from the Middle East and the Indian subcontinent. \n \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/patterns-in-time/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Patterns in Time"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-590.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63625-1727004600-1727010000@bangaloreinternationalcentre.org",
    "name": "Sitar Stories: Weaving the Past and Present in Music",
    "startDate": "2024-09-22T11:30:00+05:30",
    "endDate": "2024-09-22T13:00:00+05:30",
    "description": "This session presents an enthralling journey through the rich history of the sitar, beginning with its origins and evolution across centuries. The performance explores the sitar’s creation from natural elements, merging Persian and Indian musical traditions to symbolize its sacred and timeless nature. As the sitar travels through royal courts, it becomes a symbol of refinement and cultural prestige, before eventually establishing itself as a central instrument in Indian classical music. This concert highlights the transformation, showcasing the sitar’s rise as a solo instrument and its deep connection to Indian music. \nHonoring the contributions of legendary sitarists like Ustad Vilayat Khan and Pandit Ravi Shankar, this performance will illustrate their groundbreaking innovations that shaped the sitar’s modern identity and global influence. From classical Indian ragas to cross-cultural experiments, the sitar’s role in contemporary music will be explored, demonstrating its versatility and ongoing relevance in world music. Through a blend of storytelling and music, this performance celebrates the instrument’s enduring legacy and its profound impact on both classical and global music. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sitar-stories-weaving-the-past-and-present-in-music/",
    "keywords": [
      "Culture*",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sitar Stories: Weaving the Past and Present in Music"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-591.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63911-1728039600-1728849600@bangaloreinternationalcentre.org",
    "name": "Karri-Djarrk-Durrkmirri (Karri – We, Djarrk – Together, Durrkmirri – Work)",
    "startDate": "2024-10-04T11:00:00+05:30",
    "endDate": "2024-10-13T20:00:00+05:30",
    "description": "Bábbarra Women’s Centre, in collaboration with Tharangini Studio, presents a collection of woodblock textiles, supported by the Australian Government’s Centre for Australia-India Relations. “Karri-djarrk-durrkmirri,” meaning “we work together” in the Kuninjku language of West Arnhem Land, embodies the collaborative spirit of this exhibition, which blends heritage Indian textile traditions with culturally significant designs by Indigenous Australian women. \nBased in remote Maningrida, 500 km east of Darwin, Bábbarra Women’s Centre is dedicated to producing unique screen printed and Lino printed textiles that tell the stories of West Arnhem Land—its people, traditional foods and spiritual beings like yawkyawk (mermaids). Since its inception in 1987 as a women’s refuge, the Centre has supported women’s economic and social development. \nTharangini Studio, a women-owned woodblock printing studio, shares a commitment to craftsmanship and sustainability. Curators Prithi Pais and Anshu Arora have worked closely with director, Padmini Govind to interpret the complex design briefs of the Babbarra women and add their expertise in ethically sourced fabrics, natural dye and repeat patterns. \nKarri-djarrk-durrkmirri is an example of the beautiful artwork that can be created when Australia and India work together. Twenty-one unique textiles made from 77 individual woodblocks will be displayed. The woodblock designs were created by Bábbarra Women’s Centre artists over 20 years and reinterpreted into woodblocks by Tharangini Studio artisans. The fabric was produced under curatorial direction of Prithi Pais and Anshu Arora and Jessica Stalenberg in liaison with Bábbarra Women’s Centre. The exhibition also features embroidery by Porgai women artisans and a film by Indian-Australian filmmaker Naina Sen with photographer Anahita Ananth. \nThe exhibition is open to all, at the BIC Gallery, from 4th October to 13th October 2024. Artist talks with visiting artists from Australia will be held on Friday, 4th October and Saturday, 5th October at 11:30am. \nThis marks Bábbarra’s second exhibition at BIC, following their successful Jarracharra (Dry Season Winds) tour across India in March 2023, supported by the Kolkata Consul-General. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/karri-djarrk-durrkmirri-karri-we-djarrk-together-durrkmirri-work/",
    "keywords": [
      "Textiles",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-597.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63157-1726167600-1726174800@bangaloreinternationalcentre.org",
    "name": "Harmonica Magic",
    "startDate": "2024-09-12T19:00:00+05:30",
    "endDate": "2024-09-12T21:00:00+05:30",
    "description": "Many years ago, in Detroit during a chance meeting with Jerry Murad of the Harmonicats, a commitment was made. Sulaiman Jamal met Jerry Murad at a harmonica convention, and he asked Sulaiman to continue playing the chromatic harmonica. He highlighted the versatility and beauty of the small instrument. That was Sulaiman’s motivation and inspiration to continue playing the unique instrument which he had actually put in cold storage. \nWhile Jerry had passed away many years ago, Sulaiman was reminded by a mutual friend that he had not fulfilled Jerry’s request – This concert is to do just that. \nThe theme of the concert is to cover some of the greatest Broadway and cinema themes, mainly from yesteryear which have warmed our hearts. \nThe evening will include favourites from Phantom of the Opera, The Wizard of Oz, Jesus Christ Superstar, Fiddler on the Roof and more. Not to forget the classics from The Beatles, Leonard Cohen, Simon and Garfunkel, and Big Band and Blues numbers. \nWith a group of extremely talented and accomplished musicians, the evening can’t be anything but memorable. The magic of the Harmonica and an incredible music ensemble awaits you. \nPresented by: \n \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/harmonica-magic/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Harmonica Magic"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-2_POSTER-17.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "63719-1726398000-1726407000@bangaloreinternationalcentre.org",
    "name": "The Golden Thread",
    "startDate": "2024-09-15T11:00:00+05:30",
    "endDate": "2024-09-15T13:30:00+05:30",
    "description": "2022 | 86 min | Hindi and Bengali with English Subtitles | India \nAt the outskirts of Kolkata, the banks of the river Hooghly are lined with jetties and huge factories in various states of operation and decay. Some industrial chimneys belch smoke while others have trees growing out of them. This is the landscape of West Bengal’s 165-year-old jute industry, which once produced the ubiquitous gunny bags, rope, and jute textiles used by trade and commerce around the world. Almost all of these functions have been largely replaced by plastic, which is perhaps more durable but certainly environmentally disastrous. \nNearly forgotten, the jute industry is attracting renewed interest in the golden fibre due to its eco-friendly qualities. At the same time, the jute industry is in turmoil. A few mills remain in operation, with frequent shutdowns and lockouts to replace workers with precision machines. Can environmental concern recuperate a future for jute and for jute workers while there is still time? \nThe Golden Thread contemplates itself as a product of an encounter between jute workers, early industrial machines, and jute fibre. What was an unwanted fibre for 50 years is now being hailed as the ‘fibre of the future’. The act of filming is an act of archiving –documenting a past that has continued into the future, fade away. \nFilmmaker Nishtha Jain will be in conversation with Gautam Sonti after the screening. A Q&A session with the audience will follow. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-golden-thread/",
    "keywords": [
      "Film",
      "Heritage",
      "Textiles"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "bn",
    "workPresented": {
      "@type": "Movie",
      "name": "The Golden Thread"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-592.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63923-1726511400-1726516800@bangaloreinternationalcentre.org",
    "name": "The Road Not Taken",
    "startDate": "2024-09-16T18:30:00+05:30",
    "endDate": "2024-09-16T20:00:00+05:30",
    "description": "Join us for a discussion based on the book Poles Apart: The Military and Democracy in India and Pakistan. This session delves into the starkly different roles played by the military in the political landscapes of India and Pakistan, and how these choices have shaped the democratic trajectories of both nations. While Pakistan’s history is marked by frequent military interventions that have hindered its democratic development, India’s military has remained notably apolitical, even in moments of crisis such as the 1962 Sino-Indian War, the Emergency, and Operation Blue Star. \nExplore the critical moments where India’s military could have intervened but chose to uphold democratic principles, contrasting with Pakistan’s history of military dominance in politics. The discussion will also include insights into Bangladesh’s unique experiments with democracy and military rule. This session offers a rare opportunity to understand how the military’s influence—or restraint—can define a nation’s political destiny. \nThe author, Aditya Sondhi will be in conversation with Journalist, Aunohita Mojumdar. A Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-road-not-taken/",
    "keywords": [
      "Books",
      "Defence & security",
      "Governance",
      "History",
      "Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-596.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63976-1726398000-1726405200@bangaloreinternationalcentre.org",
    "name": "First Light",
    "startDate": "2024-09-15T11:00:00+05:30",
    "endDate": "2024-09-15T13:00:00+05:30",
    "description": "The First Light concert and conversation series present young Hindustani and Carnatic musicians in an intimate, informal and interactive setting. Presented on a Sunday morning, these thoughtfully curated concerts will feature a group of young, emerging musicians who are talented, sensitive and capable of independent thinking and critical enquiry, from across India. \nThey will attempt to engage with their respective lineages and the traditional as well as the lesser performed material they have received, in distinctive ways. The musicians are encouraged to present a repertoire that reflects their long years of training, core aesthetic influences and values as well as their individual outlooks and interpretation. \nThe young musicians are also encouraged to interact with their listeners and explain the nuances of the music and its cultural history as a way of learning communication skills and investing in the building of audiences for the form early on in their careers. This concert too will be accompanied by a component of conversations. \nThese concerts and conversations featuring young musicians are a part of Kishima Arts Foundation’s Indian Classical Music & Performing Arts Public Digital Archive Project 2022-28 which seeks to document Gurus/senior artists and also encourage younger, talented classical musicians to delve deeper into their traditions to try and present lesser performed and exquisite compositions along with stories of their respective lineages. \nIn its fifth edition, the series presents a group of Carnatic musicians from Chennai and Bangalore. \nIn collaboration with: \n \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/first-light-5/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "First Light"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-601.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64055-1725993000-1725998400@bangaloreinternationalcentre.org",
    "name": "Lights, Camera, Accountability!",
    "startDate": "2024-09-10T18:30:00+05:30",
    "endDate": "2024-09-10T20:00:00+05:30",
    "description": "In response to growing concerns about sexual harassment and gender discrimination in the Malayalam film industry, the Kerala government constituted the Justice Hema Committee in 2017. Led by retired judge Justice K. Hema, along with actress Sharada and former bureaucrat K.B. Valsalakumari, the committee was tasked with investigating the working conditions of women in the industry and recommending measures to improve safety and gender equity. \nThe Women in Cinema Collective (WCC), a group founded by women in the Malayalam film industry, played a crucial role in highlighting these issues. Formed in the wake of a high-profile assault case involving a leading female actor, the WCC advocated for the safety and rights of women, pushing for systemic reforms and engaging with the committee to provide testimonies and insights. Their efforts were instrumental in the establishment of the committee and the shaping of its recommendations, which called for systemic changes to address harassment, exploitation, and the lack of representation of women in leadership roles within the industry. \nThis session is an attempt to dive deep into and critically examine the Justice Hema Committee report, its findings and its implications for the Kannada entertainment industry. This two-part event aims to foster open dialogue about industry practices and explore solutions for a safer, more equitable work environment. \nThe evening begins with lawyer Ashwini Obulesh presenting a primer on the report’s key findings, making them accessible to a general audience. This will be followed by a panel discussion featuring prominent practitioners and stakeholders from Kannada film, television, and theatre, moderated by Kirtana Kumar. \nPanelists will discuss current industry challenges, potential solutions, and provide a blueprint for implementing safeguarding measures. This event seeks to raise awareness, catalyse meaningful change, and offer a model for addressing similar issues in other regional entertainment sectors. \n",
    "url": "https://bangaloreinternationalcentre.org/event/lights-camera-accountability/",
    "keywords": [
      "Culture*",
      "Gender",
      "Media",
      "Policy & Regulation"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "ml",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/LCA.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63385-1726254000-1726259400@bangaloreinternationalcentre.org",
    "name": "Her Voice",
    "startDate": "2024-09-13T19:00:00+05:30",
    "endDate": "2024-09-13T20:30:00+05:30",
    "description": "Her Voice by SaMaRaSa is an exploration of compositions that are created by women, or about women, set in the context of a Carnatic concert, but with a novel approach. The musicians explore the nuances of the raga, lyric and soul of the composition, while sharing what each piece means to them personally as women and artistes. Interspersed with spoken word and poetry, this concert will be an intimate yet exciting journey into the world of raga and rhythm. They will share inspirational stories of fearless artistes who conquered barriers within and without to leave a lasting legacy. \nPresenting the concert are three accomplished musicians – Manasi Prasad (vocals), Aditi Krishnaprakash (violin) and Deepika Sreenivasan (mridangam) who have travelled the world sharing their music. In addition, their academic and corporate credentials have enabled them to develop a world view that is unique, contemporary and relevant. \n‘SaMaRaSa’ – Sisters in Harmony, is a collective of women musicians who believe that music not only entertains and elevates, but can also create change. Through performances and ideas that celebrate women, SaMaRaSa aims to bring fresh ideas to the way Carnatic music is presented and performed. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/her-voice/",
    "keywords": [
      "Gender",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Her Voice"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-587.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "63762-1726858800-1726862400@bangaloreinternationalcentre.org",
    "name": "The Earthquake",
    "startDate": "2024-09-20T19:00:00+05:30",
    "endDate": "2024-09-20T20:00:00+05:30",
    "description": "\n54 minutes | English, Hindi, Kannada | Suitable for 13+ Years\nTrigger Warnings: Themes of Loneliness \n\n\n\n\nDo you ever feel alone, even when surrounded by people? Do you crave connection, even when it cracks a little? \nMira and Sameer meet every week, their meeting as familiar as the apple they share. They speak. Someone leaves. They do this again. And again. Mira goes on a boat ride. Sameer stays in a bubble. There is silence. And again. Mira and Sameer are friends… Yet, their unspoken words scream louder than their conversations. \nThis is a story of cycles. Of coming together, drifting apart, and all the spaces in between. \nWhat happens when we finally face our truth? Maybe we hear a strange noise… \nThis is an adaptation of “Bhūmikampa – Das Erdbeben” which received funding for International Cultural Projects from The Department of Arts and Culture of the City of Munich \n\n\nFrom the Playwrights (Samragni Dasgupta and Marvin Krause):\nTwo young artists from India and Germany meet on a farm in Bengaluru as part of an exchange program. They get to know each other and realise that cultural differences are just one aspect of human connection. They come together to develop something together. But what?The idea for this collaboration started with a conversation about loneliness. Above all, how loneliness is a common factor for young people in all countries. From loneliness to the intricacies of human relationships, two people began an intensive writing process to explore the many facets of human connection.\n\nFrom the Director:\n“Mira and Sameer find themselves on a bench, surrounded by unspoken words. ‘The Earthquake’ delves into the essence of human relationships—our connections, routines, distances, and all the spaces in between. It asks us what it means to be truly seen or heard. What happens when we finally face the unspoken truths in our interpersonal relationships?”\n\n\n  \nCredits: \nPlaywrights: Marvin Krause and Samragni Dasgupta\nDirector: Samragni Dasgupta \nCast: \nMira: Yamuna Kali\nSameer: Naman Roy \nThe Earthquake received the Internationaler Kulturprojekte Grant 2023 from the Landeshauptstadt München Kulturreferat (City of Munich). \nProduced by     \n\nWith Support from \n\n \n\n",
    "url": "https://bangaloreinternationalcentre.org/event/the-earthquake/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "The Earthquake"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-599.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63449-1726081200-1726086600@bangaloreinternationalcentre.org",
    "name": "Ardha | The Incomplete Dream",
    "startDate": "2024-09-11T19:00:00+05:30",
    "endDate": "2024-09-11T20:30:00+05:30",
    "description": "Ardha – The Incomplete Dream is a solo work born out of a collection of essays contained in the book, Finding Radha by Namita Gokhale and Malashri Lal. Weaving together Bharatanatyam and spoken word, Ardha looks at Radha as the ‘adhara’ in whom the essence of Krishna is held. Beyond her oft-recognized status as Krishna’s lover and his chosen gopi, Radha is ‘Hladini Shakti’ – the potency that is half of Krishna, their spirits engaged in perpetual ‘Lila Hava’- the exchange of ornaments, attire, and souls. \nCould Radha be an illusion that, through her dhara (flow) of joy and pain in union and separation, symbolizes the yearning for something beyond, a yearning that exists in every human? What happened to Radha after Krishna left Mathura? Why is Krishna celebrated while Radha, is a mere shadow in her aradhana to him? \nCredits:  \n– Concept, Choreography, Dance, Spoken word: Vidhya Subramanian \n– Music Composition: Shreya Devnath \n– Sound track produced at Resound India and mixed and mastered by Sai Shravanam \n– Musicians: Keerthana Vaidyanathan, Shreya Devnath, Sivaprasad, Sruti Sagar, Sai Shravanam, Manonmani, Vidhya Subramanian \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/ardha/",
    "keywords": [
      "Dance",
      "Mythology",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-16.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63738-1726311600-1726320600@bangaloreinternationalcentre.org",
    "name": "Rivers & People: A Disconnect in Times of Scarcity",
    "startDate": "2024-09-14T11:00:00+05:30",
    "endDate": "2024-09-14T13:30:00+05:30",
    "description": "Bengaluru, India’s economic engine, is a water-starved city. The Cauvery river, its lifeline, is drying up and severely polluted, while the Western Ghats forests, where its waters originate, are rapidly degrading. Yet, the government continues to push for unsound projects like the Mekedatu Dam and Yettinahole Drinking Water project, further damaging the rivers and forests that sustain us. Amid this, the city remains disconnected from its rivers, yet perpetually thirsty. \nThis session will begin with a discussion followed by songs about rivers sung by children and an English adaptation of Komal Swaminathan’s 1980 satirical Tamil play Thaneer Thaneer. Set in a drought-ridden village in Tamil Nadu, the play follows a stranger who helps the villagers harness water against political and natural challenges, showing the power of a community deeply connected to its water sources. \nPaani.Earth, a citizen-led think tank, is dedicated to river conservation. The team will share their efforts to protect the rivers that sustain us. Through this session, they aim to foster a deep understanding and compassion for rivers — crucial for meaningful change. \n",
    "url": "https://bangaloreinternationalcentre.org/event/rivers-people-a-disconnect-in-times-of-scarcity/",
    "keywords": [
      "Bangalore",
      "Environment",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-593.jpg"
  }
]