[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79949-1760293800-1760299200@bangaloreinternationalcentre.org",
    "name": "Sovereigns of the Sea: Omani Ambition in the Age of Empire",
    "startDate": "2025-10-12T18:30:00+05:30",
    "endDate": "2025-10-12T20:00:00+05:30",
    "description": "This talk based on the book, Sovereigns of the Sea. Omani ambition in the age of Empire, views the Indian Ocean as an important political space where both Asian and Western imperial aspirations were articulated in the long nineteenth century. Putting the micro-optic on the Omani Sultans, rather than on European powers, it questions the idea that the Ocean became an uncontested British lake in the age of Empire. It shows how the Sultans made the most of Europeans who made a bee line to the Western Indian Ocean hungry for slaves, cloves, and ivory. They leveraged themselves to European economic concerns and politics, but remained heeled in their own cultural tradition. Many of them reached out to Indian financiers and merchants and articulated clearly their political ambitions. The talk forefronts these Asian imperial ambitions in the Ocean with important implications for the writing of global histories. \nAbout Prof. Satish Chandra \nProf. Satish Chandra (1922 – 2017) was a leading authority on Medieval Indian History. \nIn a career spanning nearly 40 years, Prof. Chandra taught history at Allahabad University, Aligarh Muslim University, Delhi University, Rajasthan University, and finally the Jawaharlal Nehru University (JNU), where along with S. Gopal, Bipin Chandra and Romila Thapar he co-founded the Centre for Historical Studies. \nIn between, from 1972 to 1980 he was first Vice Chairman and then the Chairman of the University Grants Commission. \nIn 1985, along with intellectuals like Prof. Nurul Hasan and marine biologist Dr. Zahoor Qasim, he founded the Society for Indian Ocean Studies which, among other activities, brings out the quarterly Journal for Indian Ocean Studies. \nSon of Sir Sita Ram, India’s first High Commissioner to Pakistan (1947-48), Prof. Chandra has, along with some other JNU historians, been said to have been a ‘left leaning historian’ who espoused the Marxist approach to history, and one whose early experiences helped bridge the intellectual gap in interpreting medieval Indian history and modern times. \n",
    "url": "https://bangaloreinternationalcentre.org/event/sovereigns-of-the-sea-omani-ambition-in-the-age-of-empire/",
    "keywords": [
      "History",
      "In Memory",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-2-7.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80207-1760180400-1760187600@bangaloreinternationalcentre.org",
    "name": "Can the Greater Bengaluru Governance (GBG) Act Deliver for Bengaluru?",
    "startDate": "2025-10-11T11:00:00+05:30",
    "endDate": "2025-10-11T13:00:00+05:30",
    "description": "The Bengaluru Debates: A BIC–Janaagraha Dialogue Series on Urban Governance in Bengaluru and Beyond aims to expand civic space in the city by fostering conversations through a civic lens. The series is designed to be informative, constructive, and entertaining, while also serving as a trigger for local community action. Its objective is to bridge the gap between policy, practice, and public discourse on urban governance challenges, and to catalyse citizen and policymaker engagement towards systemic solutions. \nThe inaugural session will examine: “Can the GBG Act deliver for Bengaluru?”. Enacted in 2025, the GBG Act is a landmark legislation intended to strengthen Bengaluru’s governance. This session will assess whether the Act can deliver on its promise and what it means for the future of the city. \nThe session will open with a context presentation on the Greater Bengaluru Governance Act through a City-Systems Assessment delivered by VR Vachana, Associate Director of Policy at Janaagraha and the Jana Urban Space Foundation. This will lead into a panel discussion on whether the Act can deliver for Bengaluru, featuring Tejasvi Surya, Member of Parliament for Bengaluru South; Rizwan Arshad, Member of the Legislative Assembly for Shivajinagar and Chair of the Joint Select Committee on the Greater Bengaluru Governance Bill, 2024; V Ravichandar, Member of the Brand Bengaluru Committee; and VR Vachana. The discussion will be moderated by Srikanth Viswanathan, CEO of Janaagraha, and will be followed by a Q&A with the audience. \nThrough this series, BIC and Janaagraha seek to build a widely followed platform for civic dialogue, citizen awareness, and informed media narratives on urban issues. \nIn collaboration with: \n \nJanaagraha Centre for Citizenship and Democracy, founded in 2001 in Bengaluru, is dedicated to transforming the quality of life in India’s cities and towns. Their mission is to strengthen the systems of urban governance so that cities can deliver clean, green, safe, and liveable environments for all citizens. For them, “quality of life” is not only about infrastructure and services, but equally about responsive institutions, citizen engagement, and transparent, data-driven governance. \n",
    "url": "https://bangaloreinternationalcentre.org/event/can-the-greater-bengaluru-governance-gbg-act-deliver-for-bengaluru/",
    "keywords": [
      "Bangalore",
      "Governance",
      "Policy & Regulation",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-31-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "80196-1759950000-1759954500@bangaloreinternationalcentre.org",
    "name": "Romantic Visions: Scriabin, Liszt, and Chopin",
    "startDate": "2025-10-08T19:00:00+05:30",
    "endDate": "2025-10-08T20:15:00+05:30",
    "description": "Hailed by CBC Music as one of Canada’s finest young musicians, pianist Tony Yike Yang first captured international attention at just sixteen, when he became the youngest-ever laureate of the International Chopin Piano Competition in Warsaw. Since then, he has appeared in some of the world’s leading concert halls, from Carnegie Hall and the Tokyo Metropolitan Theatre to the Great Hall of the Moscow Conservatory, performing with major orchestras including the Cleveland Orchestra, Warsaw Philharmonic, and Orchestre Métropolitain. \nThis evening, he presents a programme that traces a sweeping arc through the Romantic imagination. Scriabin’s early Preludes open the program alongside his rarely heard Fantasy in B minor. Liszt follows with two contrasting masterpieces: the intimate Sonetto 104 del Petrarca, and the dazzling Mephisto Waltz No. 1, one of Liszt’s most iconic showpieces. The program culminates in Chopin’s Sonata in B minor. Together, these works highlight the Romantic piano’s full expressive range, brought to life by Tony Yike Yang’s artistry. \n \nSupported by: \n    \n",
    "url": "https://bangaloreinternationalcentre.org/event/romantic-visions-scriabin-liszt-and-chopin/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Romantic Visions: Scriabin, Liszt, and Chopin"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-TY1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "80154-1760268600-1760274000@bangaloreinternationalcentre.org",
    "name": "Samyoga – Khayal Se Kriti Tak",
    "startDate": "2025-10-12T11:30:00+05:30",
    "endDate": "2025-10-12T13:00:00+05:30",
    "description": "Shared roots, divergent paths: listen as tradition and expression entwine! \nSamyoga brings together Hindustani and Carnatic music in a rare exploration of sound, emotion, and tradition. Conceptualised and presented by Dr. Radhika Joshi (Hindustani Vocal) and Manasi Prasad (Carnatic Vocal), the performance celebrates both the shared ancestry and the distinctive aesthetics of these classical systems. \nTraversing genres from the gravitas of classical forms to the devotion of Bhakti Sangeet and the lyrical beauty of Thumri and Jawali, each piece highlights how the two traditions converse, diverge, and find harmony. Beyond their mastery as performers, Radhika and Manasi are accomplished researchers, bringing deep theoretical understanding and insight into the evolution, structure, and nuances of Indian music. Through a seamless blend of narration and performance, Samyoga transforms listening into discovery, revealing connections and contrasts that are rarely experienced together. \nA morning of sound, story, and subtle interplay, offering a unique chance to see these two traditions in dialogue. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/samyoga-khayal-se-kriti-tak/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Samyoga – Khayal Se Kriti Tak"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_S-KSK.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "80312-1760266800-1760272200@bangaloreinternationalcentre.org",
    "name": "Super Silly Sunday",
    "startDate": "2025-10-12T11:00:00+05:30",
    "endDate": "2025-10-12T12:30:00+05:30",
    "description": "Step into a world where just about anything can happen! \nIn this improv workshop, children will bring stories to life, play interactive games, and learn to respond creatively in the moment. Our facilitators foster a brave, playful space where mistakes become magic and shy voices grow bold. Perfect for budding actors, storytellers, or simply curious hearts ready to leap into imagination.  \nAs with every Sunday at BIC, every child will leave feeling proud, expressive, and inspired! \nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/super-silly-sunday/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Theatre",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-33-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "79839-1759950000-1759955400@bangaloreinternationalcentre.org",
    "name": "Sounds From the Library (#5)",
    "startDate": "2025-10-08T19:00:00+05:30",
    "endDate": "2025-10-08T20:30:00+05:30",
    "description": "Sounds From The Library returns for its fifth edition! \nAn intimate evening where conversation and performance intertwine in the cozy, listener-focused space of the BIC library. This hybrid series spotlights emerging voices from the Indian music scene, all past longlisted artists from the Toto Awards for Music. \nThis edition hosts RIVU from Kolkata, who is a Progressive Rock Guitarist/Producer and 2018 Longlister, a soundscape that’s as textured as it is emotional. Sharing the stage is The Sine Painter, a Bangalore-based electronic music producer and 2018 shortlister. \nMore than a gig, Sounds From The Library invites audiences into the creative lives of the artists; offering insight into their inspirations, processes, and personal journeys. With music that moves and conversations that linger, this is a rare chance to experience live performance in its most thoughtful form. \n\nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sounds-from-the-library-5/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sounds From the Library (#5)"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-29-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "80405-1760468400-1760473800@bangaloreinternationalcentre.org",
    "name": "Kutiyattam Balivadham",
    "startDate": "2025-10-14T19:00:00+05:30",
    "endDate": "2025-10-14T20:30:00+05:30",
    "description": "When the curtain is removed we see Sugreeva sitting in a mood of deep sorrow and dejection. Sugreeva expresses through hand gestures and facial expression his agonies and his hardships on living alone in a solitary wood. \nSugreeva, for fear of his elder brother Bali, has taken refuge in the Malyavan Mountain. Hounded out of his palace, Sugreeva bemoans his sad lot, living alone in the forest facing the rigours of nature. He sees around him in the forest, a reflection of his own mental state. “My good God, will my miseries never end? Exposed to the sun, drenched by the rains, shivering in the cold and open to the winds, I live in the forest. Would I ever see a normal comfortable life? He decides to take a leaf and tried to go deep into the issue. First he sees that there is no Friend but there is foe. At that time, he sees a deer running away frightened hearing a hunter’s bow. On taking shelter in a cave, it is frightened to see a lion in it. When he takes up the leaf and looks a second time, he sees Friend and foe. In another angle, he sees a snake hiding in a hole fearing Garuda flying in the sky. Then, Hanuman comes and allies with him. Looking a third time, he sees that he has Friend but there is no foe. In a direction, a peacock dances seeing the dark clouds and a forest fire starts. Later he sees that it rains and the fire ends. Then, seeing Rama and Lakshmana on the banks of the river Pamba, he asks Hanuman, Please go and find the truth behind it and kindly bring them here and make them join hands with me. Sugreeva sees Hanuman returning with Rama & Lakshmana .Here, with the fire as witness, the scene of Sugreeva making friends with Rama is acted out. Together with Rama, Lakshmana, and Hanuman, Sugreeva returns to Kishkindha and boldly challenges Bali to battle \nOn the Stage:\nSugreeva: Nepathya Sreehari Chakyar\nMizhavu: Kalamandalam Manikandan, Nepathya Jiensh\nEdakka: Kalanilayam Rajan\nThalam: Dr. Indu G.\nMake-up: Kalamandalam Satheesan\nTroupe: Nepathya, Moozhikkulam \nThis is the seventh edition of the ‘All For Dance’ series presented by Kalavaahini in association with BIC curated by Malavika Sarukkai. The ‘All For Dance’ series is presented every quarter at BIC to spotlight some of the best of classical dance from across India. The event is managed by Shreya Nagarajan Singh Arts Development Consultancy. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/kutiyattam-balivadham/",
    "keywords": [
      "Culture",
      "Dance",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Kutiyattam Balivadham"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-KB.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80138-1760554800-1760559300@bangaloreinternationalcentre.org",
    "name": "Murta Maheswara",
    "startDate": "2025-10-15T19:00:00+05:30",
    "endDate": "2025-10-15T20:15:00+05:30",
    "description": "In a world where we often connect with Lord Shiva through music, dance, and celebration, the concept of Murta Maheswara offers a deeper understanding of this deity. It is a journey to find the essence of Shiva as a carefree, uninhibited, and truthful force within ourselves, rather than through rigid doctrine. \nMurta Maheswara is explored through three key aspects of Shiva’s nature: \nPashupati: This highlights Shiva as the lord of all creatures, a figure revered since ancient times. The seals of Harappa and Mohenjo-Daro depict him surrounded by animals who trust him completely, showing his connection to all beings—fierce and gentle alike. \nShiva-Shakti: This story explores the union of Shiva and Shakti. Shiva represents the passive, foundational energy, while Shakti is the active, creative force. Their cosmic union is a symbol of harmony and regeneration, a sacred bond that is mirrored in the union of man and woman. \nDhwani-Pratidhwani: This concept reveals the origin of sound through Shiva’s cosmic dance. When Shiva strikes his damaru, he creates Dhwani, the primordial sound. This sound then echoes throughout the cosmos as Pratidwani, the manifestation of all audible sound. This illustrates that every sound we hear is part of the divine dance of Nataraja. \nSupported by; \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/murta-maheswara/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-942.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "80121-1761850800-1761856200@bangaloreinternationalcentre.org",
    "name": "Travellers",
    "startDate": "2025-10-30T19:00:00+05:30",
    "endDate": "2025-10-30T20:30:00+05:30",
    "description": "What happens when sound stretches across time, memory, and place? \nAward-winning sarod musician and composer Soumik Datta breathes life into Travellers: a sonic journey that blends the evocative voice of the sarod with ambient soundscapes, spoken word, and Indian classical roots. Layered with field recordings and immersive textures, the performance moves fluidly between moments of stillness and pulse, carrying audiences across the invisible borders that divide lands, people, and memories. Each note unfolds a story, inviting reflection, connection, and wonder. \nPart of Soumik’s Melodies in Slow Motion Tour, the performance reaches concert halls, homes, heritage sites, and schools, touching communities often unheard, and reminding us how music bridges distance and difference. \nAn evening of sound that offers a rare chance to experience music in its fullest depth. \nTravellers is coproduced by Soumik Datta Arts, G5A In Residence & Arts Council England \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/travellers/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Travellers"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-32-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79928-1759863600-1759869000@bangaloreinternationalcentre.org",
    "name": "Magdalana Mariam",
    "startDate": "2025-10-07T19:00:00+05:30",
    "endDate": "2025-10-07T20:30:00+05:30",
    "description": "\nWhat awakens within us when temptation gives way to truth? \nThis performance in chaste Malayalam brings to life Mahakavi Vallathol Menon’s lyrical poem Magdalana Mariam through the timeless vocabulary of Bharatanatyam. The poem narrates the story of Mariam, a woman who rises from poverty to wealth, only to find herself ensnared by pride and desire. One night, a moment of stark realization shatters her illusions, revealing the emptiness of her existence. \nHer encounter with Christ transforms this despair into redemption, and it is this very arc from vanity to awakening, that unfolds on stage. Through evocative abhinaya, intricate rhythm, and the expressive power of Bharatanatyam, the performance turns Vallathol’s poetry into a moving meditation on the possibility of renewal. \nA story of loss, grace, and transformation, waiting to be felt through movement and verse! \n \n \nCredits: \nMusic: Dr. O.S. Arun \nConcept & Choreography: Anjana Anand \nLighting Design: Sneha Sheejith \n \n \n\nSupported by: \n \n\n  \n\n",
    "url": "https://bangaloreinternationalcentre.org/event/magdalana-mariam/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ml",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_MM-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "80176-1759777200-1759783500@bangaloreinternationalcentre.org",
    "name": "Artie’s Festival India",
    "startDate": "2025-10-06T19:00:00+05:30",
    "endDate": "2025-10-06T20:45:00+05:30",
    "description": "Join us for an evening of timeless music spanning the Classical, Romantic, and operatic traditions. \nThe program opens with Mozart’s Sonata for Violin and Piano K. 379, followed by two highlights from Handel’s Giulio Cesare in Egitto: the stately “Ouverture” and the aria “Piangerò la sorte mia.” Three elegant songs by Reynaldo Hahn—Décrets indolents du hasard, L’heure exquise, and La dernière valse—close the first half. \nAfter the interval, Schubert’s expansive Piano Trio No. 1 in B-flat major, Op. 99 takes center stage, before the concert ends on a lighthearted note with Offenbach’s witty operetta numbers: Ah que j’aime les militaires and Tu n’es pas riche, tu n’es pas beau. \nA program of contrasts—poised and playful, intimate and grand—this evening offers a journey through some of Europe’s most beloved musical voices. \nPresented by: \n \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/arties-festival-india/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Artie’s Festival India"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_AFI.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "80174-1760034600-1760043600@bangaloreinternationalcentre.org",
    "name": "ಸಂಗಮ | Sangama | Coming Together",
    "startDate": "2025-10-09T18:30:00+05:30",
    "endDate": "2025-10-09T21:00:00+05:30",
    "description": "67 minutes | Kannada, English and Hindi with English subtitles | Germany, India | 2025 \nOn January 22, 2024, much of India came to a halt as Prime Minister Narendra Modi inaugurated a grand temple to Lord Ram, built on the contested site of a demolished mosque. The spectacle, meticulously staged, gave the ruling party a decisive advantage ahead of the 2024 Indian elections, further splintering an already divided opposition. \nSangama is a powerful portrait of democracy at work in Southern India. The film follows the campaign of Wake-up Karnataka (WK), a citizen-led coalition mobilizing national networks to challenge the decade-long dominance of the BJP. \nJourneying with Team WK, by train, car, and on foot, the film captures their efforts to steer clear of polarizing rhetoric and instead spotlight urgent, everyday issues: unemployment, farmer distress, and the rising cost of essentials. “Our tradition has taught us to love and not hate,” one senior member affirms, encapsulating their ethos. \nFrom intimate community meetings and voter registration drives to the energy of massive political rallies, an intricate mosaic of the Indian election unfolds. Voices from the ground echo the people’s concerns: “Modi may have done a lot for the rich, but daily wagers haven’t benefited at all.” \nAs the summer intensifies, so do the campaigns—and with them, caste-based clashes stirred by political forces. Meanwhile, the Prime Minister amplifies anti-Muslim rhetoric, unsettled that strident Hindu nationalism is losing its appeal. Protests demanding accountability from pliant election officials expose the unevenness of the playing field. Through it all, Team WK persists, moving village to village, booth to booth, ensuring that people cast their votes. \nCommissioned by the Centre for Modern Indian Studies, Göttingen, Germany, the film is part of Election Diaries 2024, a series of nine campaigns across India that celebrate the resilience of democracy. At a time when authoritarian regimes are on the rise and narrow visions of nationhood threaten to erase cultural plurality, Sangama reminds us that an alternative vision of collective resistance and unity endures. \nThe screening will be followed by an interactive discussion with Tara Rao, Noor Sridhar and Mallige Sirimane from Eddelu Karnataka, and filmmaker Sunanda Bhat. The session, moderated by Pooja Prasanna, will conclude with a Q&A with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%b8%e0%b2%82%e0%b2%97%e0%b2%ae-sangama-coming-together/",
    "keywords": [
      "Film",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "ಸಂಗಮ | Sangama | Coming Together"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_DM6-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80257-1760266800-1760272200@bangaloreinternationalcentre.org",
    "name": "Planet of the Apps",
    "startDate": "2025-10-12T11:00:00+05:30",
    "endDate": "2025-10-12T12:30:00+05:30",
    "description": "A cab in five minutes. Groceries in ten. Biryani in twenty.  \nWho really powers your fast, effortless digital life?\n\nOTP Please! (Penguin Random House) uncovers the hidden human stories behind South Asia’s booming app economy. Vandana Vasudevan takes readers into the lives of gig workers racing against the clock, small sellers navigating the algorithm, and the restless customers who keep tapping ‘Order Now.’ From India’s hyperlocal delivery boys to Pakistan’s ride-hail drivers, Nepal’s app startups to Bangladesh’s e-marketplace sellers, the book reveals the invisible ecosystem that fuels our digital ease – and the costs it quietly extracts. \nVandana will be in conversation with Mekin Maheshwari, serial entrepreneur, early Flipkart leader, and Founder & CEO of Udhyam Learning Foundation, exploring the realities, challenges, and humanity behind the apps we use every day. \nAn insightful evening unpacking the human side of technology, offering perspectives that linger long after the screen goes dark. \n",
    "url": "https://bangaloreinternationalcentre.org/event/planet-of-the-apps/",
    "keywords": [
      "Books",
      "Business",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-3-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80230-1760639400-1760647500@bangaloreinternationalcentre.org",
    "name": "Navalny",
    "startDate": "2025-10-16T18:30:00+05:30",
    "endDate": "2025-10-16T20:45:00+05:30",
    "description": "98 minutes | English, Russian and German | 2022 \nEnthralling and intimate, the Oscar-winning documentary Navalny, directed by Daniel Roher, unfolds with the pace of a thriller as it follows Russian opposition leader Alexey Navalny in his quest to identify the men who poisoned him in August 2020. Shot in Germany as the story unfolded, the film offers extraordinary access to the investigation while also portraying Navalny the man—a reformist leader who refuses to be cowed, even by an assassination attempt. \nThe documentary takes viewers inside the meticulous investigation into the shocking poisoning, revealing who was behind it. Navalny’s years-long campaign against corruption among Russia’s elites has earned him powerful enemies, particularly Vladimir Putin, who pointedly refuses to utter his name in public. In August 2020, Navalny was poisoned with a military-grade nerve agent in an elaborate attempt on his life. Despite official denials, independent investigations by Bellingcat, CNN, and others later linked the attack to the Kremlin. \nThe film Navalny is produced by Odessa Rae (RaeFilm Studios), Diane Becker and Melanie Miller (Fishbowl Films), Shane Boris (Cottage M), and Amy Entelis and Courtney Sexton (CNN Films), with Maria Pevchikh as executive producer. \nFollowing the screening, a discussion between Aakar Patel and Swati Dandekar will take place, followed by an audience Q&A. \nPlease note: Director Daniel Roher will not be present. \nViewer discretion: Children under 17 are restricted from viewing the film unless accompanied by an adult. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/navalny/",
    "keywords": [
      "Film",
      "Politics",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-941.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80491-1760725800-1760731200@bangaloreinternationalcentre.org",
    "name": "Antarctica: A Journey in Photographs",
    "startDate": "2025-10-17T18:30:00+05:30",
    "endDate": "2025-10-17T20:00:00+05:30",
    "description": "Step into one of the most remote and pristine places on Earth, without leaving Bangalore. In this immersive session, traveller, photographer, and storyteller Raksha Nagaraj takes you on an unforgettable journey to Antarctica through striking photographs and firsthand narratives of her expedition to the White Continent. \nThe talk reveals Antarctica’s awe-inspiring landscapes, towering icebergs, endless oceans, and surreal stretches of ice that few have ever seen. But it goes beyond scenery. Raksha’s photographs capture extraordinary encounters with wildlife: playful penguins, curious seals, and majestic whales, each image paired with stories that bring their behaviour to life in this extreme environment. \nAdding a scientific dimension, Raksha shares her experience participating in a Citizen Science program, where travellers assisted researchers by collecting plankton samples, studying fjord freshwater impact on seawater, and recording data critical to understanding climate change. These efforts highlight how exploration can meaningfully contribute to global research. Part personal narrative, part visual adventure, this session blends exploration, adventure, science, and storytelling. It reflects the wonder of standing at the edge of the world and the urgency of protecting such fragile ecosystems in a rapidly changing climate. \nJoin us for an evening of discovery, photography, and conversation, and see Antarctica as few have ever experienced it. Irrespective of whether you are an adventurer, nature enthusiast, or simply want to know about this beautiful white continent, this journey promises to inspire and perhaps spark dreams of your own voyage to Antarctica. \n",
    "url": "https://bangaloreinternationalcentre.org/event/antarctica-a-journey-in-photographs/",
    "keywords": [
      "Environment",
      "Photography",
      "Visual Arts",
      "Wildlife"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-Ant.jpg"
  }
]