[
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Aesthetic City",
    "startDate": "2024-07-07T17:00:00+05:30",
    "endDate": "2024-07-07T18:30:00+05:30",
    "description": "Taking the once idyllic “garden city” of Bangalore in southern India as its point of departure, Jisha Menon’s book, Brutal Beauty: Aesthetics and Aspiration in Urban India explores how artists across India engage with urban transformations. The book conveys the affective life of the city through multiple aesthetic projects that express a range of urban feelings, including aspiration, panic, and obsolescence. As developers and policymakers remodel the city through tumultuous construction projects, urban beautification, privatization, and other templated features of “world‑class cities,” urban citizens are also changing—transformed by nostalgia, narcissism, shame, and the spaces where they dwell and work. \nSketching out scenes of urban aspiration and its dark underbelly, Menon delineates the creative and destructive potential of India’s lurch into contemporary capitalism, uncovering the interconnectedness of local and global power structures as well as art’s capacity to absorb and critique liberalization’s discontents. She argues that neoliberalism isn’t just an economic, social, and political phenomenon; neoliberalism is also a profoundly aesthetic project. \nA talk by Jisha Menon will be followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/aesthetic-city/",
    "keywords": [
      "Bangalore, Books, Culture*"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-529.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "Photography Strictly Prohibited",
    "startDate": "2024-07-05T00:00:00+00:00",
    "endDate": "2024-07-08T00:00:00+00:00",
    "description": "Exhibition Opening: Friday, 5 July, 5:30 pm\nTimings: 11:00 am – 8:00 pm\nExhibition on show until Sunday, 7 July \nWalkthroughs:\nFriday, 5 July | 5:45 pm\nSaturday, 6 July | 5:45 pm\nSunday, 7 July | 5:45 pm \nConversations:\nCelebrating Navroze Contractor | Friday, 5 July | 6:30 pm \nScreenings:\nJharu Katha | Friday, 5 July | 7 pm\nदुविधा | Duvidha | Sunday, 7 July | 11:30 am \nPhotography Strictly Prohibited | An Exhibition\nAn exhibition of photographs by Navroze Contractor, thoughtfully curated by Sanjiv Shah, Anuj Ambalal, and Himanshu Panchal, showcases the work of the renowned cinematographer and prolific still photographer. Contractor’s collection of photographs of Jazz musicians is now with the Smithsonian Museum. This exhibition features a selection from over 20,000 images taken over 60 years, many of which have not been previously exhibited. This retrospective reflects Navroze Contractor’s empathetic gaze and his ability to capture the perfect photographic ‘moment’. The curators will be present at the opening. \nCelebrating Navroze Contractor | Auditorium | Friday, 5 July | 6:30 pm\nThe inauguration and walkthrough of the exhibition will be followed by the Release of the book, Photography Strictly Prohibited. Tributes by Sanjiv Shah, Arshia Sattar and Rajesh Nair will be followed by a screening of Jharu Katha (2010), a 64-minute documentary film photographed and directed by Navroze Contractor. \nJharu Katha | 64 mins | 2010 | Documentary\nDrawing on extensive fieldwork in remote corners of rural Rajasthan and the by-lanes of Jodhpur city, this documentary film on the broom, directed by Navroze Contractor, engages in conversation with a wide spectrum of broom-makers. Their struggle for livelihood is intersected with different stories of the broom provided by women and ritual attendants of shrines, traders, municipal sweepers and garbage collectors. Through the counterpoint of their voices, the film covers wide ground in opening the contradictory values and belief-systems of the broom. \nSteeped in the realities of caste, the broom is both a source of livelihood for millions of people and the repository of traditional knowledge. Even so, it stigmatises entire communities through its associations with pollution and untouchability. Highlighting the humiliation and robust survival of India’s most downtrodden caste groups, whose hopes are at once catalyzed and complicated by the politics of reservations, Jharu Katha works towards a larger envisioning of waste in urban India. Bleak and terrifying, this vision questions the endurance of the broom and its capacity to reinvent itself in a ceaseless process of change \nCamera/ Direction: Navroze Contractor\nResearch/ Script: Rustom Bharucha\nEditor: Monisha Baldawa\nAssociate Director: Madan Meena\nProducer: Yugantar \nदुविधा | Duvidha | 82 mins | 1973 | Hindi with English Subtitles\nBased on a Rajasthani folktale retold by Vijayadan Detha, Duvidha is about a merchant’s son, whose relationship with his young bride, Lachhi is thwarted by his work and a ghost who falls in love with her, resulting in the ghost soon impersonating the husband. \nAt its core, Duvidha is a metaphysical exploration of love, desire, and the complexities of human relationships. The ghost’s obsession with Lachhi and his subsequent impersonation of her husband raise profound questions about identity, fidelity, and the nature of love itself. The film invites the viewer to ponder the depths of human longing and the lengths to which one might go to satisfy that longing. \n",
    "url": "https://bangaloreinternationalcentre.org/event/photography-strictly-prohibited/",
    "keywords": [
      "Biography, Film, In Memory, Photography, Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "Photography Strictly Prohibited"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-522.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "Forbidden Love",
    "startDate": "2024-07-17T19:00:00+05:30",
    "endDate": "2024-07-17T20:30:00+05:30",
    "description": "The beauty of Ghazals comes from its lyricism and stories. Dr. Abhinav takes that one step further by curating shows by bringing together storytelling and a musical performance. \nThis concert is an ode to revolution and politics around love and relationships, love contested by the society and legends who went beyond the binary and loved on their terms, through Ghazals, Nazms, Sufi and some semi-classical songs. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/forbidden-love/",
    "keywords": [
      "Gender, Music, Performing Arts, Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Forbidden Love"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-525.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Economics for Kids",
    "startDate": "2024-07-10T18:30:00+05:30",
    "endDate": "2024-07-10T20:00:00+05:30",
    "description": "In a world where inequalities are rising, books are essential for building up the young and the values we pass on to them. Together with illustrator Cheyenne Olivier, 2019 Nobel Prize-winning economist Esther Duflo will present her new series of books which explores the themes of school, health, work, environment and entrepreneurship as they relate to poverty. Designed to to encourage children to ask the right questions and help parents talk about poverty in simple terms, the series aims to break down prejudices and stereotypes associated with poverty in today’s world.   \nThe event marks the launch of the series in English (Juggernaut), Bengali, Hindi, Kannada, Tamil and Marathi (Pratham Books books). \nThe Keynote by Esther Duflo will be followed by a discussion between her and Cheyenne Olivier, moderated by Roopa Pai. Whether you’re an adult or a precocious teenager, join us for an enlightening and inspiring evening! \nIn collaboration with: \n              \n",
    "url": "https://bangaloreinternationalcentre.org/event/economics-for-kids/",
    "keywords": [
      "Books, Economics, Education, Society, Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "bn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-527.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Secularism, Religion and Women",
    "startDate": "2024-07-12T18:30:00+05:30",
    "endDate": "2024-07-12T20:00:00+05:30",
    "description": "This panel discussion is a conversation between two authors who also share a teacher-student relationship. Nivedita Menon will speak on her latest book, Secularism as Misdirection, while Debangana Chatterjee, her student from Jawaharlal Nehru University, will present her first book, Lives of Circumcised and Veiled Women. The intellectual pursuits of two individuals, which converged in classroom discussions once, complete a full circle of knowledge creation. \nThe conversation aims to probe religion and secularism using gender as the focal point. Menon’s title alludes to perspectives from the global South and India. In her argument, secularism performs a “misdirection” as in the performance of a magic trick. It simultaneously hypervisiblises women and religion and obscures caste, capitalism, and the non-individuated, non-rational self.  Chatterjee’s work sheds light on the politics of representation and the process of exoticising women’s bodies in knowledge production; presenting the politics which cloaks the ‘misdirection’. It brings out the intricacies of representational discourses around cultural practices of female circumcision and Islamic veiling. \nThe conversation will be moderated by Rinku Lamba, followed by a Q&A session with the audience. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/secularism-religion-and-women/",
    "keywords": [
      "Books, Faith, Gender, Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-520.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "ಅಮ್ಮ ಮತ್ತು ಸುಹೇಲ್ | Amma Mattu Suhail",
    "startDate": "2024-07-08T19:00:00+05:30",
    "endDate": "2024-07-08T20:30:00+05:30",
    "description": "Kannada | 90 minutes | Suitable for Ages 16+  \nThe play is an ode to queer love. It is a meditation on the values of empathy and dialogue as powerful agents to bring estranged minds together. The narrative traverses through moments of passion, anger, sadness, and love in its raw human element. The characters attempt to interrogate, understand, and acknowledge each other, and in this process, unveil the universality of all emotions as being the same, irrespective of gender and orientation. The play tries to deconstruct and lay open the psychological and emotional baggage of the characters who are but symbols of the divided humanity that we are today. An interfaith gay couple and the mother of one of the characters venture on a journey of understanding one another rather light-heartedly through uncomfortable conversations, only to explore depths which they never knew or imagined would be possible to unearth. \n\n\n\n\nPlaywright/Director’s Note: \nWith the drastic change in the political discourse the world has witnessed in the last few years, one cannot but notice the drastic emergence of an undeniable divide within humanity. There are two segments that appear to be in stark contrast, constantly struggling and fighting with each other. There is a constant othering and exclusion of minorities by the majority in power. During the pandemic, the apathy by the political class at large was glaringly visible and we witnessed in full display the class disparity that envelops our nation. The Hindu – Muslim rhetoric was constantly fed to us through public discourse and hate was offered as a staple diet for even those who refused to be part of it. \nThe artist felt compelled to speak up, believing that love is the only antidote to the vehement poison of hate. They hence decided to write and direct this play that features the love story of a gay couple hailing from the Hindu and Muslim communities. Diversity cannot be celebrated without the intersectionality that makes for the complex mix of the society we are. The play intends to hold the mirror to the microaggressions and biases that consume us all through humor and emotional storytelling. \nWith music, love, and humor, the play tries to unravel the demons of Islamophobia and homophobia in us all. It celebrates the value of empathetic dialogue and honest communication in eradicating hate. Amma mattu Suhail is a tender story of love, acceptance, and possibilities. \nThe artist is a classical musician, writer, and theatre practitioner, and their arts practice is always an amalgamation of these elements. They create out of necessity! Having grown up queer and gender fluid, they struggled to find representation in the Kannada arts scene and were disappointed. They tried to fit in and adapt to the arts “as is” but eventually found it suffocating and had to carve out their own path and create what they wanted to engage with. They strive to bring marginalized voices to the fore and their stories or creations always aim to question and break patriarchal stereotypes and conditioning. Their search is always to find fluidity. Just like their characters either in the plays they have written or in the dance-based compositions they have created, which always traverse through the non-binary nature of gender identity or sexuality, the art they create yearns to find fluidity in form and content. They break the structure and form using non-linear narratives, democratic – secular emotional indulgences, and fluid emotional paradigms. They attempt to convey the grotesque bizarreness of our social existence with humor and the humorous, funny realities that define us through the macabre. \nThey always like to begin with an uncomfortable space and establish familiarity with the unfamiliar. Most importantly, they want their art to be accessible to all class and caste sections of society. They often find it very difficult to mold their form in a way that does not “other” an audience which has no access to learning arts appreciation or delving into abstraction. While they try to abstain from dumbing down their audience, they make it a priority to make their arts inclusive. Having been in circles where art is created and consumed in the same vicious elitist spaces and circles, they yearn to connect to a larger canvas. \nHaving written, produced, and directed three plays, their exploration has always yearned to find that fluidity between sound and silence, prose and poetry, body and realism. They aim to tell more queer stories which are embraced by the mainstream and more mainstream stories which make the queer community feel that they are “seen”. Whilst they are cognizant of the brutal grays that marginalized voices live in, they believe we need more positive representation of these marginalized characters. Their younger queer self wanted to watch happy endings and stories of hope and not just suicide and tragedies. They work only on stories which are fictional retellings of lived experiences and also for these stories to be specifically told in Kannada. Regional languages have the power to automatically place these stories in a certain space while also making sure to remove them from only English-speaking elite spaces. They strive to create work which opens itself to a more vulnerable audience who need to hear, get uncomfortable, and feel ignited towards a spirit of inquiry through these stories. \nThey will be glad if their art is also entertaining but they will never be okay if it is not activism. \nCredits: \nPlaywright – Direction – Music : Karthik Hebbar\nCast: Dr Seetha Kote, B V Shrunga, Arun D T\nLighting: M G Naveen\nProduction Manager: Murali Sreeram\nSubtitles Execution: Chethana Ramesh Srivatsa\nBackstage: Vishak Bharadwaj and Soumya Dixit\nProduced by Dheemahi Theatre \nDheemahi Theatre was born out of the need to create a safe space for new voices. We are a space for the “outsiders”. We have come together to tell stories that have been oppressed and suppressed in other majoritarian spaces. Empathy and humanity are the main focuses of all the work that we create. We as a team thrive on celebrating diversity and secular narratives by exploring and devising new techniques for facilitating these stories. We work around minimalist production setups and maximal internal processes. With a passion for storytelling that transcends boundaries, we strive to create a stage that reflects the kaleidoscope of human experiences. Our productions are more than performances; they are a canvas of shared narratives that resonate with the richness of our collective journey. We aspire to weave together tales that inspire, provoke thought, and unite us in the magic of the theatre. \nSupported by: \n \n\n\n\n\n\n\n\n  \n\n\n\n\n\n\n\n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%85%e0%b2%ae%e0%b3%8d%e0%b2%ae-%e0%b2%ae%e0%b2%a4%e0%b3%8d%e0%b2%a4%e0%b3%81-%e0%b2%b8%e0%b3%81%e0%b2%b9%e0%b3%88%e0%b2%b2%e0%b3%8d-amma-mattu-suhail/",
    "keywords": [
      "Performing Arts, Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "ಅಮ್ಮ ಮತ್ತು ಸುಹೇಲ್ | Amma Mattu Suhail"
    },
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "ಅಮ್ಮ ಮತ್ತು ಸುಹೇಲ್ | Amma Mattu Suhail"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-506.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "ಆಶ್ಚರ್ಯ ಚೂಡಾಮಣಿ | आश्चर्य चूड़ामणि | Ascharya Choodamani | આશ્ચર્ય ચૂડામણિ | ਅਸਚਾਰ੍ਯ ਚੂੜਾਮਣੀ",
    "startDate": "2024-07-01T19:00:00+05:30",
    "endDate": "2024-07-01T20:00:00+05:30",
    "description": "Hindi, English, Punjabi, Marathi, Kannada, and Gujarati | 60 Minutes | Suitable for all ages \nAscharya Choodamani is a vibrant theatrical adaptation by Prasanna inspired by the timeless classic, Alice in Wonderland, showcasing a delightful fusion of six languages: Hindi, English, Punjabi, Marathi, Kannada, and Gujarati. Audiences get a linguistic rollercoaster, experiencing a delightful confusion of languages that adds to the comic charm of the production. \nAt the heart of the play is the spirited character of Choodamani, a young girl who radiates joy and curiosity, always seeking out surprises in her whimsical world. Her infectious energy draws the audience into her enchanting journey filled with wonder and laughter. \nAccompanying Choodamani are three animals, each adding their own unique flavour to the narrative. Their interactions with Chudamani spark lively exchanges and moments of humour, enriching the theatrical experience. \nOne of the standout features of Ascharya Choodamani is its interactive nature, inviting the audience to become actively engaged in the unfolding story. With rhythmic and live songs interwoven throughout the performance, viewers are transported into a world where music and storytelling seamlessly blend, creating an immersive and memorable theatrical experience for all. \nDirector’s Note: \nOver the past few years, I’ve delved into the realm of Theatre in Education, recognising the profound impact theatre can have on both children and adults alike. \nIn today’s fast-paced world, where digital distractions often take precedence over outdoor activities and meaningful social interactions, it’s imperative that we make efforts to reconnect younger generations with the simple joys of life. Ascharya Choodamani serves as a poignant reminder of the beauty found in community, nature, and human connection. \nAs an initiative of the Indian Theatre Foundation (ITF), this production aims to bridge the gap between modernity and tradition, inviting audiences to rediscover the magic of storytelling and performance art. Through the collaborative efforts of young artists hailing from diverse regions and cultures, we bring to life the vibrant tapestry of Ascharya Choodamani, enriching it with their unique experiences, talents, and musicality. \nThis play is not merely entertainment; it’s a celebration of cultural diversity and a testament to the power of unity. With its humorous and multilingual elements, Ascharya Choodamani promises to captivate audiences of all ages, inviting them on a journey of laughter, reflection, and wonder. \n \n  \nWith Support from: \n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%86%e0%b2%b6%e0%b3%8d%e0%b2%9a%e0%b2%b0%e0%b3%8d%e0%b2%af-%e0%b2%9a%e0%b3%82%e0%b2%a1%e0%b2%be%e0%b2%ae%e0%b2%a3%e0%b2%bf-%e0%a4%86%e0%a4%b6%e0%a5%8d%e0%a4%9a%e0%a4%b0%e0%a5%8d%e0%a4%af/",
    "keywords": [
      "Performing Arts, Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "pa",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "ಆಶ್ಚರ್ಯ ಚೂಡಾಮಣಿ | आश्चर्य चूड़ामणि | Ascharya Choodamani | આશ્ચર્ય ચૂડામણિ | ਅਸਚਾਰ੍ਯ ਚੂੜਾਮਣੀ"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-521.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "To Forget is to Remember is to Forget",
    "startDate": "2024-07-10T00:00:00+00:00",
    "endDate": "2024-07-13T00:00:00+00:00",
    "description": "\nPerformance Timings:\nWednesday, 10 July | 6.30 pm – 8pm\nThursday, 11 July | 6.30 pm – 8pm\nFriday, 12 July | 6.30 pm – 8pm  \nPlease Note: No Entry for Latecomers \nExhibition: \nThursday, 11 July | 11 am – 5 pm\nFriday, 12 July | 11 am – 5 pm \nTo Forget is to Remember is to Forget is an exhibition-performance that attempts to trace layered relationships between memory, mirror, mind and mother. Traversing through visual and sound installations, video, photography, print and performance, the show tries to reimagine the idea of the inheritance of loss. \nCredits: \nConcept, Text & Performance: Nimi Ravindran \nDesign & Dramaturgy: Sujay Saple \nCinematography & Editing: Ben Brix \nSound Design: Baan G & Sachin Gurjale \nImage & Book Design: Aakriti Chandervanshi \nPhoto Box Design: Rency Philip \nProduction Management: Charulatha Dasappa \nPoster Design: Arjun Shankar (Fizz) \n\n\n\n\n\n\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/to-forget-is-to-remember-is-to-forget/",
    "keywords": [
      "Media, Performing Arts, Theatre, Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "To Forget is to Remember is to Forget"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-526.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Leela",
    "startDate": "2024-07-02T19:00:00+05:30",
    "endDate": "2024-07-02T20:15:00+05:30",
    "description": "Leela is an immersive dance production that delves into the timeless spiritual love story of Krishna, Radha, and the Gopis in the sacred town of Vrindavan. Inspired by the rich cultural and spiritual heritage of India, the production aims to bring to life the essence of devotion, longing, and the transcendental nature of love through a fusion of classical Indian dance forms, music, and intricate storytelling. \nSet against the backdrop of the illuminated night of Vrindavan, the production chronicles the emotional journey of Radha and the Gopis as they grapple with the profound yearning for Krishna’s divine presence. Through a series of intricately choreographed dance sequences, the performance portrays the bittersweet symphony of emotions, ranging from intense longing to ecstatic celebration, ultimately emphasizing the universal truth that love transcends all boundaries. \nLeela highlights the spiritual evolution of the characters, as they come to realize the profound spiritual connection that exists beyond the physical realm. The production emphasizes the notion of ‘virah’ (separation) as a catalyst for understanding the depths of true love, and it emphasizes the spiritual bond that unites humanity with the divine. The dance sequences are crafted to reflect the cosmic harmony and the eternal quest for divine love that resonates with audiences across cultural and geographical boundaries. \nThrough a fusion of music, dance, and narrative, Leela aims to create an immersive experience that transports the audience into the mystical realm of Vrindavan, where love, devotion, and the divine converge in a timeless spectacle of spiritual ecstasy. The production seeks to celebrate the universality of love and the enduring power of devotion that transcends the limitations of time and space, leaving a lasting impression on the hearts and minds of the audience. \nA Q&A with the audience will follow the performance. \nDancers:\n\nSanjukta Sinha\nKrutika Ghanekar\nVidhi Shah\nPankaj Sihag\nHiren Gajjar\nShantanu Gosavi\n\nLight Assistance:\n\nDaideepya Leuva\n\nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/leela/",
    "keywords": [
      "Dance, Faith, Mythology, Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-517.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Moon on the Man",
    "startDate": "2024-07-02T18:30:00+05:30",
    "endDate": "2024-07-02T20:15:00+05:30",
    "description": "2021 | 75 mins | English and Hindi | India \nMoon on the Man is an observational and exploratory feature length documentary that questions the most basic assumptions of reality, perception and choices. As such, it is synonymous with every individual’s struggle to find direction, some that bear fruit in the ever-evolving landscape of human perspectives and others that segue into mental illness, old age and broken dreams. \nThe film looks at two eccentric personalities Praklawn and Sailesh, through their stories, life experiences and their everyday activities. This narrative is annexed by Aasif and Wadood at a juncture when the stories of Praklawn and Sailesh enter into the realms of magic realism. They scrutinize Praklawn’s and Sailesh’s eventful past and their debate on the men’s life throws open a Pandora’s box which questions the very nature of our reality. \nThe screening of the film will be followed by a discussion with Director, Prince Shah and Filmmaker, Sunanda Bhat. A Q&A with the audience will follow. \nCredits:\nDirector: Prince Shah\nCinematographer: Vaibhav Sorte\nEditors: Ashish Ranglani, Prince Shah\nMusic Composer: Prassanna Vishwanathan\nSound: Tarun Bhandari\nGrade: Kabir Nagranee\nProducers: Anshul Pandey, Prince Shah \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/moon-on-the-man/",
    "keywords": [
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-516.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "दुविधा | Duvidha",
    "startDate": "2024-07-07T11:30:00+05:30",
    "endDate": "2024-07-07T13:00:00+05:30",
    "description": "1973 | 82 Minutes | Hindi with English Subtitles \nBased on a Rajasthani folktale retold by Vijayadan Detha, Duvidha is about a merchant’s son, whose relationship with his young bride, Lachhi is thwarted by his work and a ghost who falls in love with her, resulting in the ghost soon impersonating the husband. \nCalling all cinephiles! BIC is thrilled to present B•Cinematic, an initiative dedicated to celebrating the most essential, impactful, and artistically significant cinematic works from across the state and the country. \nAt B•Cinematic, our mission is to curate and share those remarkable films that is a must-watch (or re-watch) experience for every passionate cinema lover. From groundbreaking classics to under-appreciated gems, our carefully curated selection will take you on an unparalleled (pun not intended) cinematic journey through the ages. \nThrough curated screenings, insightful discussions, and engaging analyses from distinguished cinematic voices, we aim to not only watch these films together but to truly appreciate their craftsmanship, cultural impact, and intellectual depth. Our vibrant community of film aficionados will collectively rediscover Indian cinema’s most stunning and enduring masterpieces. \nSo join us on this quest to experience the films that have defined and redefined the art form. Don’t miss out on crossing these essential works off your bucket list. Because to truly live, you must first watch the films that make life worth living. \nThis month’s film featured in our informal film club is Duvidha (1973) \nDuvidha is a hauntingly beautiful and thought-provoking film that delves into the realms of folklore, desire, and the complexities of human relationships. Based on a Rajasthani folktale, the film weaves a captivating tale of a young bride, Lachhi, whose newfound marriage is immediately put to the test by circumstances beyond her control. \nOn the very day of their wedding, Lachhi’s husband, a merchant’s son, departs on a five-year business trip, leaving her behind in the care of his family. Amidst this lonely existence, a mischievous and longing ghost, enchanted by Lachhi’s beauty, devises a cunning plan to impersonate her husband and gain her affection. \nDirector Mani Kaul’s masterful storytelling and Navroze Contractor’s exceptional cinematography breathe life into this enigmatic narrative, creating a hypnotic and surreal atmosphere that blurs the boundaries between the corporeal and the ethereal. The film’s striking visuals, infused with rich textures and rhythmic sequences, transport the viewer into the vibrant tapestry of Rajasthani culture, where the rhythms of daily life intertwine with the spectral realm. \nAt its core, Duvidha is a metaphysical exploration of love, desire, and the complexities of human relationships. The ghost’s obsession with Lachhi and his subsequent impersonation of her husband raise profound questions about identity, fidelity, and the nature of love itself. The film invites the viewer to ponder the depths of human longing and the lengths to which one might go to satisfy that longing. \nBeyond its captivating narrative, Duvidha also serves as a powerful commentary on societal norms and gender dynamics. Lachhi’s predicament, torn between her duty as a wife and the allure of the supernatural, reflects the constraints and expectations placed upon women in traditional societies. The film subtly challenges these conventions, inviting the viewer to question the foundations upon which societal structures are built. \nUltimately, Duvidha is a cinematic masterpiece that transcends its folktale origins, offering a transcendent and thought-provoking exploration of the human condition. With its mesmerizing visuals, haunting narrative, and profound themes, the film continues to resonate with audiences, inviting them to embark on a journey that blends the fantastical with the deeply human. \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%a6%e0%a5%81%e0%a4%b5%e0%a4%bf%e0%a4%a7%e0%a4%be-duvidha/",
    "keywords": [
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "दुविधा | Duvidha"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-505.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Sakhi Ri",
    "startDate": "2024-07-04T19:00:00+05:30",
    "endDate": "2024-07-04T20:30:00+05:30",
    "description": "Sakhi Ri is a Kathak-based dance drama production that delves into the profound subject of menstruation. This performance weaves the tale of a unique friendship between a woman and her Laal Sakhi, aka her menstrual cycles as she embarks on her journey of womanhood. Together, they navigate the intricacies of life, with each phase of Laal Sakhi adding its own vibrant hue to her human companion – from embarrassment and pain to sensuality, attraction, separation and the profound essence of motherhood. \nAbout SIFF Young Artiste: \nSIFF Young Artiste’s mission is to further the cause of Arts Education by providing a structured and consistent path to learning the arts for any student with the desire to learn. With a steadfast commitment to democratizing access to the arts, SIFF stands firm in their mission to provide easy access to high-quality learning in vocal, instrumental, and dance. The essence of learning – the teacher-student relationship remains at the core and is further enhanced by the creative use of technology. They equally serve the classical and contemporary arts to make arts education an engaging and fruitful pursuit for all learners. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sakhi-ri/",
    "keywords": [
      "Dance, Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-519.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Longen Folk to Go on Pilgrimage",
    "startDate": "2024-07-20T18:30:00+05:30",
    "endDate": "2024-07-20T20:15:00+05:30",
    "description": "2022 | 88 mins | English | India \nThe film is about what used to be a little-known event until the 1980s but which has now become the single largest annual pilgrimage in India: The Kanwar Yatra. \nThe Kanwar Yatra is an annual pilgrimage dedicated to Lord Shiva in which devotees, known as kanwariyas, fill water from the river Ganga and carry it back to their hometowns for libations. \nThe film looks at not just the religious and cultural aspects of the Yatra but also its socio-economic impact, the environmental issues attached to it (for instance, the state of the Ganga), the sheer maleness of the event, and how the occasion is being used by Hindu right-wing groups to push their majoritarian agenda and the showcase it has become for Hindu nationalism. \nThe screening of the film will be followed by a discussion with Director, Kunal Vohra. A Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/longen-folk-to-go-on-pilgrimage/",
    "keywords": [
      "Faith, Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-518.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "CARBON Film Festival",
    "startDate": "2024-07-06T10:00:00+05:30",
    "endDate": "2024-07-07T20:00:00+05:30",
    "description": "Carbon has been an invisible protagonist on the celluloid screen for a while now. Our lives are saturated with carbon, and the screen reflects its presence everywhere. Though unseen, carbon’s influence permeates our lives and finds reflection in countless stories on the big screen. This festival invites you on a journey from the barren grounds of an e-waste dump yard to the magical forests of the Western Ghats. We will showcase a distinctive collection of cinematic narratives centered on the theme of carbon and bring to life stories that span generations, reflecting both the past and the ever-evolving present. These stories of ambition, resilience, and perseverance will offer a deeper understanding of carbon and films, shedding light on the transformative power of carbon. \nThe festival strives to create an immersive environment where visitors can deeply interact with these ideas through various films and discussions. We are offering a wide array of films spanning different languages, including German, English, French, and Hindi, and genres, from documentary features and narrative features to experimental shorts and animated shorts. Filmmakers and scholars have been encouraged to create a colorful, interactive space that encourages people of all ages to consider carbon’s critical role in our lives and the global ecosystem. \nFestival Schedule: Download the full schedule here. \nDay 1 | 6 July | Saturday | 10:00 am – 8:00 pm \n10:00 am – 10:05 am: Opening address by SGB team \n10:05 am – 11:40 am: All that Breathes\nDocumentary Feature | Hindi with English Subtitles | India | Shaunak Sen\nAs legions of birds fall from New Delhi’s skies and the city smoulders with social unrest, two brothers race to save one of the casualties: a majestic black kite, a bird of prey essential to their city’s ecosystem. \n11:40 am – 12:30 pm: Discussion with Shaunak Sen and Suhel Quader \n12:30 pm – 1:11 pm: Ocean Mud Pickle\nDocumentary Feature | Oriya with English Subtitles | India | Paribartana Mohanty\nThe abandoned village of Satabhaya, often submerged by natural disasters and rising sea levels, is a place of memory and speculation. Near Bhitarkanika crocodile reserve and Gahirmatha Beach, its future might be as a wildlife sanctuary or underwater habitat. This video explores Satabhaya’s climate stories and ‘queering’ process through archives, memories, and maps, transforming interviews and field notes into poetry and Daskathia folk songs and dance. \n1:11 pm – 2:00 pm: Break \n2:00 pm – 2:13 pm: We Held Our Breath\nShort | United Kingdom | Matthew Denham\nInformed by the historic and contemporary carbon-intensive industries of North East England, this experimental video surveys a landscape altered by industrial cycles and the values of growth and extraction. It captures three years of complex conversations with local communities, reflecting on potential futures. Through scenes of production, consumption, and waste, it serves as a metaphor for living with the environmental crisis we’ve created. \n2:13 pm – 2:14 pm: On the Surface\nExperimental Short | India | Jayasri Sridhar & Amal Zen\nOn the surface, lichens appear as unsightly patches on city roofs, often unnoticed. Yet, they play a crucial role in the carbon cycle, absorbing carbon dioxide and releasing oxygen. Sensitive to pollution, lichens are the first to die when contamination rises. This film examines this remarkable organism. The sound design captures human activities emitting carbon essential for lichens’ survival and pollutants signaling their demise. \n2:14 pm – 4:53 pm: Not Just Roads\nDocumentary Feature | Hindi with English subtitles | India | Nitin Bathla & Klearjos Papanicolaou\nA massive urban transformation is underway in India, with highways being built at a rapid 23 kilometers per day under the Bharatmala program. This aims to open new territories for the emerging middle class. Criss-crossed by native trails and ecological commons, this film captures the story of one such highway outside Delhi from the perspective of both human and non-human actors. \n4:53 pm – 5:30 pm: Break \n5:30 pm – 6:53 pm: Planet Soil\nDocumentary Feature | English | Mark Verkork \n6:53 pm – 7:14 pm: This Mortal Plastik \nDocumentary Short | Dutch with English Subtitles | Jess Irish \n7:14 pm – 8:00 pm: Curated by ALTEFF \n\nDay 2 | 7 July | Sunday | 11:00 am – 8:00 pm \n11:00 am – 11:13 am: Nuisance Bear\nDocumentary Short | English | Canada | Jack Weisman, Gabriela Osio Vanden\nChurchill, Manitoba, is famous as an international destination for photographing polar bears. We’ve seen the majestic images and classic wildlife series captured here – but what do these bears see of us? Through a shift in perspective, Nuisance Bear reveals an obstacle course of tourist paparazzi and wildlife officers whom bears must navigate during their annual migration. \n11:13 am – 11:38 am: Haul Out\nDocumentary Short | Russian with English Subtitles | Russia | Maxim Chakilev\nOn a remote coast of the Siberian Arctic in a wind-battered hut, a lonely man waits to witness an ancient gathering. But warming seas and rising temperatures bring an unexpected change, and he soon finds himself overwhelmed. \n11:38 am – 12:11 pm: Carbon and Captivity\nDocumentary Feature | German with English Subtitles | Germany | Oliver Ressler\nCarbon capture and storage (CCS) is promoted as a solution to global warming by storing CO₂ in sub-seabed formations, but it remains immature, with cracks found in North Sea storage rocks. Filmed at Norway’s Technology Centre Mongstad (TCM), the film shows how CCS could delay decarbonisation and increase fossil fuel dependence. The title refers to humanity’s “captivity” within capitalism’s extractivism. \n12:11 pm – 1:18 pm: Augmented Organism Pentaptych\nDance Film | Finland | Cy Gorman\nAugmented Organism is a stunning collaborative transnational dance-film and sustainable social design project between Cy Gorman (Australia) and Jazmyne Geis (USA).  The project brings together experimental narrative filmmaking, contemporary dance, technology, and social and environmental activism in dialogue with world wisdom traditions and mythology. \n1:18 pm – 2:00 pm: Break \n2:00 pm – 2:10 pm: Wade\nAnimated Short | India | Upamanyu Bhattacharyya\nIn a version of Kolkata, India rendered uninhabitable by sea level rise, things take a dark turn when a family of climate change refugees are ambushed by a tiger on the flooded streets. \n2:10 pm – 2:17 pm: Spirit of the Forest \nAnimated Short | Kannada with English Subtitles | India | Nirupa Rao\nWalking home from school, a little girl stumbles into a sacred grove near her village in south India. Here, she disturbs the grove’s resident spirit, who takes her on an adventure illuminating the evolution of this ancient swamp. It is inspired by indigenous practices of protecting relict forests through folklore grounded in ecological principle. \n2:17 pm – 2:23 pm: Autosaurus Rex\nAnimated Short | French with English Subtitles | Switzerland | Marcel Barelli\nAmong the different species that inhabit our planet, one stands out from the others by its power and its impact on ecosystems. It is the Autosaurus Rex. \n2:23 pm – 2:30 pm: The Chimney Swift \nAnimated Sort | English | Germany | Frédéric Schuld\n19th century in Europe: a child climbs up a chimney while a bird sails down into it to build a nest. An encounter with no way back. \n2:30 pm – 3:15 pm: Into the Carbonverse: Exploring the World of Animated Films | A Discussion with Fabian Driehorst, Nirupa Rao,  Aniruddh \n3:15 pm – 3:36 pm: Mountain Man \nDocumentary Short | Bhutanese with English Subtitles | Bhutan | Arun Bhattarai\nPhuntsho Tshering, Bhutan’s only glaciologist, climbs sacred mountains annually to measure melting glaciers. His 11-year-old daughter, Yangchen, sees him disappear for months, fearing he disturbs the ‘snow lion’s’ home. Despite local warnings, Phuntsho continues his vital work to document climate change and protect the snow lion’s vanishing habitat, sharing his journey with Yangchen through phone videos. \n3:36 pm – 4:15 pm: Break \n4:15 pm – 6:10 pm: The Road to Kuthriyar \nNarrative Feature | Tamil and English | India | Bharat Mirle\nIn “The Road to Kuthriyar,” a wildlife researcher and a tribesman form an unlikely friendship while navigating the complexities of a resettled tribal community in India, blending real conditions and staged events to authentically portray their intertwined lives. \n6:10 pm – 8:00 pm: Tortoise Under the Earth \nNarrative Feature | Santhali with English Subtitles | India | Shishir Jha\nIn a uranium mining area of Jharkhand, India, a tribal couple mourns their daughter, finding solace in the land and forest. Tortoise Under The Earth explores the deep connections between tribal communities and their traditional home, weaving together vivid festivals, folk songs, and a strong sense of community in a poetic elegy to a world vanishing due to unchecked development and displacement. \n  \nIn collaboration with: \n \nScience Gallery Bengaluru (SGB) is a not-for-profit public institution for research-based engagement targeted at young adults working at the intersection of the human, natural, and social sciences, and engineering, art, and design. SGB’s public engagement model moves beyond participation, and towards proactive involvement through ever-changing research festivals anchored by interdisciplinary exhibitions, programmes, and public events consisting of research-based engagements led by artists and scholars from diverse backgrounds. SGB is established with the founding support of the Government of Karnataka and three academic partners—Indian Institute of Science, National Centre for Biological Sciences, and Srishti Institute of Art, Design and Technology. \n",
    "url": "https://bangaloreinternationalcentre.org/event/carbon-film-festival/",
    "keywords": [
      "Environment, Film, Science, Society, Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "workPresented": {
      "@type": "Movie",
      "name": "CARBON Film Festival"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-8_POSTER.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "Ranga Taranga",
    "startDate": "2024-06-28T19:00:00+05:30",
    "endDate": "2024-06-28T21:00:00+05:30",
    "description": "Two seemingly distinct forms of the Vishnu, Ranganatha and Panduranga are geographically far apart. Iconographically too, they differ: one is a reclining idol, while another stands with his hands on his hips. What connects these two forms? \nRanga Taranga is a conceptualisation aiming to answer precisely this question, exploring subtle yet powerful connections between the two. Traversing across legends, architecture, experiences, history and more, Ranga Taranga invites its audiences to embrace the shades of two popular deities: Ranganatha and Panduranga. \nThe program comprised storytelling by Vinay Varanasi and music by Kruthi Vittal, B K Raghu and B S Prashanth. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/ranga-taranga/",
    "keywords": [
      "Faith, Heritage, Music, Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Ranga Taranga"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-2_POSTER-11.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "प्रवास | Pravaas",
    "startDate": "2024-07-23T19:00:00+05:30",
    "endDate": "2024-07-23T20:30:00+05:30",
    "description": "Since the first humans migrated to present-day India 65,000 years ago, the pravaas hasn’t stopped. \nWhether seeking greener pastures, fleeing oppression, or pursuing economic opportunities, migrants have moved across districts, states and countries. Despite different times, places, and cultures that separate each wave of migration, there is much that is shared in a migrant’s experience. \nPravaas – A Migrant’s Tale is a musical telling of a migrant’s journey. Whether it’s a Bihari traveling to Chennai, a Rajasthani to Bengaluru, or a Tamilian to Mumbai, the only certainty in their journey—whether it begins with hope or fear—is its unpredictability. \nJoin us in the musical experience of the migrant’s timeless tale featuring songs in Bengali, Sanskrit, Hindi, Kannada, Marathi, Tamil, Telugu and more. The performance is a tribute to the indomitable spirit of those who seek new horizons. \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%aa%e0%a5%8d%e0%a4%b0%e0%a4%b5%e0%a4%be%e0%a4%b8-pravaas/",
    "keywords": [
      "History, Music, Performing Arts, Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "bn",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "प्रवास | Pravaas"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-528.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Gods in the \"Clouds\"",
    "startDate": "2024-07-03T18:30:00+05:30",
    "endDate": "2024-07-03T19:45:00+05:30",
    "description": "How do the political aesthetics of the Hindu diaspora in the West interact with mythopolitics in India? \nThis talk studies ways in which Hindu diasporic communities in the West connect with and influence political stories in India. How do these communities use neoliberal digital spaces to enact “long distance nationalism”? And how do artists respond to, comply with, and resist the combination of diasporic nationalism and Western neoliberalism? \nBy looking at various forms of cultural expression, this talk explores the interconnections between Western liberal ideas of diversity and the politics of caste and religion in the Indian diaspora. \n",
    "url": "https://bangaloreinternationalcentre.org/event/gods-in-the-clouds/",
    "keywords": [
      "Culture*, Faith, Politics, Society, Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-523.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The World in Flux",
    "startDate": "2024-07-11T18:30:00+05:30",
    "endDate": "2024-07-11T20:00:00+05:30",
    "description": "In a rapidly evolving global landscape, the historical bond between India and Russia stands at a crossroads, presenting both challenges and opportunities. This session explores the multifaceted nature of their relationship amidst significant geopolitical shifts. \nHistorically, India and Russia have enjoyed a robust partnership, characterised by deep-rooted ties and mutual cooperation. However, recent global events, such as the rise of China, the conflict in Ukraine, and changing US foreign policies, have introduced new complexities to their strategic interactions. \nEconomically, both nations have benefited from trade and energy collaborations, but sanctions on Russia and India’s economic diversification efforts pose significant challenges. In defense and security, while arms trade and joint military exercises remain strong, India’s growing defense relationships with Western countries add layers of strategic ambiguity. Regionally, the dynamics in areas like Afghanistan and the Indo-Pacific region influence bilateral relations, necessitating a recalibration of strategies. On the multilateral front, platforms like BRICS and the SCO offer both collaboration and contention. \nThis session seeks to provide a comprehensive understanding of the dilemmas and opportunities in India-Russia relations, offering insights into the future trajectory of this pivotal partnership in a world marked by constant flux. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-world-in-flux/",
    "keywords": [
      "International Relations, Policy & Regulation"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-2_POSTER-12.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "320. Safe Spaces: Unraveling Gender Bias (Part 1 of 4)",
    "startDate": "2024-06-28T00:00:00+00:00",
    "endDate": "2024-06-29T00:00:00+00:00",
    "description": "In the premiere episode of Safe Spaces, we delve into the history of human evolution to uncover the roots of gender bias. Join Dr. Sangeeta Saksena and host Anishaa Tavag as they explore how societal norms and misconceptions about gender have developed over time, setting the stage for a deeper understanding of contemporary issues in sexuality and gender equity. \nIn our society, discussing sexuality openly with family, friends, and peers has often been taboo, shrouded in misconceptions and stigma. Many of us experience shame, guilt, and embarrassment when it comes to sexuality and intimacy, and we may not know how to engage with our own sexuality safely and respectfully. \nSafe Spaces is a transformative podcast series that aims to break these barriers. Comprehensive sexuality education extends beyond the mechanics of human biology. It equips us with the tools to navigate relationships with informed consent and respect for personal boundaries. By fostering a deeper understanding of our own minds and bodies, this education can significantly reduce the incidences of sexually transmitted infections and unintended pregnancies, address gender-based violence, and enhance self-expression and sexual well-being. \nIn this four-part series by the Bangalore International Centre, Dr. Sangeeta Saksena delves into the realm of sex and sexuality. Dr. Sangeeta, a gynaecologist, author, counsellor, and activist, co-founded Enfold India in 2001 to promote gender equity, sexuality, and personal safety education. \nJoin host Anishaa Tavag as we embark on this enlightening journey. \nThis series was made possible with the generosity and knowledge of Dr. Sangeeta Saksena and the contributions of Abha Khetarpal, Dipankar Panth, Diya Naidu, Meghana Roy, Mich Gupta, Nitya Deviah, and Saurabh Levin. \nSubscribe to the BIC Talks Podcast on your favorite podcast app! BIC Talks is available everywhere, including Apple Podcasts, Spotify, Google Podcasts, Castbox, Overcast, Audible and Amazon Music. \n",
    "url": "https://bangaloreinternationalcentre.org/event/320-safe-spaces-unraveling-gender-bias-part-1-of-4/",
    "keywords": [
      "Culture*, Gender, Health & Wellness, Podcast, Science, Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-530.jpg"
  }
]