[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68569-1736276400-1736281800@bangaloreinternationalcentre.org",
    "name": "K-Art Beyond K-Culture",
    "startDate": "2025-01-07T19:00:00+05:30",
    "endDate": "2025-01-07T20:30:00+05:30",
    "description": "The Asia Dance Festival is an annual celebration that brings together diverse dance traditions from across Asia. This vibrant event showcases the rich cultural heritage and contemporary dance innovations of various Asian countries, offering a unique platform for artistic exchange and collaboration.\nThe Korea Dance & Arts Center, a nonprofit organization, is focusing on promoting K-Art beyond K-Culture through the Asia Dance Festival, while strengthening networks through dance in various countries.\n\nNabimu \nCha Myung Hee(Korea)          \n– This dance, expressing the joy of enlightenment upon hearing the Buddha’s teachings (Dharma), is one of the elegant forms of Jakbeop (a traditional Buddhist ritual dance). It involves purifying the sacred space and is accompanied by chants used to honor the Three Jewels (Sambo) and the celestial beings (Cheonryong). \nSeonbi Hagchum \n(the crane dance of Korean traditional scholars) \nLee Jong Ho(Korea)   \n– Seonbi Hagchum by Lee Jong-ho is a work that depicts a crane soaring and a seonbi (Korean traditional scholar) dancing, expressing the pure and clear communion with a crane through the gestures of a seonbi. The seonbi spirit values integrity and frugality above all, while the crane symbolizes purity and nobility. The hakchangui(鶴氅衣), the traditional attire worn by seonbis in their daily lives, was designed to emulate the white body and black head of a crane. This attire embodies natural beauty and harmony while reflecting the dignified and unyielding character of the seonbi. \n  \nJinju Gyobang Gutgeori Chum \nSeo Jung Sook(Korea)           \nThe Jinju Gyobang Gutgeori Dance, designated as an Intangible Cultural Heritage of Gyeongnam Province, is composed of eight sequences representing the four seasons: spring, summer, autumn, and winter. Rooted in the elegant and artistic tradition of Gyeongsang-do’s Deotbaegi, this dance combines refined postures and precise footwork derived from Jeongjae (court dances), serving as both the driving force and the pinnacle of all its movements, culminating in improvisation. \nTaepyeongmu  \nKwak Myeong Ji (Korea)        \n– This piece expresses through dance the wish for the nation’s peace and prosperity, a sentiment that has been passed down by Kang Sun-young as an officially designated National Intangible Cultural Heritage. Based on the shamanic rhythms of the Wangsimni Dang-gut, it showcases the vibrant and unique footwork, along with delicate yet precise hand movements, highlighting the splendor and elegance of traditional Korean folk dance. \n  \nSupported by: \n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/k-art-beyond-k-culture/",
    "keywords": [
      "Culture",
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-52.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68537-1737570600-1737576000@bangaloreinternationalcentre.org",
    "name": "Out of the Middling Middle",
    "startDate": "2025-01-22T18:30:00+05:30",
    "endDate": "2025-01-22T20:00:00+05:30",
    "description": "Midlife is a phase when we find ourselves pulled in multiple directions—across work, home, health, friendships, and hobbies. \nIn this session, Ravi Venkatesan delves into themes from Deepak Jayaraman’s recent book, Play to Potential. The book offers a nuanced exploration of how to unlock human potential—not just professionally but holistically—by embracing life’s highs and lows. Drawing from his acclaimed Play to Potential podcast and his experiences as a coach, Deepak introduces the FLAVOUR framework, a practical guide to navigating the intricate interplay of family, aspirations, values, and relationships. \nDeepak emphasises that life is a team sport, with family serving as an essential support system. He argues that personal growth and achievement are deeply intertwined with our family contexts, a perspective often overlooked in self-help literature, particularly in cultures where family plays a central role. \nA key insight of the book is the recognition that life unfolds in seasons, shaped by transitions—some intentional, others unexpected. Using real-life examples and case studies, Deepak illustrates how navigating these transitions thoughtfully is vital to realising our potential. \nThis discussion will resonate with anyone in their 30s to 60s, offering valuable strategies to lead a multi-dimensional, purposeful life. \n",
    "url": "https://bangaloreinternationalcentre.org/event/out-of-the-middling-middle/",
    "keywords": [
      "Books",
      "Nonfiction",
      "Philosophy",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-691.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68490-1736447400-1736452800@bangaloreinternationalcentre.org",
    "name": "Emergent Practices in South Asia",
    "startDate": "2025-01-09T18:30:00+05:30",
    "endDate": "2025-01-09T20:00:00+05:30",
    "description": "In South Asia, architectural practice is characterized by a rich pluralism of approaches. This event brings together leading studios—CollectiveProject, Kamat and Rozario Architecture, M9 Design Studio, and Made in Earth Collective—for a panel discussion moderated by Pranav Thole and Ela Singhal. The conversation aims to explore the evolving landscapes of practice, focusing on forms of patronage, methodologies, emerging technologies, innovative construction techniques, and the architect’s role as a social catalyst. \nIn collaboration with: \n    \nSupported by: \n   \n",
    "url": "https://bangaloreinternationalcentre.org/event/emergent-practices-in-south-asia/",
    "keywords": [
      "Architecture",
      "Design",
      "Development",
      "Sustainability",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-54.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "65148-1735930800-1735938000@bangaloreinternationalcentre.org",
    "name": "Vhay, I am Savitribai Phule!",
    "startDate": "2025-01-03T19:00:00+05:30",
    "endDate": "2025-01-03T21:00:00+05:30",
    "description": "English | 120 minutes (with Interval) | Suitable for All Ages \n“Vhay, I am Savitribai Phule!” presents the remarkable story of a 19th-century pioneer who shattered societal barriers through education and social reform. Born into a time when women’s education was forbidden, Savitribai’s journey from illiteracy to becoming India’s first woman teacher exemplifies extraordinary courage and determination. \nThe play, originally written in Marathi and premiered on 3rd January 1989, has evolved into a powerful narrative that transcends linguistic and cultural boundaries. Written, directed, and initially performed by Sushama Deshpande, the production has since been translated into nine languages, including Hindi and, most recently, English, reaching diverse audiences both nationally and internationally. \nAt its heart, this is a story of revolutionary partnership. Inspired by her husband, Mahatma Jyotiba Phule, Savitribai carved her own identity as a dynamic administrator and social reformer. Together, they established the Satyashodhak Samaj and tackled various social issues: managing orphanages, feeding poor children during droughts, supporting widows, and notably organising the Barber’s Strike against caste oppression. Their work in colonial India challenged both gender inequality and caste discrimination, with Savitribai continuing their mission even after Jyotiba’s death. \nThe production maintains deliberate simplicity in its staging, utilising minimal props, lighting, and music to focus on the power of the narrative. Though initially conceived as a solo performance, it was later adapted into a duo act before returning to its original one-person format in its English incarnation. Notably, the script has been made freely available to all potential performers since 1989, reflecting the playwright’s belief that Savitri’s legacy belongs to everyone. \nAs times change and social frameworks evolve, the Phules’ work remains remarkably relevant to contemporary Indian society. Their story, brought to life through this production, continues to illuminate paths towards social justice and equality, offering vital lessons for present and future generations. \nCurrently performed by Nandita Patkar, this English adaptation particularly resonates with India’s youth, making this historic narrative accessible to new audiences whilst preserving its powerful message of education, emancipation, and social reform. \nDirector’s Note: \n“Vhay Mee Savitribai,” originally a Marathi production that premiered on 3rd January 1989, is a timeless narrative transcending borders and languages. After translating the script into Hindi in 1992, I have performed it both nationally and internationally. The play has since been translated into nine languages, with English being its latest adaptation. While Marathi remains the regional language of Maharashtra and Hindi the national language of India, English was chosen for this version as it increasingly connects with India’s youth, many of whom may not speak Hindi. \nWhen the play debuted in 1989, I deliberately made the script freely available to all potential performers. This decision stemmed from my belief that despite being the scriptwriter, I had no right to claim ownership over Savitri’s life, work, or spirit. Though primarily conceived as a solo performance, I later experimented with the format by adapting it into a duo act featuring two new actors. However, the current English version, “Vhay, I am Savitribai Phule,” returns to its solo format, which I believe best serves the script’s essence. The production has been deliberately designed for simplicity, requiring minimal staging, props, lighting, and music. \nCredits: \nCreative Team: Writer and Director: Sushama Deshpande \nEnglish Translation: Shanta Gokhale \nPlay-script: Manjiri Bhuskute \nArtist: Nandita Patkar \nMusic: Composition: Tejaswinee Ingale \nOperation: Parag Sarang \nProduction: \nProduction Support: Samruddhi Chemburkar, Dattatray Pawar, Rohit Pawar, Sujit Kulkarni \nTechnical Support: Atharv Gokhale, Abhijeet Telgote \nLighting: Akshay Khaire, Ram Saidpure \nMedia: Design and Publicity: Vishwas Kanekar, Abhishek Harvande \nCamera and Editing: Ravi Nikam and team \nProducer: Anjor Communications \nSpecial Thanks: Mridula Bhatkar, Shilpa Sane, Shubhangi Bhujbal, Dr Sanjyot Deshpande and friends \n",
    "url": "https://bangaloreinternationalcentre.org/event/vhay-i-am-savitribai-phule/",
    "keywords": [
      "Performing Arts",
      "Society",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "mr",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Vhay, I am Savitribai Phule!"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-689.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68347-1736247600-1736712000@bangaloreinternationalcentre.org",
    "name": "Architectures of Transition",
    "startDate": "2025-01-07T11:00:00+05:30",
    "endDate": "2025-01-12T20:00:00+05:30",
    "description": "Exhibition Walkthroughs\nWed, Jan 8 | 4pm – Presentation by Pranav Thole, followed by a walkthrough by Rahul Mehrotra\nThu, Jan 9 | 5pm – Presentation by Pranav Thole, followed by a walkthrough \nThe travelling exhibition displays the works of 41 emergent architecture practices in South Asia that have engaged in the making of architecture, landscape, and infrastructure in the public realm. The research offers insights into patronage, methodologies, emergent technologies, and construction techniques and also sheds light on how the humane and social aspects of architecture characterized by participatory frameworks are being approached by practitioners today. It attempts to highlight modes of engagement as well as transgressions and synergies between disparate cultures, ways of representation, and knowledge accumulation and production. The first edition of the exhibition was shown at the India International Centre, New Delhi in December 2023, followed by the first travel edition at the Alliance Francaise, Chennai in August 2024. \nThe exhibition is part of the research project – State of Architecture in South Asia, which aims to collectively ask, across South Asia, the question: Does Architecture matter in a state of transition? In the region, numerous transitions, and uncertainties, encompassing climate change, political transformations, and socio-economic shifts, manifest in a heightened form within the daily existence of its populace.  A project initiated by the Lakshmi Mittal and Family South Asia Institute, Harvard University  and the Architecture Foundation,  visit https://www.soasouthasia.com for more details on the project. \nThe Travelling exhibition is produced by Prakriti Foundation and the Architecture Foundation \nIn collaboration with: \n    \nSupported by: \n    \n",
    "url": "https://bangaloreinternationalcentre.org/event/architectures-of-transition/",
    "keywords": [
      "Architecture",
      "Sustainability",
      "Technology",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-688.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68506-1736681400-1736686800@bangaloreinternationalcentre.org",
    "name": "Our Incredible Inheritance: India’s Plant Wealth",
    "startDate": "2025-01-12T11:30:00+05:30",
    "endDate": "2025-01-12T13:00:00+05:30",
    "description": "The lecture will explore efforts to engage the public in conserving India’s extraordinary plant diversity. This diversity forms the foundation of our diverse ecosystems, nourishes us, sustains our health, mitigates climate change, and offers spiritual, recreational, and other invaluable benefits. Vijay Thiruvady utilized botanical gardens like Lalbagh to showcase India’s plant wealth and inspire the public to contribute to safeguarding our natural heritage. Professor Bawa will highlight  ATREE’s recent, innovative initiatives aimed at connecting scientists, students, and the general public to the world of plants. These efforts could promote deeper interactions with nature and continue Vijay Thiruvady’s enduring legacy. \nWith this programme, the Bangalore International Centre remembers the contributions of our member Vijay Thiruvady in three landmark lectures that he gave at the BIC, on the “Greening of Bangalore” with Girish Karnad and Capt. Prabhala (2015), on “Botanical Illustrations” with Nirupa Rao (2019), and on “Why Lalbagh Matters” (2021). \nAmong the accounts of our city, Vijay Thiruvady’s book, Lalbagh – Sultans’ Garden to Public Park, published by the Bangalore Environment Trust, presents the most comprehensive history of Lalbagh written to date. Ranging across five centuries, it presents a panoramic view from Kempegowda’s flower garden in 1537, through Haider and Tipu (1760 to 1799), to the East India Company years — Scottish army men and surgeons — and over a century by six Kew trained gardeners. The book is based on research from several archives, including Kew Gardens and the Royal Botanic Gardens Edinburgh, and of course on Vijay Thiruvady’s intimate knowledge of Lalbagh having conducted inspiring nature walks for over 18 years that were attended by over 15,000 walkers.  \nVijay Thiruvady was always interested in various aspects of nature and more specifically horticulture. In addition to the Green Heritage Walks in Lalbagh, he conducted Imperial Colonial Walks in Cubbon Park and Military Heritage Walks at the MEG&C, and participated in the various activities of Bangalore Environment Trust as a Trustee. These have included the publishing of notable books on Heritage Trees in and around Bangalore and on Devarakadus and Gundutopus in the vicinity of Bangalore.  \nThiruvady spent his early years in Delhi.  His academic interests were pursued at\nSt. Stephen’s College, Delhi and School of Architecture, Ahmedabad.  When in Delhi, he had exposure to the world of nature and environment through association with a number of distinguished people in the field and institutions.  \nHe gave talks on Bangalore, its environment and history at many institutions, including the National Institute of Advanced Studies, Raman Research Institute, BIC, Bangalore Club, National Gallery of Modern Art, and Azim Premji University. A gifted raconteur, his encyclopedic knowledge of trees and of Bangalore’s history were conveyed through stories that kindled a love of nature and made his walks, lectures and books memorable, connecting with young and old from around the world, from experts in the field to school children. His passing in August 2023 is a profound loss to the city. \nVijay Thiruvady’s talk on Lalbagh at the BIC, which has been widely viewed as an introduction to the botanical garden and to Bangalore and its history, is available here.  \nHis short essays on trees are available here. \nAn article about him in Frontline magazine is available here. \nImage Captions \nThumbnail and Poster: Impatiens and Primula species from the Himalaya  \nHeader and Instastory: Rhododendron arboreum in the Himalaya  \n  \nTea will be served at 11 am. \n",
    "url": "https://bangaloreinternationalcentre.org/event/our-incredible-inheritance-indias-plant-wealth/",
    "keywords": [
      "Environment",
      "In Memory",
      "Science"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-56.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "67866-1735988400-1735993800@bangaloreinternationalcentre.org",
    "name": "Samvad Music",
    "startDate": "2025-01-04T11:00:00+05:30",
    "endDate": "2025-01-04T12:30:00+05:30",
    "description": "Igino Giovanni Brunori and Virginia Nicoli of Samvad are an innovative musical duo crafting new sounds from ancient materials. Their performances are journeys through a rich landscape of melody and rhythm, using bansuri (Indian bamboo flute), silver flute, saxophone and voice. \nThanks to their teachers, the Gundecha Brothers, they have forged their own musical language in which Raga (melodic frames of indian classical music) and tala (rhythm cycles) remain the core features. In this sense, their music is less of a fusion and more of a dynamic expression of these traditional principles. \nSamvad means to ‘speak together’ or ‘accord’ in Sanskrit. There is much accord between the art and life of Igino and Virginia. Music brought them together and continues to be the driving force in their lives. Their shared passions give a special tone to their sonic creations, at once deeply connected to ancient traditions and still pulsing with the present. \nThe exceptional quality of Samvad’s music derives from their attention to sound quality, to micro-tonal detail and to the mysterious dialogue between the two. East and West, ancient music and contemporary sounds meet in a new interpretation of tradition and modernity. \n",
    "url": "https://bangaloreinternationalcentre.org/event/samvad-music/",
    "keywords": [
      "Culture",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Samvad Music"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-49.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68015-1735815600-1736107200@bangaloreinternationalcentre.org",
    "name": "Vibrant Books",
    "startDate": "2025-01-02T11:00:00+05:30",
    "endDate": "2025-01-05T20:00:00+05:30",
    "description": "Exhibition Opening: Thursday, 02 January, 6:45pm\nInaugural Talk: Thursday, 02 January, 6pm – 6:30pm\nExhibition Timings: 11am – 8pm\nExhibition on show until: Sunday, 05 January, 8pm \nWalkthroughs with the Curator:\nThursday, 02 January, 6:45pm\nFriday, 03 January, 5pm\nSaturday, 04 January, 5pm\nSunday, 05 January, 12pm \nA selection from the vast book and magazine design output of one of the world’s greatest Book Designers Prof Kohei Sugiura of Japan, will be on display at the exhibition. Over 80 books and magazines including deluxe books; panels showing the creative process of the most celebrated of his book designs; over 20 cultural posters; and catalogues of various cultural events will be on display along with 20 annual calendars on the theme of Letterforms from the Japanese typesetting company ‘Sha-ken’. \nThe exhibition is an opportunity to see the best in book design in the world; and also to understand the creative process behind the designs. Movies explaining the thought process in designing the books will also be shown along with a large screen interactive presentation of Sugiura Design Archive of the Musashino Art University Museum, where the viewers will be able to browse through the entire collection of Sugiura books. \nProf Kirti Trivedi, the curator of the exhibition, will give an illustrated talk on the design methodology of Kohei Sugiura, at the inauguration of the exhibition. \nIn collaboration with:\n \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/vibrant-books/",
    "keywords": [
      "Books",
      "Design",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-687.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68518-1736533800-1736539200@bangaloreinternationalcentre.org",
    "name": "The Beauty of Physics",
    "startDate": "2025-01-10T18:30:00+05:30",
    "endDate": "2025-01-10T20:00:00+05:30",
    "description": "Embark on a journey through the evolution of physics, from the mysteries of electrostatics and magnetism to the groundbreaking discoveries of Oersted, Faraday, and Maxwell, culminating in the transformative framework of field theory that underpins modern physics.  Michael Faraday—arguably the greatest experimentalist of all time—pursued an understanding of nature’s beauty, unveiling a new perception of reality. His work demonstrates how pure, theoretical research often drives technological progress more effectively than direct attempts to invent. Faraday’s story highlights the power of curiosity, offering timeless insights into science education that can guide us toward better educational opportunities for all students. \nThis lecture is a part of Azim Premji University’s Public Lecture Series. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-beauty-of-physics/",
    "keywords": [
      "Education",
      "Science"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-55.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67903-1736447400-1736454600@bangaloreinternationalcentre.org",
    "name": "And, Towards Happy Alleys",
    "startDate": "2025-01-09T18:30:00+05:30",
    "endDate": "2025-01-09T20:30:00+05:30",
    "description": "75 mins | Persian, English | 2023 | India, Iran \nFascinated by Iran’s film culture and the poetic works of the feminist poet Forough Farrokhzad, Indian filmmaker Sreemoyee Singh sets out in search of the protagonists of Iranian cinema. Her interactions over six years with filmmakers Jafar Panahi, Mohammad Shirvani and human rights activist Nasrin Sotudeh, among others, depict the precarious situation in which critics of the regime find themselves, including the constant threat of imprisonment and being banned from practicing their profession. With a keen eye for unusual situations, she poetically captures the effect of the Islamic Republic’s omnipresent censorship on the daily lives of Iranian women whose uncompromising struggle has put them at the forefront of the protests that are currently rocking the country. \nAnd, Towards Happy Alleys is a passionate declaration of love for the cinema and poetry of Iran which also provides a frank view of daily life, and bears witness to a fearless generation raising its voice and implacably demanding its civil liberties. \nInspired by Iranian cinema and the poetry of Forough Farrokhzad, a young director from India journeys to Tehran to witness how resistance becomes a daily act of survival in Iranian society. Despite stringent censorship of the Islamic Regime, she collects a series of eloquent and candid interviews with filmmaker Jafar Panahi, activists and Iranian women. Over six years, these conversations with the camera capture the simmering anxieties, fears, hopes and dreams of a nation on the brink of revolution. \nThe screening will be followed by Q&A with the audience. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/and-towards-happy-alleys/",
    "keywords": [
      "Film",
      "Language"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-681.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68149-1736361000-1736366400@bangaloreinternationalcentre.org",
    "name": "Looking for Bombay/Mumbai/Bambai",
    "startDate": "2025-01-08T18:30:00+05:30",
    "endDate": "2025-01-08T20:00:00+05:30",
    "description": "This talk looks at a photographic ecology of the working classes in Bombay/Mumbai/Bambai between the 1970s and 1990s by fine art photographers. It asks in what ways this photographic construction of the laboring population looks at questions of alienation, class, caste, and capitalism. It situates these images at a time when the city was witness to the steady decline of the Communist stronghold among the working classes, moving to embrace the Shiv Sena Party with its anti-migrant rhetoric, liberalization and deindustrialization after the Great Textile Mill Strike of 1982. \nThe talk will be followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/looking-for-bombay-mumbai-bambai/",
    "keywords": [
      "Cities",
      "Photography",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-690.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68366-1736361000-1736366400@bangaloreinternationalcentre.org",
    "name": "Research in Practice",
    "startDate": "2025-01-08T18:30:00+05:30",
    "endDate": "2025-01-08T20:00:00+05:30",
    "description": "For complex projects in the public realm or at the scale of the city, actors become clearly differentiated, and hence the building of constituencies becomes crucial to engage different stakeholders in any project. This is often done through various media to put across ideas, and it is here that research and writing to communicate ideas of the city become an important part of the practice.  \nIn retrospect, publications become a way of creating partnerships, collaborations, and friendships which serve to keep alive the conversations on the issues at hand and engagement with the work we do. Similarly, these publications then go out into the world beyond the project and have a life of their own. But, most critically, in hindsight they allowed us to expand our ‘sphere of influence’ and equipped us to speculate about the future, simultaneously creating an archive of the present.  \nThe acts of archiving and reflecting, as well as simultaneously speculating and being propositional, are critical for us to gain agency as a profession. For, by committing to writing, drawing our speculations, or even discerning the patterns that surround us gives us agency as professionals in society. If we do not have agency or find ways to establish an agency, we will break down as a profession.  \nThis lecture will cover 30 years of Rahul Mehrotra’s research and writings in the context of his engagement as a practitioner as well as advocate for various issues concerning Architecture and Urbanism in India. \nIn collaboration with: \n     \nSupported by: \n    \n",
    "url": "https://bangaloreinternationalcentre.org/event/research-in-practice/",
    "keywords": [
      "Architecture",
      "Books",
      "Design"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-53.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "68408-1736074800-1736083800@bangaloreinternationalcentre.org",
    "name": "ಚಿತೆಗೂ ಚಿಂತೆ | Chithegu Chinthe",
    "startDate": "2025-01-05T11:00:00+05:30",
    "endDate": "2025-01-05T13:30:00+05:30",
    "description": "\nKannada with (English Subtitles) | 1978 |116 minutes  \nMovie star Gajasimha becomes a successful politician despite gangster Thimmaya’s traps. Karate expert Avinash and foreign secret agent Mary work to expose the criminals. \nThis month’s film featured in our informal film club is Chitegu Chinte (1978) \nChitegu Chinte, set in a fictitious country called Gajadweepa, is at once a razor sharp and a side splitting look at power and one man’s relationship with it. The film follows a superstar into his newly fashioned life of a politician. \nA parody of the times that it was made in, it uses all the tropes and elements that made up popular mainstream cinema to give us a keen allegorical satire. \nDirected by MS Sathyu \nWritten by Javed Siddiqui \nDialogue by S Ramaswami \nCinematography by Ashok Gunjal \nEditing by Chakravarti \nProduced by G N Lakshmipathy \nFeaturing CR Simha, Manjula, Paula Lindsay, Ramprakash \nAbout B•Cinematic \n\nCalling all cinephiles! BIC is thrilled to present B•Cinematic, an initiative dedicated to celebrating the most essential, impactful, and artistically significant cinematic works from across the state and the country. \nAt B•Cinematic, our mission is to curate and share those remarkable films that is a must-watch (or re-watch) experience for every passionate cinema lover. From groundbreaking classics to under-appreciated gems, our carefully curated selection will take you on an unparalleled (pun not intended) cinematic journey through the ages. \nThrough curated screenings, insightful discussions, and engaging analyses from distinguished cinematic voices, we aim to not only watch these films together but to truly appreciate their craftsmanship, cultural impact, and intellectual depth. Our vibrant community of film aficionados will collectively rediscover Indian cinema’s most stunning and enduring masterpieces. \nSo join us on this quest to experience the films that have defined and redefined the art form. Don’t miss out on crossing these essential works off your bucket list. Because to truly live, you must first watch the films that make life worth living. \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%9a%e0%b2%bf%e0%b2%a4%e0%b3%86%e0%b2%97%e0%b3%82-%e0%b2%9a%e0%b2%bf%e0%b2%82%e0%b2%a4%e0%b3%86-chithegu-chinthe/",
    "keywords": [
      "Film",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "ಚಿತೆಗೂ ಚಿಂತೆ | Chithegu Chinthe"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_CC.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "68241-1736015400-1736020800@bangaloreinternationalcentre.org",
    "name": "From Africa to India",
    "startDate": "2025-01-04T18:30:00+05:30",
    "endDate": "2025-01-04T20:00:00+05:30",
    "description": "74 mins | English with some English Subtitles | 2003 \nThe African-Indian Sidis of Gujarat practice a unique strand of Sufism. Followers of the 14th century Rifa’i Sufi Saint, Bava Gor, and his disciples Bava Habash and Mai Mishra, Gujarati Sidis invoke Sidi Goma and Sidi Dhamal music and dance as fundamental ritual healing and social practices. Sidis of Karnataka follow various Christian, Hindu, and Muslim paths with their own music and dance traditions.  \nIn From Africa to India: Sidi Music in the Indian Ocean Diaspora, and its sequel The Sidi Malunga Project: Rejuvenating the African Musical Bow in India, UCLA ethnomusicologists Amy Catlin-Jairazbhoy and Nazir Ali Jairazbhoy trace the role of music in Sidi identity in Gujarat, Karnataka, Mumbai, and Hyderabad.  \nProfessor Catlin-Jairazbhoy has been working with the Sidi community in Gujarat for more than 25 years. In 2002 she organized the “Sidis at the Millennium” conference where 400 Gujarati Sidis and several international scholars gathered at the Rajpipla Palace in Narmada District. Juje Siddi from Karnataka, who plans to attend this screening with other local Siddis, was a participant in the conference.   \nThe research was conducted with Amy’s Senior Fellowship from the American Institute of Indian Studies, and is archived in their Archives and Research Centre for Ethnomusicology (ARCE) in Gurgaon, Haryana. At the request of the Sidi community, she co-directed the Sidi Literacy Project (2015-2024), and currently co-directs the Sidi Cultural Centre Project in Bharuch District (2024-) again with Sonal Mehta of Eklavya (Ahmedabad) and Professor Beheroze Shroff (University of California at Irvine).  She looks forward to introducing this project after the screening during discussion with the audience. \nThe screening of the film will be followed by a conversation with the filmmaker. \n",
    "url": "https://bangaloreinternationalcentre.org/event/from-africa-to-india/",
    "keywords": [
      "Anthropology",
      "Culture",
      "Film",
      "Heritage",
      "Music"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "gu",
    "workPresented": {
      "@type": "Movie",
      "name": "From Africa to India"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-684.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "67899-1735326000-1735331400@bangaloreinternationalcentre.org",
    "name": "The Man and His Shadow",
    "startDate": "2024-12-27T19:00:00+05:30",
    "endDate": "2024-12-27T20:30:00+05:30",
    "description": "\n\nThe Man and His Shadow traces the events in the life of KARNA that shaped his character. It then goes beyond Karna’s life to yours and mine – for dilemma is integral to human existence. Journeying along the spectrum of dilemma, we arrive at conflict. And war. There are winners and losers in a war. Karna lost. We often simplify a war to be Good versus Evil. But is it ever that simple? Are we all caught sometimes on the wrong side? Silenced by both sides in the end, where does Karna find voice? Where do we find voice in conflict? \nBringing together literature from multiple Indian languages, this experience is scripted in the format of a dance-theatre performance. The artistes’ exploration of Karna is as much theirs as it is the audience’s. \n\nSupported by:\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/the-man-and-his-shadow/",
    "keywords": [
      "Dance",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Man and His Shadow"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-50.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68198-1736679600-1736685000@bangaloreinternationalcentre.org",
    "name": "Gandhi, the Philosopher",
    "startDate": "2025-01-12T11:00:00+05:30",
    "endDate": "2025-01-12T12:30:00+05:30",
    "description": "In Gandhi’s Integrity: Thinking Radically with Gandhi on Religion, Caste, Capital, Liberalism, Science, and Culture (forthcoming Columbia University Press), Akeel Bilgrami presents an account of the many aspects of Gandhi’s thought in a framework that integrates his resistance against imperialism with his critique of capitalist modernity, raising fundamental questions about how we should understand the relevance of these ideas for our own time and concerns. \nA panel discussion with Akeel Bilgrami (Author), Chandan Gowda (RK Hegde Chair Professor, ISEC) and Rajeev Kadambi (Associate Professor, OP Jindal Global University) moderated by Vishnupad (Dean, ESLA, SRM University, AP) will be followed by a Q&A session with the audience. \nIn collaboration with:\n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/gandhi-the-philosopher/",
    "keywords": [
      "Biography",
      "Books",
      "Philosophy"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_GP.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68336-1736274600-1736280000@bangaloreinternationalcentre.org",
    "name": "Love, Law and the Constitution",
    "startDate": "2025-01-07T18:30:00+05:30",
    "endDate": "2025-01-07T20:00:00+05:30",
    "description": "What does it mean when vulnerable groups end up in Court for their right to love? \nThis session with the author of Urban Elite v. Union of India Rohin Bhatt will discuss a wide range of issues surrounding the queer community in India. \nAmongst others, the author will seek to answer the following questions: How should social impact and public interest legislation be undertaken? What goes through the mind of a queer lawyer when homophobia is masqueraded as a legal argument? \nA conversation between Rohin Bhatt and Arvind Narain will be followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-courtroom-and-beyond/",
    "keywords": [
      "Books",
      "Gender",
      "Law",
      "Nonfiction",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-686.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "68160-1735291800-1735407000@bangaloreinternationalcentre.org",
    "name": "Politicizing Bharatanatyam",
    "startDate": "2024-12-27T09:30:00+05:30",
    "endDate": "2024-12-28T17:30:00+05:30",
    "description": "This two-day event, consisting of lectures and discussion, examines key issues of power and representation in the making of modern Bharatanatyam. Participants will engage in crucial conversations around a range of issues including caste and Brahminic power, colonial and postcolonial histories, ethno-nationalism, and somatic politics in contemporary India. Our goal is to disseminate evidence-based histories for Bharatanatyam, create discussions around caste-based power and performance, and think critically about equitable futures for the arts of South India.  \nPreregistration is required for this workshop and participants must commit to attending all sessions. No on-site registration. Participants must preregister before December 18, 2024. Lunch and coffee will be provided. Participants must commit to attending both days. Participants will be selected based on their responses to questions on the registration form. \nDay 1 | Friday, Dec 27 \n9:30am: Welcome and Introductions \n10:00am – 12:00pm: Lecture\nBharatanatyam: Critical Histories, Power, and Politics\nProfessor Davesh Soneji (University of Pennsylvania) \n12:00pm – 1:00pm: Lunch \n1:00pm – 3:00pm: Lecture and Q & A\nCaste: Servitude, Labor, and the Question of Bharatanatyam’s Historical Narrative\nProfessor Davesh Soneji (University of Pennsylvania) \n3:00pm – 3:30pm: Coffee Break \n3:30pm-5:30pm: Group Discussion\nHistory, Politics, Caste, and Religion\nLed by Nrithya Pillai and Rituparna Pal \nDay 2 | Saturday, Dec 28 \n10:00am – 12:00pm: Lecture\nAesthetic Questions in Modern Bharatanatyam: Sources of Authority, Casteist Taste Habits, and the Politics of Performance\nProfessor Davesh Soneji (University of Pennsylvania) \n12:00pm – 1:00pm: Video Commentary\nProfessor Davesh Soneji (University of Pennsylvania) \n1:00pm – 2:00pm: Lunch \n2:00pm – 3:00pm: Video Commentary\nNrithya Pillai \n3:00pm – 4:30pm: Group Discussion\nAesthetic Practice and Imagining New Futures\nLed by Nrithya Pillai and Rituparna Pal \n4:30pm – 5:30pm: Coffee and Informal Conversation \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/politicizing-bharatanatyam/",
    "keywords": [
      "Culture",
      "Dance",
      "Heritage",
      "History",
      "Performing Arts",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Untitled-design-18.png"
  }
]