[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "85109-1771093800-1771099200@bangaloreinternationalcentre.org",
    "name": "AI as a Creative Partner",
    "startDate": "2026-02-14T18:30:00+05:30",
    "endDate": "2026-02-14T20:00:00+05:30",
    "description": "A tool is only as good as the hands that wield it. \nAnd AI is, after all, another tool. \nThis talk explores how Artificial Intelligence functions as a collaborator for creativity: accelerating exploration, provoking new directions, and sharpening creative judgment. The session opens with live demonstrations that surface instinctive reactions to AI-generated content, then lifts the veil on how these systems actually work and why their outputs can feel genuinely creative. No jargon, just clarity on what’s happening under the hood and why it’s more interesting than you might expect. \nA live co-creation segment puts theory into practice. Using tools like ChatGPT, Suno, and Midjourney, the session demonstrates real creative workflows in action. You’ll discover that the power lives in iteration, selection, and rejection, revealing how human judgment shapes everything that emerges from these systems. \nAI represents the next generation of creative tools, shifting how creation happens, not why it happens. Intent remains yours. Taste remains yours. Meaning remains yours. The talk concludes by exploring the questions that make this moment genuinely intriguing: authorship, originality, bias, ethics. As AI makes output abundant and accessible, your context, lived experience, and values determine what’s worth making in the first place. \n",
    "url": "https://bangaloreinternationalcentre.org/event/ai-as-a-creative-partner/",
    "keywords": [
      "Science",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_AIAACP.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "85246-1770834600-1770840000@bangaloreinternationalcentre.org",
    "name": "When Poetry Refused to Obey",
    "startDate": "2026-02-11T18:30:00+05:30",
    "endDate": "2026-02-11T20:00:00+05:30",
    "description": "A new dawn was breaking. And its light would reach far beyond its time. \nRebellion in Verse unfolds a journey that goes back to the sixth century CE; a time when many yearned for a reprieve from the constraints of Vedic orthodoxy and caste hierarchies. The Tamil Bhakti movement emerged as their clarion call, a grassroots surge of devotion that redefined spirituality and the social fabric itself. The saints of this movement were poets of the people, composing their hymns in Tamil and their verses, brimming with simplicity and profundity, wrestled divine wisdom from the elite grip of Sanskrit and handed it to the masses. \nThis conversation around Raghavan Srinivasan’s book Rebellion in Verse, explores how poetry has long served as a space of defiance: challenging hierarchy, authority, and inherited social orders. Drawing from Bhakti and other traditions, the discussion reflects on how verse carried ideas of equality, desire, and resistance, and why these voices continue to matter today. A Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/when-poetry-refused-to-obey/",
    "keywords": [
      "Books",
      "Culture",
      "Faith",
      "History",
      "Nonfiction",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_WPRTO.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "85265-1770922800-1770928200@bangaloreinternationalcentre.org",
    "name": "Viyoga - Fragments of Light",
    "startDate": "2026-02-12T19:00:00+05:30",
    "endDate": "2026-02-12T20:30:00+05:30",
    "description": "We have drifted. From the earth beneath us, from the quiet wisdom within, from the stillness we once knew. \nCommissioned by Kalavaahini Trust on the occasion of their 10th Anniversary, Viyoga is a dance performance that moves through the fractures of our time. \nBuilt on the premise of loss, it explores how our harmony with nature quietly fades, how the narcissistic self eclipses the deeper truth within, and how unbridled material desires overshadow the spiritual depth that sustains us. \nThrough movement and silence, Viyoga asks us to pause, witness, and rediscover what binds us. \nProduction Credits: \nConcept, Choreography & Lead: Vaibhav Arekar\nCreative Consultant: Malavika Sarukkas\nMusic Composition & Vocal: Karthik Hebbar\nLights & Costumes: Sushant Jadhav\nArtistic Director: Sushant Jadhav\nPercussion Design: Satish Krishnamurthy\nEnsemble: Eesha Pinglay, Swarada Bhave, Poorva Saraswat, Gautam Marathe, Anu Christi Pillai\nOrchestra: Madhuri Seshadri (Vocal), Suma Rani (Sitar), Shrinidhi Mattur (Violin), Shubha (Veena), Vivek Krishna (Flute), Venu (Keyboard)\nRecording: Omkar Studio, Bangalore (Shrinidhi Omkar)\nPoets: Kabir, Sharad Chandra, Sant Tukaram, Annamacharya, Da. Ra. Bendre, Karthik Hebbar \nThis is the eighth edition of the ‘All For Dance’ series presented by Kalavaahini in association with BIC curated by Malavika Sarukkai. The ‘All For Dance’ series is presented every quarter at BIC to spotlight some of the best of classical dance from across India. The event is managed by Shreya Nagarajan Singh Arts Development Consultancy. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/viyoga-fragments-of-light/",
    "keywords": [
      "Culture",
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-9-6.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "85305-1771093800-1771102800@bangaloreinternationalcentre.org",
    "name": "Embracing the Broken",
    "startDate": "2026-02-14T18:30:00+05:30",
    "endDate": "2026-02-14T21:00:00+05:30",
    "description": "Reconsider what it means to be whole. \nIn the Japanese art of Kintsugi, fracture lines become illumination. Damage transforms into something worth keeping. \nRed House brings this meditative practice to Bangalore after reaching over 20,000 participants across India. Their space in Okhla is itself a product of this philosophy: once an abandoned factory, it was converted into a thriving cultural hub in 2022. Now one of Delhi’s pioneering hubs for this ancient art, Red House invites you to experience the ritual firsthand. \nThe process is simple but deliberate. Select a ceramic piece, break it with intention using a hammer, then carefully mend it, watching as golden seams emerge where cracks once lived. Traditional Kintsugi uses lacquer and gold powder in a painstaking, multi-step technique that can take weeks. This workshop offers a more accessible approach, allowing you to complete the full arc of breaking and repair in a single session. You’ll leave with a vessel wearing its history openly, a reminder that our fractures, when tended to, can become the most beautiful part of us. \nAn act of creation that insists our faults and repairs are worth displaying. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/embracing-the-broken/",
    "keywords": [
      "Philosophy",
      "Visual Arts",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_ETB.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "85273-1771068600-1771074000@bangaloreinternationalcentre.org",
    "name": "Citizen, Republic, Conscience",
    "startDate": "2026-02-14T11:30:00+05:30",
    "endDate": "2026-02-14T13:00:00+05:30",
    "description": "What did the architects of the Republic want our symbols to represent? \nAcclaimed musician and public intellectual T M Krishna launches We, the People of India: Decoding a Nation’s Symbols, a rigorous exploration of the tricolour, the Preamble, the national anthem, and the symbols that define Indian democracy. \nIn conversation with urban researcher Gautam Bhan and journalist Dhanya Rajendran, Krishna traces the historical and philosophical origins of these symbols. Together they will unpack how these symbols were born, what they were meant to represent, and how their meanings have shifted in contemporary India. \nA thoughtful inquiry into the past, present, and enduring significance of India’s defining symbols. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/citizen-republic-conscience/",
    "keywords": [
      "Books",
      "Law",
      "Nonfiction",
      "Politics",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-10-4.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "85165-1770663600-1770668100@bangaloreinternationalcentre.org",
    "name": "Johann Sebastian Bach's Goldberg Variations",
    "startDate": "2026-02-09T19:00:00+05:30",
    "endDate": "2026-02-09T20:15:00+05:30",
    "description": "This recital presents J.S. Bach’s Goldberg Variations, BWV 988, performed by pianist Eun Seong Hong. \nThe Goldberg Variations are thirty variations framed by an opening and closing aria, all built on a single, unchanging bass line. Across thirty-two movements, one musical idea unfolds into a hidden architecture in time, at once rigorous and deeply expressive. For the performer, navigating this structure is not only a technical challenge but an inward journey, where each note must carry both order and feeling. \nEun Seong Hong’s first performance of the Goldberg Variations in India, this evening is an invitation to hear how Bach transforms a single idea into a small universe built with astonishing perfection. \n  \nImage Credit \nThumbnail and Poster: Johann Sebastian Bach (aged 61) in a portrait by Elias Gottlob Haussmann (1695-1774), the second version of his 1746 canvas, bequeathed to Bach-Archiv Leipzig by William H Scheide (Princeton, New Jersey). Bach is holding a copy of his six-part canon BWV 1076. \n  \nIn collaboration with: \n \nSupported by: \n    Contact \n",
    "url": "https://bangaloreinternationalcentre.org/event/johann-sebastian-bachs-goldberg-variations/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Johann Sebastian Bach's Goldberg Variations"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-Bach-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84461-1771068600-1771074000@bangaloreinternationalcentre.org",
    "name": "Invisible Empire",
    "startDate": "2026-02-14T11:30:00+05:30",
    "endDate": "2026-02-14T13:00:00+05:30",
    "description": "You’ve received the call. The scam artist trying to get your information. Perhaps you fell for it, perhaps you knew better. In either case, it becomes a story to tell over coffee. \nBut who are the people on the other end of line? \nIn her new book, Scamlands, journalist Snidha Poonam explores the vast fraud economies stretching from small-town India to global scam hubs. Nuanced, detailed and above all, personal, Poonam reports on the many lives that run parallel to our own. Tracing the supply chains of fraud, she reveals an economy that’s both ruthlessly efficient and heartbreakingly human. \nIn this talk, she is joined by columnist Aakar Patel to explore the themes of the book. They will examine how scam economies thrive in the gaps of inequality, why trust is collapsing faster than we can rebuild it, and what it means when fraud becomes a viable career path for an entire generation. The session ends with an audience Q&A. \nThere are no easy answers, but you’ll know more when that unknown number calls again. \n",
    "url": "https://bangaloreinternationalcentre.org/event/invisible-empire/",
    "keywords": [
      "Books",
      "Economics",
      "Law",
      "Media",
      "Nonfiction",
      "Policy & Regulation",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_IE.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "85253-1770838200-1770841800@bangaloreinternationalcentre.org",
    "name": "LONO: The Woman Who Had Two Navels",
    "startDate": "2026-02-11T19:30:00+05:30",
    "endDate": "2026-02-11T20:30:00+05:30",
    "description": "“The distinction between past, present and future is only a stubbornly persistent illusion.” — Albert Einstein \nA woman sits at a table. A lamp flickers. And between the two of them, an entire inner world comes alive. \nWho manipulates whom? \nWhat follows is a quiet, unsettling dance between light and shadow, memory and imagination. A dialogue played out without words between a performer and a lamp that refuses to stay in its place. One dominates. Then the other. The rules keep shifting, and the audience is never quite sure who is in control. \nThrough dance and puppetry, LONO offers a reflection on the stories we tell ourselves about who we are. What remains is not stillness but a restless balance: the soul caught somewhere between what was and what is yet to come. \nLONO – The Woman With Two Navels is presented by the 12th Attakkalari India Biennial in collaboration with the Goethe-Institut / Max Mueller Bhavan Bangalore. \nPlease note: Strictly no entry once the program has begun. \nPresented by:\n         \n",
    "url": "https://bangaloreinternationalcentre.org/event/lono-the-woman-who-had-two-navels/",
    "keywords": [
      "Dance",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "LONO: The Woman Who Had Two Navels"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-8-10.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "85429-1771718400-1772409599@bangaloreinternationalcentre.org",
    "name": "Pravāha 2026",
    "startDate": "2026-02-22T05:30:00+05:30",
    "endDate": "2026-03-02T05:30:00+05:30",
    "description": "Born from a vision to unite masters and experimentalists on a single stage, Pravāha debuted in 2024. The second edition of this festival, The Body As Space, explores how we experience the world through sight, sound, touch, taste, and smell. \nOver eight days, the festival becomes a journey through sensation. Classical melodies meet olfactory landscapes. Contemporary dance transforms into tactile dialogue. Installations immerse you in sound, scent, and memory itself. Conversations uncover India’s forgotten sensory archives and trace the origins of instruments that changed how we listen. \nWe invite you to tune into what you’ve always carried: the intelligence of your body, the stories held in your senses. \nFull schedule to be announced soon! \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/pravaha-2026/",
    "keywords": [
      "Experience",
      "Performing Arts",
      "Pravaha",
      "Theatre",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Pravāha 2026"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/WhatsApp-Image-2026-02-06-at-16.55.52.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "85124-1771353000-1771360200@bangaloreinternationalcentre.org",
    "name": "Life in Metaphors",
    "startDate": "2026-02-17T18:30:00+05:30",
    "endDate": "2026-02-17T20:30:00+05:30",
    "description": "84 minutes | English & Kannada with English subtitles | India | 2015 \nWhen banker Om Prakash Srivastava attended a 2012 FTII master class with Girish Kasaravalli, one screening of Dweepa changed everything. Inspired, he abandoned his career to create this National Award-winning portrait of India’s most decorated filmmaker. \nSrivastava brings together luminaries including Adoor Gopalakrishnan, Deepti Naval, Shyam Benegal, and U.R. Ananthamurthy, who illuminate Kasaravalli’s remarkable journey from Ghatashraddha (1975) to Koormavatara (2013). Across fifteen National Award-winning films, Kasaravalli has built a cinema of silence, metaphor, and moral inquiry. \nCrafted with sensitivity and restraint, Life in Metaphors reveals how everyday life, memory, and folklore transform into enduring images on screen. It is both portrait and meditation on the art of seeing itself. \nThe screening will be followed by a discussion with the filmmaker. \n",
    "url": "https://bangaloreinternationalcentre.org/event/life-in-metaphors/",
    "keywords": [
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "Life in Metaphors"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-3-6.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "85279-1770912000-1770919200@bangaloreinternationalcentre.org",
    "name": "The Body Leads the Mind",
    "startDate": "2026-02-12T16:00:00+05:30",
    "endDate": "2026-02-12T18:00:00+05:30",
    "description": "Drawing from Commedia dell’arte, clowning, and physical theatre, this workshop puts the body first. It explores how physical action, form, and rhythm can unlock imagination, presence, and emotional life in ways that psychological approaches alone cannot. \nDeveloped in collaboration with La Compagnie Dramatique, whose long-running, critically acclaimed comedy by Dario Fo, The Open Couple, has been in repertoire since 2013, this workshop offers an inside look at the playful, high-energy physical tools used in making a full-scale professional production, and how they are shaped into clear, dynamic storytelling. \nWho It’s For \nFor actors and theatre practitioners, this workshop loosens habitual patterns, rebuilds physical ease, and rediscovers play. It is particularly useful if you feel blocked, overly cerebral, or curious about comedy and physical performance. \nFor writers, directors, educators, or anyone curious about how performers work, the principles here extend well beyond the stage. Presence, adaptability, attention, and expressive freedom are skills that land anywhere. \nCuriosity, openness, and a willingness to play are enough. \nInside the Workshop \n\nDiscover the impact of exaggeration, contrast and neutrality \nWitness the relationship between physical form and inner state\nExperience mindful presence, unburdened play, and the pleasure of being seen\nLearn to make an audience lean in with physical storytelling, rhythm, and clarity\nLearn how these tools are ultimately shaped in service of text and performance\n\nParticipants will engage with the kinds of physical, rhythmic, and embodied approaches that are used in the making of a full-scale professional production. The workshop offers an inside look at how playful, high-energy physical exploration is later shaped, refined, and structured into clear storytelling and performance craft. The workshop is designed not for mastery in a single session, but for opening doors: to imagination, confidence, and a deeper appreciation of theatrical craft. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-body-leads-the-mind/",
    "keywords": [
      "Performing Arts",
      "Theatre",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "The Body Leads the Mind"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-112.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "84848-1771153200-1771158600@bangaloreinternationalcentre.org",
    "name": "In Search of Rain",
    "startDate": "2026-02-15T11:00:00+05:30",
    "endDate": "2026-02-15T12:30:00+05:30",
    "description": "Can you turn trash into treasure? \nLed by 6th and 7th graders from Ramagondanahalli Government School, this shadow puppetry workshop is all about having fun while helping the Earth. \nYou’ll create your own puppets, invent exciting stories about sustainability, and put on a shadow theatre performance. It’s playful, it’s creative, and you’ll show others how reusing simple materials can make a big difference for our planet! \nNote: Do you have extra paper bags at home? Bring them along! \n\nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \n\nSupported by:\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/in-search-of-rain/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Performing Arts",
      "Theatre",
      "Visual Arts",
      "Workshops",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "In Search of Rain"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_ISOR.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84782-1771007400-1771012800@bangaloreinternationalcentre.org",
    "name": "Tell Me a Story about Our World",
    "startDate": "2026-02-13T18:30:00+05:30",
    "endDate": "2026-02-13T20:00:00+05:30",
    "description": "A single family. A small village. An entire nation’s story hiding inside. \nTell Me A Story About Our World brings together academic and translator Vanamala Viswanatha and novelist Kavery Nambisan for a conversation about the art of fiction and storytelling, based on Nambisan’s latest novel, Rising Sons. Set in a village in Karnataka, following one family from pre-independent India through to the 1970s, threading through the complexities of caste and colonialism while painting vivid landscapes of rural and urban life in a bygone era. \nWhat makes Rising Sons sing is how Nambisan inhabits her world. Kannada coexists comfortably within the English, not as a novelty but as a force of realism, enabling the reader’s sensibility to percolate through society at every level. Then there is the narrator: never formally introduced, yet unmistakably present, speaking of “our village” and “our daily lives” with a voice that is not quite impartial. The resulting text reads as both narration and remembrance, an immersion into a carefully crafted world. \nThe stories we tell are as much about the Word as they are about the World. Expect an interesting and illuminating conversation, followed by a Q&A with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/tell-me-a-story-about-our-world/",
    "keywords": [
      "Books",
      "Fiction",
      "Language",
      "Literature",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-111.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "84332-1770570000-1770577200@bangaloreinternationalcentre.org",
    "name": "Menace",
    "startDate": "2026-02-08T17:00:00+05:30",
    "endDate": "2026-02-08T19:00:00+05:30",
    "description": "42 minutes |  English & Hindi with English subtitles | India | 2025 \nCompassion. Conflict. Culling. Care. \nMenace is a documentary that examines one of the most contested questions in contemporary Indian cities: how do we coexist with stray dogs? Set against recent judicial directions and everyday urban realities, the film moves beyond polarised debates to explore the moral, legal, and governance dimensions of the issue. Through voices from animal welfare practitioners, veterinarians, lawyers, municipal actors, adopters, and citizens, Menace traces the shift from historical practices of dog culling to the Animal Birth Control (ABC) framework, while questioning why humane policies often fail in implementation. \nThe screening will be followed by a moderated conversation bringing together perspectives from law, animal welfare, and civic practice. This programme invites audiences to engage with complexity, contradiction, and ethical choice: opening space for reflection on how cities negotiate care and safety without resorting to cruelty or neglect. \nThe discussion will be followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/menace/",
    "keywords": [
      "Film",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "Menace"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-1-15.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "84499-1771176600-1771182000@bangaloreinternationalcentre.org",
    "name": "An Orphanage of Memories",
    "startDate": "2026-02-15T17:30:00+05:30",
    "endDate": "2026-02-15T19:00:00+05:30",
    "description": "21 minutes | Kashmiri and Hindi with English subtitles | 2024 | India \nWhen grief becomes obsession. \nAfter losing her husband under mysterious circumstances, Farah clings to his memory through the saplings he brought to their kitchen garden. But when rats threaten the fragile plants, and a land buyer threatens her home, Farah’s devotion spirals into dangerous obsession. \nIt is shot during Kashmir’s bleakest season, deliberately stripping away the region’s famous beauty to focus on something rarely seen in Indian cinema: the inner life of a Kashmiri woman, not the postcard landscape around her. \nFollowing the screening will be a discussion with the Film Director, Rayit Hashmat Qazi and Research Analyst, Aishwaria Sonavane. The session will close with an audience Q&A. \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/an-orphanage-of-memories/",
    "keywords": [
      "Film",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "An Orphanage of Memories"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-11-4.jpg"
  }
]