[
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "73152-1745605800-1745611200@bangaloreinternationalcentre.org",
    "name": "An Exemplary Indian Life",
    "startDate": "2025-04-25T18:30:00+05:30",
    "endDate": "2025-04-25T20:00:00+05:30",
    "description": "This special BIC event honours the contributions of Gopalkrishna Gandhi—public servant, diplomat, writer, and scholar. Over the course of his career, he has held a range of significant positions including Secretary to the President of India, High Commissioner to South Africa and Sri Lanka, and Governor of West Bengal. He was also the Founder-Director of the Nehru Centre in London. \nAlongside his public service, Gopal Gandhi has pursued a sustained literary life. His writings include Refuge, a novel centred on the Tamil experience in Sri Lanka; an award-winning Hindi translation of Vikram Seth’s A Suitable Boy (Ek Achcha Sa Ladka); several edited volumes of Mahatma Gandhi’s writings; and most recently, The Undying Light, a personal reflection on independent India. \nThe evening will begin with a talk on Gopal Gandhi’s work and influence by historian Ramachandra Guha, followed by a vocal recital by the acclaimed classical musician T. M. Krishna with R K Shriramkumar on the Violin and K Arun Prakash on the Mrdangam. \n",
    "url": "https://bangaloreinternationalcentre.org/event/an-exemplary-indian-life/",
    "keywords": [
      "Biography",
      "Governance",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "An Exemplary Indian Life"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-810.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "72651-1745519400-1745526600@bangaloreinternationalcentre.org",
    "name": "Humans In The Loop",
    "startDate": "2025-04-24T18:30:00+05:30",
    "endDate": "2025-04-24T20:30:00+05:30",
    "description": "74 minutes | India | 2024 | Hindi, Kurukh with English Subtitles \nAn Adivasi woman begins interacting with AI while working in a data centre in remote Jharkhand. \nAfter a divorce, Nehma returns to her ancestral village with her children. To support her family, she takes an unusual job as a ‘data labeler’. She trains algorithms to recognise & distinguish objects, approaching the task with the care of a parent teaching their child. As she works, Nehma uncovers human biases in AI systems, questioning if AI can truly ever adapt to an indigenous perspective. \nAranya Sahay’s layered Humans in the Loop, brings AI and Adivasi reality together while taking the viewer through a woman’s attempts to mend her strained relationship with her adolescent daughter. \nThe film screening will be followed by a conversation between the Director, Aranya Sahay, and Shrikant Karwa. \nCredits:\nWriter & Director | Aranya Sahay\nProducers | Mathivanan Rajendran, Sarabhi Ravichandran & Shilpa Kumar\nCast | Sonal Madhushankar, Ridhima Singh, Geeta Guha, Anurag Lugun, Monika, Aranya Sahay\nDirector of Photography | Monica Tiwari, Harshit Saini\nEditing | Swaroop Reghu, Aranya Sahay\nSound Design | Kalhan Raina\nMusic | Saransh ‘KHWAGBAH’ Sharma\nColorist | Uday Oswal, Toshik Saraf\nProduction Design | Shubham Solanki \n",
    "url": "https://bangaloreinternationalcentre.org/event/humans-in-the-loop/",
    "keywords": [
      "Film",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "Humans In The Loop"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-811.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "72932-1745172000-1745177400@bangaloreinternationalcentre.org",
    "name": "Everyday Lives, Extraordinary Stories",
    "startDate": "2025-04-20T18:00:00+05:30",
    "endDate": "2025-04-20T19:30:00+05:30",
    "description": "This conversation on Heart Lamp: Selected Stories will delve into Banu Mushtaq’s fearless storytelling and her portrayal of women navigating faith, family, and societal expectations in southern India. The speakers will explore how Mushtaq’s journalistic and legal background shaped her writing, giving voice to the struggles and resilience of Muslim women. Translator Deepa Bhasthi, whose masterful rendering brings these stories to an English-speaking audience, will share insights into the nuances of language, the challenges of retaining Mushtaq’s distinctive voice, and the role of translation in preserving and amplifying regional literature. Through anecdotes from the book and reflections on contemporary gender and caste dynamics, the discussion will highlight the power of fiction to challenge norms, preserve oral histories, and inspire change. \n",
    "url": "https://bangaloreinternationalcentre.org/event/everyday-lives-extraordinary-stories/",
    "keywords": [
      "Books",
      "Culture",
      "Fiction",
      "Gender",
      "Literature"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-808.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "72894-1745751600-1745755200@bangaloreinternationalcentre.org",
    "name": "The Birthday Party",
    "startDate": "2025-04-27T11:00:00+05:30",
    "endDate": "2025-04-27T12:00:00+05:30",
    "description": "Step into a world of colour, kindness, and creativity with The Birthday Party, a delightful puppet show that brings life skills to the stage through the magic of puppetry. Created especially for Autism Awareness Month, this engaging performance follows a young boy and his father as they prepare for a friend’s birthday party—learning lessons in friendship, cooperation, and emotional understanding along the way. \nFeaturing vibrant, expressive puppets and a visually immersive traditional puppet theatre setup, the show is designed to support the sensory and social needs of autistic children while offering an enriching experience for audiences of all ages. With clear emotional cues, playful storytelling, and gentle visual and auditory transitions, The Birthday Party opens a meaningful dialogue about family, empathy, and everyday challenges. \nThis inclusive performance is open to all children and families, and especially welcomes those in the neurodiverse community to enjoy theatre in a safe, supportive space. Whether you’re laughing along with the characters or learning new ways to connect, this joyful production is sure to leave a lasting impression. \nThe 30 minute performance will be followed by a 30 minute Q&A with the audience. \nIn collaboration with: \n \nThe team at Colours Centre for Learning – an NGO for Autism, has conceptualised and developed The Birthday Party entirely in-house, drawing on their deep expertise in autism education, art, and theatre production. Blending creative storytelling with an inclusive approach to learning, the production reflects the team’s commitment to using the arts as a meaningful tool for engagement, expression, and skill-building among autistic individuals. From scriptwriting and puppet design to stagecraft and performance, every aspect of the show has been thoughtfully created to support both educational and emotional development through a rich, sensory-friendly experience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-birthday-party/",
    "keywords": [
      "Theatre",
      "Visual Arts",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-804.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "72828-1745348400-1745353800@bangaloreinternationalcentre.org",
    "name": "The Soul Within the Strings",
    "startDate": "2025-04-22T19:00:00+05:30",
    "endDate": "2025-04-22T20:30:00+05:30",
    "description": "Vidushi Debasmita Bhattacharya presents a sarod recital featuring compositions from the Senia Shahjahanpur Gharana. Known for its lyrical phrasing and nuanced expression, the gharana’s distinctive style will be explored through a selection of evening ragas, performed in a twilight setting. \nAccompanied by Shri Trilochan Kampli on tabla, Debasmita Bhattacharya will present a repertoire that reflects both the depth of her training and her evolving musical voice. The concert offers an opportunity to engage with a tradition that continues to evolve while remaining rooted in classical form. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-soul-within-the-strings/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Soul Within the Strings"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-806.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "72867-1745346600-1745353800@bangaloreinternationalcentre.org",
    "name": "Handmade Guitars: Passion in the Art & Craft of Lutherie",
    "startDate": "2025-04-22T18:30:00+05:30",
    "endDate": "2025-04-22T20:30:00+05:30",
    "description": "Lutherie is the making of stringed instruments out of wood, by hand. \nMost of us are used to seeing factory-made instruments and tend to take them for granted. Understanding Lutherie gives us a glimpse into a very different world – one that combines design, deep understanding of tone and timbre and the manner in which every part of a guitar affects them, extreme respect for details and more details, the love of wood and mastery over craftsmanship of wood – a world of limitless possibilities, where no two instruments are ever alike. \nThis is the story of a pair of luthier-made instruments, a Bass and a Guitar; the passion and love that created them and the extraordinary relationship between Luthier and Musician they are based upon . \nThis session provides a glimpse into an art and a craft that has immense intricacies and of which very, very few people (including guitar players) are aware. Vinoo Matthew will demonstrate to people that there are no limits to intricacy and detail in anything one might choose to do – handmade garments to surgery to corporate governance. \nThe talk will be followed by a performance by the Sarpajur Blues Band, a duo consisting of Vinoo Matthew on electric guitar and Shekhar Seshadri on acoustic guitar. The Sarjapur Blues Band (SBB) is an underground, eclectic, backstreet, workingmen’s, original, rhythm and blues band \n",
    "url": "https://bangaloreinternationalcentre.org/event/handmade-guitars-passion-in-the-art-craft-of-lutherie/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Handmade Guitars: Passion in the Art & Craft of Lutherie"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-805.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "72095-1745776800-1745784000@bangaloreinternationalcentre.org",
    "name": "Rise of Sport in India",
    "startDate": "2025-04-27T18:00:00+05:30",
    "endDate": "2025-04-27T20:00:00+05:30",
    "description": "India’s sporting landscape has dramatically transformed over the past few decades. Traditionally dominated by cricket, the country has emerged as a powerhouse in multiple disciplines, including badminton, wrestling, boxing, and athletics. \nThe rise of leagues such as the Indian Premier League (IPL), Pro Kabaddi League, and Indian Super League (ISL) has played a crucial role in popularizing various sports and providing financial support to athletes. Additionally, India’s improved performance in global events like the Olympics, Commonwealth Games, and Asian Games has boosted national pride. Charu Sharma with his decades of experience leading RCB and even conceptualizing Kabbadi League will tell this story. \nThe Devatha Radhakrishna Memorial Lecture \nDevatha Radhakrishna was not only a visionary entrepreneur but a lifelong seeker—curious, resilient, and deeply reflective. From building a thriving silk and garment empire to exploring law, organic farming, and philosophy, he approached every pursuit with passion and purpose. Even in adversity, he found meaning, drawing strength from the wisdom of D.V. Gundappa and Tolstoy. To him, business, literature, and spirituality were not separate paths but part of a single journey. This memorial lecture honours a life lived with conviction, curiosity, and an unyielding spirit. \nPresented by: Sriram Devatha. \n",
    "url": "https://bangaloreinternationalcentre.org/event/rise-of-sport-in-india/",
    "keywords": [
      "In Memory",
      "Sports"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-2-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "72321-1745164800-1745172000@bangaloreinternationalcentre.org",
    "name": "I Scroll, Therefore I Am",
    "startDate": "2025-04-20T16:00:00+05:30",
    "endDate": "2025-04-20T18:00:00+05:30",
    "description": "Go from doom-scrolling to decoding – uncover the pop culture politics behind trends, memes, and reels with clarity. Unpack your feed with art history hacks, cultural theory, and a critic’s sass. 2 hours, no jargon only smarts. The algorithm won’t see this coming. \nWhy do we doom-scroll against our doom? Why does the Instagram feed consume us, even when we’re the ones curating it? Why must our social media always outshine our social reality? In this workshop, we’ll unravel the strange logic of our digital desires, using tools from psychoanalysis, cultural theory, and art criticism. We’ll critique not just Instagram but ourselves—how we scroll, what we seek, and why we can’t look away. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/i-scroll-therefore-i-am/",
    "keywords": [
      "Media",
      "Technology",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-801.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73129-1745692200-1745697600@bangaloreinternationalcentre.org",
    "name": "A Crossroads of Empires",
    "startDate": "2025-04-26T18:30:00+05:30",
    "endDate": "2025-04-26T20:00:00+05:30",
    "description": "The early medieval period in South Karnataka was a time of vigorous cultural change. Between the 10th and 13th centuries CE, it became a frontier region between the sprawling Chola and Chalukya empires, allowing for migration, the development of new trade networks, and the rise of innovative temple cultures. Tamil peasant-warriors and traders settled in South Karnataka, significantly contributing to the region’s already cosmopolitan character—an influence still visible in the temple architecture of Bengaluru and its vicinity. The Chola presence also introduced new models of royal power that shaped the emerging Hoysala dynasty. Drawing on architectural, art historical, and epigraphical material, Anirudh Kanisetti examines the Chola impact on South Karnataka and how it continues to shape Bengaluru’s urbanism today. A Q&A with the audience will follow. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-crossroads-of-empires/",
    "keywords": [
      "Books",
      "Cities",
      "Culture",
      "Heritage",
      "History",
      "Literature",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-812.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "72401-1745751600-1745757000@bangaloreinternationalcentre.org",
    "name": "Barahmasi | बारहमासी",
    "startDate": "2025-04-27T11:00:00+05:30",
    "endDate": "2025-04-27T12:30:00+05:30",
    "description": "Barahmasi, is an amalgamation of semi classical genres sung throughout the year just like the Periwinkle or Barahmasi flower that blooms round the year. An enchanting curation of thumri, dadra, tappa, chaiti, kajri, hori, jhoola, ghazal, bhajan and beautiful Malwi folk tunes, Barahmasi is an interactive show featuring Kanakshree and Savni Bhatt where they will perform the 12 semi-classical forms of Indian music that resonate throughout the year. Delve into the harmonious world of Indian classical music, where each note is steeped in tradition and brought to life with the passion of two generations. \nIt has been observed that Indian Classical mehfils often end with a semi classical composition like thumri, dadra or sometimes the season dependent chaiti or kajri. However, the constraints of time and season shouldn’t stop one from enjoying these forms at any time of the year… The very thought gave birth to Barahmasi where one walks out with songs of the year that echo in one’s heart and a one of its kind experiences where all of the said forms come together in a single concert. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/barahmasi-%e0%a4%ac%e0%a4%be%e0%a4%b0%e0%a4%b9%e0%a4%ae%e0%a4%be%e0%a4%b8%e0%a5%80/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Barahmasi | बारहमासी"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-814.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "72836-1745521200-1745526600@bangaloreinternationalcentre.org",
    "name": "The Universe in a Pot",
    "startDate": "2025-04-24T19:00:00+05:30",
    "endDate": "2025-04-24T20:30:00+05:30",
    "description": "The pot in its various forms is the most common musical instrument in India. Cutting across all musical genres, the ghatam has spoken the musical language of the common people as well as expert drummers. \nIn Indian wisdom and bhakti traditions too, the clay pot holds a very special place. Mystics, poets and saints spanning many centuries and regions have extensively used the metaphor of the clay pot to talk about the fragility of the human body and the enormous possibilities of human existence. \nIn this performance titled The Universe in a Pot, musicians Sumana and Saitejas bring together a sonic and a lyrical experience centred around the simple clay pot. The performance takes the audience on a musical journey that blends together the diverse soundscapes that are possible on this simple yet powerful instrument, along with songs, stories and poetry of the mystics that celebrate the pot. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-universe-in-a-pot/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Universe in a Pot"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-807.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "72856-1745434800-1745438400@bangaloreinternationalcentre.org",
    "name": "Rakhtabha",
    "startDate": "2025-04-23T19:00:00+05:30",
    "endDate": "2025-04-23T20:00:00+05:30",
    "description": "This Kathak production is in four parts. \nWoman in Red – Bold and Beautiful \nBreathtaking, mesmerizing, and radiant— Much like the sun, which dips below the horizon and engulfs us in a crimson embrace, the lady in red stands there with a magnetic gaze on her. She is bold, beautiful, unstoppable, and embodies a fiery energy. Her magical aura makes time stand still and ensures that the minute she walks in her red dress, all eyes are always on her.\nComposed in Raag Darbari and Tal Tivra. \nAdi Shakti – Powerful and Unassailable \nRed because she is Kriya, or Shakti in action. She is a primordial red goddess and is beyond defeat. Red is the color of the Hindu goddess Durga, who represents feminine power, vanquished evils and new beginnings.\nComposed in Durga Shlok and Stuti. \nBalma Re – Thumri (Pt Birju Maharaj) \nHindu wedding customs state that a woman should wear red at her wedding. The woman is waiting for her beloved in this piece. She prepares for the wedding of her dreams.\nThumri is a vocal genre or style of Indian music. The text is romantic or devotional in nature, and usually revolves around a girl’s love for the beloved. \nSamagam – Amalgamation of Strength and Love \nThis is the concluding piece of the production. An amalgamation of beauty and power in the form of tarana composed in Raag Darbari and Taal teental. \nConcept and choreography : Aishwarya Verma\nWritten by (First Segment ‘Woman in Red’) : Sunita Verma\nMusic Composition and Vocals : Jaywardhan Dadhich\nPercussionist : Roman Das on Pakhawaj and Divyanshu on Tabla\nSitar : Uma Shankar\nProduced by : Aaharyam Nrityashaala Dance Foundation and Educational Trust \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/rakhtabha/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-794.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73139-1745694000-1745699400@bangaloreinternationalcentre.org",
    "name": "The Dirty Sky",
    "startDate": "2025-04-26T19:00:00+05:30",
    "endDate": "2025-04-26T20:30:00+05:30",
    "description": "English | 73 mins | India | 2025 \nIn an era where our lives increasingly depend on satellites for everything from communication to weather forecasting, The Dirty Sky delves into the escalating crisis of orbital debris – the uncontrolled trash accumulating in space. Through a detailed exploration of the history of satellite launches, the film sheds light on the exponential increase in non-functional satellites, leading to a severe threat to our orbital environment and space sustainability. It underscores the growing dangers posed by orbital debris, which, much like terrestrial pollution, is an unseen but pervasive threat to space activities. The Dirty Sky emphasizes the urgency for global awareness and action. It advocates for the public and world leaders to raise a concerted voice, urging competing nations and commercial companies to take concrete steps before our beautiful sky becomes as uninhabitable as the polluted seas and air on Earth – the only home humanity has. \nThe screening will be followed by a Q&A session with the filmmaker. \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-dirty-sky/",
    "keywords": [
      "Environment",
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-813.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "72882-1745433000-1745438400@bangaloreinternationalcentre.org",
    "name": "Taking the Temperature of Society",
    "startDate": "2025-04-23T18:30:00+05:30",
    "endDate": "2025-04-23T20:00:00+05:30",
    "description": "The fiercest wars are fought between siblings. \nTara, a successful Delhi lawyer, is everything her younger brother isn’t: dedicated, independent, thriving. When their beloved father retires, he summons them to a meeting. But what he has to say threatens to tear the family apart. Tara’s friend Lila has it all: a great job, a lovely home, a beautiful family. \nBut when Lila’s father dies unexpectedly, her brother wastes no time in claiming what he thinks is his. Together, Tara and Lila are forced to confront the challenge that their ambition poses to patriarchal Delhi society. Set against a backdrop of ecological collapse and political unrest, The Tiger’s Share is both a family and a state-of-the-nation novel. \nThe Tiger’s Share, Keshava Guha’s incisive new novel unravels sibling rivalries set against the backdrop of a rapidly changing India. Guha’s storytelling transforms personal conflicts into a lens for examining societal upheavals – from shifting family loyalties to the pressures of urban ambition. \nIn this session, Keshava Guha will be in conversation with novelist and playwright, Vivek Shanbhag. A Q&A with the audience will follow. \nIn collaboration with: \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/taking-the-temperature-of-society/",
    "keywords": [
      "Books",
      "Cities",
      "Fiction"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTERs-3.jpg"
  }
]