[
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "64302-1727632800-1727638200@bangaloreinternationalcentre.org",
    "name": "The Eternal Echo",
    "startDate": "2024-09-29T18:00:00+05:30",
    "endDate": "2024-09-29T19:30:00+05:30",
    "description": "Join us for a evening of musical reverence at The Eternal Echo, a heartfelt homage to the revered santoor maestro, Pt. Shiv Kumar Sharma, whose music has left an indelible mark on the world of classical music. \nIn this special concert, late Pt. Shiv Kumar Sharma’s senior disciple, Pt. Dhananjay Daithankar, along with his son Ninad Daithankar, will come together to honor the legendary artist’s legacy through a santoor duet. Through their performance, they will revisit and share with us the music that they internalised through the teachings of Shiv Kumar Sharma and that which defined his illustrious career, offering an intimate glimpse into the profound artistry and innovative spirit of the maestro. \nAs they traverse the rich tapestry of melodies that Shiv ji crafted, this concert will not only celebrate his contributions to music but also reflect on his influence on generations of musicians and listeners alike. They will be accompanied by Shantanu Deshmukh on Tabla. This concert will be held in the Seminar Halls on the first floor. \nSupported by: \n \n  \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-eternal-echo/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Eternal Echo"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-610.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64017-1726963200-1727222399@bangaloreinternationalcentre.org",
    "name": "The Indian Tribal Folklore Archive",
    "startDate": "2024-09-22T05:30:00+05:30",
    "endDate": "2024-09-25T05:30:00+05:30",
    "description": "Exhibition Opening: Sunday, 22 September, 12:30pm \nExhibition Timings: 10am to 8pm \nExhibition on show until: Tuesday, 24 September, 8pm \nWalkthroughs with Curator: \nSunday, 22 September, 12:30pm and 5pm\nMonday, 23 September, 6pm\nTuesday, 24 September, 6pm \nKids Storytelling Workshop (Library): Sunday, 22 September, 3pm – 4pm \nMusic Performance: Sunday, 22 September, 6pm – 7pm \nDocumentary Film Screening (Library): Monday, 23 September, 6:30pm – 7:15pm \nThe Indian Tribal Folklore Archive exhibition is a vibrant celebration of five Indian tribal communities, bringing to life their worlds through the rich tapestry of their folktales. These works are not merely artistic interpretations; they are deeply informed by thorough research and genuine engagement with the tribes, in collaboration with folklorists. \nTribal documentation transcends simple record-keeping; it becomes a powerful narrative of empowerment, self-assertion, and celebration. This exhibition invites you to embrace the diversity that shapes our collective identity, cherish the stories that unite us, and build a future that pays homage to the richness of our shared heritage. \nIn the intricate fabric of India’s culture, tribal documentation emerges as a vital thread, imbued with deep meaning and significance. The celebration of Indian tribal folklore becomes a reflection on the enduring resilience and cultural wealth of indigenous communities. It tells a story steeped in tradition’s quiet strength and the profound interconnectedness of all Indians. \nKids Storytelling Workshop:\nWeave stories with Curator Deepshika Maity and Artist Amrapali Das and explore the rich world of folklore. Through engaging activities, children will have the opportunity to immerse themselves in traditional stories and create their own tales inspired by elements of Indian folklore.The workshop encourages creativity, imagination, and a deeper connection to cultural heritage. Kids will not only learn the art of storytelling but also gain an appreciation for the timeless wisdom embedded in these stories. It’s an interactive and fun experience, fostering a love for stories while building creative confidence. \nMusic Performance:\nA folk music performance by Dipanjali Deka will interweave songs, poems, and stories of devotion, nature, and love. Her work celebrates the diverse folk voices and languages of the subcontinent that often go unheard in the noise of our daily lives. Moving through Assamese, Rajasthani, Bengali, Punjabi, and more, she will sing of nature, social critique, fear and fearlessness, divine surrender, and mystical joy. \nDocumentary Film Screening (Library): \nThe Missing Rainbow – Tribal and Folk Art | 2019 | 40 minutes \nThis documentary by filmmaker Gita Hudson celebrates and brings attention to India’s vibrant tribal arts. Filmed during a painting camp at the Tribal Museum in Arakku Valley, Andhra Pradesh, in 2019, the story follows twelve exceptional women artists from different states across India, the unique art forms and their lives. \nCurated by Deepshikha Maity and Amrapali Das of Kaahaani Ghar.\n \nKaahaani Ghar believes in the transformative power of storytelling to connect communities and inspire change. They are driven by the ambition to revive the magic of Indian folklore, weaving it back into the fabric of our society and rekindling love for our shared heritage. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-indian-tribal-folklore-archive/",
    "keywords": [
      "Heritage",
      "Mythology",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "as",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-602.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64520-1727375400-1727380800@bangaloreinternationalcentre.org",
    "name": "The Forum",
    "startDate": "2024-09-26T18:30:00+05:30",
    "endDate": "2024-09-26T20:00:00+05:30",
    "description": "In this session of The Forum, we focus on the critical intersection of gender, urban spaces, and security. As cities expand and evolve, the safety and inclusivity of women within these spaces remain essential concerns. This discussion will center around the challenges women face in navigating urban environments, whether due to inadequate infrastructure, social norms, or policy shortcomings. \nPublic spaces—whether transportation hubs, parks, or streets—should be accessible to all, but many women experience these spaces as fraught with danger or restrictions. In this session, we aim to dissect these issues while also looking at how socio-economic backgrounds can further shape a woman’s experience of urban life. The role of law enforcement and public policy in addressing gender-based violence is another important focus. Finally, this session will consider how the ability to move freely and confidently through the city is linked to broader issues of mobility and access. By engaging with these topics, we hope to generate ideas for creating cities that prioritise safety for all, especially women. \nThis is the second of our sessions titled, The Forum, a series of engaging discussions held at the BIC Library. Our goal is to bring together individuals from all walks of life, ages 15 to 50, to discuss topics of importance in a setting that is both informed and informal. Whether you’re passionate about current events, social issues, or cultural topics, The Forum provides a platform for open dialogue and thoughtful exchange of ideas. Inspired by the ancient Roman forums, where citizens gathered to discuss and debate the issues of the day, these sessions aim to revive this tradition of community dialogue. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-forum-2/",
    "keywords": [
      "Cities",
      "Gender",
      "Governance",
      "Policy & Regulation",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-47.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63911-1728039600-1728849600@bangaloreinternationalcentre.org",
    "name": "Karri-Djarrk-Durrkmirri (We-Together-Work)",
    "startDate": "2024-10-04T11:00:00+05:30",
    "endDate": "2024-10-13T20:00:00+05:30",
    "description": "Timings: 11 am to 8 pm\nExhibition on show until Sunday, 13 October \nWalkthroughs with the Artists:\nFriday, 4 October, 11:30 am\nSaturday, 5 October, 11:30 am \nBábbarra Women’s Centre, in collaboration with Tharangini Studio, presents a collection of woodblock textiles, supported by the Australian Government’s Centre for Australia-India Relations. “Karri-djarrk-durrkmirri,” meaning “we work together” in the Kuninjku language of West Arnhem Land, embodies the collaborative spirit of this exhibition, which blends heritage Indian textile traditions with culturally significant designs by Indigenous Australian women. \nBased in remote Maningrida, 500 km east of Darwin, Bábbarra Women’s Centre is dedicated to producing unique screen printed and Lino printed textiles that tell the stories of West Arnhem Land—its people, traditional foods and spiritual beings like yawkyawk (mermaids). Since its inception in 1987 as a women’s refuge, the Centre has supported women’s economic and social development. \nTharangini Studio, a women-owned woodblock printing studio, shares a commitment to craftsmanship and sustainability. Curators Prithi Pais and Anshu Arora have worked closely with director, Padmini Govind to interpret the complex design briefs of the Babbarra women and add their expertise in ethically sourced fabrics, natural dye and repeat patterns. \nKarri-djarrk-durrkmirri is an example of the beautiful artwork that can be created when Australia and India work together. Twenty-one unique textiles made from 77 individual woodblocks will be displayed. The woodblock designs were created by Bábbarra Women’s Centre artists over 20 years and reinterpreted into woodblocks by Tharangini Studio artisans. The fabric was produced under curatorial direction of Prithi Pais and Anshu Arora and Jessica Stalenberg in liaison with Bábbarra Women’s Centre. The exhibition also features embroidery by Porgai women artisans and two video works by Indian-Australian video artist and filmmaker Naina Sen with photographer Anahita Ananth. \nArtists: Deborah Wurrkidj, Jennifer Wurrkidj (dec), Janet Marawarr, Raylene Bonson, Susan Marawarr, Joy Garlbin, Helen Lanyinwanga (dec), Lucy Yarawanga, Nancy Gununwanga (dec), Carol Liyawanga,  Abigial Gurawiliwili Namundja, Ruth Bindiedbal, Susan Marawarr, Jay Jurrupula Rostron, Elizabeth Wullunmingu, Verity Bangarra and dilly bags by Maningrida Arts \nThe exhibition is open to all, at the BIC Gallery, from 4th October to 13th October 2024. Artist talks with visiting artists from Australia will be held on Friday, 4th October and Saturday, 5th October at 11:30am. \nThis marks Bábbarra’s second exhibition at BIC, following their successful Jarracharra (Dry Season Winds) tour across India in March 2023, supported by the Kolkata Consul-General. \nPresented by: \n \nImage credit: Artist Jennifer Wurrkidj (dec) and Janet Marawarr. Discharge print by Tharangini Studio \n",
    "url": "https://bangaloreinternationalcentre.org/event/karri-djarrk-durrkmirri-we-together-work/",
    "keywords": [
      "Textiles",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-597.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "64484-1727884800-1727902800@bangaloreinternationalcentre.org",
    "name": "Past, Present and Possibilities",
    "startDate": "2024-10-02T16:00:00+05:30",
    "endDate": "2024-10-02T21:00:00+05:30",
    "description": "4:00 pm – 5:20 pm : Lyd \n5:20 pm – 6:00 pm : Discussion \n6:15 pm – 6:30 pm : Break \n6:30 pm- 8:00 pm  : Bye Bye Tiberias \n8:00 pm- 9:00 pm  : Discussion \n  \nLYD \nSpeculative Documentary | Arabic, Hebrew with English subtitles | Palestine, United Kingdom, USA| Sarah Ema Friedland and Rami Younis |2023 \nLyd follows the rise and fall of Lyd, a 5,000-year-old metropolis that was once a bustling Palestinian town until it was conquered when the State of Israel was established in 1948. As the film unfolds, a chorus of characters creates a tapestry of the Palestinian experience of this city and the trauma left by the massacre and expulsion, while vivid animations envision an alternate reality where the same characters live free from the trauma of the past and the violence of the present. Using never-before-seen archival footage of the Israeli soldiers who carried out the massacre and expulsion, the personified city explains that these events were so devastating that they fractured reality, and now there are two Lyds – one occupied and one free. As the film cuts between fantastical and documentary realities, it ultimately leaves the viewer questioning which future should prevail. Lyd dares to ask the question: what would the city be like had the Israeli occupation of Lyd never happened? \nLink to the trailer \nBye Bye Tiberias \nDocumentary Feature | French, Palestinian Arabic with English subtitles | France, Palestine, Belgium, Qatar | Lina Soualem | 2023 \nIn her early twenties, Hiam Abbass (Emmy-nominated for Succession) left her native Palestinian village to follow her dream of becoming an actress in Europe, leaving behind her mother, grandmother, and seven sisters. Thirty years later, her filmmaker daughter Lina returns with her to the village and questions for the first time her mother’s bold choices, her chosen exile and the way the women in their family influenced both their lives. Set between past and present, BYE BYE TIBERIAS pieces together images of today, family footage from the nineties and historical archives to portray four generations of daring Palestinian women who keep their story and legacy alive through the strength of their bonds, despite exile, dispossession, and heartbreak. Palestine’s entry for Best International Feature in the 2024 Academy Awards, this second feature from Lina Soualem premiered at Venice, won the Grierson Award at the BFI London Film Festival, had its North American Premiere at the Toronto International Film Festival, and won the shared jury prize at the Marrakech International Film Festival. An important film that beautifully portrays the complexity of Arab women’s lives. \nLink to the trailer \nIn collaboration with \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/past-present-and-possible-future/",
    "keywords": [
      "Film",
      "Heritage"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Past, Present and Possibilities"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-613.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "63283-1729105200-1729110600@bangaloreinternationalcentre.org",
    "name": "आनंदओवरी | Anandowari",
    "startDate": "2024-10-16T19:00:00+05:30",
    "endDate": "2024-10-16T20:30:00+05:30",
    "description": "90 Minutes | Hindi (Tukaram abhangs will be sung in Marathi) | Ages 16 years + \nThis play is an adaptation of the seminal Marathi novel ‘Anandowari’ written by D.B. Mokashi in 1974. \nAnandowari (English translation: ‘The Verandah of Bliss’) looks at 17th-century saint poet Tukaram’s story through his younger brother Kanha’s perspective. Tukaram has gone missing again. This time, though, the hints seem ominous. We travel through those 3 days of Kanha’s frantic search for Tuka and his many realisations about his brother. \nIn reminiscing about Tukaram, Kanha tries to grapple with Tuka’s many identities: Tuka his brother, the son, the householder, the creative genius, a saint, a reformer, a rebel. \nThis act of reminiscence becomes an act of grappling with what and who he has lost, in the process giving us a great psychological insight into the events (personal, social and political) and impulses that shaped Tukaram’s consciousness and made him who he was: one of the most beloved Bhakti saint poets of Maharashtra, as tender as he was fierce, as compassionate as he was unforgivingly harsh, as much a reformist as he was a transcendentalist. \nOur adaptation focuses on the search that lies at the heart of the text: a devotee in search of God, a man in search of his brother, a writer in search of the poet Tukaram. \nCredits: \nOriginal Novel Anandowari by D.B Mokashi\nAdaptation and Direction: Gerish Khemani\nHindi Translation: Dr Jaya Dayal\nPerformed by: Varad Salvekar, Hrishabh Kanti\nBackground Score: Ruturaj Bhosle\nAbhang Composition: Keshav Kudale\nLight Design: Sachin Lele\nLights Operation: Prerana\nPoster and Creatives: Robin Patel \nDirector’s Note: \nWhat interested me personally was the question of the creative consciousness of the saint poet Tukaram, the source of his poetry, his metaphysical preoccupations, his social rebellion, his love for his beloved God Vitthal. I was interested in finding a device through which I could approach this text. And then it struck me: what would happen if the writer stepped into his own story? His character has found salvation, what about the writer? How will he? It is an investigation into that search… A devotee in search of God. A man in search of his brother. A writer in search of the poet Tukaram. \nThrough two texts – D. B Mokashi’s original Anandowari and my text where Tuka meets Vithal and Mokashi enters his own story – multiple confrontations are imagined. Confrontation between Mokashi (writer) and Kanha (character), confrontation between Tuka (devotee) and Vitthal (God). Creator and creation? One writer (Mokashi) searching for another (Tuka)? And then the question prevails: Who gives meaning to the other? Both depend on each other for meaning. For identity. Can there be a God without a devotee? Can there be a writer without her creation? Each validates the other. And each has the power to cancel each other out. \nBut then what if they exchange roles? Or what if this duality itself is the biggest illusion? And so these two texts came to be juxtaposed, hoping to interpenetrate and illuminate each other. \nOur adaptation of Anandowari reeks of tremendous longing for the absolute and the madness, pain of creative consciousness and its concomitant search for meaning embodied in the existential desperation of the protagonists. \nWith Support From \n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%86%e0%a4%a8%e0%a4%82%e0%a4%a6%e0%a4%93%e0%a4%b5%e0%a4%b0%e0%a5%80-anandowari/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "mr",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "आनंदओवरी | Anandowari"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-612.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "63272-1728500400-1728504000@bangaloreinternationalcentre.org",
    "name": "நடபாவாடை | Nadapaavaadai",
    "startDate": "2024-10-09T19:00:00+05:30",
    "endDate": "2024-10-09T20:00:00+05:30",
    "description": "60 Minutes | Tamil | Suitable for all ages \nThe play “Nadapaavaadai” centers on a woman who is forced to conduct burial rites for her entire village after the passing of her family member, who previously performed these duties.  \nDue to social inequality and prevailing customs, women are rarely permitted to even enter the crematorium. The characters in the play question the lady’s access to the crematorium and her role in carrying out those rituals that are traditionally associated with men. \n The charismatic lady performs the rites by taking the center stage, with only men allowed to visit the crematorium. She leads the burial rites in full face of the public – which many would be reluctant to undertake or would not be allowed to do.   \n“Nadapaavaadai” attempts to initiate an engaging dialogue about her role in diverse social and cultural contexts and its implications. This play has evolved out of a close observation, followed by an extensive ethnographic fieldwork, engaging discussions, and participatory playmaking. \nDirector’s Note \nCredit List \nCast\nManik Subramanian\nArchana Selvaraj\nAbinaya Jothi\nDevi Devadoss\nTamilarasan \nMusicians\nSuren Sekaran\nSathya Sharath \nLight Design: Suthan \nStage Manager: Nethaji \nTechnical Assistant: Raagul \nDesign and Direction: Ramassamy S \nSupported By: The Perch Collective \nSpecial Thanks: Kumari Amma Rajiv Krishnan \nAbout the Velippadai Theatre Movement: \nVelippadai Theatre Movement was founded as a community initiative in 2013 to develop deep connection with the lives, sufferings and concerns of the self and others as well, and to inculcate a new awareness in the rural context of Pondicherry about both tradition and modernity. The 15 days Cultural Gathering cum Residential workshop on Theatre-Making and Theatre-Happening titled Cycle Yajna organised by the Movement in 2015 went on to instil a deeper interest for the village people of Kuruvinatham towards theatre while making them realise the rich performance varieties available within their culture and tradition. The Movement conducts theatre workshops, cultural gatherings, environment protection events and acting camps regularly by collaborating global expertise and local knowledge. \nWith Support from \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%ae%a8%e0%ae%9f%e0%ae%aa%e0%ae%be%e0%ae%b5%e0%ae%be%e0%ae%9f%e0%af%88-nadapaavaadai/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "நடபாவாடை | Nadapaavaadai"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-611.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63901-1727290800-1727296200@bangaloreinternationalcentre.org",
    "name": "Sounds From the Library (#2)",
    "startDate": "2024-09-25T19:00:00+05:30",
    "endDate": "2024-09-25T20:30:00+05:30",
    "description": "Sounds From The Library is a performance series in a hybrid format that combines conversations and live music featuring past long listed artists of the Toto Music Awards at BIC’s intimate Library space. \nWe are back with the second edition, presenting Kolkata’s dreamy synth-folk/alternative duo Dindūn (Toto Awards for Music 2023 – Winner) and the Bangalore-based musician/producer and visual artist Disco Puppet (Toto Awards for Music 2017 – Winner). The audience will have the opportunity to learn more about their music creation process and see them perform live in a special up-close set. They will be joined by the interlocutor of the evening, Performing Arts and Experience Curator, Charu Mittal. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sounds-from-the-library-2/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sounds From the Library (#2)"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-604.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64320-1727461800-1727467200@bangaloreinternationalcentre.org",
    "name": "Innovation and Access",
    "startDate": "2024-09-27T18:30:00+05:30",
    "endDate": "2024-09-27T20:00:00+05:30",
    "description": "Access to affordable, high-quality pharmaceutical products remains a critical challenge worldwide, particularly in the Global South. In this lecture, Prof. William Fisher will explore this pressing global health issue through historical insights, including responses to the COVID-19 pandemic. \nHe will discuss potential initiatives that can foster local pharmaceutical innovation and production without requiring changes to the existing international intellectual property obligations. Through a set of legal and economic suggestions, the talk will explore ways to build sustainable infrastructure for local pharmaceutical industries in the Global South, while also addressing some of the key concerns of both proponents as well as critics of intellectual property rights. A Q&A with the audience will follow. \nTea will be served at 6pm. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/innovation-and-access/",
    "keywords": [
      "Public Health",
      "Science",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTERS.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "64329-1727204400-1727208900@bangaloreinternationalcentre.org",
    "name": "Darya",
    "startDate": "2024-09-24T19:00:00+05:30",
    "endDate": "2024-09-24T20:15:00+05:30",
    "description": "Darya Mosenzon is a pianist and composer specializing in North African music. She began playing the piano and composing at a young age and studied classical music throughout her childhood, but was drawn since adolescence to other genres of music as well, culminating in her choice to pursue Moroccan and Algerian music. \nDarya will present a solo piano recital featuring original and traditional North African music, infused with a classical-Jazzy twist. This intimate acoustic experience will blend the evocative rhythms of the Maghreb with soulful melodies, culminating in a vibrant instrumental dance party. As Haaretz aptly described, her performance is “a blend of meticulous restraint and exhilarating passion.” \nIn collaboration with: \n \nPhoto credit: Ronen Goldman \n",
    "url": "https://bangaloreinternationalcentre.org/event/darya/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Darya"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-21.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64223-1727136000-1727222399@bangaloreinternationalcentre.org",
    "name": "333. Demystifying Climate Change",
    "startDate": "2024-09-24T05:30:00+05:30",
    "endDate": "2024-09-25T05:30:00+05:30",
    "description": "Every day we hear something unusual. A fire here, a flood there, a storm surge, a cloudburst. These events affect all of us, our well-being, our health, our family, our work. Their frequency and intensity are increasing. Fortunately, however, we no longer lack explanations for these events. We know fossil fuels and the destruction of Nature by us humans are the primary reasons for the alarming acceleration in global warming. \nAwareness is the first step towards change, and Rajan Mehta’s Backstage Climate is an attempt to make you aware of global warming and climate change in a simple and interesting manner. It demystifies this grim reality—the science, the politics and the economics behind climate change. It also gives you a glimpse of the policies, technology and solutions that can help save the planet and ensure our survival. \nGoing slightly beyond mere awareness, the attempt is to help the reader connect the dots and develop a perspective on the reasons, impact and solutions that can help us avoid a climate crisis. \nIn this episode of BIC Talks, Rajan Mehta is in conversation with Prem Panicker. This is an excerpt from a conversation that took place in the BIC premises in September 2024. \nSubscribe to the BIC Talks Podcast on your favorite podcast app! BIC Talks is available everywhere, including Apple Podcasts, Spotify, Castbox, Overcast, Audible and Amazon Music. \n",
    "url": "https://bangaloreinternationalcentre.org/event/333-demystifying-climate-change/",
    "keywords": [
      "Books",
      "Climate Change",
      "Environment",
      "Nonfiction",
      "Podcast"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/PODCAST_Thumbnail-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64531-1727609400-1727614800@bangaloreinternationalcentre.org",
    "name": "The Story of Raghoba",
    "startDate": "2024-09-29T11:30:00+05:30",
    "endDate": "2024-09-29T13:00:00+05:30",
    "description": "The story of Raghoba – or Raghunathrao – is a captivating tale that spans across eras. It picks up the threads from the death of his nephew Madhav Rao in 1772. Raghoba, the son of the renowned Bajirao Peshwa, was once hailed for his exceptional military skills and talent for intrigue. However, he later succumbed to his own indolence and ambition, crossing a line from which there was no turning back. \nThis account in author Uday S Kulkarni’s book Raghoba, drawn from contemporary sources, pulls the reader into a vortex of a plot to commit murder and its aftermath, searing Raghoba, burning his nephew, and plunging the Maratha Empire into a crisis. The politics of the time, the many characters who strode the stage of History. They speak to us through their original letters which will take the reader to the very core of the story and give a ring side view of the events over a nearly three year period… \nA talk by Uday S Kulkarni will be followed by a conversation with Amit Paranjape and a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-story-of-raghoba/",
    "keywords": [
      "Books",
      "Heritage",
      "History"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/POSTERs_Thumbnail-copy-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64470-1727542800-1727548200@bangaloreinternationalcentre.org",
    "name": "Shelf Shuffle",
    "startDate": "2024-09-28T17:00:00+05:30",
    "endDate": "2024-09-28T18:30:00+05:30",
    "description": "Got a favorite book you’re dying to share? \nWrap it in paper, mystery and bring it along! You’ll get to talk about it to a group of fellow book lovers, meet enthusiastic readers, share and receive recommendations and walk away with an exciting new read. \nJoin us in a cozy setting to get clued in on what the rest of Bangalore is reading and browse a special selection of books at the BIC library. \nPlease note: This fun, interactive event is for a small group of about 20 people. Bring a physical book to join in. No book, no entry! \nThis event is a part of BIC’s Programmes at the Library. \nBIC Library Programmes are designed to mould the library into a community-centered reading space. Our primary goal is to curate sessions that cater to the diverse interests and ages within our library community. Through this programming we wish for the library to become a dynamic space that goes beyond traditional book-related activities. \nWe also aim to provide a platform for members of the community to sometimes host these events we curate. If you have event ideas that align with our vision, please reach out to us at collab@bangaloreinternationalcentre.org \n",
    "url": "https://bangaloreinternationalcentre.org/event/shelf-shuffle-2/",
    "keywords": [
      "Books",
      "Language",
      "Literature"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-42.png"
  }
]