[
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Open Source, Open Knowledge",
    "startDate": "2024-06-15T10:00:00+05:30",
    "endDate": "2024-06-15T13:00:00+05:30",
    "description": "This event is a 3-hour seminar on intellectual property in India, hosted by Professor Lawrence Liang and Carl Malamud of the Servants of Knowledge Initiative. \nThis seminar is aimed at people who spend time on Access to Knowledge, Free and Open Software, and other civic technologies. \nOpen source software, and Creative Commons licensing emerged as an important challenge to the dominant narrative of copyright law. The framework of open knowledge has played a pivotal role in democratizing information, fostering collaboration, and empowering creators and users alike. However, in the last two decades, we have also witnessed their limitations, especially when it comes to addressing the question of infrastructure. Physical libraries are a good example of how the limitations of physical goods and severely constrained infrastructures still serve as a impediment to access to knowledge. \nIn the domain of library infrastructure, one particularly noteworthy innovation is the digitization of books, a process that transforms physical texts into accessible digital assets. Book scanning, as a cornerstone of digital library infrastructure, offers a compelling case study in navigating the intricate landscape of copyright exceptions and controlled lending. At its core, book scanning epitomizes the transformative power of technology in democratizing access to knowledge. By digitizing print collections, libraries can transcend physical constraints, reaching those who traditionally do not have access and ensuring the preservation of knowledge for future generations. However, the process of digitization raises complex legal considerations, particularly in relation to copyright law. \nIn many jurisdictions, copyright exceptions and limitations provide a legal framework for libraries to digitize and make available certain works without seeking explicit permission from rights holders. These exceptions often encompass activities such as preservation, research, and access for individuals with print disabilities. However, the scope and applicability of these exceptions vary widely across jurisdictions, posing challenges for libraries seeking to navigate a patchwork of legal regimes. \nIn this workshop, we focus on copyright law in India and contend that the design of exceptions and limitations in India are particularly facilitative of access. Using case studies such as the Delhi University photocopy case, the Sci-Hub case and the Hatchette case on Controlled digital lending, we will probe questions of how copyright in India can be used to facilitate the creation of infrastructures of knowledge. Using our experience at servants of knowledge, of scanning large libraries, we propose a framework that brings together open source activists, book collectors, librarians, students, researchers and authors under a common platform “Public library of India”, designed to imagine digital infrastructure for 21st century India. \nFor further reading: \n\nLiang and Malamud, Controlled Lending by Public Libraries Under Indian Law, https://archive.org/details/Controlled.Lending.India/Controlled.Lending.20230505.pamphlet/\nMalamud, Gyan Satyagraha, Remarks Delivered at Kannada University, https://archive.org/details/kannada.university.20240415/02-kannada.university.20240415/\nLiang and Gupta, The Public Library Movement in India, https://archive.org/details/public.library.movement.india\n\nPresented by: \n \n  \n",
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/open-source-open-knowledge/",
    "keywords": "Books, Education, Law, Technology, Workshops",
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-13_POSTER.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Art as Activism",
    "startDate": "2024-06-16T11:30:00+05:30",
    "endDate": "2024-06-16T13:00:00+05:30",
    "description": "This discussion is set in the context of the recent ruling from the Karnataka High Court that limits public protests in Bangalore to a designated space within one park in the city, that too subject to police approval. It aims to explore how art can serve as an alternative medium for voicing dissent and fueling public discourse. \nThe panel will discuss the ramifications of the Court’s ruling and its impact on communities, and talk about art as a potent tool for social change. Through their experiences, the panelists will demonstrate how art can amplify voices, provoke thought, and catalyze change even amidst growing restrictions on dissent. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/art-as-activism/",
    "keywords": "Bangalore, Cities, Politics, Society, Visual Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-495.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "Kārunya Sindhu | Ocean of Mercy",
    "startDate": "2024-06-15T19:00:00+05:30",
    "endDate": "2024-06-15T20:30:00+05:30",
    "description": "Karuna or Kārunya is one of the navarasā-s (nine emotions) of the Indian cultural pantheon, embodying the highest form of unconditional compassion and mercy. \nSince time immemorial, poets, saints, composers and bhakta-s (devotees) have performed sādhana (ardent practice of any pursuit) with a yearning for divine Karuna. When Narayana Bhattathiri wrote the magnum opus Narayaneeyam in the 16th century, he said, “Oh Krishna, oh Kārunya Sindhu! May your feet, where all the liberated souls reside, always rest in my heart. Oh, ocean of compassion, destroy all my sorrows and confer an abundant flow of Supreme Bliss”. In the 19th Century, Patnam Subramania Iyer composed a Kriti pleading Lord Venkatesha to forgive all his sins and bestow abundant Kripa (mercy) with no further delay. Even when we make a prayer today, it is only natural for us to seek the Lord’s Karuna. It is also this very unconditional empathy that we have for one another that makes the world a beautiful place. \nThis concert through the evocative literature and music of composers like Tyagaraja, Patnam Subramania Iyer, the Dāsā-s and others, hopes to invoke this Ocean of Mercy, this Kārunya Sindhu. \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/karunya-sindhu-ocean-of-mercy/",
    "keywords": "Music, Performing Arts",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Kārunya Sindhu | Ocean of Mercy"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-_POSTER-1.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Living the Past, Dancing in the Present",
    "startDate": "2024-06-20T19:00:00+05:30",
    "endDate": "2024-06-20T20:30:00+05:30",
    "description": "Living the Past, Dancing in the Present is an illustrated lecture-demonstration of the Sattriya dance tradition of Assam. \nThe presentation will be supported by audio-visuals and archival recordings that elaborate upon the historical roots of the dance form, its distinctive features, the present context in relation to changing time and space and the celebration of dance as a living art heritage. \nSupported by:\n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/living-the-past-dancing-in-the-present/",
    "keywords": "Culture*, Dance, Heritage, Performing Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-500.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "A Ballet Soirée",
    "startDate": "2024-06-25T19:00:00+05:30",
    "endDate": "2024-06-25T20:15:00+05:30",
    "description": "The National Youth Ballet company will present an evening of repertoire that is curated with excerpts from classical and modern ballets. Among the varied selection are pieces from timeless ballets like The Nutcracker, Paquita, La Bayadere, and Swan Lake. \nFrom the wintry escapade of the Waltz of the Snowflakes, the charm of the tambourine in La Esmeralda to the gripping Ankle Scarf Dance from La Bayadere, the pieces will be weaved together to transcend the audience into a land of ethereal artistry. The soirée aims to offer insights into the multifaceted realms of ballet while delving into its nuanced expression. \nIn collaboration with: \n \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/a-ballet-soiree/",
    "keywords": "Dance, Performing Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-486.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Matters of Plasma",
    "startDate": "2024-06-22T11:30:00+05:30",
    "endDate": "2024-06-22T13:00:00+05:30",
    "description": "Dive into the electrifying world of plasma, the fourth state of matter beyond solids, liquids, and gases. Plasma, made up of ions, electrons, and neutrals, is a quasi-neutral substance where particle motion is influenced by electric and magnetic fields. This state of matter is an excellent conductor of electricity and exhibits unique collective behaviors. \nA combined effort of seven countries (EU as one country) in building the ITER tokamak in France is under progress, where India is a full partner. Low temperature (~ eV) plasmas with similar ion, electron and neutral temperatures can be used as an intense heat source. Such a heat source can dissociate large molecules, and hence such a plasma source is used for waste treatment. Low temperature (electrons ~ few eV, ions and neutrals ~ 0.1 eV) plasmas, where electron temperature is more than ion and neutral temperatures, are chemically very active and can be used for surface modification. \n In this talk, Prof. Subroto Mukherjee will cover various aspects of plasmas and its applications, from energy to environmental solutions. \nThis lecture is a part of RRI’s Vignyana Kathegalu, a series of popular talks on science. \nPresented by: Raman Research Institute, Bangalore \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/matters-of-plasma/",
    "keywords": "Education, Science",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-509.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Fact and Fiction – Inside the Election Commission",
    "startDate": "2024-06-24T18:30:00+05:30",
    "endDate": "2024-06-24T20:00:00+05:30",
    "description": "India has emerged as a leader and a model for ‘electoral governance’. The Election Commission, a constitutional body has orchestrated all our elections including the most recent one which by all accounts has been a stellar success; How is the Election Commission managing national and state elections, year after year; what are the challenges it faces; what are the perceptions, and misconceptions political parties in the fray and the voters have during elections; how does the Election Commission address such issues, try to remain above controversy and conduct free and fair polls? \nA presentation by Mr. Vinod Zutshi will be followed by a Q&A with the audience. \nPresented by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/fact-and-fiction-inside-the-election-commission/",
    "keywords": "Governance, Policy & Regulation, Politics",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-511.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Is Demography Destiny?",
    "startDate": "2024-06-19T18:30:00+05:30",
    "endDate": "2024-06-19T20:00:00+05:30",
    "description": "In the context of contemporary US elections, many have claimed that “demography is destiny.” This kind of rhetoric became particularly popular among Democratic strategists after Barack Obama was elected in 2008. On this theory, Democrats will have a significant advantage in upcoming national, particularly presidential, elections, given the party’s widespread appeal among a multiracial and otherwise diverse coalition of voters. The Republican Party, in this view, has made a strategic miscalculation by relying too heavily on white (particularly white male) voters, especially since the Nixon years. In recent years, however, there is a growing sense among many observers that demography may not, after all, be destiny; that voting behavior may not neatly align along a white-nonwhite divide, with non-Hispanic white men voting for the Republican Party and the rest of the country voting Democrat. \nIn this lecture, Prof. Cyril Ghosh will offer an overview of this debate, with some remarks about what we might expect to see in the 2024 US presidential elections. In so doing, he will discuss the demographic make-up of the voting blocs of each of the two major parties in the US, how they came to be, and how they are likely to vote in November 2024. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/is-demography-destiny/",
    "keywords": "International Relations, Politics",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-498.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The City and the Scam",
    "startDate": "2024-06-22T18:30:00+05:30",
    "endDate": "2024-06-22T20:00:00+05:30",
    "description": "In this event, Professor Malini Ranganathan will discuss her new book, Corruption Plots: Stories, Ethics, and Publics of the Late Capitalist City (Yoda Press 2024, Cornell University Press 2023). Through ethnographic fieldwork, the book studies what its co-authors call “corruption plots” from the streets of Bengaluru and Mumbai, where black money, skyscrapers, land grabs, encroachment on wetlands, and slum evictions invoke outrage at deepening economic polarization and the impunity with which the real estate lobby operates. Flying in the face of conventional wisdom, the book argues that corruption is a story-telling practice charged with ethical meaning, one that does not simply condemn illegality or bribery, but is also used to call attention to the legal—and legalized—abuses of power by the state, political class, and elites. \nAt the same time, the book warns that anger by various publics about corruption is uneven, inflected by caste, class, and ethno-religious bias, especially in the context of rightwing nationalism and crony capitalism in India. Why do certain things get called “corruption” while others don’t—and why do corruption charges suddenly erupt into public discourse, while at other times remain muted in the background?  \nDrawing on ethnography in two Indian cities undertaken in 2018, as well as a cross-section of films and novels on the global city (in India and beyond), this book attends to the political slipperiness, sensationalism, and opportunism associated with corruption talk, wherein fantastical scams about the city can often appear more fictional than factual. Ultimately, in deriving a humanistic and multifaceted theory of corruption—sorely lacking in one-dimensional policy pronouncements—the book contends that across the world’s ostensible democracies, we need a more grounded analysis of how anti-corruption has been selectively championed and challenged, and with what effects, by both liberal and rightwing regimes. More information available here. The author will briefly discuss the book, followed by a conversation with Professor Sushmita Pati and an audience Q&A. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-city-and-the-scam/",
    "keywords": "Bangalore, Cities, Politics, Society",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-501.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "ಅಮ್ಮ ಮತ್ತು ಸುಹೈಲ್ | Amma Mattu Suhail",
    "startDate": "2024-07-08T19:00:00+05:30",
    "endDate": "2024-07-08T20:30:00+05:30",
    "description": "Kannada | 90 minutes | Suitable for Ages 16+  \nThe play is an ode to queer love. It is a meditation on the values of empathy and dialogue as powerful agents to bring estranged minds together. The narrative traverses through moments of passion, anger, sadness, and love in its raw human element. The characters attempt to interrogate, understand, and acknowledge each other, and in this process, unveil the universality of all emotions as being the same, irrespective of gender and orientation. The play tries to deconstruct and lay open the psychological and emotional baggage of the characters who are but symbols of the divided humanity that we are today. An interfaith gay couple and the mother of one of the characters venture on a journey of understanding one another rather light-heartedly through uncomfortable conversations, only to explore depths which they never knew or imagined would be possible to unearth. \n\n\n\n\nPlaywright/Director’s Note: \nWith the drastic change in the political discourse the world has witnessed in the last few years, one cannot but notice the drastic emergence of an undeniable divide within humanity. There are two segments that appear to be in stark contrast, constantly struggling and fighting with each other. There is a constant othering and exclusion of minorities by the majority in power. During the pandemic, the apathy by the political class at large was glaringly visible and we witnessed in full display the class disparity that envelops our nation. The Hindu – Muslim rhetoric was constantly fed to us through public discourse and hate was offered as a staple diet for even those who refused to be part of it. \nThe artist felt compelled to speak up, believing that love is the only antidote to the vehement poison of hate. They hence decided to write and direct this play that features the love story of a gay couple hailing from the Hindu and Muslim communities. Diversity cannot be celebrated without the intersectionality that makes for the complex mix of the society we are. The play intends to hold the mirror to the microaggressions and biases that consume us all through humor and emotional storytelling. \nWith music, love, and humor, the play tries to unravel the demons of Islamophobia and homophobia in us all. It celebrates the value of empathetic dialogue and honest communication in eradicating hate. Amma mattu Suhail is a tender story of love, acceptance, and possibilities. \nThe artist is a classical musician, writer, and theatre practitioner, and their arts practice is always an amalgamation of these elements. They create out of necessity! Having grown up queer and gender fluid, they struggled to find representation in the Kannada arts scene and were disappointed. They tried to fit in and adapt to the arts “as is” but eventually found it suffocating and had to carve out their own path and create what they wanted to engage with. They strive to bring marginalized voices to the fore and their stories or creations always aim to question and break patriarchal stereotypes and conditioning. Their search is always to find fluidity. Just like their characters either in the plays they have written or in the dance-based compositions they have created, which always traverse through the non-binary nature of gender identity or sexuality, the art they create yearns to find fluidity in form and content. They break the structure and form using non-linear narratives, democratic – secular emotional indulgences, and fluid emotional paradigms. They attempt to convey the grotesque bizarreness of our social existence with humor and the humorous, funny realities that define us through the macabre. \nThey always like to begin with an uncomfortable space and establish familiarity with the unfamiliar. Most importantly, they want their art to be accessible to all class and caste sections of society. They often find it very difficult to mold their form in a way that does not “other” an audience which has no access to learning arts appreciation or delving into abstraction. While they try to abstain from dumbing down their audience, they make it a priority to make their arts inclusive. Having been in circles where art is created and consumed in the same vicious elitist spaces and circles, they yearn to connect to a larger canvas. \nHaving written, produced, and directed three plays, their exploration has always yearned to find that fluidity between sound and silence, prose and poetry, body and realism. They aim to tell more queer stories which are embraced by the mainstream and more mainstream stories which make the queer community feel that they are “seen”. Whilst they are cognizant of the brutal grays that marginalized voices live in, they believe we need more positive representation of these marginalized characters. Their younger queer self wanted to watch happy endings and stories of hope and not just suicide and tragedies. They work only on stories which are fictional retellings of lived experiences and also for these stories to be specifically told in Kannada. Regional languages have the power to automatically place these stories in a certain space while also making sure to remove them from only English-speaking elite spaces. They strive to create work which opens itself to a more vulnerable audience who need to hear, get uncomfortable, and feel ignited towards a spirit of inquiry through these stories. \nThey will be glad if their art is also entertaining but they will never be okay if it is not activism. \nCredits: \nPlaywright – Direction – Music : Karthik Hebbar\nCast: Dr Seetha Kote, B V Shrunga, Arun D T\nLighting: M G Naveen\nProduced by Dheemahi Theatre \nDheemahi Theatre was born out of the need to create a safe space for new voices. We are a space for the “outsiders”. We have come together to tell stories that have been oppressed and suppressed in other majoritarian spaces. Empathy and humanity are the main focuses of all the work that we create. We as a team thrive on celebrating diversity and secular narratives by exploring and devising new techniques for facilitating these stories. We work around minimalist production setups and maximal internal processes. With a passion for storytelling that transcends boundaries, we strive to create a stage that reflects the kaleidoscope of human experiences. Our productions are more than performances; they are a canvas of shared narratives that resonate with the richness of our collective journey. We aspire to weave together tales that inspire, provoke thought, and unite us in the magic of the theatre. \nSupported by: \n \n\n\n\n\n\n\n\n  \n\n\n\n\n\n\n\n  \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%85%e0%b2%ae%e0%b3%8d%e0%b2%ae-%e0%b2%ae%e0%b2%a4%e0%b3%8d%e0%b2%a4%e0%b3%81-%e0%b2%b8%e0%b3%81%e0%b2%b9%e0%b3%88%e0%b2%b2%e0%b3%8d-amma-mattu-suhail/",
    "keywords": "Performing Arts, Theatre",
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "ಅಮ್ಮ ಮತ್ತು ಸುಹೈಲ್ | Amma Mattu Suhail"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-506.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Mad and Divine",
    "startDate": "2024-06-14T19:00:00+05:30",
    "endDate": "2024-06-14T20:30:00+05:30",
    "description": "An insight into the life and teachings of Janabai, 13th Century and Lalded, 14th Century. Both were women mystic poets who went through tremendous hardships before they were recognised for their spiritual awakenings. They crossed barriers of social norms to fearlessly express their love for the Supreme. \nThey were different in approach but MAD and DIVINE. Janabai was a Vaishnavait while Lalded was a Shaivaite. Janabai believed in the form while Lalded believed in the formless. Janabai took the path of devotion while Lalded took the path of tantra. \nMad and Divine was first commissioned by Dr. Anita Ratnam for the Natya Darshan at Kartik Fine Arts Chennai, in 2011. \nChoreographed and presented by Rama Vaidyanathan\nMusic for Janabai | Sudha Raghuraman\nMusic for Lalded | Dr. S Vasudevan with creative inputs by Sudha Raghuraman\nVocal | Sudha Raghuraman\nNattuvangam | Dr S Vasudevan\nMridangam | Sumod Sreedharan\nFlute | G Raghuraman\nValuable inputs in the storytelling technique from Rajika Puri \nIn collaboration with:\n \nSupported by:\n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/mad-and-divine/",
    "keywords": "Dance, Faith, Performing Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-493.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "#PageTurners",
    "startDate": "2024-06-22T11:30:00+05:30",
    "endDate": "2024-06-22T13:00:00+05:30",
    "description": "The timeless love for reading, particularly young adult fiction, thrives in that glorious corner of the internet—Bookstagram and BookTok—dedicated to books, where heartfelt reviews, discourses on classics, and subs enriching beloved stories with hot takes, POVs, and fanfics converge. This vibrant online ecosystem seamlessly extends into real-life gatherings, creating a dynamic forum where virtual discussions about young adult narratives spark deeper in-person dialogues and connections. It’s a testament to the enduring relevance of stories, whether shared in paperback, hardbound, or PDFs. \nJoin us for a compelling panel discussion centered around Poile Sengupta’s novel, A Higgledy Piggledy Growing Up. This 90-minute session will feature a panel of four passionate readers, writers, and lovers of literature, exploring the evolution and current state of young adult crossover fiction in Indian English literature—a genre that has blossomed significantly over the past two decades. \nThe discussion will dive into how today’s cultural dynamics in India cultivate a fertile ground for innovative narratives that resonate across generations. The panel will explore Higgledy Piggledy Growing Up, following Neel, a fourteen-year-old from Bengaluru, whose ordinary life is swept up in extraordinary adventures—combining humour, romance, and a poignant awareness of societal divides – promising a deeper understanding of how young adult literature both reflects and influences the shifting societal landscape, enhancing appreciation for its transformative impact. \nWhether you’re a seasoned aficionado or a newcomer to the genre, this event is designed to deepen your connection with the transformative world of young adult literature in India. \nThe session will be peppered with readings and the panel will engage in Q&A with the audience towards the end. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/pageturners/",
    "keywords": "Books, Fiction, Literature",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-507.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "दुविधा | Duvidha",
    "startDate": "2024-07-07T11:30:00+05:30",
    "endDate": "2024-07-07T13:00:00+05:30",
    "description": "1973 | 82 Minutes | Hindi with English Subtitles \nBased on a Rajasthani folktale retold by Vijayadan Detha, Duvidha is about a merchant’s son, whose relationship with his young bride, Lachhi is thwarted by his work and a ghost who falls in love with her, resulting in the ghost soon impersonating the husband. \nCalling all cinephiles! BIC is thrilled to present B•Cinematic, an initiative dedicated to celebrating the most essential, impactful, and artistically significant cinematic works from across the state and the country. \nAt B•Cinematic, our mission is to curate and share those remarkable films that is a must-watch (or re-watch) experience for every passionate cinema lover. From groundbreaking classics to under-appreciated gems, our carefully curated selection will take you on an unparalleled (pun not intended) cinematic journey through the ages. \nThrough curated screenings, insightful discussions, and engaging analyses from distinguished cinematic voices, we aim to not only watch these films together but to truly appreciate their craftsmanship, cultural impact, and intellectual depth. Our vibrant community of film aficionados will collectively rediscover Indian cinema’s most stunning and enduring masterpieces. \nSo join us on this quest to experience the films that have defined and redefined the art form. Don’t miss out on crossing these essential works off your bucket list. Because to truly live, you must first watch the films that make life worth living. \nThis month’s film featured in our informal film club is Duvidha (1973) \nDuvidha is a hauntingly beautiful and thought-provoking film that delves into the realms of folklore, desire, and the complexities of human relationships. Based on a Rajasthani folktale, the film weaves a captivating tale of a young bride, Lachhi, whose newfound marriage is immediately put to the test by circumstances beyond her control. \nOn the very day of their wedding, Lachhi’s husband, a merchant’s son, departs on a five-year business trip, leaving her behind in the care of his family. Amidst this lonely existence, a mischievous and longing ghost, enchanted by Lachhi’s beauty, devises a cunning plan to impersonate her husband and gain her affection. \nDirector Mani Kaul’s masterful storytelling and Navroze Contractor’s exceptional cinematography breathe life into this enigmatic narrative, creating a hypnotic and surreal atmosphere that blurs the boundaries between the corporeal and the ethereal. The film’s striking visuals, infused with rich textures and rhythmic sequences, transport the viewer into the vibrant tapestry of Rajasthani culture, where the rhythms of daily life intertwine with the spectral realm. \nAt its core, Duvidha is a metaphysical exploration of love, desire, and the complexities of human relationships. The ghost’s obsession with Lachhi and his subsequent impersonation of her husband raise profound questions about identity, fidelity, and the nature of love itself. The film invites the viewer to ponder the depths of human longing and the lengths to which one might go to satisfy that longing. \nBeyond its captivating narrative, Duvidha also serves as a powerful commentary on societal norms and gender dynamics. Lachhi’s predicament, torn between her duty as a wife and the allure of the supernatural, reflects the constraints and expectations placed upon women in traditional societies. The film subtly challenges these conventions, inviting the viewer to question the foundations upon which societal structures are built. \nUltimately, Duvidha is a cinematic masterpiece that transcends its folktale origins, offering a transcendent and thought-provoking exploration of the human condition. With its mesmerizing visuals, haunting narrative, and profound themes, the film continues to resonate with audiences, inviting them to embark on a journey that blends the fantastical with the deeply human. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%a6%e0%a5%81%e0%a4%b5%e0%a4%bf%e0%a4%a7%e0%a4%be-duvidha/",
    "keywords": "Film",
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "दुविधा | Duvidha"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-505.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Yakshagana & Silapadikaram",
    "startDate": "2024-06-15T11:00:00+05:30",
    "endDate": "2024-06-15T13:00:00+05:30",
    "description": "K K Hebbar was born on June 15th, 1911 in Kattingeri, a village near Udupi. He rose to become a nationally acclaimed Painter. His works are in national and international collections. He donated 65 paintings of his to Karnataka, housed in a separate floor in Venkatappa Gallery. He served as Chairman Karnataka Lalit Kala Academy and  Chairman National Lalit Kala Academy. June 15th is Hebbar’s 113th birth anniversary. \nThis event is conceived by K K Hebbar Art Foundation and  Manipal Academy of Higher Education (MAHE). They came together in 2017 to establish ‘Hebbar Gallery and Art Center’ (HGAC) India’s first University Gallery hosting over 30 paintings of India’s famous artist K K Hebbar. \nIn 2024, HGAC produced a film on how Hebbar’s interaction with leading writers, poets, editors of national media brought about a cultural renaissance in the 60’s and 70’s. This film covers Hebbar’s and Shivaram Karanth’s collaboration to convert a folk dance-drama into a ballet and took it national. Secondly how Hebbar and A S Raman, first Indian Editor of The Illustrated Weekly of India, took the Tamil epic Silapadikaram, national. This twelve-minute film will premiere on June 15th at BIC in the presence of leading artists and art lovers. \nThe film is followed by a live performance of Yakshagana. ‘Kamsa Vadhe’ will be performed by the troupe of Dr. Shivakumar Begar. Trained under Dr. Shivaram Karanth, he has been a Yakshagana performer in the MGM College Udupi troupe. He spent 12 years under Dharmadhikari Veerendra Hegde in Dharmasthala, starting a Yakshagana school. Currently he is running Yakshagana schools in Bangalore, in Art of Living and other places. He leads a troupe of performers who perform various Yakshagana Dramas. \nPresented by:\n  \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/yakshagana-silapadikaram/",
    "keywords": "Film, Heritage, In Memory, Mythology, Theatre",
    "inLanguage": "ta",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-497.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Redefining Unions",
    "startDate": "2024-06-16T17:00:00+05:30",
    "endDate": "2024-06-16T18:30:00+05:30",
    "description": "The Supreme Court in “Supriyo @ Supriya Chakraborty & Anr. v. Union of India” has put a roadblock on the route to marriage equality with its split verdict. This conversation between Ammel Sharon and Arvind Narrain will contextualize and understand the rationale behind the Supreme Court’s decision, examining the arguments from both sides and the legal reasoning of the justices. \nWe’ll explore the implications for LGBTQ+ rights and the broader societal attitudes towards marriage in India. Additionally, we’ll map out potential ways forward for the movement, focusing on legislative reforms, continued advocacy, and strategies to build broader support for marriage equality. \nJoin us to critically examine this landmark case and chart a course for advancing LGBTQ+ rights and marriage equality in India. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/redefining-unions/",
    "keywords": "Culture*, Gender, Law, Society",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-499.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Just Hiss",
    "startDate": "2024-06-23T11:00:00+05:30",
    "endDate": "2024-06-23T12:00:00+05:30",
    "description": "50 minutes | English and Kannada  \nJust Hiss is a compelling adaptation of the short folk story titled A Serpent’s Predicament. Just Hiss is an ode to coexistence, following the transformative journey of a snake to choose love over hate. As the play navigates the complex dynamics between the snake, the forest denizens, and the villagers of Rasbharpur, it skillfully tackles the universal themes of unity and understanding. The resonant narrative serves as a reminder of the profound impact that choices, particularly those rooted in love and compassion, can have on fostering harmony in a world shared by diverse beings. \nDirector’s note: \nJust Hiss is not just a play; it is a whimsical journey crafted especially for children, featuring endearing animal characters. At its heart, it unfolds an analogical tale, resonant with the pressing message of our times—understanding the limitations of one’s perspective and the imperative need to embrace and accommodate others. \nConceived with meticulous care and having undergone several work-in-progress phases, this play is a testament to the idea that assumptions should yield to genuine inquiry. It serves as a reminder to care enough to ask, fostering the spirit of coming together and progressing impactfully. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/just-hiss/",
    "keywords": "Theatre, Wildlife, Young BIC",
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-487.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Personal and the Political",
    "startDate": "2024-06-25T18:30:00+05:30",
    "endDate": "2024-06-25T20:00:00+05:30",
    "description": "After ten years of reporting from central Africa for The New York Times, Associated Press, and others, Anjan Sundaram finds himself living a quiet life in Shippagan, Canada, with his wife and newborn. But when word arrives of preparations for ethnic cleansing in the Central African Republic, he is suddenly torn between his duty as a husband and father, and his moral responsibility to report on a conflict unseen by the world. \nBreakup: A Marriage in Wartime illuminates the personal price that war correspondents pay as they bear witness on the frontlines of humanitarian crimes across the world. This introspective book is a grounded account of one man’s inner turmoil in the context of a dangerous journey through a warzone. \nIn this session, Anjan is in conversation with Siddharth Raja. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-personal-and-the-political/",
    "keywords": "Books, Defence & security, International Relations, Media, Nonfiction, Politics, Society",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-510.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Achintya - Beyond Perception",
    "startDate": "2024-06-17T19:00:00+05:30",
    "endDate": "2024-06-17T20:00:00+05:30",
    "description": "Achintya – Beyond Perception is a solo dance production exploring the concept of truth and humanity’s ongoing pursuit of it. Performed by Deeksha Kumar, the production combines Bharatanatyam with storytelling to examine the philosophical aspects of truth. \nThe performance features a series of movements, each representing different facets of truth – from its elusive nature to the clarity it brings when understood. The choreography reflects the complex journey of seeking truth, with movements symbolizing the struggle and eventual enlightenment of this quest. \nIn one section of Achintya – Beyond Perception, the imagery of sand is used to convey the philosophy of non-duality and the elusive nature of truth. Seated in front of a box of sand, the performer holds the grains in their hands, allowing them to slip through their fingers to symbolise the transient and ever-changing nature of truth. Through a sequence, two separate piles of sand are created, only to be merged into a single pile, visually representing the concept of non-duality — the ultimate realisation that all is one. This interaction with sand underscores the performance’s exploration of truth and unity. \nOriginal music, blending classical and modern elements, underscores the performance and enhances its emotional depth. The score integrates traditional instruments with contemporary sounds, creating an auditory experience that mirrors the dancer’s journey. The music’s shifts and harmonies amplify the emotional intensity, guiding the audience through a sensory experience. \nAchintya – Beyond Perception is a dance that encourages audiences to reflect on their own journeys towards truth. This production aims to be a thought-provoking and visually engaging experience that resonates with viewers long after the final bow. \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/achintya-beyond-perception/",
    "keywords": "Dance, Performing Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-496.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "INHERITAGE",
    "startDate": "2024-06-14T00:00:00+00:00",
    "endDate": "2024-06-17T00:00:00+00:00",
    "description": "Exhibition Opening: Friday, 14 June, 11:00 am \nTimings:\nFriday, 14 June | 11:00 am – 8:00 pm\nSaturday, 15 June | 11:00 am – 5:00 pm\nSunday, 16 June | 11:00 am – 8:00 pm \nWalkthroughs:\nFriday, 14 June | 6:00 pm\nSaturday, 15 June | 12:00 noon\nSunday, 16 June | 12:00 noon & 4:00 pm \nPerformance:\nSaturday, 15 June | 7:00 pm \nINHERITAGE, conceived and created by choreographer Preethi Athreya, is a performance installation that traces a relationship with objects inherited, passed on or lost. Through a choreographic lens, it looks at objects that speak to a cultural and colonial heritage, embodying critical questions of our attachment to ‘belongings’, to the idea of ‘belonging’ and to place. \nThe installation presents a personal collection of thirteen objects inherited, owned, acquired or lost to bring out a history of their transactions beyond ownership, origin and identity. How can the act of looking, touching or holding these objects be a way to ‘read’ them? The objects are displayed as photographic images. Scan the QR codes on each image to listen to an account of their journeys. These writings, in turn, find their way into the body in a dance film that accompanies the images. Interrupting this assembly of image, sound and film is periodical live movement that punctuates the tableau. \nPerformance: ‘how are things …?’\nSaturday, 15 June | 7:00 pm\n \n‘how are things …?’ is a 50 minute solo performance within the context of the performance installation INHERITAGE by choreographer Preethi Athreya. Through a development of text, movement and sound, Preethi presents a personal ‘archaeology’ of objects inherited, passed on or lost. By tracing the journey of things into our lives, she asks  – can we make an anatomical, speculative fiction of objects? Can we trace ‘her-stories’ (and not totalising and reductive ‘his’tories) of objects found not in the museum, but in our family homes, that have written us into being …?  \nINHERITAGE was produced by the CHARCOAL platform for collaboration with support from Prakriti Foundation and the Alliance Française of Madras. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/inheritage/",
    "keywords": "Dance, Visual Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-494.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "झुंड | Jhund",
    "startDate": "2024-06-26T19:00:00+05:30",
    "endDate": "2024-06-26T20:00:00+05:30",
    "description": "Hindi | 60 minutes | Suitable for 8+ years  \nJhund (Herd), a dark comedy, unfolds in an unknown room where two strangers navigate their uncertain circumstances. Unsure if they’re there by choice or coercion, they grapple with fear, defending themselves against an indefinable threat. Amid absurd moments, an unknown authority keeps asking for things, making them question who to trust and what they believe. \nThis comedy delves into themes of submission, freedom, and betrayal, revealing the fine line between compliance and rebellion in a gripping, compact narrative. \nCredits: \nWritten and Directed by Chanakya Vyas\nDevised and Performed by Ashwini Kumar Chakre and Vivek Vijayakumaran\nPresented by Our Theatre Collective, Bengaluru\nOriginally produced by Indian Ensemble, Bengaluru\nSet Design and Execution: Sridhar Murthy\nLight Design: Niranjan Gokhale\nLights Execution: Arun DT\nCostume Design: Aloka Gloria D’souza\nSound Design: Mohammed Lehry\nSound Execution: Ankit Tripathi\nProduction Manager: Ankit Tripathi\nPoster Design: Pratyush Singh\nPhoto Credits: Virginia Rodrigues and Team\nProducer: Our Theatre Collective \n \n  \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%9d%e0%a5%81%e0%a4%82%e0%a4%a1-jhund/",
    "keywords": "Performing Arts, Theatre",
    "inLanguage": "hi",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "झुंड | Jhund"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-502.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Ocean of Wetness",
    "startDate": "2024-06-15T18:30:00+05:30",
    "endDate": "2024-06-15T19:45:00+05:30",
    "description": "We live in an all-consuming wetness that is everywhere in the air, earth, seas, flora and fauna. It precipitates, evaporates, storms, seeps, soaks, transpires, osmotes, condenses. We exist in this ‘Ocean’ as wet stuff ourselves, our wetness necessary to our existence. However, we are not educated to inhabit this Ocean. We are rather educated to inhabit an Earth with a surface of land served by water confined to a place behind a line. This surfaced Earth, we suggest, is the outcome of a design project intent on making an object that benefits a few at the cost of the many, an object that serves science, civilization and cities, but also colonization and systemic oppression. Today, this Earth is in trouble from climate change, threatened (and violated) by the water it has sought to enslave. It faces sea level rise, floods, increasingly frequent, violent and unpredictable storm events, and the melting of ice caps. To us, these are not problems to solve; they are calls to review a design project that has proved unjust, unwise and disastrous. Does an Ocean of Wetness offer an alternative? \nJoin us as Prof. Dilip da Cunha lays out an alternative to interpret ‘landscapes’ as a gradient of wetness over the binary of ‘land’ and ‘water’. This talk will be followed by a Q&A session with the audience. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/ocean-of-wetness/",
    "keywords": "Climate Change, Environment, Science, Sustainability",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-44.png"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "India’s Defence and Security Imperatives",
    "startDate": "2024-06-18T18:30:00+05:30",
    "endDate": "2024-06-18T20:00:00+05:30",
    "description": "In an increasingly complex and dynamic world of Geo-Politics & Geo-Economics, safeguarding India’s national interests involves multifaceted challenges and strategic considerations in the context of the nation’s defence & security. Ambassador Sujan Chinoy, India’s leading defence & security expert will through his talk give an overview and provide a comprehensive understanding of this scenario. \nThis talk will help understand India’s position in the global geopolitical landscape, including regional power dynamics, strategic partnerships, emerging threats and internal and external security challenges, such as terrorism, insurgency, cyber threats, and border tensions. He will also touch upon emerging defence technology and innovation, assessing military capabilities and fostering defence indigenisation in the Indian context. \nThe talk will be followed by a moderated Q&A with the audience. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/indias-defence-and-security-imperatives/",
    "keywords": "Defence & security, International Relations, Politics",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_pOSTER.jpg"
  }
]