[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76478-1753036200-1753041600@bangaloreinternationalcentre.org",
    "name": "English & Our Many Selves",
    "startDate": "2025-07-20T18:30:00+05:30",
    "endDate": "2025-07-20T20:00:00+05:30",
    "description": "What happens when the language we speak no longer fits who we are, or when it never quite did? \nIn this thought-provoking talk, writer and translator Rita Kothari invites us to reflect on the hidden languages of our lives: the ones we speak at home, inherit from our families, or carry quietly within us. While English may dominate our public conversations, Kothari reminds us that it rarely stands alone. Beneath its surface are other tongues, shaping how we think, feel, and belong. \nDrawing from personal stories and cultural insight, she explores how linguistic expression is deeply tied to identity and power. From subtle shifts in pronunciation to bold acts of embracing or rejecting a language, Kothari highlights how marginalised communities use language to resist dominant norms.  \nKothari challenges us to see language not just as a system of grammar and rules, but as lived experience; fluid, intimate, and political. In doing so, she calls for a more inclusive understanding of how we speak and listen to one another. \nThe talk will be followed by a Q&A session, offering space for conversation and reflection with your questions, your stories, and your own layers of language. \nThis lecture is a part of Azim Premji University’s Public Lecture Series. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/english-our-many-selves/",
    "keywords": [
      "Culture",
      "Development",
      "Language",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-70.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "76581-1753470000-1753475400@bangaloreinternationalcentre.org",
    "name": "Kadahin Milandaasin",
    "startDate": "2025-07-25T19:00:00+05:30",
    "endDate": "2025-07-25T20:30:00+05:30",
    "description": "Experience an unforgettable evening of music and memory with a special vinyl listening session of Kadahin Milandaasin, the acclaimed album by drummer and composer Tarun Balani. Called “a sonic love letter to Sindh” by The Hindu, this deeply personal work has been featured on NPR’s Best Jazz Albums and Bandcamp’s Best of Jazz. \nInspired by the life of Balani’s late grandfather, K.S. Balani, a renowned Sindhi writer and painter, the album explores themes of migration, ancestral memory, and identity. Through moving compositions and layered soundscapes, Kadahin Milandaasin becomes both a tribute and a journey home. \nThe evening includes a full vinyl playback of the album, followed by an intimate conversation with Tarun Balani himself. Join us for a rare chance to hear the stories behind the music: of love, loss, and legacy.  \nAbout BIC Elsewhere: \nWhile the majority of our events find a home at our premises in Domlur, BIC Elsewhere represents our commitment to bringing conversations, arts, and culture directly to diverse audiences. Through this initiative, we collaborate with various venues, extending the reach of our events beyond our own space. These partnerships not only breathe life into our gatherings but also play a crucial role in cultivating an environment for the flourishing of arts and culture in the city. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/kadahin-milandaasin/",
    "keywords": [
      "Culture",
      "Heritage",
      "Music",
      "Performing Arts",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Sabha: An Arts and Crafts Shaale, No.44/A, Kamaraj Rd, Bharati Nagar, Shivaji Nagar, Bengaluru, Karnataka, 560042, India"
    },
    "inLanguage": "sd",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Kadahin Milandaasin"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-936.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "76591-1754245800-1754251200@bangaloreinternationalcentre.org",
    "name": "Peace Notes - An Evening at the Opera",
    "startDate": "2025-08-03T18:30:00+05:30",
    "endDate": "2025-08-03T20:00:00+05:30",
    "description": "Experience the drama, passion, and romance of opera in a concert featuring timeless masterpieces from Bizet’s Carmen, Verdi’s La Traviata, and Gounod’s Romeo and Juliet! \nThe South Asian Symphony Orchestra will be led by India-born Danish conductor Maria Badstue, and joined by stellar soloists—Indian-American tenor Alok Kumar and soprano Cheryl Bains. This concert brings the emotional power of grand opera to life in Bengaluru. \nThe South Asian Symphony Orchestra brings together talented musicians from across the region to foster peace and unity through music. Inspired by Ambassador Nirupama Menon Rao’s extensive years in diplomacy, the orchestra provides a platform to promote dialogue, cultural synergy, and friendly understanding. \nNirupama Rao, Founder/ Trustee of The South Asian Symphony Foundation says, “There is something profoundly symbolic about an orchestra. It is more than a group of musicians gathered to perform a piece of music; it is a living metaphor for what society could be — and perhaps what it must be, if we are to thrive together… This metaphor becomes even more powerful in today’s world, where individualism often overshadows community, and noise threatens to replace music. The orchestra reminds us that true greatness lies not in volume, but in harmony — in listening, adapting, and playing our part with care and respect.” \n \n  \nIn collaboration with: \n \nSupported by: \n      \n",
    "url": "https://bangaloreinternationalcentre.org/event/peace-notes-an-evening-at-the-opera/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Peace Notes - An Evening at the Opera"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-SASO-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76381-1752865200-1752868800@bangaloreinternationalcentre.org",
    "name": "All About Nothing",
    "startDate": "2025-07-18T19:00:00+05:30",
    "endDate": "2025-07-18T20:00:00+05:30",
    "description": "Isn’t love just the most beautiful illusion? \nAll About Nothing is a powerful solo performance that blends story, movement, and music into a poetic look at how romantic love shapes the way we see the world. Through the lens of maya, or illusion, this deeply personal piece asks: what happens when we build our lives around feelings that may not be real? \nTold through a quiet, intimate dialogue between two artists, the performance gently unravels the roles, emotions, and routines we often cling to. With honesty and grace, it explores what lies beneath it all, and the freedoms that might be found in letting go. \nRooted in the spirit of Butoh master Kazuo Ohno’s words, “You must have life coming out of you (your art),” this work is not simply performed, but lived. \nAll About Nothing offers both tenderness and confrontation, inviting you to reflect on your own attachments through questions of what you hold dear, and why. \nCredits:\nWritten & Conceptualized by: Archana S Kumar, India\nOriginal Soundscore: Kamal Singh, Bangalore, India\nDramaturgy & Lighting: Sal Yusuf, UK | India (Black Box India) \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/all-about-nothing/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-932.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75807-1752778800-1752784200@bangaloreinternationalcentre.org",
    "name": "Dual Margam 4",
    "startDate": "2025-07-17T19:00:00+05:30",
    "endDate": "2025-07-17T20:30:00+05:30",
    "description": "What happens when two classical dance forms meet on the same stage? \nRooted in tradition, yet distinct in rhythm and grace, the fourth evening of Dual Margam brings together two iconic forms: the flowing, emotive elegance of Mohiniyattam from Kerala, and the sculptural strength and expressive clarity of Odissi from Odisha. \nEach solo performance offers a glimpse into the soul of its tradition—Mohiniyattam with its gentle, circular grace; Odissi with its striking lines and powerful storytelling. The evening culminates in a duet, weaving these two styles into a graceful confluence, illuminating their shared roots and individual brilliance in a spellbinding visual dialogue. \nWhether you’re a longtime admirer of classical dance or simply curious, this is a rare chance to experience movement as language, emotion, and shared heritage. \nThe Dual Margam series curates two classical dance forms of India to highlight their similarities and differences. The solo performances honour traditional repertoire (the Margam), while the duet will juxtapose each unique form with another. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dual-margam-4/",
    "keywords": [
      "Dance",
      "Heritage",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-921.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76224-1752692400-1752697800@bangaloreinternationalcentre.org",
    "name": "Chandalika",
    "startDate": "2025-07-16T19:00:00+05:30",
    "endDate": "2025-07-16T20:30:00+05:30",
    "description": "What happens when one small act of kindness transforms society? \nChandalika is a moving story of a young woman marked by caste, until one simple act of compassion sparks a revolution. Presented by Chinmayi Nrithyalaya and directed by Guru Sridevi Chalagalla Mungara, this Kuchipudi dance-drama brings Rabindranath Tagore’s poignant writing to life. \nThis emotional and spiritual journey of identity, longing, and liberation unfolds beautifully through Kuchipudi’s deeply expressive vocabulary. Graceful movement, rhythmic command, and layered abhinaya, portray the character’s awakening from inherited exclusion to personal agency with an emotional depth only dance can invoke . \nPerformed in Telugu with English narration, Chandalika is easy to follow and hard to forget! \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/chandalika/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "te",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-928.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "76365-1753297200-1753304400@bangaloreinternationalcentre.org",
    "name": "ಕ್ರಾಂತಿ ಬಂತು #ಕ್ರಾಂತಿ | Kranthi Bantu #Kranthi",
    "startDate": "2025-07-23T19:00:00+05:30",
    "endDate": "2025-07-23T21:00:00+05:30",
    "description": "\n110 minutes | Kannada | For all ages \nಕ್ರಾಂತಿ ಬಂತು #ಕ್ರಾಂತಿ ನಾಟಕವನ್ನು ಸಾಹಿತಿ ಪಿ. ಲಂಕೇಶ್‌ ಅವರ “ಕ್ರಾಂತಿ ಬಂತು ಕ್ರಾಂತಿ” ನಾಟಕದ ಪಠ್ಯವನ್ನು ಪ್ರಸ್ತುತಕ್ಕೆ ಅಳವಡಿಸಿಕೊಂಡು ಕಟ್ಟಲಾಗಿದೆ. ಈ ನಾಟಕವು ಮೊದಲ ಬಾರಿಗೆ ಪ್ರಕಟವಾಗಿದ್ದು 1971ರಲ್ಲಿ. ಸಾಮಾಜಿಕ ಮತ್ತು ರಾಜಕೀಯ ಪರಿಸ್ಥಿತಿಗಳಲ್ಲಿ ಅಂದಿಗೂ – ಇಂದಿಗೂ ಸಾಕಷ್ಟು ಬದಲಾವಣೆಗಳು ಕಂಡುಬಂದರು, ಆ ಬದಲಾದ ಪರಿಸ್ಥಿತಿಗಳು ತಮ್ಮ ಮೂಲ ಸ್ವರೂಪವನ್ನು ಹಾಗೆಯೇ ಉಳಿಸಿಕೊಂಡಿರುವುದು ನೋವಿನ ಸಂಗತಿ. ಸಮಾಜವಾದ, ಸಮತಾವಾದ, ಕ್ರಾಂತಿಯಂತಹ ವಿಚಾರಗಳ ಘರ್ಷಣೆ ಉತ್ತುಂಗದಲ್ಲಿದ್ದಾಗ ಬರೆಯಲ್ಪಟ್ಟಿರುವ ನಾಟಕ ಇಂದಿನ ಸಾಮಾಜಿಕ ಮತ್ತು ರಾಜಕೀಯ ಸನ್ನಿವೇಶಗಳನ್ನು ಕೂಡ ಸಮರ್ಥವಾಗಿ ಪ್ರತಿಧ್ವನಿಸುತ್ತದೆ. ಮೂಲ ಪಠ್ಯವನ್ನು ಕಲಾವಿಲಾಸಿ ತಂಡದ ಕಲಾವಿದರು ಈಗಿನ ಕಾಲದ ಸಂಕೀರ್ಣ ಮತ್ತು ಸೂಕ್ಷ್ಮ ಘಟನೆಗಳನ್ನು ಇಟ್ಟುಕೊಂಡು ಇಂದಿನ ತಲೆಮಾರಿಗೆ ಹತ್ತಿರವಾಗುವ ಹಾಗೆ ವಿಸ್ತರಿಸಿದ್ದಾರೆ. \nಬಂಡವಾಳಶಾಹಿಗಳ ದೋರಣೆ, ವ್ಯವಸ್ಥೆಯ ಹಸ್ತಕ್ಷೇಪ, ತಮ್ಮ ಲಾಭಕ್ಕಾಗಿ ಅಮಾಯಕರ ದಿಕ್ಕು ತಪ್ಪಿಸುವ  ಪ್ರಭಾವಿಗಳ ಅವಕಾಶವಾದಿ ಧೋರಣೆ, ಕ್ಷಮತೆ ಕಳೆದುಕೊಳ್ಳುವ ಯುವಕರ ಆಕ್ರೋಶ, ಸಾಮಾಜಿಕ ಜಾಲತಾಣಗಳ ಸಾಮೂಹಿಕ ಅಭಿಪ್ರಾಯಗಳು… ಹೀಗೆ ನಾಟಕವು ಹಲವು ಜ್ವಲಂತ ಸಮಸ್ಯೆಗಳಿಗೆ ಪ್ರೇಕ್ಷಕರನ್ನು ಮುಖಾಮುಖಿಗೊಳಿಸುತ್ತಾ ಹೋಗುತ್ತದೆ. ಸರಿ ತಪ್ಪುಗಳು ಅವರವರ ವಿವೇಚನೆಗೆ ಬಿಟ್ಟಿದ್ದು. ನಾಟಕದುದ್ದಕ್ಕೂ ತಮಗೆ ಸರಿ ಎನಿಸುವ ನಿರ್ಧಾರಗಳನ್ನು ತಗೆದುಕೊಂಡು ತಮ್ಮ ದಾರಿಗಳನ್ನು ಆರಿಸಿಕೊಳ್ಳುವ ಪಾತ್ರಗಳು ಈ ಸಂಕೀರ್ಣ ವ್ಯವಸ್ಥೆಯ ಸುಳಿಯಲ್ಲಿ ಸಿಕ್ಕಿಕೊಂಡು ಕುತೂಹಲವನ್ನು ಕೆರಳಿಸುತ್ತವೆ. ಹಾಸ್ಯ ಮಿಶ್ರಿತ ವಿಡಂಭನೆಯೊಂದಿಗೆ ಕಟ್ಟಿರುವ ನಾಟಕ ಪ್ರೇಕ್ಷಕರಿಗೆ ಸಾಕಷ್ಟು ಮನರಂಜನೆಯನ್ನೂ ಒದಗಿಸುತ್ತದೆ. \nThe play Kranthi Banthu #Kranthi has been adapted to the present times from P. Lankesh’s original “Kranthi Banthu Kranthi”, first published in 1971. Although there has been a significant shift in the political and social climate, the fact that the roots of these issues have remained constant makes it feel almost natural. The original play, written during an era when socialism, communism and revolution were at their peak, still manages to capture and reflect the present political and social order. Team Kalavilasi has adapted the original to fit today’s scenario, making it more relatable to the current generation while being mindful of the play’s complex and sensitive aspects. \nThe play explores pressing issues such as the tyranny of capitalists, systemic interference, the opportunistic behavior of influencers for personal gain, the outrage of disempowered youth, the flood of opinions on social media, and how the media capitalizes on these dynamics. It engages the audience with these timely themes. \nThe question of what is right or wrong is subjective. Throughout the play, the characters make decisions they believe to be right, only to become trapped in the system’s nuances, sparking curiosity in the audience. Woven with humor and satire, the play offers ample entertainment while provoking thought. \nCast and Crew | ತಾರಾಗಣ ಮತ್ತು ತಾಂತ್ರಿಕ ಬಳಗ: \nVaishnavi | ವೈಷ್ಣವಿ\nMadhukar Hirisave | ಮಧುಕರ್ ಹಿರಿಸಾವೆ\nSiddaramu K | ⁠ಸಿದ್ದರಾಮು ಕೆ\nNamitha Ramu | ⁠ನಮಿತಾ ರಾಮು\nPallavi Hegde | ⁠ಪಲ್ಲವಿ ಹೆಗಡೆ\nHarsha Vardhan | ⁠ಹರ್ಷ ವರ್ಧನ್\nNarayan Badiger | ನಾರಾಯಣ್ ಬಡಿಗೇರ್\nNagaraj | ನಾಗರಾಜ್\nSuhas Srinivas | ಸುಹಾಸ್ ಶ್ರೀನಿವಾಸ್\nAbhishek Chakrannavar | ಅಭಿಷೇಕ ಚಕ್ರಣ್ಣವರ\nAbhinav Iyengar | ಅಭಿನವ್ ಅಯ್ಯಂಗಾರ್ \nBackground Music | ಹಿನ್ನೆಲೆ ಸಂಗೀತ : Sathya Radhakrishna | ಸತ್ಯ ರಾಧಾಕೃಷ್ಣ\nLighting Design | ಬೆಳಕು ವಿನ್ಯಾಸ : Manju Narayan | ಮಂಜು ನಾರಾಯಣ & Surya | ಸೂರ್ಯ\nCo-ordinator | ರಂಗ ನಿರ್ವಹಣೆ : Basavaraj Emmiyavar | ಬಸವರಾಜ ಎಮ್ಮಿಯವರ \n\n\nSupported by:\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%95%e0%b3%8d%e0%b2%b0%e0%b2%be%e0%b2%82%e0%b2%a4%e0%b2%bf-%e0%b2%ac%e0%b2%82%e0%b2%a4%e0%b3%81-%e0%b2%95%e0%b3%8d%e0%b2%b0%e0%b2%be%e0%b2%82%e0%b2%a4%e0%b2%bf-kranthi-bantu-kranthi/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "ಕ್ರಾಂತಿ ಬಂತು #ಕ್ರಾಂತಿ | Kranthi Bantu #Kranthi"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-935.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "76603-1753614000-1753621200@bangaloreinternationalcentre.org",
    "name": "Ferdinand Kittel's Life and Works",
    "startDate": "2025-07-27T11:00:00+05:30",
    "endDate": "2025-07-27T13:00:00+05:30",
    "description": "The Word and the Teacher / ಅರಿವು ಮತ್ತು ಗುರುವು / Das Wort und Der Lehrer\n80 mins |  English, Kannada, & German with English subtitles | 2023 | India, Germany \n  \nRev. Ferdinand Kittel (1832 – 1903) was a missionary from Germany, who spent 50 years of his life between India and Germany on his work as a writer, translator, linguist and lexicographer. This period film takes up the journey of his monumental work in the fields of lexicography and philology. Despite many challenges, he mastered the Kannada language and created a huge dictionary and thesaurus unparalleled in any Indian language. He also taught in schools and produced more than 40 scholarly works. \nThis tri-lingual, non-fiction film is shot in locations where Kittel lived and worked both in southern India and Germany, and its first person narration uses his letters to his children in Germany, and letters and reports to superiors. It includes archival photographs dating back to the early 19th century, folk songs and poems written and translated by Kittel, and Old Kannada literature. The film has been shown in different parts of Switzerland, Germany & India. \nDuring the production of the film, one of the early print typefaces of Kannada, pioneered by Kittel and cast in Europe was digitised by the filmmaker, Prashant Pandit, and an open-source font in the name of Kittel was released for public use. This font was extensively used in the books published during the 1860s. The film also uses this font in the displayed texts. \nImage Credit\nHeader: Erstwhile Basel Mission Printing Press, Mangaluru, a still from the film, The Word and the Teacher. Ferdinand Kittel supervised the publication of numerous books at the Press. \nProduction Crew:\nDirector, Writer & Editor – Prashant Pandit\nCinematography – Chidanand GL & Florina Steiner\nSound – Anand V & Mahaveer S \n",
    "url": "https://bangaloreinternationalcentre.org/event/ferdinand-kittels-life-and-works/",
    "keywords": [
      "Biography",
      "Culture",
      "Film",
      "Language",
      "Literature"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "Ferdinand Kittel's Life and Works"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-2-4.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "76239-1753210800-1753216200@bangaloreinternationalcentre.org",
    "name": "The Rhythm of Calm",
    "startDate": "2025-07-22T19:00:00+05:30",
    "endDate": "2025-07-22T20:30:00+05:30",
    "description": "What if music could quiet the world around you? \nStep into an evening of calm, beauty, and tradition with Dhrupad; the oldest form of Indian classical vocal music still performed today. \nRooted in the Dagarvani style, this performance offers a deep, meditative experience. Rich vocal melodies meet the earthy rhythm of the Pakhawaj, creating an atmosphere of calm, clarity, and deep listening. \nEach note is sung with grace. Each rhythm unfolds with purpose.  \nThis evening of Dagarvani Dhrupad invites you to slow down for a night of pure, powerful listening. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-rhythm-of-calm/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Rhythm of Calm"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-934.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76028-1753383600-1753388100@bangaloreinternationalcentre.org",
    "name": "Dvaita | Duality",
    "startDate": "2025-07-24T19:00:00+05:30",
    "endDate": "2025-07-24T20:15:00+05:30",
    "description": "Contradictions, comparison and ultimately confluence, Dvaita | Duality is a fusion of artistic expression and philosophical inquiry. Through two distinct dance forms, Kuchipudi and Balinese, the dynamic balance of opposing energies is beautifully displayed. \nCentred around ‘Ardhanareeswara’, the composite form of Shiva-Shakti, the dance visualises the distinct yet complementary nature of the masculine and feminine energies. A layered performance, this piece explores the philosophical questions of how our consciousness (Purusha) interacts with the material world (Prakriti). \nThis evening aspires to resolve the paradox of opposites not through negotiation, but harmonious expression. \nCredits: \nConcept, Creation and Artistic Direction: Gomathi Boorada \nDancers:\nGomathi Boorada\nJesitta Jilju\nNeharika Renjith Nair\nHemali Subramanyam Boorada\nAlphonsa Ashwajit Kamble\nSneha Chandrababu\nGoutham Maheswaran\n⁠Ni Putu Widiantini\n⁠Ni Wayan Pia Wahyuni\n⁠Ni Komang Erna Sriwahyuni\n⁠Ni Kadek Santi Wiadnyani \nMusic:\nI Wayan Sudirana / Gamelan Yugananda\nD.S.V. Sastry – Sastry Studios, Hyderabad\nBrian Raine \nChoreography:\nGomathi Boorada\nNi Putu Widiantini \nIn collaboration with:\n  \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dvaita-duality/",
    "keywords": [
      "Culture",
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-922.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "76355-1753009200-1753014600@bangaloreinternationalcentre.org",
    "name": "The Shape of Sound in Stillness",
    "startDate": "2025-07-20T11:00:00+05:30",
    "endDate": "2025-07-20T12:30:00+05:30",
    "description": "Some moments in life invite us to pause; to breathe, to listen, and to simply exist. \nSet in the calm of a late morning, this intimate Hindustani classical concert is a quiet space to step away from the rush of daily life. The gentle interplay of voice, tanpura, tabla, and harmonium creates a soundscape that invites you inward, toward reflection and balance. \nThe morning ragas chosen for this performance are rooted in centuries-old traditions. Each note is crafted with care to awaken clarity, soft energy, and a renewed sense of presence. Guided by accomplished vocalists who carry forward the rich legacy of Hindustani classical music, the concert becomes more than a performance; it becomes a meditative journey. \nCome as you are. Let the music meet you there. Before the world fully stirs, allow yourself this gift of stillness, where melody and rhythm become gentle reminders of the peace already within you.  \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-shape-of-sound-in-stillness/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Shape of Sound in Stillness"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-933.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75651-1753468200-1753473600@bangaloreinternationalcentre.org",
    "name": "Kailash-Manasarovar",
    "startDate": "2025-07-25T18:30:00+05:30",
    "endDate": "2025-07-25T20:00:00+05:30",
    "description": "For centuries, Tibet has remained a land of mystery. Though sacred to millions, Mount Kailash and Lake Manasarovar, were still wrapped in myth as recent as the 1900’s. This session retraces the journey of two travelers, a Swedish explorer and an Indian ascetic, whose visits illuminated the mythical and sacred Kailash-Manasarovar region in Tibet. \nBetween 1907 and 1909, Swedish explorer Sven Hedin mapped the region. He traced the sources of the three great rivers – the Brahmaputra, Indus, and Sutlej – and became the first European to walk around Mount Kailash. Three decades later, Indian monk Swami Pranavananda arrived in the region. He offered a fresh view, challenging Hedin’s identification of the rivers’ sources, offering, for the first time, an informed Asian perspective on Tibet’s geography. \nThis visually rich talk brings their stories to life. Rare archival material, contemporary photos, and new research reveal how these journeys shaped our understanding of a sacred landscape. \nThe Q&A after the session offers room for your participation – whether curious about history, travel, or sacred places. \n",
    "url": "https://bangaloreinternationalcentre.org/event/kailash-manasarovar/",
    "keywords": [
      "Cities",
      "Culture",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-931.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73689-1752690600-1752696000@bangaloreinternationalcentre.org",
    "name": "The History of Welfare",
    "startDate": "2025-07-16T18:30:00+05:30",
    "endDate": "2025-07-16T20:00:00+05:30",
    "description": "Why does welfare feel out of reach for so many, even as governments promise more than ever? \nWelfare schemes and cash transfers are central to India’s political economy today. Making India Work: The Development of Welfare in a Multi-Level Democracy (Cambridge University Press, 2025) recounts the crucial history of how welfare has evolved in India over the past century. Traversing more than a century of welfare development from the late colonial period to the present-day, the book asks important questions, illuminates failures and brings clarity to our murky future. \nAuthor Louise Tillin in conversation with Anindita Adhikari and Rajendran Narayanan, moderated by Arun Thiruvengadam, will explore what India’s welfare journey means for citizens, workers, and voters today. \nCurious about where your taxes go, or why support doesn’t always reach those who need it most? Stay for the Q&A and bring your questions. \nIn collaboration with: \n \nThis event is sponsored by the Justice VR Krishna Iyer Chair, NLS.  \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-history-of-welfare/",
    "keywords": [
      "Books",
      "Economics",
      "History",
      "Law",
      "Policy & Regulation",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-829.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76762-1753468200-1753473600@bangaloreinternationalcentre.org",
    "name": "The Gauri Files",
    "startDate": "2025-07-25T18:30:00+05:30",
    "endDate": "2025-07-25T20:00:00+05:30",
    "description": "Join us for an urgent and thought-provoking evening with journalist and author Rollo Romig, as he delves into his powerful new book, I Am on the Hit List, a gripping exploration of the life and assassination of Gauri Lankesh, a fearless journalist in Bangalore whose murder shook India and the world. \nIn conversation with Pushpamala N and Shivsundar, Romig will unpack the years-long investigation behind the book, taking audiences inside the complex web of political extremism, underground networks, and courageous dissenters in modern India. From Bangalore’s storied publishing lanes to secretive religious enclaves, Romig’s reporting traces the forces threatening democracy—and the people risking everything to resist them. \nThis event offers a rare window into the human cost of political violence, the courage of those who speak truth to power, and the urgent question: how do we stop the spread of hatred before it turns deadly? \nDon’t miss this conversation at the intersection of journalism, politics, and justice. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-gauri-files/",
    "keywords": [
      "Books",
      "In Memory",
      "Media",
      "Nonfiction",
      "Politics",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-937.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76712-1753381800-1753387200@bangaloreinternationalcentre.org",
    "name": "The Law Strikes Back",
    "startDate": "2025-07-24T18:30:00+05:30",
    "endDate": "2025-07-24T20:00:00+05:30",
    "description": "Assistant Commissioner of Police (Retd) Madhukar B. Zende is best-known for his sensational arrest of the serial murderer Charles Sobhraj, aka the Serpent. He is also lauded for successfully managing the violent riots in Mumbai that broke out in the aftermath of the demolition of the Babri Masjid in 1993, and ushering in an era of peace. \nBut Zende has many more stories of crime and justice under his belt, and in the book, Mumbai’s Most Wanted, he gives readers a glimpse into what it meant to be a cop in the seventies and eighties. From the puzzling case of the murder of Shanta Devi to the kidnapping of a famous movie mogul to the capture of dark luminaries like Arun Gawli, Karim Lala, Haji Mastan and Babu Reshim, this session will explore the riveting account of a super cop who brought some of the city’s most dreaded villains to their knees. \nA Q&A session with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-law-strikes-back/",
    "keywords": [
      "Books",
      "Law",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-73.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "76197-1752865200-1752870600@bangaloreinternationalcentre.org",
    "name": "Tales of the Night",
    "startDate": "2025-07-18T19:00:00+05:30",
    "endDate": "2025-07-18T20:30:00+05:30",
    "description": "The solitude of the night-time has always been a space where humans release their innermost thoughts, whether of comfort, terror, liberation, wistfulness or hope. As such, many of the finest works of art have been inspired by its thrall. Karl Lutchmayer’s recital discusses and presents some powerful emotional responses to the darkness by a quintet of composer-pianists who represent a pantheon of Romantic and Modernist ethea. From yearning lullabies, intimate reminiscences, and nocturnal soundscapes to religious ecstasy, and gothic horror, each showcases the extraordinary resources of the piano and the technical and emotional range of the pianist’s art. \n \n  \nImage Credit: \nThumbnail, Header and Poster: Photos of Karl Lutchmayer by Param Singh \n  \nPresented by the International Music and Arts Society \n \n  \nWith the support of Furtados and Steinway \n       \n \n  \nThe International Music and Arts Society gratefully acknowledges the support of Shashi Uthappa and V Natarajan. \n",
    "url": "https://bangaloreinternationalcentre.org/event/tales-of-the-night/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Tales of the Night"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-923.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76494-1753470000-1753475400@bangaloreinternationalcentre.org",
    "name": "Folie à Deux",
    "startDate": "2025-07-25T19:00:00+05:30",
    "endDate": "2025-07-25T20:30:00+05:30",
    "description": "Folie à Deux \nSome connections run so deep, they blur the line between two minds, two lives, until they begin to move as one. Folie à Deux, French for “a shared madness” or “shared state of mind,” captures this rare intimacy. \nThe program features two evocative contemporary dance solos: “3 AM” and “Nobody Cares.” Together, these performances invite you into that in-between space where stories overlap, emotions echo, and movement speaks what words often cannot. \nTitle: Nobody Cares \nIn “Nobody Cares,” Deepak Kurki confronts identity in a world shaped by contradiction. His piece explores the dissonance of social labels and inherited expectations of an individual born in a Hindu family, raised in a Muslim neighborhood, and educated in a Catholic school. Through raw, physical language, Deepak questions the systems that define us—and the quiet resistance that emerges from within. \nCredits: \nChoreographed & Performed by Deepak Kurki Shivaswamy \nMusic: Abhijeet Tambe \nDuration: 30 minutes \n  \nTitle: 3 AM \nIn “3 AM,” Prashant More takes us into the restless mind of an insomniac. The piece traces the delicate edge between exhaustion and wakefulness—a world where time dissolves, and the mind spirals through memory, anxiety, and longing. It’s a quiet, surreal portrait of sleeplessness, told through a body caught in motion while desperately searching for stillness. \nCredits: \nChoreography and Performance: Prashant More Music: Nikhil Nagaraj \nDuration: 35 minutes \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/folie-a-deux-2/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-74.jpg"
  }
]