[
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Living Wills",
    "startDate": "2024-04-13T11:30:00+05:30",
    "endDate": "2024-04-13T13:00:00+05:30",
    "description": "An Advance Medical Directive (AMD) (usually misunderstood as a Living Will) recognizes the right of a person to choose the nature of medical treatment that he/she would like to be withheld. It is an extension of the principle of the right to die with dignity. An AMD is a person’s advanced exercise of autonomy on the subject of the level of medical intervention they intend to accept on their own body at a time when they may not be able to express their views. The objective and intent of an AMD are to convey a person’s medical care preferences if they lose their ability to make decisions. \nIn March 2018, the Supreme Court of India, in a landmark judgement, recognized the right of a terminally ill person to execute an Advance Medical Directive. AMD helps in protecting basic human autonomy, while also shedding light on the concept of dignity in death. However, it is still a new concept in India and early last year the Supreme Court modified its guidelines for the execution of the Living Will. \nThis session by Mr. Shiv Kumar will delve into the Advanced Medical Directive and will examine the ingredients of an AMD, its legal nuances, how and when it can be made, and its consequences. It will be followed by a Q&A session with the audience and enable a discussion on the barriers that impact the efficacy of the AMD. \nIn collaboration with Silver Talkies, a social enterprise focused on making active ageing a desirable and viable goal for older adults:\n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/living-wills/",
    "keywords": "Law, Society",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-424.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Make / Believe",
    "startDate": "2024-04-06T11:00:00+05:30",
    "endDate": "2024-04-14T20:00:00+05:30",
    "description": "Inauguration & Walkthrough: Saturday, April 6 | 11:15 am – 12 noon\nTea: 12 noon – 12:15 pm\nPanel Discussion: Saturday, April 6 | 12:15 pm – 2:00 pm \nThis exhibition is conceptualized as a way to put forth the method and medium of practice at a for architecture (AFA) which has primarily been that of model making, since the establishment of the office some twelve years ago. Practice for AFA is understood more in the form of an atelier or a work-shop which is known for a certain way of doing things, approach to questions, craft, and other related qualities. Like most good ateliers, the focus is to produce ideas for good architecture and the method and modality of putting these ideas forward has been the physical model. \nAFA was established in 2011 by Ajay Sonar and Monali Patil in Nashik. AFA has won several awards, including the Archdaily’s 2021 New Practices. Their work has been exhibited at Time Space Existence in Venice in 2023. Most recently AFA has been featured in ‘Architectures of transition: Emergent practices in South Asia’ published by Harvard GSD. \nThe exhibition will be inaugurated by Sanjay Mohe which will be followed by presentations and a panel discussion. \nPresented by:\n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/make-believe/",
    "keywords": "Architecture, Design, Visual Arts",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-430.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Saga of a Poet",
    "startDate": "2024-04-15T18:30:00+05:30",
    "endDate": "2024-04-15T20:30:00+05:30",
    "description": "60 minutes | Tamil with English Subtitles | 2000 | India \nMany years after a poet’s death, the words and images he conjured up continue to inspire generations of artists. Tamil cinema, dance, painting, music, theatre and literature resonate with Bharati’s vision. The public and private lives of men, women and children are shaped indelibly by his ideals. Subramania Bharathi (1882-1921) lives on. \nShot in present-day Tamilnadu and Pondicherry, at the turn of the present century (2000-2001) Saga of a Poet celebrates the enduring relevance and presence of perhaps the greatest poet the Tamil language has seen. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/saga-of-a-poet/",
    "keywords": "Film, Poetry",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-426.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Jump",
    "startDate": "2024-04-08T19:00:00+05:30",
    "endDate": "2024-04-08T20:30:00+05:30",
    "description": "90 minutes | English and Hindi | Mature Content for Ages 16+ \nTrigger Warnings: Suicide & Self Harm \nA two-actor black comedy about life, death, and everything in between. A successful female executive is ready to commit suicide by jumping off a roof when a male cab driver saves her. \nThis sets the stage for a collision between two completely opposite worlds, personalities,\ncircumstances, beliefs, and perspectives. Despite their contrasting socio-economic classes, backgrounds, and lifestyles, this unusual encounter leads to a night of pure and simple human connection. \nWill the man be able to truly save her, or will she be back to jump again? \nThe play explores the themes of suicide, depression, loneliness, happiness, love, having or not having a purpose in life, and ultimately death, creating an emotionally complex and thought-provoking experience for the audience. Jump delves into the human psyche, showcasing the struggles, challenges, and aspirations of two very different individuals who would never meet in normal circumstances but find a unique connection in the most unexpected of places and in their shared\nhumanity. \nDirector’s Note \nApart from being an actor and director, I’m also a mountaineer. I was in an advanced mountaineering course trying to summit a Himalayan mountain in October 2022. An avalanche came, and we lost 29 people out of a batch of 53 people. I somehow survived the incident and escaped death. The incident changed me, my core beliefs, and my perspective on living life. For the first time, I felt depressed and tried therapy. The incident left me with a lot of questions. WHO recently declared loneliness a ‘global public health concern’. In India, 1 in every 5 individuals suffers from some form of mental health illness, and over 2.6 lakh cases of suicide occur in a year. \nGiven these alarming numbers, considering and addressing mental health is still at a very early stage in India. In a post-pandemic world, the alarming rise in suicide, depression, and loneliness rates around the world shows that our pursuit of success and materialistic goals doesn’t lead us to genuine happiness and fulfilment. In the world of social media, because of personal, sociological, political, and geographical reasons, we feel disconnected more than ever before. We often witness instances where seemingly successful and happy individuals suddenly take their own lives. In spite of the number of self-help books, motivational speakers, and influencers preaching about finding life’s purpose, a significant portion of us are just trying to survive. \nOur individual perspectives play a significant role in shaping our lives. We tend to surround ourselves with like-minded people who share similar perspectives. We believe that our own perspective is the\nultimate and only valid one. If we look closely enough, all the conflicts in the world are just a clash of different and opposing perspectives. \nThe essence of Jump lies in the meeting of these two contrasting characters, identities, perspectives, lifestyles, and worlds within a highly unusual situation. \nAbout Collective Madness\nEvery project for us is an attempt to find a unique connection with our audience around the ideas we believe in. Collective Madness Studios, established in 2004, is a platform for anyone who believes that theatre is a practicing art form and provides a space for those who are passionately attached to theatre. The studio has produced close to 20 projects, including musicals, adaptations and plays with social messages We believe in collaboration & experiential learning. It is at the heart of all our products & initiatives. Every individual human experience is a limiting one, so collaborating with others has become essential. Collaborations challenge one’s current understandings and help to see things from new perspectives. \nCast and Crew: \nActors: Vidushi Chadha and Sandeep Shikhar\nWriter & Director: Maneesh Verma\nDramaturg: Akhshay Gandhi\nAssociate Director & Lights: Vishal\nScenography: Maneesh Verma and Dhanendra Kawade\nProduction Manager: Monika Gupta\nSoundscape: Sahil Vaid\nSong Music Producer: Kaizad Gherda\nSong Lyrics & Music: Asif Ali Beg\nSong Singer: Shazneen Arethna\nProduced by Collective Madness Studios\nSpecial Thanks Kalyani Hiwale, Harsh Khurana, Tushar Pandey \nJump is inspired from “Umbrella” written by Larry Pontius\nCommissioned by Serendipity Arts Festival 2023 \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/jump/",
    "keywords": "Performing Arts, Theatre",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-405.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "ಪಂಚಮ ಪದ | Panchama Pada",
    "startDate": "2024-04-22T19:00:00+05:30",
    "endDate": "2024-04-22T20:30:00+05:30",
    "description": "Panchama was a magazine closely aligned with the Dalit Movement in Karnataka that gave voice to a generation of writers and journalists to document their contemporary moment including atrocities against Dalits. Using performance, the Jangama Collective revisits some of these writings and places them alongside songs, skits, pamphlets, and their own memories to think about where one should look for an embodied archive of Dalit resistance.\n\nThere will be a twenty minute post performance open forum with the performers and audience.\n\n\n\n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%aa%e0%b2%82%e0%b2%9a%e0%b2%ae-%e0%b2%aa%e0%b2%a6-panchama-pada/",
    "keywords": "Culture*, Society, Theatre",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-433.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Yaadey",
    "startDate": "2024-04-21T17:30:00+05:30",
    "endDate": "2024-04-21T19:00:00+05:30",
    "description": "This event will pay tribute to Ustad Rashid Khan, an illustrious figure in Indian classical music, through Ragas. \nIn Hindustani classical music, a Raga represents an array of melodic structures with musical motifs. They can express different moods for different times of the day. \nIn this evening concert in the BIC Amphitheatre, the artists will present bandishes of different ragas from the Hindustani classical tradition. \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/yaadey/",
    "keywords": "Music, Performing Arts",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-422.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "A Sound Democracy",
    "startDate": "2024-04-14T11:00:00+05:30",
    "endDate": "2024-04-14T12:30:00+05:30",
    "description": "67 mins | Hindi with English subtitles | India | 2023 \nA Sound Democracy explores the fusion of sound, identity, and the collective conscience, challenging us to reflect on the profound impact of the DJ sound system era on the delicate fabric of our democratic ideals. \nThe screening will be followed by a conversation with the filmmaker Dhananjai Sinha, the artistic director of Conflictorium, YSK Prerana, and the curator Aayush Chandrawanshi. A Q&A with the audience will follow. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/a-sound-democracy/",
    "keywords": "Culture*, Film, Music, Politics, Society, Technology",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-435.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "ಕಾಕದೋಷ | Kaakadosha",
    "startDate": "2024-04-10T19:00:00+05:30",
    "endDate": "2024-04-10T21:00:00+05:30",
    "description": "Kannada | 110 minutes |  Suitable for Ages 14+  \nಸರಿ ತಪ್ಪುಗಳಾಚೆ ಕುಟುಂಬ ಮನೆತನದ ಗೌರವಗಳು ನಿಲ್ಲಬಹುದೇ ? \nಬೆಂಗಳೂರಿನಲ್ಲಿ ಇರಬಹುದಾದ ಒಂದು ಸಾಂಪ್ರದಾಯಿಕ ಕುಟುಂಬ. ಗಂಡನನ್ನು ಕಳೆದುಕೊಂಡು ಕುಟುಂಬವನ್ನು ಸಂಭಾಳಿಸುತ್ತಿರುವ ಶಾರದಳಿಗೆ ಇರುವ ಒಂದೇ ಒಂದು ಭರವಸೆ ಎಂದರೆ ದೂರದ ಮುಂಬೈನಲ್ಲಿ ಕೆಲಸ ಮಾಡುತ್ತಿರುವ ಮಗ ಅಕ್ಷಯ್‌. ಹಳೆ ತಲೆಮಾರಿನ ಕೊಂಡಿಯಾಗಿ ಸಂಪ್ರದಾಯದ ಆಲದ ಮರವಾಗಿರುವ ಅತ್ತೆ ಸೀತಮ್ಮ ಮತ್ತು ಹೊಸ ಭವಿಷ್ಯದ ಸಂಕೇತವಾಗಿರುವ ಮಗ, ಇವರಿಬ್ಬರ ಮಧ್ಯೆ  ನಿಂತಿರುವ ಶಾರದಳಿಗೆ ಭೂತಕಾಲದ ಸತ್ಯವೊಂದು ನಿಜಭೂತವಾಗಿ ಹಠಾತ್ತನೆ ನಿಲ್ಲುತ್ತದೆ, ಅದೂ ತನ್ನ ಮಗ ಅಕ್ಷಯ್‌ನ ಮೂಲಕ. ಹೀನಕೃತ್ಯವೊಂದರಲ್ಲಿ ಆರೋಪಿಯಾಗಿ ಮಗ ಮನೆ ಸೇರಿದಾಗ, ಶಾರದಳ ಮುಂದಿರುವ ಆಯ್ಕೆಗಳೇನು ?ತಾನು ನಂಬಿದ ಮೌಲ್ಯಗಳು ಆಕೆಗೆ ಸರಿದಾರಿ ತೋರಿಸಿದವೇ ಅಥವಾ ಆಕೆಯ ಮನೆ ಕಾಗೆ ಹೊಕ್ಕ ದೋಷದ ಮನೆಯಾಯಿತೇ ? \nಪ್ರಖ್ಯಾತ ನಾಟಕಕಾರ ಹೆನ್ರಿಕ್‌ ಇಬ್ಸೆನ್‌ ನ ʼಘೋಸ್ಟ್ಸ್‌ʼ ನಾಟಕದ ಎಳೆಯೊಂದನ್ನು ಹಿಡಿದು , ಭಾರತದಲ್ಲಿ ೨೦೧೨ ರಲ್ಲಿ ನಡೆದ ನಿಜಘಟನೆಯೊಂದನ್ನು ಆಧರಿಸಿ ಅನುಪಮಾ ಚಂದ್ರಶೇಖರ್‌ ರವರು When the Crows Visit  ಎಂಬ ನಾಟಕವನ್ನು ವೆಂಕಟೇಶ್‌ ಪ್ರಸಾದ್‌ ರವರು ಕನ್ನಡಕ್ಕೆ ʼಕಾಕದೋಷʼ ಎಂಬ ಹೆಸರಿನಲ್ಲಿ ಅನುವಾದಿಸಿ ನಿರ್ದೇಶಿಸಿದ್ದಾರೆ. ಲಂಡನ್ನಿನಲ್ಲಿ ೨೦೧೯ ರಲ್ಲಿ ಇಂಗ್ಲೀಷಿನಲ್ಲಿ ಮೊದಲಿಗೆ ಪ್ರದರ್ಶನಗೊಂಡ ಈ ನಾಟಕ ಈಗ ಮೊದಲ ಬಾರಿಗೆ ಭಾರತದಲ್ಲಿ ಕನ್ನಡ ಭಾಷೆಯಲ್ಲಿ ‘ಕಾಕದೋಷʼ ಎಂಬ ಹೆಸರಿನಲ್ಲಿ ಪ್ರದರ್ಶನ ಕಾಣುತ್ತಿದೆ.  \nHow far can one go to save the Family’s ‘honour’? \nSet in a traditional family in a city like Bangalore, Kaakadosha revolves around the widow, Sharada, and her only hope, her son, Akshay who lives in distant Mumbai. Sharada, who is balancing the household with her Mother in law, Seethamma who roots the house with her traditional values, a link between the distant past and the present and Akshay the promise of a new future. Sharada is suddenly faced with the ghosts of the past, through the actions of her son, Sharada is left in cross roads. When Akshay returns home, accused of a heinous crime, what are Sharada’s choices? Will her trusted values show her the right path? Or are they all cursed in the old family house? \nDrawing inspiration from Henrik Ibsen’s “Ghosts,” Anupama Chandrasekhar crafted the play When the Crows Visit is based on a true incident from 2012. Venkatesh Prasad has translated to Kannada directed Kaakadosha. The English original premiered at Kiln Theatre, London, in October 2019, directed by Artistic Director Indhu Rubasingham. The play for the first time is being staged in an Indian language.  \n  \nCast and Crew: \nDesign: S. Surendranath \nSet Build: Sridhar Murthy \nProducer: Sushma \nProduction Manager: Bhyrava N \nLight Design: Arun D T \nSound Design: Utthana Barighat \nCostumes: Sushma \nOn Stage \nGauri Dattu, Divyashree J, Nandini Patvardhan, Shrunga B. V., Naveen Kumar J., Mario Jerome, Vasantha Krishnamurthy, Vidhya Ulithayya, Sunil Kumar V., Raag Urs \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%95%e0%b2%be%e0%b2%95%e0%b2%a6%e0%b3%8b%e0%b2%b7-kaakadosha/",
    "keywords": "Performing Arts, Theatre",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-406.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Understanding Theatre",
    "startDate": "2024-04-20T10:00:00+05:30",
    "endDate": "2024-04-20T17:30:00+05:30",
    "description": "The programme is specially designed as a Masterclass for BIC by Prof. Padaki. \nThe sessions during the day will be interactive, and will include exercises, films and active participation by all present. The programme at BIC will be led by Prof. Padaki himself. \nThe programme outline and the questions it attempts to answer are as follows: \n\n How and why did mankind invent the theatre?\nWhat is the theatre different from other performing arts?\nAre there some things common to drama in all cultures?\nWhat is a “good” play? What to look for in a play?\nWhat goes into the making of a play?\nWhy do some plays succeed? Why do others fail?\nHow do actors prepare for their profession?\nWhat is the place of English language drama in India?\n\nIf you have wondered about questions like these, you will enjoy taking part in the one-day workshop. \nThe workshop is open to anybody interested in knowing more about the Theatre arts.  It is not meant to be a course in acting or directing a play. It is open to participants of all ages above 16. Enrolment will be only through registration in advance. Admission is free, but the seats are limited. \nAll interested in the workshop are requested to register early. BIC reserves the right to finalise the list of participants. The registration form can be accessed here. \n  \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/understandning-theatre/",
    "keywords": "Theatre, Workshops",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-418.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "China through Another Prism",
    "startDate": "2024-04-16T18:30:00+05:30",
    "endDate": "2024-04-16T20:00:00+05:30",
    "description": "Discussions surrounding China and India’s relationship remain urgent and crucial due to their geopolitical significance, economic interdependence, and potential for conflict. As two of the world’s most populous nations and emerging global powers, their interactions shape regional stability and have far-reaching implications for international relations. With ongoing territorial disputes, trade tensions, and differing strategic interests, understanding and managing their relationship is vital for fostering cooperation, averting conflicts, and navigating the complexities of a rapidly changing world order. \nExploring themes from his book Beyond Binaries: The World of India and China based on his writings on India, China and their often-tumultuous relationship, Shastri Ramachandaran unravels a succinct history of how ties between the two Asian neighbours have evolved over the 15 years from 2008–2022 and the internal and bilateral compulsions that shaped them. The book makes the reader aware about the strategic thinking that went into each move and counter-move by the two nations that are often at odds with each other, as they are at present. It is an attempt to deepen understanding of the recent history of Sino-Indian relations and, as the title suggests, look at India-China relations without putting it in the category of good or bad. \nIn this session, author Shastri Ramachandran will be in conversation with Manoj Kewalramani taking the listener beyond the binaries in which perceptions of India and China, their relationship and their role on the world stage is trapped. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/china-through-another-prism/",
    "keywords": "History, International Relations, Politics",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-400.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Costs of Political Corruption",
    "startDate": "2024-04-14T11:30:00+05:30",
    "endDate": "2024-04-14T13:00:00+05:30",
    "description": "In the era of electoral bonds, the costs of political corruption demand scrutiny. Today’s corruption differs vastly from that of a decade or two ago, altering its associated consequences. \nThe captive coal block allocation scandal entrenched oligarchy by favoring select families, while in states like Punjab, corruption consolidates power within a single family, depriving the state of revenue. Presently, India witnesses a surge in a rent-sharing model, akin to a mafia state, where government support disproportionately benefits chosen firms. This breakdown in the citizen-party social contract prompts reporter M Rajshekhar to analyze its origins and effects. \nAbout Narayan Dutt:\nMr Narayan Dutt was a Hindi journalist. He retired as the Features Editor of PTI Hindi division. He was earlier Editor of Navaneet, a Hindi digest, for many years. He was highly regarded by his peers and received honours such as the Sri Ganesh Shanker Vidhyarthi Puraskar bestowed by the President of India, and an Honorary D. Lit by Makhanlal Chaturvedi Rashtriya Patrakarita evam Sanchar Vishwavidyalay, Bhopal. His date of birth is 17 February 1929. The last few speakers have included the journalist Mr P Sainath,  the film-maker Mr Girish Kasaravalli, the sociologist Prof Amita Baviskar of Asoka University and Prof Krishna Achuta Rao of the Department of Climate Change,IIT Delhi. \nThis event is in collaboration with Devagitam Charitable Trust (R), Mysuru & Abhijnana, Bengaluru: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-costs-of-political-corruption/",
    "keywords": "Books, Governance, Policy & Regulation, Politics, Society",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-419.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Arduous Pursuit of Dignity for All",
    "startDate": "2024-04-10T18:30:00+05:30",
    "endDate": "2024-04-10T20:00:00+05:30",
    "description": "This talk draws from Matthias Mahlmann’s recent critically acclaimed book, Mind and Rights: The history, law and psychology of Human Rights published in open access mode by Cambridge University Press in February 2023.  The talk critically examines the growth of the concept of human rights, its roots in history and current human rights theories. It scrutinizes in particular the myth of the Western origin of the idea of human rights by highlighting the many roots of human rights in different cultures, including within the Global South and indigenous cultures. \nA particular goal of the talk is to engage with the so-called cognitive revolution and to investigate the relationship between human cognition and human rights.  The talk will argue that insights gained from modern theories of the mind can deepen our understanding of the foundation of human rights. The talk also seeks to answer the question whether the current attacks on democracy can be countered through the use of human rights and its underlying political ethics of egalitarian dignity. Finally, the talk will contend that the pursuit of the human rights idea, with its achievements and tragic failures, is key to understanding what kind of beings humans are. Such self-knowledge is crucial in times in which the human species has put its own survival at risk. \nA conversation between the author, Matthias Mahlmann, and the discussant, Sudhir Krishnaswamy, will be followed by a moderated Q&A session with the audience. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-arduous-pursuit-of-dignity-for-all/",
    "keywords": "Books, Law, Policy & Regulation, Society",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-413.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Like the Date Palm",
    "startDate": "2024-04-28T18:30:00+05:30",
    "endDate": "2024-04-28T20:00:00+05:30",
    "description": "“Translation is a little like falling in love,” says Arvind Krishna Mehrotra. “It can be love at first sight, when you read a poet and have a desire to translate him immediately. Or he can come back to you decades later, your memory of him faded. When I started translating Rahim’s dohas, I had forgotten all about him, even who he was. It’s as if I’d never read him – though I had.” \nIn Search of Rahim is Mehrotra’s discovery of the man and his work through translation, history, and memory. In the process, he recovers parts of his own boyhood by going back to someone who died 400 years ago. \nThis evening has Mehrotra in conversation with Jeet Thayil. \nHeader Image: Akbar’s siege of “Brampore” (Burhanpur); from the last German edition of *Munster’s Cosmographia*, 1628 \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/like-the-date-palm/",
    "keywords": "Literature, Poetry",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-432.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Practicing Wildlife Conservation",
    "startDate": "2024-04-12T18:30:00+05:30",
    "endDate": "2024-04-12T20:00:00+05:30",
    "description": "This session will explore complexities that affect basic conservation actions essential to recover threatened wildlife species and their habitats in India. \nIt will cover the critical role of effective law enforcement to protect wildlife and habitats. Additionally, it will address the challenge of maintaining wildlife populations and habitats in as ‘natural’ a condition as possible relying on best wildlife science; mitigating human wildlife conflicts. It will also delve into the need to expand wildlife habitats in the context of increasing human aspirations that drive economic development and discuss some win-win solutions that benefit both people and wildlife, from the perspectives of governmental well as of non-governmental sectors. \nA talk by Ullas Karanth will be followed by a conversation with P J Dilip Kumar and P M Muthanna and a Q&A session with the audience. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/practicing-wildlife-conservation/",
    "keywords": "Environment, Masterclass, Wildlife",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-434.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "ನೀಲಿ ಪರದೆ | Neeli Paradé (Season 2)",
    "startDate": "2024-04-14T18:00:00+05:30",
    "endDate": "2024-04-14T20:30:00+05:30",
    "description": "Neeli Paradé is a showcase of short films made by Bahujan filmmakers under Neelavarana Media. It celebrates the lifestyle of Bahujans along with engaging with the filmmakers and discussion. This is the second edition of the screening initiative. \nNeelavarana is an Ambedkarite artists forum dedicated to promoting Bahujan artists in Kannada. They are a collective of filmmakers, writers, artists, actors, and musicians who aim to create a platform for the voices of the marginalised communities. \nThe filmmakers will engage in a conversation, moderated by writer Vinay Kumar, after the screening. \nAbout the Films: \nAddiction (11 minutes 38 seconds) \nPintu is a regular kid with regular hobbies and a regular fear of exams and parent-teacher meetings. One day, his father goes missing! He requests the help of his quirky friend, Rover the Dog, who knows the whole town and everyone in it very well. With his guidance, Pintu discovers some not-so-regular happenings in the town- nearly everyone seems to be consumed by something strange… \nWhere does Pintu find his father in the end? What led to his disappearance, and why? Watch this film toÂ discover how Pintu, Rover, and their friends try to make sense of stuff that isÂ regular and not so regular.CommissionedÂ in 2023 by Hasiru Dala, this is a short stop-motion shadow puppet animation film that explores the issues of addiction in the community, as experienced and shared by the children. The film was created after a series of workshops with children from the Jyothipura Buguri Library Community, where they articulated concerns, questions, and insights into different kinds of addictions- from mobile phones, to work and money, substances, and even comic books! \nHasiru Dala is an organization that works with sanitation workers in and around Bangalore city. \nCast & Crew: \nCast: Darshini Priya, Likith V, Valarmadhi, Shakthi A, Yogesh A, Akshay Gowtham, Sathwik NN, Lathasha, Bharath Raj \nFilming, Recording and Editing: Vishnu Nambiar \nMusic: Poorvi Kalyani \nGuidance: Pallavi Chander \n  \nK.G.B (Kadamba Geleyara Balaga) (29 minutes) \nHigh stakes for theÂ KadambaÂ Geleyara Balaga (aka the Ganesha club) this year! Three 20-year-olds must woo a local Insta influencer, defy wealthy colony boys, and rally the neighborhood elders for funds to set up Bullet Ganesha. But their true challenge? Navigating the strains on their friendship. \nCast & Crew: \nCast: Surya Saathi, Anush KMS, Likhith Raj Arasu, Disha Shetty, Lavanya Krishna \nCinematographer: Sameer Deshpande \nEditor: Amar Nath \nSound: Sam Keuper \nMusic: Ajith KP \nExecutive Producer: Sharath Bhagavan \nProducer: Suneel R (Talents’ day films) \nKuuk Aah? (29 minutes 10 seconds) \nWhile cooking, Anjali realizes that they have run out of salt. She asks Adarsh to fetch a packet of salt. Adarsh is the husband of Anjali. Anjali is the wife of Adarsh. \nCast & Crew: \nCast: Aashith, Shradha Raj, Naveen Tejaswi, Ajay Tambe, Meghana D, Goutham R, Brunda Prasad \nCo-creators: Purushottam Ranoji, Vinay Kumar J \nDubbing: Ajith KP \nPoster Design: Sudarshan Devadoss \n  \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%a8%e0%b3%80%e0%b2%b2%e0%b2%bf-%e0%b2%aa%e0%b2%b0%e0%b2%a6%e0%b3%86-neeli-parade-season-2/",
    "keywords": "Film",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-429.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Rise and Fall of the Vanderbilts",
    "startDate": "2024-06-11T18:30:00+05:30",
    "endDate": "2024-06-11T20:00:00+05:30",
    "description": "Once upon a time, there was a family whose very name connoted wealth. The Vanderbilts had a vast empire built on freight through steamboats and railroads. Over a few generations, the wealth-worth billions in today’s money-had been frittered away and the business itself faded as new options came up in the freight business. Their story remains an enduring example of what happens when business leaders fail to embrace the future and transform. \nBusiness transformation is a dynamic topic that is explored by authors R Gopalakrishnan and Hrishi Bhattacharyya in their book Embrace the Future. A key lesson in the success or failure of such transformations lies in harmonising the art and science of change – the emotional and the rational – and striking the right balance between them. Both in life and in business, a compelling narrative that inspires the organisation is essential for effecting transformation. Equally important is viewing transformation as an ongoing effort integrated into the work culture, rather than solely reacting to crises. \nTheir book resonates with anyone who has encountered change—something prevalent in today’s ever-evolving business landscape. R Gopalakrishnan and Hrishi Bhattacharyya underscore that companies unwilling to adapt are bound to fade away. The authors will share their insight on how it’s imperative to draw lessons from the past, navigate the present, and prepare for the future. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-rise-and-fall-of-the-vanderbilts/",
    "keywords": "Books, Business, Nonfiction",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-428.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Towards Digital Film Societies",
    "startDate": "2024-04-27T18:30:00+05:30",
    "endDate": "2024-04-27T20:00:00+05:30",
    "description": "Two years of Covid witnessed the world going digital in a big way. The analogue era’s cultural movements like film societies too underwent major changes. Many used digital platforms to see and discuss films in their quest towards building a better film culture. \nAfter starting as the only forum for savouring world film classics in 1940s Mumbai, today the film society movement is finding itself in the midst of a complete digital makeover after two decades of struggling with digital formats from VHS tapes to OTT. Will these changes help them achieve their original goal of developing a group of film connoisseurs and professionals who will carry on the mantle of meaningful films? To know the future one needs to understand the history and its dynamics in full measure. \nBased on the book Celluloid to Digital: India’s Film Society Movement by V K Cherian, this session will examine the future course of the Indian film society movement, which nourished the ‘New Wave’ in Indian films from 1970 and has been an anchor for all the meaningful films in the country. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/towards-digital-film-societies/",
    "keywords": "Film, History, Media",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-431.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Ocean Connection",
    "startDate": "2024-04-22T18:30:00+05:30",
    "endDate": "2024-04-22T20:00:00+05:30",
    "description": "35 mins | Kannada, English with English Subtitles | India \nHonavar, a coastal town mostly famous for pre-wedding shoots and great scenic routes, a community full of men and women connected to fishing, have been coming together to save the nesting grounds of the Schedule one species Olive Ridley Sea Turtles. The privatisation plans for the beach would lead to the nesting grounds being ruined thus the death of the next generation of sea turtles in the region. This is a heartwarming story of how humans bond with nature and also come together to protect it. \nIn 2010, the Karnataka government identified a site for a proposed port on an estuary of the Sharavathi River in the town of Honnavar in Uttara Kannada district. Since then, local residents of villages such as Tonka 1 and 2, which are located on this sandspit of land known as Kasarkod have been protesting against the construction of the proposed port. Fisherfolk inhabit these picturesque seaside villages whose beaches are also a crucial Olive Ridley turtle nesting site. The residents and environmentalists state that the port would destroy this crucial turtle nesting site in coastal Karnataka. The annual nesting patterns of the Olive Ridley turtles are closely followed by the local fishing community and a pooja is also conducted when the hatchlings head to the sea. \nLocals also contend that the port would destroy their livelihood as it would have an impact on fishing. As it is, the dry fishing industry which used the land now taken over by the port authorities, has already stopped functioning. Another concern cited by environmentalists is that the estuary is situated on an unstable piece of land that is prone to erosion which would make it unusable for a port. Activists also claim that the building of a port would also mean the laying of a four-lane road that passes through these villages which are a breach of Coastal Regulation Zone norms. The fisherfolk’s opposition to the port has also led to instances over the past few years when protestors have been arrested by the district authorities. While their protests so far have not been successful, villagers have vowed to continue their battle till all the legal routes have been exhausted. \nThe screening of the documentary will be followed by a panel discussion with the filmmaker, Vikas Badiger, Sandeep Hegde of the Honavar Foundation and fisherman, Rajesh Govind Tandel, moderated by journalist, Vikhar Ahmad. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-ocean-connection/",
    "keywords": "Environment, Film, Sustainability, Wildlife",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-436.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Gods Who Come Down from Heaven",
    "startDate": "2024-04-17T18:30:00+05:30",
    "endDate": "2024-04-17T20:00:00+05:30",
    "description": "In this illustrated lecture, Pepita Seth presents her decades of work on Theyyams published in her recent book, In God’s Mirror: The Theyyams of Malabar. The word ‘Theyyam’ is a corruption of ‘daiva’, meaning, quite simply, God. Theyyam is an act of worship that brings the deities down from heaven to be among their devotees. The practitioners of Theyyam perform specific rituals and dance to express their joy at seeing their devotees, while the last stages of their manifestation involve them in blessing, healing, exorcising, answering questions and maintaining the link between humanity and the divine. While the process is an internal one that obliterates the practitioner’s human persona, on an external level his face is transformed by intricate make-up and his body fantastically costumed. There are Theyyams for Gods and Goddesses, warrior heroes, wronged women, ghosts, spirits, tigers, snakes and even a crocodile; there are also a few Muslim Theyyams (performed by Hindus). A Theyyakkaran must be able to sing, dance, play the chenda, bless, exorcise and be proficient in kalaripayattu, Kerala’s martial art form since it is used in the rituals of the warrior heroes. Pepita Seth’s decades-long association with Theyyam’s practitioners gave her unprecedented access to their unique culture. In God’s Mirror: The Theyyams of Malabar is the culmination, in her words and photographs, of her commitment to this extraordinary subject. \nPepita Seth writes: “In God’s Mirror is the outcome of Theyyam’s practitioners suggesting I do a book about them. This was in order to establish that Theyyam is a ritual act during which devotees seek the blessings, and even the help, of the elaborately costumed deities. This was to dispense with the outside world always referring to Theyyam as a dance or a performance when in fact it is a sacred ritual in which men belonging to certain families have the ‘right’ to ‘carry’ a deity. Their only condition was that I stayed with them in order to know and understand their lives, respect their multiple skills and realise what was important to them.”  \n“Although I was born in the UK and trained as a film editor, it was the chance discovery of my soldier great-grandfather’s diary documenting his regiment’s 1857 march from Calcutta to Lucknow that took me to India. Yet despite going there in 1970 to retrace their long march, I finally found another India in Kerala. And it was there that I eventually settled and began photographing and writing about the region’s unique culture.” \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-gods-who-come-down-from-heaven/",
    "keywords": "Culture*, Faith, Heritage, History, Photography",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-100.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Dvijottama",
    "startDate": "2024-04-18T19:00:00+05:30",
    "endDate": "2024-04-18T20:15:00+05:30",
    "description": "\nDvijottama is the narrative of one of the greatest warriors of the Bharatha war – Drona. A man born to educate also finds the need to fight. What starts as a fight for survival ends for him on the battlefield of Kurukshetra, losing everything he holds dear. His scruples, his values, and the love of his disciples. The play illustrates the conflict of choice each one of us faces in the battle for survival, the choice of selecting the right action.\n\nThe play is a solo performance with an accomplished classical singer and a Bharatanatyam dancer. \nDvijottama premiered as Dvija at The Hindu Theatre Festival 2019 in Chennai, and travelled to Bangalore to Swastika School of Dance and Music and was staged at the Sunday to Sunday Natarani Theatre Festival 2019 in Ahmedabad. Most recently it was performed as part of Kutty Kutcheri organised by Lasya Narasimhachari. \nIn collaboration with: \n \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/dvijottama/",
    "keywords": "History, Mythology, Performing Arts, Theatre",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-420.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Suflet",
    "startDate": "2024-04-11T19:00:00+05:30",
    "endDate": "2024-04-11T20:00:00+05:30",
    "description": "The project “SUFLET – Soundscapes from the Carpathians and the Himalayas” is an international music collaboration which aims to create a cultural bridge between Romania and India. Through the confluence of traditional wind instruments panflute and bansuri, with the accompaniment of tabla and keyboard, the artists present modern reinterpretations of Romanian folklore masterpieces as well as new compositions which bring together Romanian and Indian music. \nThe concert illustrates the beauty and musical diversity of the two cultures, from doina to dhun, from hora to hori, from sârba to raga, inviting the audience on a fascinating sound journey across two continents. “Suflet” refers to both “breath” and “soul”. Combining their creativity, the four musicians create an exceptional music which speaks to the heart and transcends all boundaries. \nIn collaboration with:\n         \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/suflet/",
    "keywords": "Music, Performing Arts",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-415.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Ranji Triumph",
    "startDate": "2024-04-09T18:30:00+05:30",
    "endDate": "2024-04-09T20:00:00+05:30",
    "description": "Led by the great off spinner Erapalli Prasanna, the newly-renamed Karnataka state first won the Ranji Trophy in 1973-74. They ended Mumbai’s 15-year reign and then beat Rajasthan in the final. It began a redistribution of power in Indian cricket. Soon six Karnataka players from that final were in a touring Indian squad. \nHere, discussing the event are Ramachandra Guha, Suresh Menon and Sharda Ugra with Prasanna and the baby of that victorious team, Sanjay Desai. They recall the event, its impact on Indian cricket and the many stories behind the story. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/ranji-triumph/",
    "keywords": "Sports",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-412.jpg"
  }
]