[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67272-1733673600-1733684400@bangaloreinternationalcentre.org",
    "name": "Kattam Katti",
    "startDate": "2024-12-08T16:00:00+05:30",
    "endDate": "2024-12-08T19:00:00+05:30",
    "description": "Kattam Katti transports you to Uttarayan, the world-famous kite festival in Gujurat, North India, where millions of people from different cities, religions, and social classes come together to fly kites, marking the transition from winter into spring.  \nTapping into the competitive chaos, creativity, and colour of the event, the show brings to life the excitement of Uttarayan with lyricism, drama, and exquisite technique. It illustrates the highs and lows, loves and losses of the lives that are lived out among the festivities. Kite flying becomes a metaphor for the injustice of unevenly distributed privilege, in both the corporate world and society more generally.  \nChoreography: Urja Desai Thakore\nSet Design: Simon Daw\nLighting Design: Hector Murray\nDramaturgy: Lou Cope\nCostume Design: Urja Desai Thakore, Simon Daw, and Abha Desai Original Creative Producer: Nina Head\nCreative Producer: Lia Prentaki\nProduction Manager: Salvatore Scollo\nStage Manager: Ben Gray\nSound Engineer: Camilo Tirado\nLighting Technician: Chris Burr  \nSpecial thanks to Alap Desai, Chitra Sundaram, Michael Hulls, Parbati Chaudhry, Madhusoodanan Satchithannandan , Nina Head, and Eva Martinez  \nCommissioned by Sadler’s Wells Theatre, London. Funded by Arts Council England and Milton Keynes Council, with partners MK Gallery, Creative Folkestone, University of Bedfordshire, Akademi, SouthEast Dance, SAA Arts UK and GemArts. \n",
    "url": "https://bangaloreinternationalcentre.org/event/kattam-katti/",
    "keywords": [
      "Dance",
      "Performing Arts",
      "Pravaha"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-671.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67359-1733569200-1734292800@bangaloreinternationalcentre.org",
    "name": "Eeksaurus Revealed: Behind the Animated Curtain",
    "startDate": "2024-12-07T11:00:00+05:30",
    "endDate": "2024-12-15T20:00:00+05:30",
    "description": "The first-ever exhibition of Studio Eeksaurus’s celebrated films and the creative process behind them! \nEstablished in 2009 by Suresh and Nilima Eriyat, Studio Eeksaurus is an internationally celebrated film production house based in Mumbai. Renowned for its design-driven approach with multi-disciplinary expertise and ground breaking animation, the studio boasts an astonishing array of global accolades, including Annecy, D&AD, Clio, Cannes Lions, and National Film Awards. \nThis week, Studio Eeksaurus presents its first-ever retrospective in India at the Bangalore International Centre. The exhibition features seven iconic films, including Fisherwoman and TukTuk, winner of the studio’s first National Award in 2015; the acclaimed clay animation film Tokri (2017 National Award); and Kandittund!, recipient of the Best Animation Film at the 69th National Awards last year. \nVisitors can enjoy exclusive curated walkthroughs and workshops led by the visionary storyteller Suresh Eriyat and his talented team. Don’t miss this unique opportunity to explore the artistry and innovation of India’s most celebrated animation studio. \nTeam\nSuresh Eriyat, Founder and Creative Director, Studio Eeksaurus\nNilima Eriyat, Founder and Executive Producer, Studio Eeksaurus\nOriole Henry, Exhibition Designer\nSusmita Mohanty + Siddharth Das, Founders + Curators, MAD Salon+Lab\nIn-house design team – Nijin Nazeem, Adithi Krishandas, Aman Gupta, Nishant Nandgaonkar, Shania Brenda Simons, Harsh Bhati\nLogistics and support – Satish Gautam, Kalpesh Palkar \nIn collaboration with: \n        \n",
    "url": "https://bangaloreinternationalcentre.org/event/eeksaurus-revealed-behind-the-animated-curtain/",
    "keywords": [
      "Pravaha",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-674.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "67300-1733943600-1733947200@bangaloreinternationalcentre.org",
    "name": "Dante Beyond Borders",
    "startDate": "2024-12-11T19:00:00+05:30",
    "endDate": "2024-12-11T20:00:00+05:30",
    "description": "Dante Beyond Borders is an Italian Indian co-production born from the collaboration between Instabili Vaganti and Ahum Trust and inspired by the Divine Comedy of the great Italian Poet Dante Alighieri, on the occasion of his 700 years death’s anniversary. \nThe performance explores different artistic languages: experimental theatre, dance, cinema, video art and electronic music in order to bring the spectator into the otherworldly journey made by Dante. The sounds of Dante’s ancient Italian language meet the mudras and gestures of  the traditional Bharatanatyam dance, accompanied by the contemporary electronic soundscapes originally composed by the Oscar winning Italian musician Riccardo Nanni, around the leading suggestion of the Absence, an element that permeates Dante’s works. \nThe evocative physical actions of the performer Nicola Pianzola and the dance of Anuradha Venkataraman interact with the videos realised by the artists of the project through a remote collaboration developed during the lockdown. \nThe performance aims to explore the  numerous connections between Dante’s work and Indian culture, both from an iconographic, philosophical and theological point of view. \nDirection: Anna Dora Dorno\nDramaturgy: Anna Dora Dorno, Nicola Pianzola\nPerformers: Nicola Pianzola, Anuradha Venkataraman\nChoreography: Anuradha Venkataraman, Nicola Pianzola\nPerformance in video, original songs and voice over: Anna Dora Dorno, Nicola Pianzola, Anuradha Venkataraman\nOriginal music and sound design: Riccardo Nanni\nVideo creation: Anna Dora Dorno, Nicola Pianzola, Ashwin Iyer\nSet and Light design: Anna Dora Dorno\nProduction: Istituto Italiano di cultura in Mumbai, Instabili Vaganti, Ahum Trust\nSupporters: MIC Ministry of culture / Istituto Italiano di cultura in New Delhi \nIn collaboration with: \n      \n",
    "url": "https://bangaloreinternationalcentre.org/event/dante-beyond-borders/",
    "keywords": [
      "Dance",
      "Literature",
      "Performing Arts",
      "Pravaha",
      "Theatre",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Dante Beyond Borders"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-666.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "67441-1733769000-1733776200@bangaloreinternationalcentre.org",
    "name": "Inclusive Art",
    "startDate": "2024-12-09T18:30:00+05:30",
    "endDate": "2024-12-09T20:30:00+05:30",
    "description": "In this interactive and participatory talk by Alice Fox and Dr Hannah Macpherson, participants will be introduced to the underpinning ideals and philosophies of Inclusive Art, including the relational components to inclusive work, the philosophy of coming into being and the crucial emphasis on collaboration and creative listening. \nThe session will then then address critics of such participatory practice and show how in art there is more than hope (or sweet dreams!), there are proven benefits (for culture, health and life). \nThe speakers suggest avoiding leaning into overly narrow identity-based work and instead embracing our commonalities—including all our diversity—through Inclusive Arts. This requires nuance. Reflecting on some of the journeys they have taken with the practice of Inclusive Arts in Asia, they will show how collaborative practices, first developed alongside neurodiverse people and people with learning disabilities, have become relevant to collaborating with a wide range of people. \nThe talk will then seek to answer the following provocations using some practical participatory activities: \n\nHow do we travel at the speed of trust using forms of Inclusive Arts practice?\nWhat’s next for Inclusive Art? How might we ‘come into being’ inclusively with each other, our art materials and the environment?\n\nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/inclusive-art/",
    "keywords": [
      "Society",
      "Visual Arts",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-36.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67374-1733569200-1733574600@bangaloreinternationalcentre.org",
    "name": "Stories Around Us, Storytelling Within Us",
    "startDate": "2024-12-07T11:00:00+05:30",
    "endDate": "2024-12-07T12:30:00+05:30",
    "description": "An hour with the master storyteller, featuring a showcase of films and visual narratives! \nWorld renowned animation film maker-director Suresh Eriyat, is the founder of Mumbai based film production house Studio Eeksaurus. A recipient of numerous international awards, Eriyat is a storyteller extraordinaire. In 2015, his film, Fateline, bagged the prestigious Annecy Cristal Award at the Annecy International Animated Film Festival, considered the Oscars for animators, the only one for India till date. \nIn his talk, Eriyat will share his storytelling magic. He will share snippets from his film repertoire, distil and discuss his five-step process – Listen/ Observe/ Record/ Mash-up/ Share! A Q&A with the audience will follow. \nIn collaboration with: \n         \n",
    "url": "https://bangaloreinternationalcentre.org/event/stories-around-us-storytelling-within-us/",
    "keywords": [
      "Pravaha",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-670.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65954-1732905000-1732910400@bangaloreinternationalcentre.org",
    "name": "Running Across the Sahara",
    "startDate": "2024-11-29T18:30:00+05:30",
    "endDate": "2024-11-29T20:00:00+05:30",
    "description": "A 4th generation Indian Army Officer, an Extreme Endurance Athlete and an Ironman Triathlete, Col. Jangvir Lamba had to give up bodybuilding when he was diagnosed with bulging and herniated discs in his spinal cord in 2021. \nWhile most, may have given up after such an injury, Col Lamba trained himself to super fitness against all odds and participated in extreme endurance events at the international level. \nIn April 2024 he entered the Marathon Des Sables . Considered to be the toughest footrace on the planet, Marathon Des Sables is held in the Sahara Desert in Morocco in scorching temperature of over 50 degrees centigrade. With limited quantity of water every day and an open tent to sleep in – runners carry their own gear, sleeping bags, food, medical kit for the entire race, carrying a load of almost 14-15 kgs while running across the Sahara sands. \nIn this session, Col. Jangvir Lamba will share his story of overcoming a serious injury, fighting against all odds and completing some of the most extreme endurance events in the world. He will be in conversation with marathon runner, Sunil Chainani. A Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/running-across-the-sahara/",
    "keywords": [
      "Health & Wellness",
      "Sports"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-654.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67313-1734030000-1734033600@bangaloreinternationalcentre.org",
    "name": "That’s All Folks!",
    "startDate": "2024-12-12T19:00:00+05:30",
    "endDate": "2024-12-12T20:00:00+05:30",
    "description": "*This work contains scenes that explore mature themes. Viewer discretion is advised.* \nThe irreverent That’s All Folks!, premiered at the Equilibrio Festival 2024 and draws inspiration from cartoons. In a minimalist set, a quartet of international performers—Damiano Ottavio Bigi, Ching-Ying Chien, Issue Park, and Faith Prendergast—explore a work that blends dance, science, and myth. Inspired by the concept of the ‘event horizon,’ it delves into physical vertigo, the fall, and being drawn into a space where perspective shifts and everything changes depending on where we look. \nThis project continues the themes of Un Discreto Protagonista, expanding the conversation on choreographic writing and artistic composition. While the previous work focused on the universe’s origins and astronomical processes, this piece shifts to humanity’s relationship with the cosmos. \nWorking with a quartet of dancers, the team explored two distinct paths. The first centers on a “purely physical narrative,” using complex movement patterns to create a thematic structure that unfolds gradually. This investigation draws on ritual forms connected to founding myths and cosmology, balancing irrationality with control and chaos with logic to explore interconnected spatial and dimensional relationships. \nThe second path constructs four characters suspended in an undefined space—a non-time and non-place—where they encounter their unconscious and archetypal memories. Inspired by the event horizon concept, the characters search for a new beginning, questioning whether our world could have emerged from a previous universe, in a moment called “the bounce,” when space and time dissolved into a cloud of probabilities. \nThrough this journey, they question the nature of time, motion, and instability in a place where there is no fixed perspective. Our vulnerabilities and strengths are mixed as we teeter on the edge, learning more about ourselves. \nCreated by Damiano Ottavio Bigi & Alessandra Paoletti\nPerformers: Damiano Ottavio Bigi, Ching-Ying Chien, Issue Park, Faith Prendergast\nComposition and Sound Design: David Blouin\nMusic: David Blouin, Colin Stetson / Sarah Neufeld Duo, Gary ‘Oslide, Henry Purcell, Hank Williams\nLighting Design: Lucien Laborderie\nSet and Costumes: In collaboration with Tzela Christopoulou\nSet Construction: Marios Karaolis \nIn collaboration with: \n        \n",
    "url": "https://bangaloreinternationalcentre.org/event/thats-all-folks/",
    "keywords": [
      "Dance",
      "Philosophy",
      "Pravaha"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-676.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "66898-1734028200-1734033600@bangaloreinternationalcentre.org",
    "name": "Universal Food Security",
    "startDate": "2024-12-12T18:30:00+05:30",
    "endDate": "2024-12-12T20:00:00+05:30",
    "description": "Imagine a world without hunger and malnutrition. What would it take to achieve a genuinely food-secure world—where every person gets to consume the right quantity and quality of food to live a healthy, active, and productive life? \nAchieving and sustaining such a future requires transforming how our food is grown, managed, distributed, and consumed. From production to consumption, our food systems must be more sustainable, halting environmental degradation, and even repairing the damage we have previously done. \nGlenn Denning’s Universal Food Security: How to End Hunger While Protecting the Planet presents a bold, evidence-based, practical guide to food systems transformation. He bridges the divisive worlds of science, policy, and practice. By synthesizing the most relevant literature, consulting the world’s foremost experts, and sharing personal insights gained over four decades, Denning lays out five priority areas for action and investment. \nBut in Universal Food Security, Denning goes beyond what needs to change. He goes on to tackle the challenges of implementation. Echoing the words of his mentor, the late Professor MS Swaminathan, Denning argues that we need the knowhow and the do-how to transform our food systems.  \nUniversal Food Security calls for a new generation of enlightened practitioner-leaders—acting on their own and with others, through institutions—to achieve a food-secure world. \nImage Captions:\nThumbnail, Poster and Header: Rice crops in Cambodia\nInstastory: Maize crops in Malawi \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/universal-food-security/",
    "keywords": [
      "Agriculture",
      "Food",
      "Policy & Regulation",
      "Science",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-663.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67412-1734202800-1734208200@bangaloreinternationalcentre.org",
    "name": "Palem",
    "startDate": "2024-12-14T19:00:00+05:30",
    "endDate": "2024-12-14T20:30:00+05:30",
    "description": "Immerse yourself in a mesmerizing showcase of traditional and contemporary performances, blending the vibrancy of live music and the charm of recorded melodies by Sangeet Natak Akademi Award winning Latasana Devi & Group. \nProgramme \nRaagmacha: A powerful opening act featuring two drummers setting the stage alive with pulsating rhythms. \nBasant Ras: A vibrant group performance set to recorded music, celebrating the joyous spirit of spring. \nThang Ta (Sword & Spear Dance): Witness the martial prowess of a group performing this traditional Manipuri art form, accompanied by live music. \nPung Cholom (Drum Dance): A captivating group performance blending acrobatics, rhythm, and live drumming. \nDevi Stuti: A soulful solo offering, paying homage to the divine feminine, set to recorded music. \nMarakata: A group performance portraying vibrant themes through intricate movements, supported by recorded music. \nCheitak Jagoi (Stick Dance): A lively solo act, showcasing the energy and agility of Manipuri tradition with live musical accompaniment. \nAbhisarika Nayika: A solo depiction of the classical archetype, capturing the emotions of a heroine awaiting her beloved, performed to recorded music. \nDhol Cholom: A group presentation of the traditional drum dance, exuding synchronized energy and live beats. \nPalem: Closing the evening with a dynamic group performance, telling stories through expressive movements and recorded music. \nIn collaboration with: \n      \n",
    "url": "https://bangaloreinternationalcentre.org/event/palem/",
    "keywords": [
      "Dance",
      "Pravaha"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-677.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67264-1733598000-1733603400@bangaloreinternationalcentre.org",
    "name": "Abhipsaa — A Seeking",
    "startDate": "2024-12-07T19:00:00+05:30",
    "endDate": "2024-12-07T20:30:00+05:30",
    "description": "Abhipsaa — A Seeking charts a journey of discovery in physical, emotional, and spiritual realms. \nIn four choreographic works, Bihayini Satpathy expands the parameters of the formal and representational norms of the Odissi tradition through both narrative and non-narrative dances – reimagining classical Odissi forms through a personalised interpretation. \nCommissioned by Duke University and the Baryshnikov Arts Center, Abhipsaa — A Seeking, takes the audience on a profoundly personal journey. In collaboration with musicians, composers, lighting and theatrical designers, Satpathy’s performance is an otherworldly and transformative experience. A selection of the piece was presented virtually by the Baryshnikov Arts Center with introduction by Mikhail Baryshnikov and Mark Morris in February 2021 and the full piece had its world premiere performances at Duke University in December 2021. \nThis work was made possible with additional funding from the New England Foundation for the Arts’ National Dance Project, with lead funding from the Doris Duke Foundation and the Andrew W. Mellon Foundation. \n",
    "url": "https://bangaloreinternationalcentre.org/event/abhipsaa-a-seeking/",
    "keywords": [
      "Dance",
      "Performing Arts",
      "Pravaha"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-665.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "66624-1733074200-1733086800@bangaloreinternationalcentre.org",
    "name": "Carols in the City",
    "startDate": "2024-12-01T17:30:00+05:30",
    "endDate": "2024-12-01T21:00:00+05:30",
    "description": "Come start Christmas with The Bangalore Men & Cappella Bangalore, two of the finest choirs in the country, as they present Carols in the City, a traditional Christmas concert with some twists, that will surely put you in a festive mood! \nRocking jingle bells, puddings and figs, snow and prancing – all of the ingredients to make dark December turn into sparkling Christmas. \n\n\nFeaturing: Cappella Bangalore, The Bangalore Men, Rebecca Thomas Colaco on the piano & several soloists, with conductor Jonas Olsson. \n\n\nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/carols-in-the-city-4/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Carols in the City"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-32.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "66471-1732993200-1732999500@bangaloreinternationalcentre.org",
    "name": "Dastan-e-Akhtari",
    "startDate": "2024-11-30T19:00:00+05:30",
    "endDate": "2024-11-30T20:45:00+05:30",
    "description": "\nLanguage: Hindustani (Hindi-Urdu Mix) \nAkhtari Bai Faizabadi, also known as Begum Akhtar was a unique singer of her time. In her unique voice and andaz, she produced such hauntingly sweet notes, coupled with her spontaneity, that the audience were immediately captivated. Beginning at the age of Seven, Begum Akhtar kept her audience spellbound for almost six decades. \nThis was  Begum Akhtar, the Singer; but her personal journey is equally captivating and inspiring. She was a brave, fiercely independent-minded person, who drew her life path herself amidst the struggles that life threw at her. At a time when the social and political landscape of the country was gradually changing, she set her own standards of life and arts, not withstanding the constraints of times and emerged as a stronger person and better singer by living upto those standards. \nWith all its highs and lows and awws and wows, Dastan-e-Akhtari is the story of the life of the legend of her time and beyond, Begum Akhtar. In this performance, the story of her life will be told by Kafeel Jafri – a Dastango (‘storyteller’ in Urdu), interspersed with rendition of her songs – Ghazals & Thumris by Yusra Naqvi, a trained Hindustani Classical Singer. \nSupported by: \n\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dastan-e-akhtari/",
    "keywords": [
      "Culture",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ur",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Dastan-e-Akhtari"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-31.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "66645-1732820400-1732824000@bangaloreinternationalcentre.org",
    "name": "2INDIAS",
    "startDate": "2024-11-28T19:00:00+05:30",
    "endDate": "2024-11-28T20:00:00+05:30",
    "description": "2 INDIAS is a music project blending two historical and diverse cultures from Spain and India – Western Classical and Hindustani Classical in a new avatar. \nPianist and Composer, Sahil Vasudeva, reimagines the works of legendary Spanish Composer, Isaac Albéniz with an Indian Classical Ensemble. He is accompanied by Suhel Saeed Khan on the sitar. Shanawaz Khan on the sarangi, Makrand Sanon on hybrid percussion and Akshay Dwivedi on the bass guitar. \nThe performance transcribes 150-year-old scores to Hindustani classical text to present an innovative and fresh interpretation of Spain’s Greatest Composer. \n2INDIAS has been developed by the Embassy of Spain in India, produced by Meta Arts and presented by range of cultural partners from across the country. \nIn collaboration with: \n      \nSupported by: \n      \n",
    "url": "https://bangaloreinternationalcentre.org/event/2indias/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "2INDIAS"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-662.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "67214-1732924800-1734307199@bangaloreinternationalcentre.org",
    "name": "BIC @ BLR Hubba",
    "startDate": "2024-11-30T05:30:00+05:30",
    "endDate": "2024-12-16T05:30:00+05:30",
    "description": "This winter, experience a 16-day celebration of Bengaluru’s vibrant cultural landscape as BLR Hubba returns from November 30 to December 15, 2024. The festival transforms the city into a living canvas, bringing together diverse expressions of performing and visual arts, literature, theatre, science, music, technology, and design. \nTrue to our BIC ELSEWHERE initiative, this year’s festival extends beyond traditional venues to bring arts and culture directly to the heart of our communities. Through strategic partnerships with venues across Bengaluru, we’re creating accessible cultural spaces that invite diverse audiences to engage with the arts in their own neighborhoods. \nFrom intimate theatre performances in community spaces to large-scale art installations, from literary discussions to cutting-edge technology showcases, BLR Hubba 2024 celebrates the multifaceted spirit of Bengaluru. Join us as we turn the city’s community spaces into vibrant hubs of cultural exchange and creative expression. \nDetails to the events can be found here. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/bic-blr-hubba/",
    "keywords": [
      "Bangalore",
      "Culture",
      "Dance",
      "Heritage",
      "Music",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "BIC @ BLR Hubba"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-667.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "67287-1733857200-1733862600@bangaloreinternationalcentre.org",
    "name": "Axiom Of Choice",
    "startDate": "2024-12-10T19:00:00+05:30",
    "endDate": "2024-12-10T20:30:00+05:30",
    "description": "An exploration of free will, war and mathematics; from the Simonyi Professor for the Public Understanding of Science at Oxford University, comes a ground-breaking new play The Axiom of Choice. \nEminent mathematician Andre Weil is on a journey from France to India, Finland and beyond, to discover whether we really have free will or if all our choices are predetermined. Expect mathematics, movement but most of all the true story of how one man dodged death on more than one occasion. \nImprisoned in Rouen during the Second World War, Weil faces a choice that will determine his fate – but his decision just doesn’t make sense. Is life a mathematical theorem of logical strands? Because sometimes it just doesn’t add up. This is Marcus’ second work to be performed in India, following I is a Strange Loop. Most recently he has published his seventh book – Around the World in 80 Games, which has just been released in paperback. \nThis production of The Axiom of Choice has been generously supported by Ben Delo, also supported by Dangor Education, Stage One Bursary Scheme for New Producers & Charles and Lisa Simonyi Fund for Arts and Sciences. \nWritten & Co-directed by Marcus du Sautoy\nCo-Directed by Lu Descourtier\nDesigned by Bronwen Herdman\nLighting Design by Rachel Samply\nMovement Direction by Shane Shambhu\nProduced by Claire Gilbert Ltd\nSupported By Ben Delo, Dangor Education, stage One Bursary Scheme for New Producers & Charles and Lisa Simonyi Funds for Arts and Sciences.\nIndia Tour Partner: Literature Live! The Mumbai Litfest\nIndia Tour Presented By: QTP Entertainment Pvt Ltd\nExecutive Producer for QTP: Jinal Shah\nQTP Company Stage Manager: Nirlek Dhulla\nLight Operation: Adi Shastri \nIn collaboration with: \n         \n",
    "url": "https://bangaloreinternationalcentre.org/event/axiom-of-choice/",
    "keywords": [
      "Performing Arts",
      "Pravaha",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Axiom Of Choice"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-673.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "67098-1734894000-1734899400@bangaloreinternationalcentre.org",
    "name": "Our Eternal Musical Tale",
    "startDate": "2024-12-22T19:00:00+05:30",
    "endDate": "2024-12-22T20:30:00+05:30",
    "description": "\nAny musical piece has the power to teleport us to a certain moment or phase from our lifetimes. From being ecstatic to being in despair, from being confused to being determined, these musical pieces have the ability to take us through all those moments and phases from our lives instantly. \nThrough this concert, each person in the audience revisits the countless emotions they once experienced in their lifetimes through the life story of the fictional character named ‘Rachanachar’. The epic journey that this hero went through in his lifetime, and all the challenges he faced and conquered, will be revisited through all original instrumental compositions. \nEach instrumental composition takes us through a certain point in the hero’s life journey and his mindset during that phase. The inter-reflective storyline lets us step inside the shoes of Rachanachar, making us the hero of this eternal musical tale. \nSupported by: \n\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/our-eternal-musical-tale/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Our Eternal Musical Tale"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-668.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "67336-1734116400-1734121800@bangaloreinternationalcentre.org",
    "name": "The Rite of Strings",
    "startDate": "2024-12-13T19:00:00+05:30",
    "endDate": "2024-12-13T20:30:00+05:30",
    "description": "This unique Indian Classical performance featuring a double neck guitar, tabla and kanjeera, bridges tradition and innovation creating a spellbinding tapestry of rhythm and melody. \nThe double-neck guitar, blending the versatility of modern string instruments with the evocative tones of Indian ragas, takes center stage. Its rich, resonant sound captures the nuances of classical compositions. Complementing this melodic brilliance is the tabla, whose intricate rhythms breathe life into every beat. With its dynamic range and precision, the tabla sets a pulsating foundation that elevates the musical experience. Adding a distinctive flavor to this trio is the kanjira, a small but powerful frame drum renowned for its versatility. Its sharp, expressive tones seamlessly blend with the other instruments, enriching the rhythmic dialogue with bursts of spontaneity and virtuosity. \nTogether, Anupam, Amit and Swami embark on a journey through soulful ragas, energetic talas, and spellbinding improvisations. This concert promises to captivate both connoisseurs of classical music and new listeners, celebrating the timeless beauty of Indian traditions through an innovative musical lens. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-rite-of-strings/",
    "keywords": [
      "Music",
      "Performing Arts",
      "Pravaha"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Rite of Strings"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-675.jpg"
  }
]