[
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Wet Histories",
    "startDate": "2024-05-30T18:30:00+05:30",
    "endDate": "2024-05-30T19:45:00+05:30",
    "description": "Consisting of a complex of hazardous port-related industries and marginalised populations, Mumbai’s east coast was first produced as a site for furthering British imperial designs and later Indian nationalist ambitions. More recent government interventions seek to (re)value this industrial landscape through new infrastructure that prioritises marine logistics, real estate development and ecotourism.  \nBoth these imaginaries of the east coast are founded on capitalist projects of land reclamation that ‘forget’ its watery history. They also cast aside those who inhabit the coast differently, such as the indigenous fishing community of Kolis. Yet numerous fishing villages of the Kolis hug the city’s coast, revealing older, now forgotten, traditions of inhabitation based on ‘living amidst wetness’. \nThis talk foregrounds their stories to help recover worlds that relate to the movement, relations and knowledge mediated by water as opposed to land, pollution and propertied ownership. Dwelling in these wet stories might urge new dialogues and public action to address current environmental crises and reclaim other ways of being for Coast and City. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/wet-histories/",
    "keywords": "Cities, Climate Change, Development, Environment, Sustainability",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-478.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Bretton Woods at 80",
    "startDate": "2024-06-01T18:30:00+05:30",
    "endDate": "2024-06-01T20:00:00+05:30",
    "description": "Shortly after D-Day, John Maynard Keynes and his colleagues sailed to New York on a secret mission. Accompanying them was a small delegation from India. It included a future finance minister, RBI governor, and a director of Tata sons. Keynes and his co-passengers were headed to the United Nations Monetary Conference convened by President Roosevelt at Bretton Woods – a hill station in New Hampshire – in July 1944. \nAt that conference, forty-four countries including India pledged to reconstruct a war-ravaged world, sustain peace, and promote economic development. To do so, they created the International Monetary Fund and The World Bank. Although it was not fully independent, India played a critical role at the conference. It later became a founding member of both international financial institutions \nJoin us as we explore through rare photographs, oral histories and recently declassified documents the personalities and events involved in this important moment in world history. This talk by Vikram Raghavan will be followed by a Q&A session with the audience. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/bretton-woods-at-80/",
    "keywords": "Economics, History, Policy & Regulation",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-29.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "A Ballet Soirée",
    "startDate": "2024-06-25T19:00:00+05:30",
    "endDate": "2024-06-25T20:15:00+05:30",
    "description": "The National Youth Ballet company will present an evening of repertoire that is curated with excerpts from classical and modern ballets. Among the varied selection are pieces from timeless ballets like The Nutcracker, Paquita, La Bayadere, and Swan Lake. \nFrom the wintry escapade of the Waltz of the Snowflakes, the charm of the tambourine in La Esmeralda to the gripping Ankle Scarf Dance from La Bayadere, the pieces will be weaved together to transcend the audience into a land of ethereal artistry. The soirée aims to offer insights into the multifaceted realms of ballet while delving into its nuanced expression. \nIn collaboration with: \n \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/a-ballet-soiree/",
    "keywords": "Dance, Performing Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-486.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "ಸಂಸ್ಕಾರ | Samskara",
    "startDate": "2024-06-02T11:30:00+05:30",
    "endDate": "2024-06-02T13:15:00+05:30",
    "description": "1970 | 113 Minutes | Kannada with English Subtitles \nThe body of a renegade Brahmin awaits a funeral. The man in question flouted Brahmin caste regulations, attracting a cadre of youthful followers. However, the Brahmin elders of his village cannot decide whether to give him a traditional Brahmin cremation or treat him as an outcast. Until they decide, neither they nor their immediate families may eat. This film offers an intriguing glimpse into the lives and issues surrounding an orthodox community. \nCalling all cinephiles! BIC is thrilled to introduce B-Cinematic, an initiative dedicated to celebrating the most essential, impactful, and artistically significant cinematic works from across the state and the country. \nAt B-Cinematic, our mission is to curate and share those remarkable films that is a must-watch (or re-watch) experience for every passionate cinema lover. From groundbreaking classics to under-appreciated gems, our carefully curated selection will take you on an unparalleled (pun not intended) cinematic journey through the ages. \nThrough curated screenings, insightful discussions, and engaging analyses from distinguished cinematic voices, we aim to not only watch these films together but to truly appreciate their craftsmanship, cultural impact, and intellectual depth. Our vibrant community of film aficionados will collectively rediscover Indian cinema’s most stunning and enduring masterpieces. \nSo join us on this quest to experience the films that have defined and redefined the art form. Don’t miss out on crossing these essential works off your bucket list. Because to truly live, you must first watch the films that make life worth living. \nWe inaugurate our informal film club with Samskara (1970) \nSamskara is a critically acclaimed Kannada film directed by Prabha Khetan, released in 1970. It is based on the 1965 novel of the same name by U.R. Ananthamurthy. The film offers a thought-provoking exploration of traditional Brahmin society and its rigid customs. \nThe story revolves around a small Brahmin agrahara (village) that is thrown into turmoil after the death of Naranappa, a Brahmin man known for his defiance of caste rules and unorthodox lifestyle. His unconventional ways had earned him the wrath of the agrahara’s conservative leaders. \nAfter Naranappa’s death, the question arises whether he should be given the traditional Brahmin funeral rites or denied them due to his transgressions against caste norms. This dilemma deeply divides the agrahara, with ideological conflicts arising between the youths influenced by Naranappa’s progressive thinking and the rigidly orthodox elderly Brahmin custodians of tradition. \nThe film sensitively portrays the agrahara’s decaying feudal system and the inner contradictions plaguing its self-appointed patriarchal authorities as they grapple with existential questions about ritualism, sexuality, and the rapidly changing social mores. It offers a nuanced critique of entrenched casteism, misogyny, and blind adherence to outdated customs. \nWith its authentic depiction of the Brahmin way of life, powerful symbolism, and philosophical undertones, Samskara is regarded as a landmark film in Kannada cinema’s Parallel Cinema movement and a masterpiece of Indian neo-realist filmmaking. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%b8%e0%b2%82%e0%b2%b8%e0%b3%8d%e0%b2%95%e0%b2%be%e0%b2%b0-samskara/",
    "keywords": "Film",
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "ಸಂಸ್ಕಾರ | Samskara"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-489.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "Bangalore 1974",
    "startDate": "2024-05-29T19:00:00+05:30",
    "endDate": "2024-05-29T20:45:00+05:30",
    "description": "For ‘Bangalore 1974’, Konarak Reddy will perform a range of music from the 17th century to the present, which takes the audience through a meditative experience, while telling the musical story of Bangalore. You can expect to hear the stories behind Brahms‘ Lullaby, Handel’s Presto in D minor, and Konarak’s Prelude in A that leads into ‘Somewhere Over the Rainbow’ by Harold Arlen, while listening to him playing them. You will hear about old music teachers of Bangalore like Marion Fewkes and Mr. Lumas, about a certain Nadaswaram player on Cavalry Road, about the Music Strip in Cubbon Park. You will also be privy to Konarak’s own compositions that span the range of his experiences, growing up in Bangalore, playing at venues like Rex Theatre and RSI, listening to bands at 3 Aces, being arrested during the Emergency at 58 St.Mark’s Road, reading Sri Aurobindo – personal experiences of a certain period of time in Bangalore, interpreted through music.  \nThis concert is part of a series of solo guitar concerts initiated to celebrate 50 years of Konarak Reddy’s music. Each concert is uniquely conceptualised, with a special set list. \nIn collaboration with: \n \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/bangalore-1974/",
    "keywords": "Culture*, History, Music, Performing Arts",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Bangalore 1974"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnailnewkkl.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Great Flap of 1942",
    "startDate": "2024-06-10T18:30:00+05:30",
    "endDate": "2024-06-10T20:00:00+05:30",
    "description": "The Great Flap of 1942 is a narrative history of a neglected and scarcely known period—between December 1941 and mid-1942—when all of India was caught in a state of panic. This was largely a result of the British administration’s mistaken belief that Japan was on the verge of launching a full-fledged invasion. It was a time when the Raj became unduly alarmed, when the tongue of rumour wagged wildly about Japanese prowess and British weakness and when there was a huge and largely unmapped exodus (of Indians and Europeans) from both sides of the coastline to ‘safer’ inland regions. This book demonstrates, quite astonishingly, that the Raj cynically encouraged the exodus and contributed to the repeated cycles of rumour, panic and flight. It also reveals how the shadow of the Japanese threat influenced the course of nationalist politics, altered British attitudes towards India and charted the course towards Independence. \nThe title ‘The Great Flap of 1942’ refers to an expression used by British bureaucrats in India that traces a broad narrative arc, starting with the Japanese attacks in South-East Asia. The assault on Malaya, the conquest of Singapore, the bombing and eventual occupation of Burma, and the Japanese Navy’s foray into the Indian Ocean are examined in the light of the tremendous impact they had on India. \nThe author of the book, Mukund Padmanabhan, will be in conversation with Historian & Columnist, V Sriram. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-great-flap-of-1942/",
    "keywords": "Books, Defence & security, History, Nonfiction",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-485.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "ನಾಟ್ಯದೇವಚರಿತೆ | Natyadevacharite",
    "startDate": "2024-05-28T19:00:00+05:30",
    "endDate": "2024-05-28T20:15:00+05:30",
    "description": "Kannada | 75 mins | Suitable for Ages 8+ \n‘ನಾಟ್ಯದೇವಚರಿತೆ’ ನಾಟಕದ ಕಥಾವಸ್ತುವು ಹಾಸ್ಯ ಮತ್ತು ವಿಡಂಬನೆಯ ಮಿಶ್ರಣದಿಂದ ಕೂಡಿದೆ. ನಾಟಕವು ಶ್ರೀಮಂತ ವ್ಯಕ್ತಿಯೊಬ್ಬನ ಕುಟುಂಬದ ಸುತ್ತ ಸುತ್ತುತ್ತದೆ. ಆ ಶ್ರೀಮಂತನು ಧಾರ್ಮಿಕತೆಯ ಬೂಟಾಟಿಕೆಯನ್ನು ಪ್ರದರ್ಶಿಸುವ ಒಬ್ಬ ನಕಲಿ ಗುರುವಿನ ತಂತ್ರಕ್ಕೆ ಮಾರುಹೊಗುತ್ತಾನೆ. ಕಳ್ಳ ಗುರುವು ಶ್ರೀಮಂತ ವ್ಯಕ್ತಿಯ ಪ್ರಶ್ನಾತೀತ ಅನುಸರಣೆಯ ಲಾಭವನ್ನು ಪಡೆಯುತ್ತಾನೆ. ಇದರಿಂದ ಬೇಸೆತ್ತ ಕುಟುಂಬವು ಉಪಾಯವಾದ ಯೋಜನೆಯನ್ನು ರೂಪಿಸುವಲ್ಲಿ ತೊಡಗುತ್ತದೆ. ಈ ಯೋಜಬೆಯ ಬಲೆಯಲ್ಲಿ ಕಪಟ ಗುರುವು ಸಿಕ್ಕಿಬೀಳಿತ್ತಾನೆಯೇ ಎಂಬ ಕಾತುರತೆಯನ್ನು ಈ ಪ್ರಸ್ತುತಿಯು ಪ್ರೇಕ್ಷಕರಲ್ಲಿ ಉಂಟುಮಾಡುತ್ತದೆ. ನಾಟಕವು ಮುಖ್ಯ ವಿಷಯವಾದ ಧಾರ್ಮಿಕ ನಡವಳಿಕೆಯಲ್ಲಿನ ಅಪ್ರಾಮಾಣಿಕತೆ, ತಪ್ಪು ಜನರನ್ನು ನಂಬುವ ಅಪಾಯಗಳು ಮತ್ತು ಯಾರನ್ನಾದರೂ ಕುರುಡಾಗಿ ಅನುಸರಿಸುವುದನ್ನು ಹಾಸ್ಯದ ಲೇಪನದಲ್ಲಿ ತೋರಿಸುತ್ತದೆ. ಹಾಸ್ಯ ಮತ್ತು ವಿಡಂಬನೆಯ ಮೂಲಕ, `ನಾಟ್ಯದೇವಚರಿತೆ~ ಕುರುಡು ನಂಬಿಕೆಯ ಪರಿಣಾಮಗಳನ್ನು ಮತ್ತು ಧಾರ್ಮಿಕ ಬೂಟಾಟಿಕೆಗಳ ಹಾಸ್ಯಮಯ ಅಂಶಗಳನ್ನು ಬಿಚ್ಚಿಡುತ್ತದೆ. \nThe play ‘Natyadevacharite,’ revolves around a rich man who becomes vulnerable to a fake imposter guru pretending to be pious and religious. The plot unfolds through a mix of comedy and drama, revealing the guru’s insincerity. The guru takes advantage of the wealthy man`s unquestioning admiration. As the family plots a smart plan, the audience is invited to watch the unfolding events, wondering if the imposter will be caught. The main theme humorously explores the dishonesty in religious behavior, the risks of trusting the wrong people, and the outcomes of blindly following someone, all presented in a satirical manner. The play aims to entertain while shedding light on the dangers of blindly trusting those who manipulate religious appearances for personal gain. Through its mix of comedy and drama, ‘Natydevacharite’ unfolds a tale that prompts the audience to reflect on the consequences of misplaced trust and the humorous aspects of religious hypocrisy. \nAbout the Team \nSanchaya is a theatre group which has made a name for itself in the art and culture circles of Bangalore. Established in 1988, Sanchaya was the dream child of G. S. Rama Rao, a teacher at MES High School, Jayanagar, Bangalore. Fondly called GSR by Sanchayans, he envisioned the role of art and culture in moulding human personalities, and brought together his students to form a troupe. Aptly named Sanchaya (meaning “Coming together of”), it was intended to be a melting pot of drama, literature, and creativity. The team started out by putting together plays by the then students and now, founding members. The very first play “Vallabhapuriya Dantakathe” set the beginning for the wonderful journey that is in its 33rd year now. Many plays followed and with it, the transformation of the troupe from a student-centered group to a professionally managed popular theatre team. Today we have a repertoire of more than 40 plays. Along the way, we have had gratifying achievements that make us proud. We have reached theatre lovers across many cities in India. We have performed at “Bharat Rang Mahotsav” hosted by National School of Drama, New Delhi. The play “Pratibimbagalu” garnered wide critical acclaim for the multi-dimensional portrayal of a classic play. We have also organized many Theatre Festivals to provide a platform for young amateur teams to showcase their plays. With the vision of bringing all the theatre teams of Bangalore together, we organized a flagship event called “Ranga-Ugadi”. We call these endeavors “Enriching Theatre Brotherhood”. Not restricting our vista to plays alone, we have been organizing musical events as well. Sanchaya’s directorial repertoire includes prominent theatre artists like C.G. Krishnamurthy, R. Nagesh, S. Surendranath, Suresh Anagalli, Krishnamurthy Kavathar, S. K. Madhava Rao, Abbur Jayatheertha, Kathlu Satya, Iqbal Ahmed, Joseph John, Shashidhar Barighat, among others. It has groomed many artists who have become famous film and TV actors, producers, and directors today. We are also very proud of having enticed a whole new generation of youngsters towards theatre, keeping with the true spirit of GSR. Our theatre family, as we like to call it, has grown to include more than 200 members. \nಬೆಂಗಳೂರಿನ ಕಲಾ ಪ್ರಪಂಚದಲ್ಲಿ ಸಂಚಯ ತಂಡ ತನ್ನದೇ ಆದ ಛಾಪನ್ನು ಮೂಡಿಸಿದೆ. 1988ರಲ್ಲಿ ಸ್ಥಾಪನೆಯಾದ ಸಂಚಯ, ಎಂ.ಇ.ಎಸ್ ಪ್ರೌಢಶಾಲೆಯ ಶಿಕ್ಷಕರಾದ ಜಿ.ಎಸ್.ರಾಮರಾವ್ ಅವರ ಕನಸಿನ ಕೂಸು. ಜಿ.ಎಸ್.ಆರ್ ಮಾನವ ವ್ಯಕ್ತಿತ್ವವನ್ನು ರೂಪಿಸುವಲ್ಲಿ ಕಲೆ ಮತ್ತು ಸಂಸ್ಕೃತಿಯ ಪಾತ್ರವನ್ನು ಕಲ್ಪಿಸಿಕೊಂಡವರು. ಇದಕ್ಕಾಗಿ ಅವರು ತಮ್ಮ ವಿದ್ಯಾರ್ಥಿಗಳನ್ನು ಒಟ್ಟುಗೂಡಿಸಿ ತಂಡವನ್ನು ರಚಿಸಿದರು. ಸಂಚಯ (ಅಂದರೆ “ಒಟ್ಟುಗೂಡಿಸುವುದು”)ಎಂಬುದಾಗಿ ಸೂಕ್ತವಾಗಿ ಹೆಸರಿಸಲಾದ ಈ ತಂಡವು ನಾಟಕ, ಸಾಹಿತ್ಯ ಮುಂತಾದ ಹಲವು ಸೃಜನಶೀಲ ಕಲೆಗಳ ಸಮ್ಮಿಳನದ ಉದ್ದೇಶವನ್ನು ಹೊಂದಿದೆ. ಈ ತಂಡವು ಅಂದಿನಿಂದ ಇಂದಿನವರೆಗೆ ನಿರಂತರವಾಗಿ ನಾಟಕಗಳನ್ನು ಪ್ರದರ್ಶಿಸುತ್ತಾ ಬಂದಿದೆ. \n“ವಲ್ಲಭಪುರಿಯ ದಂತಕಥೆ”ಎಂಬ ನಾಟಕದಿಂದ ಅದ್ಭುತ ರಂಗಪಯಣಕ್ಕೆ ನಾಂದಿ ಹಾಡಿದ ನಮ್ಮ ತಂಡ ಈಗ್ಗೆ ಮೂರು ದಶಕಗಳನ್ನು ಕಂಡಿದೆ. ತಂಡವು ವಿದ್ಯಾರ್ಥಿ-ಕೇಂದ್ರಿತ ಗುಂಪಿನಿಂದ ವೃತ್ತಿಪರವಾಗಿ ನಿರ್ವಹಿಸಲ್ಪಡುವ ಜನಪ್ರಿಯ ನಾಟಕ ತಂಡವಾಗಿ ರೂಪಾಂತರಗೊಂಡಿದೆ. ಇಂದು ನಮ್ಮಲ್ಲಿ 40ಕ್ಕೂ ಹೆಚ್ಚು ನಾಟಕಗಳ ಸಂಗ್ರಹವಿದೆ. \nಸಂಚಯ ತಂಡವು ಭಾರತದ ಅನೇಕ ನಗರಗಳಲ್ಲಿ ರಂಗಭೂಮಿ ಪ್ರೇಮಿಗಳನ್ನು ತಲುಪಿದೆ. ನವದೆಹಲಿಯ ನ್ಯಾಷನಲ್ ಸ್ಕೂಲ್ ಆಫ್ ಡ್ರಾಮಾ ಆಯೋಜಿಸಿದ “ಭಾರತ್ ರಂಗ್ ಮಹೋತ್ಸವ”ದಲ್ಲಿ “ಪ್ರತಿಬಿಂಬಗಳು” ನಾಟಕವನ್ನು ಪ್ರದರ್ಶಿಸಿದ್ದೇವೆ. ಶಾಸ್ತ್ರೀಯ ನಾಟಕದ ಬಹು ಆಯಾಮದ ಚಿತ್ರಣಕ್ಕಾಗಿ ಈ ನಾಟಕವು ವಿಮರ್ಶಕರ ಮೆಚ್ಚುಗೆಯನ್ನು ಗಳಿಸಿತು. ರಾಜ್ಯದ ಇತರ ಹವ್ಯಾಸಿ ತಂಡಗಳಿಗೆ ಅವರ ನಾಟಕಗಳ ಪ್ರದಶನಕ್ಕಾಗಿ ವೇದಿಕೆಯನ್ನು ಒದಗಿಸುವ ಹಲವು ನಾಟಕೋತ್ಸವಗಳನ್ನು ಆಯೋಜಿಸಿದ್ದೇವೆ. ಬೆಂಗಳೂರಿನ ಎಲ್ಲಾ ನಾಟಕ ತಂಡಗಳನ್ನು ಒಂದೇ ವೇದಿಕೆಗೆ ತರುವ ಉದ್ದೇಶದಿಂದ “ರಂಗ-ಯುಗಾದಿ” ಎಂಬ ಕಾರ್ಯಕ್ರಮವನ್ನು ಆಯೋಜಿಸಿದ್ದೇವೆ. ನಮ್ಮ ಚಟುವಟಿಕೆಗಳನ್ನು ನಾಟಕ ಪ್ರದರ್ಶನಗಳಿಗಷ್ಟೇ ಸೀಮಿತಗೊಳಿಸದೆ, ಹಲವಾರು ಸಾಹಿತ್ಯ, ಸಂಗೀತ ಕಾರ್ಯಕ್ರಮಗಳನ್ನೂ ಆಯೋಜಿಸಿದ್ದೇವೆ. \nಕನ್ನಡ ರಂಗಭೂಮಿಯಲ್ಲಿ ಪ್ರಮುಖ ನಿರ್ದೇಶಕರಾದ ಸಿ.ಜಿ. ಕೃಷ್ಣಮೂರ್ತಿ, ಆರ್.ನಾಗೇಶ್, ಎಸ್.ಸುರೇಂದ್ರನಾಥ್, ಸುರೇಶ್ ಆನಗಳ್ಳಿ, ಕೃಷ್ಣಮೂರ್ತಿ ಕವತಾರ್, ಎಸ್.ಕೆ.ಮಾಧವ ರಾವ್, ಅಬ್ಬೂರು ಜಯತೀರ್ಥ, ಕತ್ಲು ಸತ್ಯ, ಇಕ್ಬಾಲ್ ಅಹಮದ್, ಜೋಸೆಫ್ ಜಾನ್, ಶಶಿಧರ್ ಭಾರಿಘಾಟ್ ಮುಂತಾದವರು ಸಂಚಯಕ್ಕಾಗಿ ನಾಟಕಗಳನ್ನು ನಿರ್ದೇಶಿಸಿದ್ದಾರೆ. ಪ್ರಸಿದ್ಧ ಚಲನಚಿತ್ರ ಮತ್ತು ಟಿವಿ ನಟರು, ನಿರ್ಮಾಪಕರು ಮತ್ತು ನಿರ್ದೇಶಕರಾದ ಅನೇಕ ಕಲಾವಿದರನ್ನು ಇಂದು ಸಂಚಯ ಅಲಂಕರಿಸಿದೆ. ಜಿ.ಎಸ್.ಆರ್ ಅವರ ನಿಜವಾದ ಸ್ಪೂರ್ತಿಯನ್ನು ಇಟ್ಟುಕೊಂಡು ಹೊಸ ಪೀಳಿಗೆಯ ಯುವಕರನ್ನು ರಂಗಭೂಮಿಯತ್ತ ಆಕರ್ಷಿಸಿದ್ದಕ್ಕಾಗಿ ನಾವು ತುಂಬಾ ಹೆಮ್ಮೆಪಡುತ್ತೇವೆ. ನಮ್ಮ ರಂಗಭೂಮಿ ಕುಟುಂಬ 200ಕ್ಕೂ ಹೆಚ್ಚು ಸದಸ್ಯರನ್ನು ಒಳಗೊಂಡು ಬೆಳೆದಿದೆ. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%a8%e0%b2%be%e0%b2%9f%e0%b2%bf%e0%b2%a6%e0%b3%87%e0%b2%b5%e0%b2%9a%e0%b2%b0%e0%b2%bf%e0%b2%a4%e0%b3%86-natyadevacharite/",
    "keywords": "Performing Arts, Theatre",
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "ನಾಟ್ಯದೇವಚರಿತೆ | Natyadevacharite"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-473.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Cries of Women",
    "startDate": "2024-06-13T18:30:00+05:30",
    "endDate": "2024-06-13T20:00:00+05:30",
    "description": "Wild Women: Seekers, Protagonists and Goddesses in Sacred Indian Poetry [Penguin India, 2024], edited by poet and seeker Arundhathi Subramaniam, is a new anthology of compelling women mystics in Indian literature. \nThese poems are the cries of women who refused, quietly, and sometimes not so quietly, to be bullied into submission. Women who surrendered not to the authority of the world, but to the authority of the spirit. Women whose voices have far too often been sanitized by the grand narratives of religion and sidelined by rationalist versions of history. \nThe names of Mirabai, Akka Mahadevi, and Andal, are known to many. But there are innumerable others. And little is known of the urgency of their words, of their feral sensuality, of their relentless questioning of the custodians of gender and faith. It is time to re-fang them, to tune into their brazenness and heartbreaking longing. Not just for their sake, but for ours. \nThis conversation with Arundhathi Subramaniam, interspersed by readings of translations by Mani Rao, Vanamala Viswanatha and Ahalya Ballal, will explore some fascinating and unforgettable women. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-cries-of-women/",
    "keywords": "Books, Gender, Literature, Poetry",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-2_POSTER-10.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Sufi Lyrics",
    "startDate": "2024-05-31T18:30:00+05:30",
    "endDate": "2024-05-31T20:00:00+05:30",
    "description": "The poetry of Bullhe Shah (d. 1758) is considered one of the glories of premodern Panjabi literature. Born in Uch, Panjab, in present-day Pakistan, Bullhe Shah drew profoundly upon Sufi mysticism in his writings. His lyrics, famous for their vivid style and outspoken denunciation of artificial religious divisions, have long been held in affection by Hindus, Muslims, and Sikhs, and they continue to win audiences today across national boundaries and in the global Panjabi diaspora. \nThe new translation from Murty Classical Library of India, published by Harvard University Press, in English is presented alongside the Panjabi text, in the Gurmukhi script, re-edited on the basis of the best modern Pakistani and Indian editions. Bullhe Shah’s Sufi Lyrics thus offers the most complete and approachable version of this great poet’s works. \nThis event features Bullhe Shah’s poetry coming to life with a musical performance by Harpreet, accompanied by readings from the book and a narration of Shah’s life story by Soni Wadhwa. \nAbout the Murty Classical Library of India:\nThe Murty Classical Library aims to reintroduce some of the greatest literary works of India, written over the past two millennia, to a new generation of readers. Each volume in the series has been translated into English by world-renowned scholars, and reflect the highest standards of contemporary book design with elegant and newly-commissioned typefaces. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/sufi-lyrics/",
    "keywords": "Books, Literature, Music, Philosophy, Poetry",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-480.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Caste in Modern India",
    "startDate": "2024-05-31T11:00:00+05:30",
    "endDate": "2024-06-02T20:00:00+05:30",
    "description": "Exhibition Opening: Friday, 31 May\nTimings: 11:00 am – 8:00 pm\nExhibition on show until Sunday, 2 June \nWalkthroughs:\nFriday, 31 May | 6:00 pm\nSaturday, 1 June | 11:30 am & 5:30 pm\nSunday, 2 June | 11:00 am \nConversations:\nInaugural Address – Friday, 31 May | 6:45 pm\nPanel Discussion – Sunday, 2 June | 11:45 am \nRailways and postal services were introduced in colonial India in the early 1850s. In due course, these new technologies made long-distance travel and communication widely accessible and affordable. In a parallel development, the introduction of limited representation in legislatures in the 1890s added urgency to tap the potential trans-local identities enumerated in the decennial censuses beginning in 1871-72. \nIn view of these developments, local communities, in particular, castes, tapped new technologies to connect with kindred groups across the country and combine to form pan-Indian communities. Post offices allowed members of these aggregate groupings to correspond with each other, while railways enabled them to meet periodically and devise strategies to capture a share in legislatures, educational institutions and public employment proportionate to their census population. Drawing upon philatelic material covering a century, the exhibition highlights the role of the postal system in this new politics. \nThe exhibition is divided into two broad parts that bring together correspondence and publications of several caste-based community organisations and individuals from across the country and the philatelic output of the post-colonial state. The exhibition has been curated by Vikas Kumar, who teaches economics at Azim Premji University. \nProf Gopal Guru will inaugurate the exhibition and deliver the inaugural address on May 31, 6:45 pm. He will comment on the exhibition and locate its images in the larger politics of visual culture. \nA Panel Discussion with Prof. Satish Deshpande, a distinguished social scientist who has made seminal contributions to our understanding of caste in independent India, Vaishna Roy, Editor-in-Chief, Frontline magazine and Vikas Kumar, Curator of the exhibit, will take place on 2 June, 11:45 am. \nIn collaboration with Azim Premji University, Bangalore \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/caste-in-modern-india/",
    "keywords": "Heritage, History, Visual Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-468.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Just a Mercenary",
    "startDate": "2024-06-05T18:30:00+05:30",
    "endDate": "2024-06-05T20:00:00+05:30",
    "description": "At the start of his career as sub-collector of Parvathipuram sub-division in north-coastal Andhra Pradesh way back in 1974, Subbarao learnt – the hard way – that tribal development requires more than enthusiasm; it requires most of all an understanding of poverty. \nNearly forty years later, in 2013, as the governor of the Reserve Bank of India in the midst of a fierce exchange rate crisis, Subbarao learnt – once again the hard way – the harsh challenges of emerging economies in an unequal world. \nBookended by these assignments is the journey of a small-town boy from a modest background to the top echelons of India’s civil service and then on to the helm of the country’s central bank. Subbarao recounts that journey – his hopes and despair, his successes and setbacks, his mistakes and misdeeds, and the lessons he learnt along the way – with candour and honesty. The subtext of that story though is his constant soul searching about whether he has given back to society more than he received. \nJust a Mercenary? is an earnest account of an extraordinary career that tries to inform and inspire young professionals trying to find their way up their career ladders – and find meaning in their journeys. \nSubbarao will be in conversation with Prof. MS Sriram of IIM, Bangalore. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/just-a-mercenary/",
    "keywords": "Biography, Books, Development, Governance, Nonfiction",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-488.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Rise and Fall of the Vanderbilts",
    "startDate": "2024-06-11T18:30:00+05:30",
    "endDate": "2024-06-11T20:00:00+05:30",
    "description": "Once upon a time, there was a family whose very name connoted wealth. The Vanderbilts had a vast empire built on freight through steamboats and railroads. Over a few generations, the wealth-worth billions in today’s money-had been frittered away and the business itself faded as new options came up in the freight business. Their story remains an enduring example of what happens when business leaders fail to embrace the future and transform. \nBusiness transformation is a dynamic topic that is explored by authors R Gopalakrishnan and Hrishi Bhattacharyya in their book Embrace the Future. A key lesson in the success or failure of such transformations lies in harmonising the art and science of change – the emotional and the rational – and striking the right balance between them. Both in life and in business, a compelling narrative that inspires the organisation is essential for effecting transformation. Equally important is viewing transformation as an ongoing effort integrated into the work culture, rather than solely reacting to crises. \nTheir book resonates with anyone who has encountered change—something prevalent in today’s ever-evolving business landscape. R Gopalakrishnan and Hrishi Bhattacharyya underscore that companies unwilling to adapt are bound to fade away. The authors will share their insight on how it’s imperative to draw lessons from the past, navigate the present, and prepare for the future. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-rise-and-fall-of-the-vanderbilts/",
    "keywords": "Books, Business, Nonfiction",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-428.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Just Hiss",
    "startDate": "2024-06-23T11:00:00+05:30",
    "endDate": "2024-06-23T12:00:00+05:30",
    "description": "50 minutes | English and Kannada  \nJust Hiss is a compelling adaptation of the short folk story titled A Serpent’s Predicament. Just Hiss is an ode to coexistence, following the transformative journey of a snake to choose love over hate. As the play navigates the complex dynamics between the snake, the forest denizens, and the villagers of Rasbharpur, it skillfully tackles the universal themes of unity and understanding. The resonant narrative serves as a reminder of the profound impact that choices, particularly those rooted in love and compassion, can have on fostering harmony in a world shared by diverse beings. \nDirector’s note: \nJust Hiss is not just a play; it is a whimsical journey crafted especially for children, featuring endearing animal characters. At its heart, it unfolds an analogical tale, resonant with the pressing message of our times—understanding the limitations of one’s perspective and the imperative need to embrace and accommodate others. \nConceived with meticulous care and having undergone several work-in-progress phases, this play is a testament to the idea that assumptions should yield to genuine inquiry. It serves as a reminder to care enough to ask, fostering the spirit of coming together and progressing impactfully. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/just-hiss/",
    "keywords": "Theatre, Wildlife, Young BIC",
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-487.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Future of Great Nicobar",
    "startDate": "2024-06-12T18:30:00+05:30",
    "endDate": "2024-06-12T20:00:00+05:30",
    "description": "In The Great Nicobar Betrayal, Pankaj Sekhsaria, one of the best known chroniclers of contemporary issues in the Andaman and Nicobar Islands, has compiled a set of articles written by various experts across publications that examine the proposed project from every angle—environmental, geological, impact on local communities, law, due process, and ecology. \nThese pieces together shed light on the magnitude of the disaster that will be unleashed on this pristine place if the project comes through. The book is a warning and a catalogue of the manmade catastrophe that lurks on the horizon, one that will destroy more than the tsunami of December 2004 ever did. \nIn this session, Pankaj Sekhsaria is in conversation with Prof. Lawrence Surendra and Vaishna Roy. A Q&A with the audience will follow. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-future-of-great-nicobar/",
    "keywords": "Books, Cities, Climate Change, Development, Environment, Nonfiction, Sustainability",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-30.jpg"
  }
]