[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70741-1741285800-1741291200@bangaloreinternationalcentre.org",
    "name": "From Pax Americana to Pax Mysteriana",
    "startDate": "2025-03-06T18:30:00+05:30",
    "endDate": "2025-03-06T20:00:00+05:30",
    "description": "The object of this lecture is to analyze the world order that was put in place at the end of World War II, examine how it has unfolded in terms of experience since then, and highlight some important manifestations of its multiple crises, to discuss possible future scenarios for 2050. In doing so, it asks four questions and seeks to provide answers. \nAre we witnessing the beginnings of a transformative change in the world order? Are we at the cusp of an emerging bi-polar world order, with the United States and China as the two superpowers? Are we moving towards a multi-polar world, in which there will be another 8-10 countries that are also key players? Are we going to live with a fluid situation and a de facto continuation of Pax Americana? \nThe lecture will be followed by a Q&A with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/from-pax-americana-to-pax-mysteriana/",
    "keywords": [
      "Governance",
      "International Relations",
      "Policy & Regulation",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-725.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70938-1740853800-1740861000@bangaloreinternationalcentre.org",
    "name": "B•Lore Season 3 Screenings",
    "startDate": "2025-03-01T18:30:00+05:30",
    "endDate": "2025-03-01T20:30:00+05:30",
    "description": "In July 2024, Bangalore International Centre launched the third season of B·LORE, an open call initiative inviting filmmakers to document fresh perspectives of our city. The call welcomed diverse narratives – from cultural heritage to civic engagement, from environmental conservation to personal stories – all aimed at creating a collective audio-visual memory of Bengaluru. \nFrom numerous submissions received from across the city, eight compelling films were selected by a three-member jury. These films, each under 5 minutes, capture unique facets of urban life in Bengaluru, telling stories of community action, environmental conservation, cultural preservation, and personal connections to the city. \nThe selected films will be screened in two segments. \nEach segment will be followed by conversations with the filmmakers, exploring their perspectives on documenting Bengaluru’s evolving narrative. \nSegment 1 | Growing Roots: Stories of Land & Labour | 6:30 pm – 7:20 pm \n\n\n\n\n\n\n\nTitle\nDirector\nSynopsis\n\n\nRipples\nNeha Nair\nA community’s journey in transforming Somasundarapalya Lake\n\n\nAn Odo-date with Puttenahalli Lake\nAakash Amish & Atheeva Reji Kumar\n\n\nA first-person exploration of lake Puttenahalli Lake\n\n\n\n\nCase and Bobbin (ಕೇಸು-ಬಾಬಿನ್)\nBharath R\n\n\nStories from Bangalore’s garment worker community\n\n\n\n\nAlli Serona: Bus Stop Maadi!\nPurpose, Bengawalk, APSA\nUrban mobility through citizens’ eyes\n\n\n\nSegment 2 | Bangalore Bytes: Stories of Heart & Home | 7:35 pm – 8:25 pm \n  \n\n\n\n\n\n\n\nTitle\nDirector\nSynopsis\n\n\nHow Long is Forever?\nVaishnavi Dhumal & Anna Joe\nHeritage of Bangalore’s watchmaking legacy\n\n\nMini-Brazil\nMayur J Raol\nExploring Bangalore’s grassroots football culture\n\n\nSFS – Yeli’s Past Glimmer\nRishab Shetty & Rahel Thoppil\nChronicles of Yelahanka’s SFS neighbourhood\n\n\nLove in Luru\nHarshini Boyala\nRomance and the city – revisiting the city through “Naguva Nayana”\n\n\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/b%e2%80%a2lore-season-3-screenings/",
    "keywords": [
      "Bangalore",
      "Culture",
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-729.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "71038-1741442400-1741449600@bangaloreinternationalcentre.org",
    "name": "Gulabi Gang",
    "startDate": "2025-03-08T14:00:00+05:30",
    "endDate": "2025-03-08T16:00:00+05:30",
    "description": "96 minutes | Hindi/Bundelkhandi with English Subtitles | 2012 | Norway, India, Denmark | Documentary \nEnter the badlands of Bundelkhand in central India and you have entered a place of desolation, dust and despair. And yet it is hope that this film discovers, as it follows the Gulabi Gang, an unusual group of rural women. Led by the energetic and charismatic Sampat Pal, they travel long distances to fight for the rights of women and Dalits. They encounter resistance, apathy and corruption, even ridicule. Sometimes whole villages connive against them to protect the perpetrators of violence. The film pulls us into the centre of these blazing conflicts and uncovers a complex story, disturbing yet heartening. \nGulabi Gang was released in theatres in Norway in 2013, where it played for the entire year. In India, it was released by Sohum Shah (Recyclewala Films) and had limited theatrical release in Indian Metros. The film gained critical acclaim, including two national awards. \nThe film has been screened at over 60 film festivals and international universities including Stanford, NYU, Wellesley, UCSB, NW University, UT Austin, Texas A&M, North Carolina, University of London, Cambridge, St. Andrews, Queens Belfast, Coventry, Heidelberg, Danish Film School, FTII Pune, SRFTI, Kolkata, MCRC Delhi, JNU Delhi. \nCast: Sampat Pal, Jaiprakash, Suman Singh Chauhan, Usha Devi, Husna Jahan\nDirector: Nishtha Jain\nWriter: Nishtha Jain, Torstein Grude\nProducer: Torstein Grude, Bjarte Morner Tveit (Piraya Film)\nCo-Producer: Nishtha Jain (Raintree Films)\nCo-Producer: Signe Byrge Sorenson (Final Cut for Real)\nDOP: Rakesh Haridas\nLocation Sound: Niraj Gera\nAssistant Director: Aditya Kelgaonkar\nLine Producer: Neelima Goel\nSound Design: Peter Schultz\nEditor: Arjun Gourisaria\nMusic: Peter ScartabelloTranslation & Subtitles: Smriti Nevatia\nGrading: Tom Christer Lilletvedt\nAssistant Producer: Oddleiv Vik\nProduced by Piraya Film (Norway), Raintree Films (India), Final Cut for Real(Denmark)\nFestival Distribution: Norwegian Film Institute \nThe screening of the film will be followed by a Q&A with Director, Nishtha Jain. \nThis event is part of Unheard Narratives, BIC’s programmes to commemorate Women’s Day 2025. It celebrates the power of unheard narratives—spotlighting the resilience, artistry, and impact of women whose stories have shaped India’s cultural and social fabric. Through performances, talks, and films, we bring these voices to the forefront. \n",
    "url": "https://bangaloreinternationalcentre.org/event/gulabi-gang/",
    "keywords": [
      "Film",
      "Gender",
      "History",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "Gulabi Gang"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-735.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "71009-1741374000-1741379400@bangaloreinternationalcentre.org",
    "name": "Women on Record",
    "startDate": "2025-03-07T19:00:00+05:30",
    "endDate": "2025-03-07T20:30:00+05:30",
    "description": "Step into a world of remarkable women, an era of black and white, of salons and tawaifs, of stories, riddles, anecdotes, photographs, and songs—the dawn of entertainment in the gramophone era. \nWomen on Record is a captivating multimedia performance that brings to life the stories of the early 20th-century Baijis—the pioneering women of India’s gramophone era. Through music, theatre, and film, this presentation celebrates the divas of their time, many of whom remain unsung beyond the well-known name of Gauhar Jaan. \nFeaturing a rich tapestry of folk music, thumri, geet, and early film songs, the show weaves together archival videos, rare photographs, and anecdotes, immersing audiences in a lost world of artistry and resilience. \nHaving toured cultural centers across India, South Asia, the USA, and England, Women on Record has received an overwhelmingly warm response. \nSo, sink into your seats as Vidya Shah transports you to the grandeur of the salon and the origins of the studio era. \nLearn more about the project at www.womenonrecord.com. \nThis event marks the opening of Unheard Narratives, BIC’s programmes to commemorate Women’s Day 2025. It celebrates the power of unheard narratives—spotlighting the resilience, artistry, and impact of women whose stories have shaped India’s cultural and social fabric. Through performances, talks, and films, we bring these voices to the forefront. \nIn collaboration with: \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/women-on-record/",
    "keywords": [
      "Gender",
      "Heritage",
      "History",
      "Music",
      "Performing Arts",
      "Poetry",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Women on Record"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/ThumbnailPOSTER-4.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "70675-1741892400-1741896900@bangaloreinternationalcentre.org",
    "name": "wepushthesky | ﺗﻘدم ﻗﺎﺑﯾﻠﺔ",
    "startDate": "2025-03-13T19:00:00+05:30",
    "endDate": "2025-03-13T20:15:00+05:30",
    "description": "English | 75 minutes | Suitable for 13 Years and above \nwepushthesky is an interactive solo performance that weaves together food, song, story, myth, and history. Where personal stories meet community histories, survival stories of the Karbala entwine with songs of the Mappila Ramayana, and anecdotes from the past confront desires about the future. A play that reflects on an urgent social reality of our present times—friendships that have been lost, gained, or have endured amidst increasing shrill political rhetoric across the world.\n \nWritten and performed by Nisha Abdulla and directed by Ujwala Rao, wepushthesky centres friendship and feminist solidarities as an antidote to the politics of hate. The play invites the audience to listen deeply to another’s reality and elevates listening to the act of an assertive ally. wepushthesky has toured widely to warm receptions in India, performed at the Feminist Theatre Festival in Jenin (Occupied Palestine), and has been invited to perform at the 15th Association for Women’s Rights in Development (AWID) International Forum in Bangkok, Singapore Fringe Festival, as well as KNMA Theatre Festival in Delhi.  \nAbout Qabila: \nQabila is a collective formed in 2018, that centers new writing and the dissenting imagination in its work. The most\nrecent production is how long is february? a fantasy in three parts (a digital play about the pursuit of justice by victims\nof state violence. Grantee of Edinburgh Festival Feinge 2023). Qabila’s Artistic Director is Nisha Abdulla, who brings\nan anti-oppressive lens and process into the rehearsal room, and the learning spaces she holds as an educator. \nCast and Crew: \nPlaywright and Performer: Nisha Abdulla\nDesign and Direction: Ujwala Rao\nProduction Manager: Shradha Raj\nSound Design: Pardafash\nLighting Design: Arun DT and Madhusudan BR\nSet Execution: Gowtham (Bheema) \n:سياق المسرحية \nمنذ عام ،2014 لدى الهند حكومة منتخبة تنفذ أجندة عنصرية. يعتقد الحزب الذي يجلس في الحكومة أن الهند أمة هندوسية. ونتيجة لذلك، يلجأ المسؤولون المنتخبون\nوالعاملون في الحزب والمواطنون الذين صوتوا لصالحهم باستمرار إلى العديد من الوسائل غير الدستورية المختلفة لالعتداء على مواطني األقليات وتنفيرهم – باستخدام\nأدوات مؤسسية مثل القانون ووسائل اإلعالم والدعاية، وكذلك عن طريق العنف الجسدي واإلعدام خارج نطاق القانون والعدالة بالجرافات. . المجتمع الذي يعاني من\n.أسوأ هذه األيديولوجية التفوقية هو المواطنون المسلمون\nومع ذلك، يواصل المسلمون الهنود الرد باالحتجاجات السلمية والتأكيد على حقهم في المواطنة المتساوية. وقد انضم إليهم في هذه الحركة مواطنون علمانيون وناشطون\n.وأكاديميون ومحامون ومعلمون وفنانون وغيرهم الكثير من خلفيات متنوعة، سواء في الهند أو على المستوى الدولي\nيتعرض النسيج االجتماعي العلماني في الهند لتهديد عميق. لقد تم تطبيع سياسات الكراهية وتسرب الخطاب .wepushthesky في هذه الخلفية تم تخيل مسرحية\nالمثير للخالف إلى المنازل والعالقات والمساحات المشتركة. تستخدم المسرحية قص ًصا شخصية من حياة الكاتب المسرحي وتاريخ المجتمع الحديث لمناقشة الصداقات\nالتي ضاعت وتم العثور عليها بسبب سياسات الكراهية. تدعو المسرحية الجمهور إلى فعل االستماع العميق وتضع الجسم المستمع كموقع للمقاومة السياسية. فهو يقترح\nالصداقة الناتجة باعتبارها األداة األقوى التي يمكن من خاللها السير نحو مستقبل متحرر ا \n:عن قب \nقابيلة” هي مجموعة جماعية تشكلت عام ،2018 وتركز في عملها على الكتابة الجديدة والخيال المخالف. أحدث إنتاج هو كم هو شهر فبراير؟ خيال من ثالثة أجزاء”\nالمديرة الفنية لقبيلة هي نيشا عبد هللا، التي .(2023 Fringe( مسرحية رقمية تدور حول سعي ضحايا عنف الدولة لتحقيق العدالة. الحائز على جائزة مهرجان إدنبرة\n.تجلب عدسة وعملية مضادة للقمع إلى غرفة التدريب، ومساحات التعلم التي تشغلها كمعلمة \n",
    "url": "https://bangaloreinternationalcentre.org/event/wepushthesky-%ef%ba%97%ef%bb%98%d8%af%d9%85-%ef%bb%97%ef%ba%8e%ef%ba%91%ef%af%be%ef%bb%a0%ef%ba%94/",
    "keywords": [
      "Performing Arts",
      "Politics",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "wepushthesky | ﺗﻘدم ﻗﺎﺑﯾﻠﺔ"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-737.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "71046-1741460400-1741465800@bangaloreinternationalcentre.org",
    "name": "Ranis of India",
    "startDate": "2025-03-08T19:00:00+05:30",
    "endDate": "2025-03-08T20:30:00+05:30",
    "description": "Ranis of India is a theatrical storytelling performance that brings to life the forgotten and lesser-known queens of India. Drawing from oral traditions and historical narratives, Vikram Sridhar weaves together tales of women rulers who shaped the course of history across different regions and time periods. \nOver the course of an hour, through the art of oral storytelling interwoven with folk songs, we embark on a journey across India—uncovering the myths, histories, and contemporary echoes of remarkable queens whose legacies deserve to be remembered. From North to South, East to West, these powerful women left an indelible mark on history, yet their stories remain largely untold. This performance seeks to reclaim their voices and bring them to the forefront. \nThis event is part of Unheard Narratives, BIC’s programmes to commemorate Women’s Day 2025. It celebrates the power of unheard narratives—spotlighting the resilience, artistry, and impact of women whose stories have shaped India’s cultural and social fabric. Through performances, talks, and films, we bring these voices to the forefront. \n",
    "url": "https://bangaloreinternationalcentre.org/event/ranis-of-india/",
    "keywords": [
      "Gender",
      "Heritage",
      "History",
      "Performing Arts",
      "Society",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Ranis of India"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-736.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70841-1741543200-1741550400@bangaloreinternationalcentre.org",
    "name": "Smriti Pravah 2025",
    "startDate": "2025-03-09T18:00:00+05:30",
    "endDate": "2025-03-09T20:00:00+05:30",
    "description": "When Rukmini Devi Arundale founded Kalakshetra in 1936, she did not intend to create a new style of Bharatnatyam. Yet, the Kalakshetra bani emerged—a new approach that distinguished itself from the traditional ‘sadir’ style. Rukmini Devi’s choreography blended classical purity with innovative storytelling, giving rise to a new school of Bharatanatyam that balanced tradition with modern sensibilities. \nOver two decades ago, Kalakshetra alumna Swagata Sen Pillai began curating Smriti Pravah in memory of Rukmini Devi, celebrating her legacy on her birth anniversary and bringing together Kalakshetra students worldwide to honor their guru. After Swagata’s untimely passing due to COVID, her friends and seniors from Kalakshetra, Tripti Bhupen and Archita Mehta, have continued this tradition. \nIn 2025, on Rukmini Devi’s 121st anniversary, Archita Mehta’s NrityaSadhana Centre for Bharatanatyam and Indian Folk Dances, and Tripti Bhupen’s Samarpan School of Performing Arts take a journey into her creative world, where she preserved Bharatanatyam’s traditions while innovating within its structure. \nThe performance will be in two parts: the first will highlight pieces from the margam choreographed by Rukmini Devi’s direct disciples, while the second will explore her timeless dance dramas. \nThis year’s performers include Kalakshetra alumni Archita Mehta, Tripti Bhupen, Gayatri Krishnaveni Lakshmanan, Vasundhara Thomas, Priyashri Rao, Lasya Priya R, and Nrithika B Natesh. \nPresented by: \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/smriti-pravah-2025/",
    "keywords": [
      "Dance",
      "In Memory",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-724.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70819-1741372200-1741377600@bangaloreinternationalcentre.org",
    "name": "Quo Vadis Dravidian Politics?",
    "startDate": "2025-03-07T18:30:00+05:30",
    "endDate": "2025-03-07T20:00:00+05:30",
    "description": "On September 17, 1949, C.N. Annadurai (Anna) founded the DMK after splitting with Periyar E.V. Ramaswamy. The party steadily gained mass appeal, shedding its separatist stance in 1962 and winning power in Tamil Nadu in 1967. Since then, it has remained a major force, first under M. Karunanidhi and now under M.K. Stalin. \nDespite political upheavals—including M.G. Ramachandran’s 1972 split, its 1976 ousting during the Emergency, dismissal in 1991 over alleged LTTE ties, and a 1993 split—the DMK has endured, reclaiming power in 2021. \nKnown for its pioneering welfare policies, the DMK now promotes its ‘Dravidian Model’ as a national alternative, emphasizing Tamil cultural nationalism and cooperative federalism. Yet, 75 years on, it faces challenges from caste-based and nationalist forces, as well as accusations of corruption and dynastic rule. \nAt this crucial juncture, veteran political commentator R. Kannan examines the DMK’s journey and future, offering an objective and comprehensive account of its role in Tamil Nadu politics. \nAuthor R. Kannan will be in conversation with Author & Editor Karthik Venkatesh. A Q&A session with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/quo-vadis-dravidian-politics/",
    "keywords": [
      "Books",
      "History",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-727.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70972-1741199400-1741204800@bangaloreinternationalcentre.org",
    "name": "Family Caregivers : A Silent Workforce",
    "startDate": "2025-03-05T18:30:00+05:30",
    "endDate": "2025-03-05T20:00:00+05:30",
    "description": "In this talk, Norman Sartorius emphasizes the critical need to address the challenges faced by caregivers of individuals with mental illness. Often overlooked, these caregivers, typically family members, find themselves thrust into unfamiliar roles, grappling with feelings of guilt, shame, fear and burnout. Caregivers, often also women, also find themselves facing the harshest stigma and judgement. They navigate complex emotions and uncertainties about their impact on their loved one’s illness. Sartorius advocates for focusing on supporting and empowering caregivers as a crucial starting point in improving mental health care. \nThe talk will be followed by a Q&A session with the audience. \n    \n",
    "url": "https://bangaloreinternationalcentre.org/event/caring-for-the-caregiver/",
    "keywords": [
      "Health & Wellness",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-728.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "63762-1740769200-1740772800@bangaloreinternationalcentre.org",
    "name": "The Earthquake",
    "startDate": "2025-02-28T19:00:00+05:30",
    "endDate": "2025-02-28T20:00:00+05:30",
    "description": "\n54 minutes | English, Hindi, Kannada | Suitable for 13+ Years\nTrigger Warnings: Themes of Loneliness \n\n\n\n\nDo you ever feel alone, even when surrounded by people? Do you crave connection, even when it cracks a little? \nMira and Sameer meet every week, their meeting as familiar as the apple they share. They speak. Someone leaves. They do this again. And again. Mira goes on a boat ride. Sameer stays in a bubble. There is silence. And again. Mira and Sameer are friends… Yet, their unspoken words scream louder than their conversations. \nThis is a story of cycles. Of coming together, drifting apart, and all the spaces in between. \nWhat happens when we finally face our truth? Maybe we hear a strange noise… \nThis is an adaptation of “Bhūmikampa – Das Erdbeben” which received funding for International Cultural Projects from The Department of Arts and Culture of the City of Munich \n\n\nFrom the Playwrights (Samragni Dasgupta and Marvin Krause):\nTwo young artists from India and Germany meet on a farm in Bengaluru as part of an exchange program. They get to know each other and realise that cultural differences are just one aspect of human connection. They come together to develop something together. But what?The idea for this collaboration started with a conversation about loneliness. Above all, how loneliness is a common factor for young people in all countries. From loneliness to the intricacies of human relationships, two people began an intensive writing process to explore the many facets of human connection.\n\nFrom the Director:\n“Mira and Sameer find themselves surrounded by unspoken words. ‘The Earthquake’ delves into the essence of human relationships—our connections, routines, distances, and all the spaces in between. It asks us what it means to be truly seen or heard. What happens when we finally face the unspoken truths in our interpersonal relationships?”\n\n\n  \nCredits: \nPlaywrights: Marvin Krause and Samragni Dasgupta\nDirector: Shania Mathew \nCast: \nMira: Samragni Dasgupta\nSameer: Naman Roy \nThe Earthquake received the Internationaler Kulturprojekte Grant 2023 from the Landeshauptstadt München Kulturreferat (City of Munich). \nProduced by     \n\nWith Support from \n\n \n\n",
    "url": "https://bangaloreinternationalcentre.org/event/the-earthquake/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "The Earthquake"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-599.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "71024-1741453200-1741458600@bangaloreinternationalcentre.org",
    "name": "Mai Ri",
    "startDate": "2025-03-08T17:00:00+05:30",
    "endDate": "2025-03-08T18:30:00+05:30",
    "description": "Mai Ri beautifully captures the legacy and struggles of two extraordinary women in Indian classical music: Padmabhushan Gaanatapaswini Mogubai Kurdikar and her daughter, Padmavibhushan Gaanasaraswati Kishori Amonkar. Smt. Mogubai Kurdikar, an eminent vocalist of the Jaipur-Atrauli Gharana, navigated a time when women in music faced societal and institutional barriers. Through sheer dedication and artistic brilliance, she not only earned her place as one of the most revered figures in classical music but also ensured that her daughter and disciple, Kishori Amonkar, became one of the most influential vocalists of her era. \nConceptualized by noted vocalist Radhika Joshi, who carries forward this lineage as a disciple of Pt. Raghunandan Panshikar (a senior disciple of Kishori Amonkar and student of Mogubai Kurdikar), Mai Ri is a thematic presentation that brings alive their musical and personal journeys. Through a carefully curated selection of bandishes composed by Mai (Mogubai Ji) and Kishoritai, Radhika interweaves music with storytelling, sharing anecdotes from their lives that offer a rare glimpse into their artistic and emotional worlds. \nRadhika Joshi will be accompanied by Sumith Naik on Tabla and Surya Upadhyay on Harmonium, enriching the performance with their artistry. \nThis event is part of Unheard Narratives, BIC’s programmes to commemorate Women’s Day 2025. It celebrates the power of unheard narratives—spotlighting the resilience, artistry, and impact of women whose stories have shaped India’s cultural and social fabric. Through performances, talks, and films, we bring these voices to the forefront. \n",
    "url": "https://bangaloreinternationalcentre.org/event/mai-ri/",
    "keywords": [
      "Gender",
      "Heritage",
      "History",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Mai Ri"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-734.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70824-1740913200-1740918600@bangaloreinternationalcentre.org",
    "name": "Grandmas’ Grand Adventures",
    "startDate": "2025-03-02T11:00:00+05:30",
    "endDate": "2025-03-02T12:30:00+05:30",
    "description": "Nanammal and Kamalathal are as different as they come. Except for one thing – they both love to travel! \nJoin us for three stories, all about Nanammal and Kamalathal’s adventures through air, land and water as they set out to explore the world. \nWe’ll also do a fun activity at the end for you to share something about your own grandmas! \n",
    "url": "https://bangaloreinternationalcentre.org/event/grandmas-grand-adventures/",
    "keywords": [
      "Books",
      "Cities",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-722.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "70636-1740769200-1740774600@bangaloreinternationalcentre.org",
    "name": "Reeds and Keys",
    "startDate": "2025-02-28T19:00:00+05:30",
    "endDate": "2025-02-28T20:30:00+05:30",
    "description": "This is a BIC Elsewhere event at Sabha: An Arts and Crafts Shaale. \nDmitry Rasul-Kareyev, Principal Clarinet with the Orchestre de la Suisse Romande in Geneva, and renowned Russian organist, Ekaterina Melnikova, will perform a range of music from Johann Sebastian Bach in the 17th century to Darius Milhaud in the 20th century, with a combination of instruments and repertoire rarely heard in Bangalore. The mother and son duo will also perform one of Ekaterina Melnikova’s own compositions, “March” from Seasons. \n \n  \nAbout BIC Elsewhere: \nWhile the majority of our events find a home at our premises in Domlur, BIC Elsewhere represents our commitment to bringing conversations, arts, and culture directly to diverse audiences. Through this initiative, we collaborate with various venues, extending the reach of our events beyond our own space. These partnerships not only breathe life into our gatherings but also play a crucial role in cultivating an environment for the flourishing of arts and culture in the city. \nIn collaboration with Shankaraa Foundation and Sabha \n      \nSupported by Furtados and Steinway \n      \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/reeds-and-keys/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Sabha: An Arts and Crafts Shaale, No.44/A, Kamaraj Rd, Bharati Nagar, Shivaji Nagar, Bengaluru, Karnataka, 560042, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Reeds and Keys"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-726.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "70622-1740931200-1740936600@bangaloreinternationalcentre.org",
    "name": "Soliloquy With Tabla",
    "startDate": "2025-03-02T16:00:00+05:30",
    "endDate": "2025-03-02T17:30:00+05:30",
    "description": "The event highlights the experience of the age old practice of CHILLA (A 40 days intense practice, where the individual practices their art form without any outside world contact totally unaware of the time,day and night. The participant is allowed only to meet their Guru for timely advice if need be. The practice regime is absolutely challenging mentally, physically and emotionally. \nThe evening will also feature a traditional Tabla solo performance, followed by an interactive session where the audience can engage with the artist. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/soliloquy-with-tabla/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Soliloquy With Tabla"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-723.jpg"
  }
]