[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "78005-1756234800-1756242000@bangaloreinternationalcentre.org",
    "name": "Ramachandram Bhavayami",
    "startDate": "2025-08-26T19:00:00+05:30",
    "endDate": "2025-08-26T21:00:00+05:30",
    "description": "Ramachandram Bhavayami brings to life the rare and powerful women of the Ramayana, figures of immense strength, influence, and devotion, each deeply impacted by Rama’s actions yet honoring him with unwavering loyalty. \nThrough a unique blend of Bharatanatyam and spoken narration, the performance reimagines their voices, offering fresh insights into Rama Bhakti, resilience, and love. \nOne highlight is Ramya Ramnarayan’s striking portrayal of Soorpanakha. A masked, dramatically attired figure enters with bold, expressive movement in Thakkukku Dhikkukku (Adi). Her first sight of Rama (Lavanya Rama, Tyagaraja) is rendered with poignant music, delicate violin, and a compelling mix of desire, wonder, and vulnerability. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/ramachandram-bhavayami/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-6-6.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "77743-1756569600-1756576800@bangaloreinternationalcentre.org",
    "name": "And, Salt to Taste",
    "startDate": "2025-08-30T16:00:00+05:30",
    "endDate": "2025-08-30T18:00:00+05:30",
    "description": "Haven’t we all been to enough discussions where we have felt, “If only the moderator asked more interesting questions!” Whether it is a book launch, a post-screening chat with a filmmaker or a panel discussion on issues that matter to us, the role of the moderator is a critical but often taken-for-granted ingredient. A good moderator has a point of view and – like ‘salt to taste’ in any dish – makes the conversation deep, engaging and participative. Good moderators build context, make delicate – sometimes pointed – enquiries, navigate difficult terrains, potential conflicts and uncomfortable truths with grace and humour, all the while maintaining the integrity and forward momentum of the conversation. They also assess the temperature and shifting temperament of the room, and strive to be the audience’s representative, in turn challenging and coaxing those they are conversing with. \nIn this interactive workshop participants will explore various tools and techniques that will enable them to learn how to become an effective and critical moderator. Through exercises, group discussions and feedback, the workshop will impart practical knowledge on styles and strategies participants can choose from to suit both their personalities as well as the needs of a particular discussion. Finally, it will also provide tips to build confidence and cope with the last minute butterflies-in-the-stomach that is the worry of anyone who has ever – or never – walked onto a stage! \nIf you are keen on building a safe and inclusive space, and respectful and inspiring conversations, if you have an opinion but are interested in engaging with others’, if you are – or want to be – moderate in truth, temperate in style and obdurate in quest, then this workshop is for you. \n",
    "url": "https://bangaloreinternationalcentre.org/event/and-salt-to-taste/",
    "keywords": [
      "Language",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_salt.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77306-1755630000-1755635400@bangaloreinternationalcentre.org",
    "name": "Kalatra: The Eternal Consort",
    "startDate": "2025-08-19T19:00:00+05:30",
    "endDate": "2025-08-19T20:30:00+05:30",
    "description": "At the edge of legend and longing, two women wait for the same god. \nKalatra is a dance-theatre work by Keelaka Dance Company that reimagines the story of Murugan and his two consorts (Valli and Devanai) not as divine footnotes, but as women bound by love, rivalry, and fate. In the classical Hindu tradition, Murugan’s union with both is a symbol of completeness, of sacred balance. But in Sri Lanka’s local poetic lore, a quieter, more human story unfolds. \nThe journey begins in Kataragama, where Murugan is worshipped not just by Hindus, but by Buddhists, Muslims, and indigenous tribes. Each finds a reflection of their own devotion in his form. Here, the story of Valli takes root, even as the shrine of Devanai turns away. Locals say she cannot bear to see her lord walk each night to Valli’s side. \nBlending Bharatanatyam and contemporary dance, Kalatra draws from mythology, regional poetry, and imagined memory. Presented by the Keelaka Dance Company, conceived by Jyotsna Shourie and Aneesha Grover, with music by Daniel B George, OS Arun, and Madstarbase. \nA performance where myth breathes, and devotion speaks! \nIn Collaboration with: \n \n  \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/kalatra-the-eternal-consort/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-23-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "78087-1755973800-1755979200@bangaloreinternationalcentre.org",
    "name": "The Kaveri River",
    "startDate": "2025-08-23T18:30:00+05:30",
    "endDate": "2025-08-23T20:00:00+05:30",
    "description": "Maya Jayapal’s book, Kaveri: The Journey of a River, traces the author’s journey down the Kaveri river, with her father in the first half, and alone in the second half, after he passed. With charming illustrations by Rohit Bhasi, the book takes the reader from Talakaveri to Poompuhar with historical and religious sites, people, culture, flora and fauna, and much more along the way. \nThe author of two books on Bangalore, one on Djakarta and one on Singapore, cities where she has lived, Maya Jayapal says, “I chose to write my story of a river as I got tired of writing about cities. I had just finished writing about Bangalore which is changing too rapidly for my liking. I wanted to discover something more natural, something more ancient, something that had been an inspiration for civilisations, something that embodied life eternal, life giving and life sustaining. And so, I chose a river, a river that flows in my own backyard, so to speak.” \n  \nImage Credit\nBook cover illustration by Rohit Bhasi.  \n  \nPresented by the Jayapal family \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-kaveri-river/",
    "keywords": [
      "Books",
      "Culture",
      "Environment",
      "Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/maya-T.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77398-1755889200-1755893700@bangaloreinternationalcentre.org",
    "name": "Deva Nartana",
    "startDate": "2025-08-22T19:00:00+05:30",
    "endDate": "2025-08-22T20:15:00+05:30",
    "description": "Ten avatars. Four styles. One stage. \nDeva Nartana is a deeply imaginative re-telling of the ten Avataras of Vishnu, interpreted through four classical dance traditions: Bharatanatyam, Mohiniattam, Odissi, and Kathak. Rooted in the Hindu view on the cyclical nature of creation, preservation, and dissolution, the production explores each incarnation as both divine narrative and timeless metaphor. It is both homage and offering: a celebration of stories that continue to shape how we understand change, time, and divinity. \nPerformed by Saji Menon (Mohiniattam), Namrata Mehta (Odissi), Bhakti Deshpande (Kathak), and Prachi Saathi (Bharatanatyam), Deva Nartana unfolds as a rich visual tapestry with each dancer bringing her own form, vocabulary, and devotion into conversation with the others. The performance uses original music composed and arranged by twelve acclaimed musicians under the direction of Satish Krishnamurthy.  \nThis production is a rare confluence of traditions, myths and devotion.  \nCredits: \nMusic Direction and Arrangement: Satish Krishnamurthy \nMusic composition:\nSatish Krishnamurthy\nManoj Desai\nJateen Sahoo \nVocals:\nManoj Desai\nSatish Venkatesh\nJateen Sahoo\nSangeet Murli \nPercussion:\nMaddalam & Edakkya – Nambishan Sir\nMridangam, Ghatam & Ganjira – Satish Krishnamurthy\nMardala – Rohan Dahale\nTabla – Vivek Mishra\nPakhawaj – Omkar Dalvi\nFlute – Vijay Tambe\nSarangi – Sangeet Mishra\nViolin – ShivaKumar Anantharaman\nSound Engineer – Tapan Da, Trio Studio \nResearch Guidance:\nRishiraj Pathak\nPartho Pawgi \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/deva-nartana/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-29-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77112-1755802800-1755808200@bangaloreinternationalcentre.org",
    "name": "Dual Margam 5",
    "startDate": "2025-08-21T19:00:00+05:30",
    "endDate": "2025-08-21T20:30:00+05:30",
    "description": "When rhythm takes flight and grace stands still, something timeless begins to move. \nOn our next evening of Dual Margam, two powerful classical traditions come together in a rare conversation of contrast and convergence. The soaring, drum-led dynamism of Pung Cholom from Manipur, and the grounded, sculptural flow of Odissi from Odisha. \nTraditionally, in Pung Cholom, dancers become percussionists: leaping, spinning, and drumming in mid-air with ecstatic energy and astonishing control. In contrast, Odissi unfolds in slow, sinuous arcs, where each gesture and every glance evokes poetry, myth, and devotion. \nIn this special performance, the two rhythmic traditions of Pung Cholom and Odissi are interwoven and contrasted: bringing fire to form, and pulse to poetry as the dances come together with complementary aesthetics. \nThe first in a two-part Odissi-Manipuri conversation, this evening unfolds through two male bodies and will be revisited next month through the feminine form. \nThe Dual Margam series curates two classical dance forms of India to highlight their similarities and differences. The solo performances honour traditional repertoire (the Margam), while the duet will juxtapose each unique form with another. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dual-margam-5/",
    "keywords": [
      "Dance",
      "Heritage",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_DM5-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "77886-1757755800-1757872800@bangaloreinternationalcentre.org",
    "name": "Storytelling Theatre Workshop",
    "startDate": "2025-09-13T09:30:00+05:30",
    "endDate": "2025-09-14T18:00:00+05:30",
    "description": "Storytelling is as old as mankind itself. In recent years there has been a resurgence in Storytelling, applying the narrative process in a wide range of settings, drawing from a variety of origins: in therapy, in community development, in toastmasters clubs, in management, in personal growth labs and so on. It may well become something of a bandwagon soon. \nBangalore Little Theatre (BLT) has developed a unique genre of storytelling theatre, presenting fully rehearsed performances, but in storytelling format. It is called the Courtyard programme. The main features of the programme are:\n– Performances in a variety of spaces, not necessarily a stage\n– Usually smaller numbers, in intimate surroundings\n– Typically two actors – even one as sometimes done\n– No staging requirements of sets, costumes, lights, etc. Just good performance! \nWhat will not be easily seen about Storytelling Theatre is that it requires a specialized approach to content and scripting and, therefore, a specialized technique in performance. Those who have seen BLT performances such as Robi’s Garden and Shakespeare By Any Other Name will understand this readily. \nStorytelling Theatre in India is a relatively new form that is still evolving. Participants in the workshop will be contributing to its development. \nWho is this workshop for? \nThis workshop is meant for those who are already well into the theatre arts and are committed to future work in either theatre making or performance, but with a special interest in Storytelling Theatre. It is not meant for mere “orientation” or armchair exploration. It will be a doing workshop, covering such objectives as:\n– To examine and appreciate different forms of Storytelling\n– To look at the special needs of storytelling theatre\n– To explore the unique skill sets needed in the actor for the above – in body, voice and mind\n– To make a beginning in creating a community of theatre storytellers, committed to developing the form.\n– The last objective is significant. It is accepted that there can be a limited amount of coverage in a two-day workshop. We hope to continue as a community of storytelling theatre makers. \nPlease note: The workshop will be for a limited number of participants. All interested in the workshop are requested to register early. BIC reserves the right to finalize the list of participants. There will be no walk-in registrations at the workshop.  \n",
    "url": "https://bangaloreinternationalcentre.org/event/storytelling-theatre-workshop/",
    "keywords": [
      "Education",
      "Performing Arts",
      "Theatre",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Storytelling Theatre Workshop"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-1-7.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "77985-1756638000-1756643400@bangaloreinternationalcentre.org",
    "name": "Ganga Maiya",
    "startDate": "2025-08-31T11:00:00+05:30",
    "endDate": "2025-08-31T12:30:00+05:30",
    "description": "It was as only as recent as 2016 on a visit to the Dhrupad Mela in Benares that the Esperanto project discovered the mystical beauty of the river Ganga and the ghats of the world’s oldest living city and have been since mesmerised by its spirit and are visiting annually. \nThe connect with the peace pervading the banks of the Ganga has given rise to new music and they have been inspired to create a new bouquet of music. This album is named ‘Boat on the River’ a mystical representation of human life as a living, loving boat, that floats on forever. \nThis music in turn serendipitously connected them with the famous artist from Kolkata Asit Poddar who has also been visiting Benares and painting many works based on his muse awakened there. The paintings and music combine in music videos to express a glimpse of the mystique of Ganga Maiya. The album is proposed to be released at the Kala Yatra festival at Kashi on march 8, 2024. The group have embarked on a journey to share this experience around India and worldwide. They now conduct Art &amp; Music Festivals on the Benares Ghats and other cities called Kala Yatri. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/ganga-maiya/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Ganga Maiya"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-3-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "77859-1756405800-1756412100@bangaloreinternationalcentre.org",
    "name": "مقدس سفر | Holy Rights",
    "startDate": "2025-08-28T18:30:00+05:30",
    "endDate": "2025-08-28T20:15:00+05:30",
    "description": "53 minutes | Urdu with English subtitles | 2020 | India \nAs a woman’s faith becomes her fire, what can stand in her way? \nIn the heart of Bhopal, where tradition runs deep and silence often surrounds resistance, Safia, a devout Muslim woman, quietly begins a revolution. When her husband invokes triple talaq and divorces her in her own absence, she turns to seek justice.  \nHoly Rights is an intimate, unflinching documentary tracing Safia’s courageous journey as she navigates uncharted territory, confronting resistance and reshaping narratives that profoundly impact women’s lives. She challenges centuries of patriarchal tradition by training to become a Qazi – an interpreter and authority of Islamic personal law. Her decision, rooted in faith and a deep sense of justice, sets in motion a ripple effect among other Muslim women, who begin to reimagine their place in both religion and society. \nThe film unfolds over four years capturing landmark political shifts, the fight against the practice of triple talaq, and the quiet courage of women who refuse to be spoken for by religious authorities, political actors, or even well-meaning allies. \nThe screening will be followed by a discussion with filmmaker Farha Khatun and producer Priyanka More, who will be joining us online, and a Q&A with the audience. \nHere is the trailer of the film. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/%d9%85%d9%82%d8%af%d8%b3-%d8%b3%d9%81%d8%b1-holy-rights/",
    "keywords": [
      "Faith",
      "Film",
      "Gender",
      "Governance",
      "Law"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ur",
    "workPresented": {
      "@type": "Movie",
      "name": "مقدس سفر | Holy Rights"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-2-4.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "78164-1756339200-1756425599@bangaloreinternationalcentre.org",
    "name": "Mozart Requiem",
    "startDate": "2025-08-28T05:30:00+05:30",
    "endDate": "2025-08-29T05:30:00+05:30",
    "description": "About the centrepiece of the evening – Requiem in D minor K. 626 \nMozart’s Requiem is a choral masterpiece whose genesis is shrouded in mystery – one that makes the piece even more fascinating and emotionally stirring. Mozart was not in the best state of mind when he received an anonymous commission to compose a Requiem Mass. His health was deteriorating, and he believed he had been cursed to write a requiem as a ‘swansong’ for himself, because he was sure he was about to die. It was in early July 1791 that an ‘unknown, gray stranger’ turned up at the composer’s door saying he represented someone who wanted a Requiem from Mozart on the understanding that he does not seek to learn the identity of his patron. Spooked by the commission, Mozart threw himself obsessively into the work. But it was all too much. He was only able to complete the Requiem and Kyrie movements and managed to sketch the voice parts and bass lines for the Dies Irae through to the Hostias.  \nMozart died aged 35 on 5 December 1791, before he could complete the work. Payment had already been received, and Mozart’s widow Constanze feared that if the work was handed over incomplete, the patron would want his money back. Mozart’s pupil Süssmayer, to whom the composer had given detailed instructions about finishing it, completed the unfinished movements. Süssmayer copied the entire completed score in his own hand – making it virtually impossible to determine who wrote what – and gave it to the stranger. So was the ‘mysterious stranger’ Mozart’s rival Antonio Salieri, much slandered villain of the film Amadeus? Almost certainly not. It was Anton Leitgeb, son of the mayor of Vienna and the valet of Count Franz von Walsegg-Stuppach, who already had acquired the reputation of palming other people’s music off as his own. The Count was hoping to use Mozart’s Requiem to commemorate his late wife, Anna. It took a full decade before Constanze was able to persuade Walsegg to acknowledge Mozart as the Requiem’s true composer. Regardless of who wrote which parts of the Requiem, it still sounds wonderful to most of us.  \nAnd let us give Beethoven the final word on the matter: ‘If Mozart did not write the music, then the man who wrote it was a Mozart.’ \n \n  \nImage Credit:\nThumbnail and Poster: Portrait of Mozart from the Berliner Philharmoniker Digital Concert Hall \n  \nIn collaboration with: \n        \nPresented by the International Music and Arts Society \n \nSupported by Furtados and Steinway \n       \n",
    "url": "https://bangaloreinternationalcentre.org/event/mozart-requiem/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Mozart Requiem"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/mozart.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77847-1755714600-1755720000@bangaloreinternationalcentre.org",
    "name": "Tipu’s Tiger & the Empire’s Trophy Room",
    "startDate": "2025-08-20T18:30:00+05:30",
    "endDate": "2025-08-20T20:00:00+05:30",
    "description": "Far from home, polished and perched, lie countless Indian artefacts.  \nStories of their acquisition, passed down through generations, often obscure the brutal realities of conquest, coercion and plunder. Taken as prized trophies during colonial rule, these objects have sat in museums and private collections for centuries.  \nIn this talk, journalist and author Shyam Bhatia brings a deeply personal story to light: the journey of a centuries-old Indian artefact passed down through a British military family. Through this single heirloom, he opens up the layered questions of cultural memory, ownership, and the unfinished business of historical justice. \nFollowing the talk, Bhatia will be in conversation with art historian and curator Dr Arnika Ahldag, exploring the roles institutions and individuals play in shaping and restoring the narratives of the past. \nThis evening invites reflection, curiosity, and conversation that lingers beyond the final word. Bring your questions to the audience Q&A at the end of the session!  \n",
    "url": "https://bangaloreinternationalcentre.org/event/tipus-tiger-the-empires-trophy-room/",
    "keywords": [
      "Culture",
      "Heritage",
      "History"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-5-4.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77749-1755255600-1755720000@bangaloreinternationalcentre.org",
    "name": "River Weaves",
    "startDate": "2025-08-15T11:00:00+05:30",
    "endDate": "2025-08-20T20:00:00+05:30",
    "description": "Exhibition Opening: 11:00 am | Friday, 15 August\nTimings: 11:00 am – 8:00 pm\nExhibition on show until Wednesday, 20 August \nWalkthroughs:\nFri, Aug 15 | 5:30 pm\nSat, Aug 16 | 12:00 pm & 5:30 pm\nSun, Aug 17 | 12:00 pm & 5:30 pm\nMon, Aug 18 | 12:00 pm & 5:30 pm\nTue, Aug 19 | 12:00 pm & 5:30 pm\nWed, Aug 20 | 12:00pm \nPanel Discussion:\nHandlooms—Past, Present and Future: Fri, 15 Aug | 11:30 am – 1 pm\nLaila Tyabji, Ratna Krishna Kumar, Nandita Das, Chandra Jain & Shoba Narayan\nRSVP here \nRiver Weaves: Brocades of Banaras offers an immersive experience. \nBanarasi brocade isn’t any old textile, but rather a living archive of artistry, memory, and devotion. River Weaves invites you into this world, where each thread tells a story of beauty shaped by generations of skill. \nConceived by craft champion Chandra Jain and brought to life by Siddhartha Das Studio, this immersive exhibition explores the richness of Banaras handloom tradition. From luminous motifs echoing Mughal gardens and temple carvings, to rare sarees dyed with natural pigments after 125 years, River Weaves traces a powerful journey of revival. \nThe exhibition moves beyond finished fabrics to reveal the unseen labour (degumming, spinning, dyeing, weaving) and centres the voices of the weavers who have quietly and dutifully carried this tradition forward for centuries. \nBut this legacy faces a fragile future. With fewer artisans able to continue and the next generation drifting away, the craft stands at a crossroads. River Weaves holds space for reflection, and more importantly, for hope. \nThe exhibition is guided by Chandra Jain’s vision and decades-long dedication to reviving Indian handloom traditions. Curated by Chiara Nath and Siddhartha Das of Siddhartha Das Studio, an award-winning, multi-disciplinary practice known for powerful storytelling of cultural heritage. Their design showcases each Banarasi brocade on display as a tribute not only to exquisite design, but to a way of life rooted in patience, precision, and pride. \nThis event is far more than your average exhibition. It is a call to action. For if we do not celebrate our traditional crafts, who will? \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/river-weaves/",
    "keywords": [
      "Culture",
      "Design",
      "Heritage",
      "Textiles",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-27-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77225-1756492200-1756497600@bangaloreinternationalcentre.org",
    "name": "Seven Ways to See the World",
    "startDate": "2025-08-29T18:30:00+05:30",
    "endDate": "2025-08-29T20:00:00+05:30",
    "description": "When do we dream up stories? \nThis Is How I Draw, published by Pratham Books, invites you inside the curious, creative minds of seven of India’s most beloved picture-book creators. With warmth and honesty, the artists open up their sketchbooks (and their thoughts) to show us how stories are born from everyday life, quiet moments, wild ideas, and everything in between. \nA perfect event for anyone who’s ever picked up a pencil and wondered, what if…? \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/seven-ways-to-see-the-world/",
    "keywords": [
      "Books",
      "Design",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-32-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "78079-1755973800-1755979200@bangaloreinternationalcentre.org",
    "name": "Assembling Cinematic Bombay",
    "startDate": "2025-08-23T18:30:00+05:30",
    "endDate": "2025-08-23T20:00:00+05:30",
    "description": "A city is known by the tales of its inhabitants. And few cities have been captured on screen with as much intimacy and complexity as Bombay.  \nIn this evocative lecture, film scholar Ranjani Mazumdar explores the layered portrait of the city as seen in films like Ritesh Batra’s Lunch Box (2013) and Photograph (2019), Milind Dhaimade’s Tu Hai Mera Sunday (2016), Kiran Rao’s Dhobi Ghat (2010), and Rohena Gera’s Sir (2018).  \nThrough quiet details, fading memories, and the rhythm of everyday life, these films map a metropolis that is both deeply personal and constantly changing. With her deep insight into cinema, technology, and urban life, Mazumdar traces how filmmakers evoke the city’s past and present while imagining its future.  \nThe event concludes with a Q&A, offering space for reflection and conversation. \nThis lecture is a part of Azim Premji University’s Public Lecture Series. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/assembling-cinematic-bombay/",
    "keywords": [
      "Culture",
      "Design",
      "Film",
      "Photography",
      "Society",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_ACB.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "77728-1755801000-1755808200@bangaloreinternationalcentre.org",
    "name": "My Radio My Life",
    "startDate": "2025-08-21T18:30:00+05:30",
    "endDate": "2025-08-21T20:30:00+05:30",
    "description": "67 minutes | English, Hindi and Marathi with subtitles | India | 2023 \n67 minutes | English, Hindi and Marathi with subtitles | India | 2023 \nBefore bluelight and bluetooth, there was the radio.  \nA glowing dial, a familiar voice, and a world unfolding through sound alone. This unique film takes us back to a near-forgotten era, tracing the deeply personal stories of those whose lives were shaped by the radio’s quiet power. \nFrom a passionate restorer’s vintage museum in Bengaluru to the broadcast of the Apollo 11 moon landing, this film is a heartfelt ode to radio’s enduring legacy. We meet cricket fans, music lovers, librarians, students and announcers, all connected by a common frequency of memory, curiosity, and wonder. \nScreened at over 80 film festivals in 36 countries and recognized by UNESCO for World Radio Day, My Radio My Life celebrates the progress of technology through deeply human connections. The film has also been on discussion programs featured on AIR Pune, AIR Rajkot and Vividh Bharati. \nThe screening will be followed by a talk and Q&A with the audience.  \nThis event is a quiet invitation to tune in, once again. \nLink to the trailer \n",
    "url": "https://bangaloreinternationalcentre.org/event/my-radio-my-life/",
    "keywords": [
      "Film",
      "Heritage",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "mr",
    "workPresented": {
      "@type": "Movie",
      "name": "My Radio My Life"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-1-8.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "78014-1755946800-1755951300@bangaloreinternationalcentre.org",
    "name": "Pooja Kunita",
    "startDate": "2025-08-23T11:00:00+05:30",
    "endDate": "2025-08-23T12:15:00+05:30",
    "description": "Pooja Kunita is a moving act of devotion where acrobatics meet ritual, and every step carries a prayer. Rooted in the folk traditions of Mandya, this vibrant performance is a celebration of spiritual connection, ancestral memory, and communal joy. \nPresented by Sri Vinayaka Yuvakara Kala Balaga and led by K.B. Swamy, the 60-minute experience invites audiences into a mesmerising journey from its richly symbolic beginnings to its breathtaking finale. A traditional Sutradar sets the stage, guiding us through the hallowed history, cultural context, and ceremonial gestures that shape this living art form. \nAs sacred chants rise and prayer frames are adorned, the performance builds with the pulse of the traditional rhythms of the Tamte, Tarsi and Nagarai. In a truly immersive experience, the audience will be taught hejjes (traditional dance steps) before the final performance.  \nIn a culmination of prayer and performance, this event offers a unique chance to connect with a living tradition. \nThis is the fourth performance of our series BIC Jaanapada. \nBIC Jaanapada is a bi-monthly (once in two months) series celebrating Karnataka’s folk traditions through the lens of regional identity and cultural preservation. Curated in collaboration with Tvarita Arts Collective India, the program combines scholarly discourse with live performances to explore the deep connections between geography and artistic expression. Through demonstrations, performances, and academic discussions, each session examines how landscape and local culture have shaped these distinct artistic practices. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/pooja-kunita/",
    "keywords": [
      "Dance",
      "Faith",
      "Heritage",
      "Music",
      "Performing Arts",
      "Society",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Pooja Kunita"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-jaanapada.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "77173-1756483200-1756488600@bangaloreinternationalcentre.org",
    "name": "The Worlds We Build",
    "startDate": "2025-08-29T16:00:00+05:30",
    "endDate": "2025-08-29T17:30:00+05:30",
    "description": "Five picture-book makers. One room full of ideas. \nStep into the imaginative world of children’s book illustration with Deepa Balsavar, Ogin Nayam, Pankaj Saikia, Priya Kuriyan, and Rajiv Eipe. All master storytellers who draw what they see, feel, and dream. \nThis hands-on workshop offers a rare glimpse into their sketchbooks and creative journeys. Learn how everyday moments become unforgettable visuals, how characters come to life with just a few strokes of your brush, and how illustration transforms into storytelling. \nThe session includes interactive demos, a Q&A with the artists, and a guided drawing activity that invites you to look closely, draw freely, and think like a storyteller. \nJoin us and learn how to make your pictures worth more than a thousand words! \nPlease note: \n\nA limited number of slots are available for the workshop.\nThe workshop is ideal for illustrators, designers, librarians and educators–anyone who works with picture books.\nTo be considered for a seat, please submit your work/portfolio through the RSVP form.\nAll mediums are welcome, but submissions should be compiled into 1 PDF and under 10MB.\nParticipants will be selected based on the work/ portfolio shared in this form.\nPlease ensure details and links attached in the form are accessible and correct.\nIf selected, please carry your preferred drawing materials and a sketchbook with you.\n\nSubmission Deadline: August 15, 9:00 PM IST\nSelected participants will be notified on August 22. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-worlds-we-build/",
    "keywords": [
      "Books",
      "Design",
      "Visual Arts",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_TWWB.jpg"
  }
]