[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75530-1750964400-1750969800@bangaloreinternationalcentre.org",
    "name": "Madhura Murali",
    "startDate": "2025-06-26T19:00:00+05:30",
    "endDate": "2025-06-26T20:30:00+05:30",
    "description": "Meenakshi Srinivasan will be presenting 4 musical gems, centred around Lord Shri Krishna: \nINVOCATION\nKrishna – Born as a Saviour\nVerse from the Shrimad Bhagavatam followed by a composition of Swathi\nThirunal \nVARNAM\nKrishna – The embodiment of Supreme Consciousness\nComposed by Dr. M.Balamuralikrishna \nPADAM\nKrishna – Longing for His Supreme Beloved\nPoetry by Kshetragnya\nMusic by Kaniyal Hariprasad \nTILLANA\nAn offering\nComposed by Dr. M.Balamuralikrishna \nThis is the sixth edition of the ‘All For Dance’ series presented by Kalavaahini in association with BIC curated by Malavika Sarukkai. The ‘All For Dance’ series is presented every quarter at BIC to spotlight some of the best of classical dance from across India. The event is managed by Shreya Nagarajan Singh Arts Development Consultancy. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/madhura-murali/",
    "keywords": [
      "Culture",
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-895.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "75415-1750789800-1750795200@bangaloreinternationalcentre.org",
    "name": "The Unreserved",
    "startDate": "2025-06-24T18:30:00+05:30",
    "endDate": "2025-06-24T20:00:00+05:30",
    "description": "60 minutes | Hindi with English subtitles | 2017 | India \nThe Unreserved is an intimate exploration of the lives of passengers who travel in the Unreserved Compartment—the most economical way to journey across India via the Indian Railways. Through candid conversations and personal stories, the film captures the aspirations, struggles, and perspectives of these travelers. \nSince its release, The Unreserved has been showcased at several notable festivals, including Film Southasia 2017 (Nepal), the EFF BRICS Film Festival 2017 (Russia), the South Asian International Docufest 2018 (USA), and the PAME Film and Music Festival 2020 (Nepal). Most recently, it was screened at Screen Southasia 2025 (Online). The film was honoured with the National Film Award for Best On-Location Sound at the 65th National Film Awards in 2018. \nThe screening will be followed by a conversation between the Director, Samarth Mahajan and Mahima Venugopalan which will be followed by a Q&A session with the audience. \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-unreserved/",
    "keywords": [
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "The Unreserved"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-892.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75595-1750590000-1750595400@bangaloreinternationalcentre.org",
    "name": "What's in a Name?",
    "startDate": "2025-06-22T11:00:00+05:30",
    "endDate": "2025-06-22T12:30:00+05:30",
    "description": "Some names are common. Some, a rarity. Some names are short. Some, long. Some names are easy to spell but some hard to pronounce. But every name has a story. Your name too. Every name carries an identity. It traces your roots. Your name is the first thing asked about you. And it makes you you! \nCome, dive into two stories – The Village with a Long Name and The Name Jar through an interactive read-aloud followed by a fun naming ceremony that will leave you in splits! \n",
    "url": "https://bangaloreinternationalcentre.org/event/whats-in-a-name/",
    "keywords": [
      "Books",
      "Language",
      "Literature",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-900.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "74835-1750359600-1750365000@bangaloreinternationalcentre.org",
    "name": "IT IS YOU",
    "startDate": "2025-06-19T19:00:00+05:30",
    "endDate": "2025-06-19T20:30:00+05:30",
    "description": "Ever felt trapped by unchosen rules? Silenced your voice because “that’s how it’s done”? What if your nods and obedience weren’t entirely yours? \nIT IS YOU invites you to explore beyond roles, rituals, and language. This immersive experience follows a carefully crafted narrative—two figures, trained in Kalakshetra (Manipur), Koodiyattam, and contemporary movement, embark on a journey of tension and harmony. Yet within this structure, there’s no fixed meaning. Through movement and a layered, resonant soundscape, you become the co-creator, weaving your emotions and memories into their story.\nWithout spoken words, the piece lives in the space between the performers’ intent and your introspection. \nWritten by Vivek Vijayakumaran\nCreated, Devised and Performed by Pangambam Tyson Meitei & Vivek Vijayakumaran\nDuration : 65 Min\nMusic and Sound Design : Chaoba Thiyam\nMusic Operated : Abhitej Gupta\nLight Design and Execution  : Arun DT\nCostume Design : Aastha & Aloka D’souza\nMarketing and Publicity : Swati Shukla & Gana\nProduced by Our Theatre Collective, Bangalore in collaboration with Kalakshetra Manipur\n \nSpecial Thanks \nRukmini Iyer, Ima Sabitri, Heisnam Tomba, Abhitej Gupta,Laxmi Priya, Sachin Ravindran, Sachin Gurjalee, Garima Mishra, Nitin Sharma, Veena Basavarajaiah, Apoorva Arthur, Ajiithlal, Sreehari Ajith, Leya Mammen, Suranjay Patil, Khumukcham Rahul, Lanchingba Laishram, Chanakya Vyas, and Infinite Souls Farm and Artists Retreat \n Supported by: \n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/it-is-you/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "IT IS YOU"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-884.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "75345-1750608000-1750613400@bangaloreinternationalcentre.org",
    "name": "More Films for Freedom",
    "startDate": "2025-06-22T16:00:00+05:30",
    "endDate": "2025-06-22T17:30:00+05:30",
    "description": "As part of BIC’s Pride Programs, we brings to you five short films that shine a light on the hurdles faced by queer people around the globe as they struggle for existence. These films, selected from British Council’s Five Films for Freedom Collection, explore the stories of those who live their lives unabashedly, enduring injustice yet fostering communities of resilience. \nFilm Schedule: \nThe Men Who Speak Gayle\n11 mins | English and Gayle with English subtitles | Andrew Brukman | UK with South African collaboration | 2020\nYoung drag performer Nathan is one of the last people to speak Gayle – a secret language the gay community were forced to invent during Apartheid. He finds out about Louis, an original Gayle speaker living in a conservative desert town in South Africa and wants to put on a performance with him, but don’t know how the town will react. \nBaba\n18 mins | English and Arabic with English subtitles | Sam Arbor, Adam Ali | UK with Libyan collaboration | 2021\nLiving in the tunnels beneath Tripoli a queer Libyan teenager, Britannia, dreams of escape to a better life, but an unexpected discovery forces him to question whether to stay or flee from his homeland and his friends. (Winner Iris Prize 2021) \nPrayers for Sweet Waters\n16 mins | English, Kirundi and French with English subtitles| Elijah Ndoumbe | UK with South African collaboration | 2021\nA submergence into the vivid realities of three Transgender sex workers living in Cape Town, South Africa during the COVID-19 pandemic. \nThe Enchanted Day of the Eres\n12 mins | Brazilian Portuguese with English subtitles | Coraci Ruiz, Julio Matos | UK with Brazilian collaboration | 2022\nBlending animation and actuality with incredible access, this documentary tells the story of an unusual birthday party. It’s a party for the ‘Erês’ – spirits venerated by the religion of Candomblé, one of the few Afro-Brazilian religions that welcomes the LGBTQIA+ community. \nA Bird Called Memory\n15 mins | Brazilian Portuguese with English subtitles | Leonard Martinelli | UK with Brazilian collaboration | 2022\nLua, a trans woman, has lost her pet bird in the streets of Rio de Janeiro, a city that can often be a hostile place for transgendered people. As Lua journeys to find Memory, we are exposed to streets full of contradictions. When Lua begins to sing the songs of the musicals that Memory and her often watched together, music and cinema become a space of resistance and hope. \n \nThe British Council is the United Kingdom’s international organization for cultural relations and educational opportunities, operating in over 100 countries. It promotes the UK and the English language, fosters cultural and educational exchange, and works to improve people’s lives through access to education, skills, and cultural opportunities. \nThis year, BIC celebrates Pride Month through a series of programs that embrace Queerness as it is — unconforming, changing and alternative. Every program aims to embody the fluid and non-normative possibilities of existence that queerness creates, while fostering a community that welcomes difference in an unbending society, whether that be through new models of living or unique modes of self-expression. Pride, Insists Upon Itself! \n",
    "url": "https://bangaloreinternationalcentre.org/event/more-films-for-freedom/",
    "keywords": [
      "Film",
      "Gender",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "More Films for Freedom"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-890.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75274-1750530600-1750536000@bangaloreinternationalcentre.org",
    "name": "Sustainable Development & Public Policy",
    "startDate": "2025-06-21T18:30:00+05:30",
    "endDate": "2025-06-21T20:00:00+05:30",
    "description": "Institutions and Public Policy for India’s Sustainable Development – Perspectives on Governance, Technology, and Finance, is an edited volume in honour of Professor Vinod Vyasulu (Edited by – Sukhpal Singh, Jyotsna Jha, A. Indira and A. V. Arunkumar). \nThe book addresses one of the most urgent challenges of our time – sustainable development. Across the globe economies are grappling with the combined pressures of climate change, inequality, and unsustainable growth. Basic needs remain unmet for large sections of the population, prompting a growing recognition that we must rethink how we define and pursue development. Sustainability is no longer a peripheral concern—it is central, complex, and evolving, requiring new approaches and frameworks. \nThe book brings together diverse perspectives on the critical drivers of sustainable development, namely, governance through institutions, readiness through technology and accessibility to finance. While technology is often seen as a key enabler, its transformative potential depends deeply on the institutional and policy environment in which it is embedded. Institutions—formal and informal—shape development outcomes, and public policy plays a crucial role in aligning these efforts with sustainability goals. \nFocusing on the Indian context, the book event will have eminent panel members exploring the three interconnected themes of (1) Institutions and Development; (2) Technology and Innovation; and (3) Policy and Governance. \nWe look forward to an engaging conversation as we reflect on the ideas in the volume and their relevance for policy, research, and practice. \n",
    "url": "https://bangaloreinternationalcentre.org/event/sustainable-development-public-policy/",
    "keywords": [
      "Policy & Regulation",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-887.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75390-1750444200-1750449600@bangaloreinternationalcentre.org",
    "name": "Iron Lady, Velvet Glove?",
    "startDate": "2025-06-20T18:30:00+05:30",
    "endDate": "2025-06-20T20:00:00+05:30",
    "description": "Was Indira Gandhi a pragmatic nation-builder or an authoritarian disruptor or both? Historian Srinath Raghavan’s new book, Indira Gandhi: The Years That Transformed India, explores her complex legacy, from her central role in reshaping India’s political structure to the controversial imposition of the Emergency. \nIn this conversation with constitutional scholar Arun Thiruvengadam, the session will explore the making and unmaking of democratic institutions, the long shadow of the Emergency, and the resonances of Indira’s era in the India of today. A Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/iron-lady-velvet-glove/",
    "keywords": [
      "Books",
      "Governance",
      "Law",
      "Nonfiction",
      "Policy & Regulation",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-893.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75057-1750357800-1750363200@bangaloreinternationalcentre.org",
    "name": "Adolescence & Algorithms",
    "startDate": "2025-06-19T18:30:00+05:30",
    "endDate": "2025-06-19T20:00:00+05:30",
    "description": "The years between ages 10 and 19 are marked by intense physiological, psychological, and social change. Adding to the challenges of this already turbulent phase are mobile devices and social media. These platforms often exploit insecurities, creating echo chambers and negative feedback loops. While digital life can connect us, it also has the power to isolate. The TV series Adolescence highlights the potentially dangerous consequences of these overlapping forces. \nIn this conversation, a panel of experts, drawing from both professional knowledge and lived experience, explores what adolescence looks like in the age of social media, particularly in urban India. Taking the TV show as a starting point, the discussion will look at the realities young people face today and consider how parents, schools, and other adults can help support individual and collective well-being. \n",
    "url": "https://bangaloreinternationalcentre.org/event/adolescence-algorithms/",
    "keywords": [
      "Health & Wellness",
      "Public Health",
      "Science",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-885.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "74793-1750532400-1750537800@bangaloreinternationalcentre.org",
    "name": "InstaRagam",
    "startDate": "2025-06-21T19:00:00+05:30",
    "endDate": "2025-06-21T20:30:00+05:30",
    "description": "How do we each feel a Raga? While Western classical music often associates major scales with happiness and minor scales with sadness, Indian Ragas evoke a wide spectrum of emotions—unique to each listener. Could a Raga that brings joy to one person stir a different emotion in another? \nIs there hidden information in the space between two notes? While the twelve notes of the well-tempered scale were standardized only in the 18th century, Indian classical music has long embraced microtones—subtle pitches between the familiar notes. Can the human mind truly perceive these shades of sound? \nAnd must we always stay within the bounds of musical grammar? What happens when we take a set of notes and let them breathe, transform, and find their own flow? \nThis World Music Day, join us for Insta-Ragam—an immersive exploration of Raga structures, followed by a live session where you get to make music with the artists. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/instaragam/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "InstaRagam"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-891.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75539-1750962600-1750968000@bangaloreinternationalcentre.org",
    "name": "Chief Justice Ahmadi & the Idea of India",
    "startDate": "2025-06-26T18:30:00+05:30",
    "endDate": "2025-06-26T20:00:00+05:30",
    "description": "In the 1940s, a rebellious teenager tore through the bustling lanes of Surat’s Dawoodi Bohra mohalla on his rickety bicycle, noisily jangling his rusty bell. Obsessed with cricket, mischief and pranks, nobody could have predicted then that young Aziz Mushabber Ahmadi would one day stride across the glittering halls of the Rashtrapati Bhavan to swear in as the third Muslim Chief Justice of India. \nThis is the story of Justice A.M. Ahmadi —26th Chief Justice of India — who served during some of India’s most turbulent political and legal moments. From his powerful dissent in the Babri Masjid case as he withstood immense political pressures, the fight for federalism in S R Bommai to his extraordinary courage in the unforgettable General Vaidya assassination case, his legacy is remembered for safeguarding democracy and the social fabric of our nation.  \nBut beyond the courtroom, his story is also one of personal struggles and conviction—navigating a world often hostile to religious minorities, protecting others from the same, or confronting difficult questions of identity and dissent within his own community. For Justice Ahmadi, secularism wasn’t just a legal principle—it was a way of life. \nPart biography, part legal history, and part family memoir— this book, written by Justice Ahmadi’s granddaughter, is a journey through the corridors of power and an unflinching portrait of a man who dared to speak truth to power no matter the consequences.  \nIn this session, author and journalist Insiyah Vahanvaty speaks with senior advocate and legal scholar Aditya Sondhi about her deeply personal and powerfully political biography, The Fearless Judge:The Life and Times of Justice A M Ahmadi. A Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/chief-justice-ahmadi-the-idea-of-india/",
    "keywords": [
      "Biography",
      "Books",
      "In Memory",
      "Law",
      "Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-896.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73689-1752690600-1752696000@bangaloreinternationalcentre.org",
    "name": "The History of Welfare",
    "startDate": "2025-07-16T18:30:00+05:30",
    "endDate": "2025-07-16T20:00:00+05:30",
    "description": "Welfare guarantees and direct benefit transfers are at the heart of the political marketplace but the longer-term history of welfare in India is surprisingly little known. Making India Work: The Development of Welfare in a Multi-Level Democracy (Cambridge University Press, 2025) recovers a history that is crucial for understanding the current juncture of welfare politics and political economy in India. Traversing more than a century of welfare development from the late colonial period to the present-day, the book asks why India has ended up with a small protected formal sector workforce shielded by social security and protection against retrenchment, and a much larger population that labours informally and does not enjoy such protections. It examines why India’s model of industrialisation failed to provide an engine for mass employment or welfare state development, and why the focus of policy efforts has shifted over the last fifty years from employment generation to the rise of ‘direct benefits’ which subsidise precarious livelihoods. \nIn this session, Louise Tillin, the author of the book, Anindita Adhikari and Rajendran Narayanan will be in conversation with Arun Thiruvengadam. The discussion will be followed by Q&A with the audience. \nIn collaboration with: \n \nThis event is sponsored by the Justice VR Krishna Iyer Chair, NLS.  \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-history-of-welfare/",
    "keywords": [
      "Books",
      "Economics",
      "History",
      "Law",
      "Policy & Regulation",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-829.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75547-1751221800-1751227200@bangaloreinternationalcentre.org",
    "name": "You Can Change Friends but Not Neighbours",
    "startDate": "2025-06-29T18:30:00+05:30",
    "endDate": "2025-06-29T20:00:00+05:30",
    "description": "India’s foreign policy towards Pakistan reflects the reality that while friends may change, neighbours are permanent. Dialogue, deterrence, and diplomacy remain key. Despite tensions, India seeks peaceful coexistence, emphasising counter-terrorism and regional stability while keeping open channels for engagement, recognising geography’s role in shaping long-term strategic approaches. \nThe talk will be followed by a Q&A session with the audience. \nThis lecture is a part of Azim Premji University’s Public Lecture Series. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/you-can-change-friends-but-not-neighbours/",
    "keywords": [
      "International Relations",
      "Policy & Regulation",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-901.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "75514-1750705200-1750710600@bangaloreinternationalcentre.org",
    "name": "The India They Saw",
    "startDate": "2025-06-23T19:00:00+05:30",
    "endDate": "2025-06-23T20:30:00+05:30",
    "description": "30 minutes | English with English Subtitles | 2025 | India \nCenturies before colonisers set sail, two Venetian explorers captured the richness of India—its culture, commerce, and faith—shaping Europe’s earliest impressions of the East. \nThis documentary takes viewers on an incredible but forgotten journey with Venetian explorers Marco Polo and Niccolò de’ Conti as they navigate medieval India. It vividly illustrates the rich cultural diversity, economic prosperity, spiritual and religious intensity of the region. \nIn the late thirteenth century, Marco Polo, along with his father and uncle, travelled from Venice to the court of Kublai Khan before heading south to India. There, he documented the thriving Pandya Kingdom in Thanjavur, known for its pearl trade, well-structured society, and beautiful temples, as well as the spice-laden markets of Kerala and the bustling port of Cambay in Gujarat, Western India. \nFast-forward over a century, and we have Niccolò de’ Conti, who provided a detailed account of India’s Deccan region. He admired the fortified beauty of Vijayanagara, celebrated the vibrant festivals like Deepavali and Maha Navami, and acknowledged the cultural richness of Cambay in Gujarat, Western India and Mylapore in Tamil Nadu, an early centre of Christianity. \nThrough their first-hand observations, this documentary highlights a medieval India characterised by thriving trade, religious tolerance, and architectural beauty, showcasing the lasting impact of these travellers’ encounters with a vibrant and complex civilisation. \nThe documentary, realised by MINDIA films, was entirely conceived and produced by the Consulate General of Italy in Bengaluru, under the aegis of the Karnataka Department of Tourism and the Archaeological Survey of India, and with the support of Baldota Group. \nPresented by: \n \nCreated by: \n \nIn Association with: \n     \nSupported by: \n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-india-they-saw/",
    "keywords": [
      "Film",
      "Heritage",
      "History"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "workPresented": {
      "@type": "Movie",
      "name": "The India They Saw"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-894.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "74478-1750590000-1750597200@bangaloreinternationalcentre.org",
    "name": "Journey Through Raaga",
    "startDate": "2025-06-22T11:00:00+05:30",
    "endDate": "2025-06-22T13:00:00+05:30",
    "description": "Raaga music is the core essence of Indian classical music. It is not just a set of swaras/notes but a flow of melodic content, defined by certain contours which gives each raga s unique flavor. \nUnique relationships exist between the notes. While individual notes define a swara position, the reflection of the swara relationship expounds the melodic variations. \nHence it is essential to understand these relationships and how they flower into a raaga. While manodharma (creativity) has a big part in it, our huge repository of compositions plays an important role in providing a framework for this exploration. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/journey-through-raaga/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Journey Through Raaga"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-889.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75490-1750962600-1750968000@bangaloreinternationalcentre.org",
    "name": "The Twist in the Odyssey of Naxalism in Karnataka",
    "startDate": "2025-06-26T18:30:00+05:30",
    "endDate": "2025-06-26T20:00:00+05:30",
    "description": "Around 15 years ago, the then UPA government had launched an all-out offensive (commonly known as ‘Operation Greenhunt’) targeting the armed cadres of the Communist Party of India (Maoist) (also known as Naxalites) across the ‘Red Corridor’ which consisted of Naxal-affected districts spanning Central and Eastern India and spilling into Southern India as well. According to reports at the time, Naxal cadres were active (to varying degrees) in at least 165 districts across this corridor which was also coterminous with the most backward, primarily tribal and the most resource rich parts of the country. The BJP government, which came to power in 2014, continued this policy of an all-out offensive against the Naxalites extending this to target the urban activists/ sympathisers of the CPI (Maoist) as well.  \nThere has been a marked decline in Naxalite activity since then with the number of affected districts falling to 70 in 2021 and newer reports suggesting that the Naxalite presence is restricted to fewer than 50 districts now. In a strong policy statement, Home Minister Amit stated that “Naxalism will be completely eliminated by 2026.” Human rights activists have questioned the state’s all-out approach of using overwhelming force to quash Naxalism as this method is not addressing the fundamental grievances of the residents of these tribal parts which is of their displacement and exploitation of the rich natural resources by large corporations. Several Naxalites have surrendered over the past two decades but questions have also been raised on the efficacy and sincerity of the surrender policy.  \nKarnataka was also impacted by the wave of Naxalism and, commencing in the 1980s, cadres were recruited for this cause in the State as well. In the 1990s, it seemed like the movement was spreading its base in Karnataka aggressively but a series of encounters including that of Saketh Rajan, the charismatic Naxal leader, in 2005, ensured that the movement did not become widespread in Karnataka. There was also intense churn among a section of the cadres of the CPI (Maoist) in Karnataka after this as well with one group exiting the party as it had ideological differences with the central leadership of the party. Over the two decades since that time, the Naxalite movement has ebbed in Karnataka with several Naxalites also surrendering. Early in 2025, with the “surrender” of the last group of Naxalites in Karnataka, Chief Minister Siddaramaiah declared the state to be Naxal-free. The Karnataka model presents a template of how Naxalism, in its violent form, can be ended. By all accounts, the Karnataka model is unique for the manner in which former Naxalites joined the mainstream of activism. The role of the mature civil society in Karnataka that played a crucial role in facilitating this process is also important. \nThe discussion proposes to dwell on the trajectory of Naxalism in Karnataka from its inception in the 1980s till early 2025, and whether the state is willing to seriously engage with the grievances of marginalised people who became Naxals. Is the state empathetic to the concerns of the Naxalites who came overground? The discussion proposes to dwell on all these aspects while broadly focussing on the success of the Karnataka model of mainstreaming Left-Wing Extremists.  \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-twist-in-the-odyssey-of-naxalism-in-karnataka/",
    "keywords": [
      "History",
      "Politics",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-899.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "75385-1751212800-1751220000@bangaloreinternationalcentre.org",
    "name": "Tarana vs Thillana",
    "startDate": "2025-06-29T16:00:00+05:30",
    "endDate": "2025-06-29T18:00:00+05:30",
    "description": "Tarana and Thillana—two strikingly vibrant forms in Hindustani and Carnatic classical traditions—share more than just syllabic play and rhythmic flair. Yet, they are often misunderstood, conflated, or heard in isolation. \nThis workshop invites participants to explore the shared pulse and divergent expressions of these two forms. Through live demonstrations, guided listening, and cross-cultural comparison, we will experience the same raga unfold as a Tarana and a Thillana, tracing how it transforms in structure, tempo, and mood across styles. \nThe session will introduce key rhythmic devices like layakari, jatis, and tihais, explore improvisation techniques in each tradition, and unpack the role of these forms in both concert and dance settings. Alongside a deep listening experience, participants will also gain a historical understanding of how Tarana and Thillana evolved and how they continue to be shaped by performance and pedagogy today. \nLed by expert practitioners from both Hindustani and Carnatic traditions, this workshop is designed for listeners, learners, dancers, and musicians alike—anyone curious to hear, feel, and understand rhythm as language and lineage. \n",
    "url": "https://bangaloreinternationalcentre.org/event/tarana-vs-thillana/",
    "keywords": [
      "Culture",
      "Music",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-71.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75389-1751220000-1751225400@bangaloreinternationalcentre.org",
    "name": "Step In the Frame",
    "startDate": "2025-06-29T18:00:00+05:30",
    "endDate": "2025-06-29T19:30:00+05:30",
    "description": "The evening will see two Contemporary dance performances. \nMetamorphosis \nThe dancers explore the reactions of what happens when one goes through the process of transformation. How does one’s body’s senses and feelings react through this unending loop between creation of new patterns, destruction, and recreation of one another. Metamorphosis dives deep into the question of how a pattern impacts the body? And during the period of transition when old patterns are fading away and the new self is finding its expression in the world, what is then your relationship to the changed self, and how does your body respond to this change? In this duet movement piece, the choreographer emphasizes the transformation of a personality from one to another. What is this new self? Is it an add-on to the old pattern or a breakaway into something new? \nLost in Oscillation \nThis piece dives deep into the strange and shifting world of self-doubt. The dancer embodies ethereal beings caught in a surreal dreamscape, where self-doubt manifests as a physical entity. This intangible force envelops the dancer, distorting their movements and warping their perception of self. The stage transforms into a shifting labyrinth of reflective surfaces, reflecting fragmented images that mirror the dancers’ internal struggle. Expect sharp angles, sudden gestures, and moments that swing between chaos and calm. With abstract visuals and a haunting soundscape, this piece pulls you into a surreal inner world where nothing feels certain, not even your own reflection. \nSupported by: \n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/step-in-the-frame/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-897.jpg"
  }
]