[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75807-1752778800-1752784200@bangaloreinternationalcentre.org",
    "name": "Dual Margam 4",
    "startDate": "2025-07-17T19:00:00+05:30",
    "endDate": "2025-07-17T20:30:00+05:30",
    "description": "What happens when two classical dance forms meet on the same stage? \nRooted in tradition, yet distinct in rhythm and grace, the fourth evening of Dual Margam brings together two iconic forms: the flowing, emotive elegance of Mohiniyattam from Kerala, and the sculptural strength and expressive clarity of Odissi from Odisha. \nEach solo performance offers a glimpse into the soul of its tradition—Mohiniyattam with its gentle, circular grace; Odissi with its striking lines and powerful storytelling. The evening culminates in a duet, weaving these two styles into a graceful confluence, illuminating their shared roots and individual brilliance in a spellbinding visual dialogue. \nWhether you’re a longtime admirer of classical dance or simply curious, this is a rare chance to experience movement as language, emotion, and shared heritage. \nThe Dual Margam series curates two classical dance forms of India to highlight their similarities and differences. The solo performances honour traditional repertoire (the Margam), while the duet will juxtapose each unique form with another. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dual-margam-4/",
    "keywords": [
      "Dance",
      "Heritage",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-921.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76570-1752604200-1752609600@bangaloreinternationalcentre.org",
    "name": "ಚಿತ್ರಕಲಾ ಪರಿಷತ್ತು | Chitrakala Parishath",
    "startDate": "2025-07-15T18:30:00+05:30",
    "endDate": "2025-07-15T20:00:00+05:30",
    "description": "1960ರ ದಶಕದಲ್ಲಿ ಸ್ಥಾಪನೆಯಾದ ಕರ್ನಾಟಕ ಚಿತ್ರಕಲಾ ಪರಿಷತ್ತು (CKP) ಕರ್ನಾಟಕದ ಆಧುನಿಕ ಮತ್ತು ಸಮಕಾಲೀನ ಕಲೆಯ ರೂಪುಗೊಳ್ಳುವಿಕೆಯಲ್ಲಿ ಪ್ರಮುಖ ಪಾತ್ರ ವಹಿಸಿದೆ. ಕಲಾ ಶಾಲೆ, ಗ್ಯಾಲರಿ ಮತ್ತು ಸಾಂಸ್ಕೃತಿಕ ಕೇಂದ್ರವಾಗಿರುವ ಪರಿಷತ್ತು ಅನೇಕ ಕಲಾವಿದರ ಬೆಳವಣಿಗೆಗೆ ವೇದಿಕೆಯಾಗಿದೆಯೆಂಬುದು ನಿಸ್ಸಂದೇಹ. \nಈ ಕಾರ್ಯಕ್ರಮದಲ್ಲಿ ಪ್ರಮುಖ ಕಲಾವಿದರಾದ ಎಸ್.ಜಿ. ವಾಸುದೇವ್, ಎಂ.ಜೆ. ಕಮಲಾಕ್ಷಿ, ರವಿ ಕಾಶಿ, ಮತ್ತು ಸುರೇಶ್ ಜಯರಾಮ್ ಚರ್ಚೆಯಲ್ಲಿ ಭಾಗವಹಿಸುತ್ತಾರೆ. ಅವರ ವೈಯಕ್ತಿಕ ಅನುಭವಗಳು ಮತ್ತು ಚಿಂತನೆಯ ಮೂಲಕ ಚಿತ್ರಕಲಾ ಪರಿಷತ್ತಿನ ಇತಿಹಾಸ, ಅದರ ಬೆಳವಣಿಗೆ ಹಾಗೂ ಇಂದಿನ ಸಾಂಸ್ಕೃತಿಕ ಪ್ರಸ್ತುತತೆಯನ್ನು ಅನ್ವೇಷಿಸುತ್ತಾರೆ. \n\n\n\n\nಈ ಕಾರ್ಯಕ್ರಮ ಕನ್ನಡ ಮತ್ತು ಇಂಗ್ಲಿಷ್ ಭಾಷೆಗಳಲ್ಲಿ ನಡೆಯುತ್ತದೆ. \n\n\n\n\nEstablished in the 1960s, Karnataka Chitrakala Parishath (CKP) has been a pivotal institution in shaping modern and contemporary art in Karnataka. As an art school, museum, and cultural hub, it has nurtured generations of artists and art lovers. \nThis session brings together eminent voices — S G Vasudev, M J Kamalakshi, Ravi Kashi, and Suresh Jayaram — to reflect on the origins, evolution, and enduring impact of CKP. Through personal memories, critical insights, and shared histories, the conversation will explore CKP’s role in building a vibrant artistic community and its relevance in today’s cultural landscape. \nThis session will be bilingual in Kannada and English. \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%9a%e0%b2%bf%e0%b2%a4%e0%b3%8d%e0%b2%b0%e0%b2%95%e0%b2%b2%e0%b2%be-%e0%b2%aa%e0%b2%b0%e0%b2%bf%e0%b2%b7%e0%b2%a4%e0%b3%8d%e0%b2%a4%e0%b3%81-chitrakala-parishath/",
    "keywords": [
      "Bangalore",
      "Culture",
      "Design",
      "Education",
      "Heritage",
      "Society",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-72.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76257-1752343200-1752348600@bangaloreinternationalcentre.org",
    "name": "Deevara Chittara",
    "startDate": "2025-07-12T18:00:00+05:30",
    "endDate": "2025-07-12T19:30:00+05:30",
    "description": "Presented by CFRIA, the book Deevara Chittara – The Art, the People and their Culture – is the first of its kind to archive and document indigenous folk art Chittara and related depleting eco-friendly handicrafts.  \nThe outcome of a two-year intense field work and research, this book documents Chittara, its versatility and the local Malenadu culture it is rooted in, with a special focus on the Deevaru community women who have refined it into an intricate art. It addresses the dearth of resources on Chittara, essential to keep this living tradition alive. The book informs the reader of the various facets of the art form — its intricacies, symbolism, use of natural materials, the role of women in the art, its link to social customs like marriages and festivals — of which Chittara is an integral part. The book makes creative use of related folk songs, proverbs and riddles. It is a valuable and comprehensive resource on one of the most refined folk art practices in our country. \nCFRIA is a non-profit organization dedicated to the preservation and revival of Chittara, an intricate folk art practiced by the women of the Deevaru community in the Malenadu region of Karnataka. The organisation has spent the last 20 years working closely with artisans from this region to preserve and celebrate this sacred and intricate mural art form.  \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/deevara-chittara/",
    "keywords": [
      "Books",
      "Culture",
      "Heritage",
      "Nonfiction",
      "Photography",
      "Society",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-925.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76028-1753383600-1753388100@bangaloreinternationalcentre.org",
    "name": "Dvaita | Duality",
    "startDate": "2025-07-24T19:00:00+05:30",
    "endDate": "2025-07-24T20:15:00+05:30",
    "description": "Contradictions, comparison and ultimately confluence, Dvaita | Duality is a fusion of artistic expression and philosophical inquiry. Through two distinct dance forms, Kuchipudi and Balinese, the dynamic balance of opposing energies is beautifully displayed. \nCentred around ‘Ardhanareeswara’, the composite form of Shiva-Shakti, the dance visualises the distinct yet complementary nature of the masculine and feminine energies. A layered performance, this piece explores the philosophical questions of how our consciousness (Purusha) interacts with the material world (Prakriti). \nThis evening aspires to resolve the paradox of opposites not through negotiation, but harmonious expression. \nCredits: \nConcept, Creation and Artistic Direction: Gomathi Boorada \nDancers:\nGomathi Boorada\nJesitta Jilju\nNeharika Renjith Nair\nHemali Subramanyam Boorada\nAlphonsa Ashwajit Kamble\nSneha Chandrababu\nGoutham Maheswaran\n⁠Ni Putu Widiantini\n⁠Ni Wayan Pia Wahyuni\n⁠Ni Komang Erna Sriwahyuni\n⁠Ni Kadek Santi Wiadnyani \nMusic:\nI Wayan Sudirana / Gamelan Yugananda\nD.S.V. Sastry – Sastry Studios, Hyderabad\nBrian Raine \nChoreography:\nGomathi Boorada\nNi Putu Widiantini \nIn collaboration with:\n  \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dvaita-duality/",
    "keywords": [
      "Culture",
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-922.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73689-1752690600-1752696000@bangaloreinternationalcentre.org",
    "name": "The History of Welfare",
    "startDate": "2025-07-16T18:30:00+05:30",
    "endDate": "2025-07-16T20:00:00+05:30",
    "description": "Why does welfare feel out of reach for so many, even as governments promise more than ever? \nWelfare schemes and cash transfers are central to India’s political economy today. Making India Work: The Development of Welfare in a Multi-Level Democracy (Cambridge University Press, 2025) recounts the crucial history of how welfare has evolved in India over the past century. Traversing more than a century of welfare development from the late colonial period to the present-day, the book asks important questions, illuminates failures and brings clarity to our murky future. \nAuthor Louise Tillin in conversation with Anindita Adhikari and Rajendran Narayanan, moderated by Arun Thiruvengadam, will explore what India’s welfare journey means for citizens, workers, and voters today. \nCurious about where your taxes go, or why support doesn’t always reach those who need it most? Stay for the Q&A and bring your questions. \nIn collaboration with: \n \nThis event is sponsored by the Justice VR Krishna Iyer Chair, NLS.  \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-history-of-welfare/",
    "keywords": [
      "Books",
      "Economics",
      "History",
      "Law",
      "Policy & Regulation",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-829.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76357-1752404400-1752409800@bangaloreinternationalcentre.org",
    "name": "Trickster Tales",
    "startDate": "2025-07-13T11:00:00+05:30",
    "endDate": "2025-07-13T12:30:00+05:30",
    "description": "Come for the clever characters, stay for the big laughs and leave with timeless tales! \nTrickster Tales is a playful storytelling workshop where folktales from around the world come to life. Through drama, movement, and craft, children meet age-old tricksters who use their brains rather than brawn to solve problems. \nKids will listen deeply, move creatively, and express freely as they step into the story. The session will end with a simple craft project, and each child will leave with a handmade piece of the story. \nThis workshop encourages creativity, builds confidence, and nurtures a love of reading in a joyful, inclusive space. \n",
    "url": "https://bangaloreinternationalcentre.org/event/trickster-tales/",
    "keywords": [
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-930.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "76197-1752865200-1752870600@bangaloreinternationalcentre.org",
    "name": "Tales of the Night",
    "startDate": "2025-07-18T19:00:00+05:30",
    "endDate": "2025-07-18T20:30:00+05:30",
    "description": "The solitude of the night-time has always been a space where humans release their innermost thoughts, whether of comfort, terror, liberation, wistfulness or hope. As such, many of the finest works of art have been inspired by its thrall. Karl Lutchmayer’s recital discusses and presents some powerful emotional responses to the darkness by a quintet of composer-pianists who represent a pantheon of Romantic and Modernist ethea. From yearning lullabies, intimate reminiscences, and nocturnal soundscapes to religious ecstasy, and gothic horror, each showcases the extraordinary resources of the piano and the technical and emotional range of the pianist’s art. \n \n  \nImage Credit: \nThumbnail, Header and Poster: Photos of Karl Lutchmayer by Param Singh \n  \nPresented by the International Music and Arts Society \n \n  \nWith the support of Furtados and Steinway \n       \n \n  \nThe International Music and Arts Society gratefully acknowledges the support of Shashi Uthappa and V Natarajan. \n",
    "url": "https://bangaloreinternationalcentre.org/event/tales-of-the-night/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Tales of the Night"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-923.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76224-1752692400-1752697800@bangaloreinternationalcentre.org",
    "name": "Chandalika",
    "startDate": "2025-07-16T19:00:00+05:30",
    "endDate": "2025-07-16T20:30:00+05:30",
    "description": "Presented by Chinmayi Nrithyalaya and directed by Guru Sridevi Chalagalla Mungara, Chandalika is a Kuchipudi interpretation of Rabindranath Tagore’s poignant dance drama. The work traces the emotional and spiritual journey of a young woman marked by caste, and the internal revolution sparked by a single act of compassion. \nAt its heart, Chandalika is a meditation on identity, longing, and liberation. The narrative unfolds through Kuchipudi’s deeply expressive vocabulary, drawing on graceful movement, rhythmic command, and layered abhinaya to illuminate the character’s awakening from inherited exclusion to personal agency. \nPerformed in Telugu with English framing, the ballet invites all audiences into a world where social realities and inner transformation meet. It is a classical work, yet quietly radical, reimagining traditional form as a lens for reflection on dignity, desire, and the human condition. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/chandalika/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "te",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-928.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76327-1752604200-1752609600@bangaloreinternationalcentre.org",
    "name": "Beyond The Prescription",
    "startDate": "2025-07-15T18:30:00+05:30",
    "endDate": "2025-07-15T20:00:00+05:30",
    "description": "Diabetes is a major epidemic in India with an estimated 77 million people suffering from it and nearly 25 million who are prediabetic. It is a silent killer, leading to significantly higher risks of heart disease, strokes and kidney failures. And most people who have it, experience helplessness when attempting to reverse or control it. \nBut what if there was a way for each and every individual to combat this challenge? What if we could turn around diabetes with less medication, right from within the daily rhythm of our lives? \nThis session explores exactly that. Drawing on insights from Turn Around Diabetes, the discussion will challenge the myths that keep India stuck in a reactive cycle of care. It will open up a deeper, science-backed conversation: How can we shift the trajectory of chronic illness management by equipping people with the tools to intervene early and meaningfully? \nAuthor Roshani Sanghani will be in conversation with Rahul Matthan, who has personally committed to transforming his life using an approach that does not need medication. Together, they will reflect on how clarity and knowledge, rather than fear and misinformation, can empower individuals and families to take charge of their health journeys. \nThe conversation will be followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/beyond-the-prescription/",
    "keywords": [
      "Books",
      "Health & Wellness",
      "Science"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-929.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76156-1752318000-1752323400@bangaloreinternationalcentre.org",
    "name": "What Would Dr. Ambedkar Have Made of the Republic of India Today?",
    "startDate": "2025-07-12T11:00:00+05:30",
    "endDate": "2025-07-12T12:30:00+05:30",
    "description": "Dr. B. R. Ambedkar is remembered and admired for many things: for his heroic, lifelong, campaign to eradicate the evil of untouchability; for his scholarly contributions as an economist and social theorist; for the social movements he led and the political parties he founded; for the educational institutions he nurtured; for his critical role in overseeing and directing the framing of the Constitution; for the brilliant books, essays and pamphlets that he authored on a variety of subjects. \nThis lecture will focus on Ambedkar as a visionary and deeply insightful theorist of constitutional democracy. By juxtaposing what he said in his speeches in the Constituent Assembly to the social and political realities of contemporary India, I shall demonstrate how his ideas remain of compelling relevance to us today. While the core of the talk will be on Ambedkar the political theorist, it will end by briefly comparing his legacy with that of other remarkable Indians of his generation, such as Nehru, Gandhi, Tagore, and Kamaladevi Chattopadhyay. \nThe National Law School of India University, Bengaluru (NLSIU) and the Ahmadi Foundation have entered into a MoU to set up the Justice Ahmadi Initiative on Rule of Law, Democracy, and Social Justice in honour of, and to preserve and promote the legacy of former Chief Justice of India, Justice Aziz Mushabber Ahmadi. The Initiative will work to advance the ideas that Justice Ahmadi championed throughout his distinguished career, including but not restricted to human rights, education, inclusion and protection of vulnerable communities, judicial independence, alternate dispute resolution mechanisms, and strengthening of democratic institutions. An annual distinguished lecture series is one of the events planned under the Initiative. Read more about it here. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/what-would-dr-ambedkar-have-made-of-the-republic-of-india-today/",
    "keywords": [
      "In Memory",
      "Law",
      "Politics",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-917.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76381-1752865200-1752868800@bangaloreinternationalcentre.org",
    "name": "All About Nothing",
    "startDate": "2025-07-18T19:00:00+05:30",
    "endDate": "2025-07-18T20:00:00+05:30",
    "description": "All About Nothing is a solo performance that weaves prose, movement, and melody into a poetic inquiry on the illusions we cling to, especially those shaped by love. Through the lens of Maya, the piece explores how the idea of love, particularly the romantic kind, can so thoroughly consume us that we begin to believe we cannot live without it. But in that entanglement arises a deeper question: Is this true love, or just the most convincing illusion we’ve created? \nWhat begins as a personal narrative unfolds into a philosophical reflection on the emotional architecture we build around relationships, identity, and truth. Through an intimate conversation between two artists, the work gradually exposes the fragile layers of perception we live within—possessions, routines, emotions, roles—ultimately revealing their impermanence. \nAt the heart of the piece lies a paradox: there is nothing, yet there is everything. And perhaps in that contradiction, we discover a strange kind of freedom. Inspired by the words of Butoh master Kazuo Ohno, who said, “You must have life coming out of you (your art),” this piece is not performed, but lived. \nAll About Nothing offers both tenderness and confrontation, inviting viewers to reflect on their own attachments and to question what they hold dear, and why. \nCredits:\nWritten & Conceptualized by: Archana S Kumar, India\nOriginal Soundscore: Kamal Singh, Bangalore, India\nDramaturgy & Lighting: Sal Yusuf, UK | India (Black Box India) \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/all-about-nothing/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-932.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "76355-1753009200-1753014600@bangaloreinternationalcentre.org",
    "name": "The Shape of Sound in Stillness",
    "startDate": "2025-07-20T11:00:00+05:30",
    "endDate": "2025-07-20T12:30:00+05:30",
    "description": "Step into a space of quiet reflection and musical depth with The Shape of Sound in Stillness, a Hindustani classical vocal concert that invites listeners to pause, breathe, and realign amidst the calm of the late morning. \nIn this intimate gathering, the rich textures of voice, tanpura, tabla, and harmonium come together to create a contemplative soundscape—one that soothes the senses and encourages inward stillness. The selected ragas, rooted in the morning hours, are chosen to evoke clarity, gentle energy, and a renewed sense of presence. \nLed by accomplished artists dedicated to the living tradition of Hindustani classical music, this concert is more than a performance. It is a meditative offering, an experience where music becomes a quiet companion in our search for balance, calm, and connection. \nLet the unfolding rhythms and resonant melodies guide you toward a place of inner harmony—an ideal way to anchor yourself before the day gathers pace. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-shape-of-sound-in-stillness/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Shape of Sound in Stillness"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-933.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "76261-1752404400-1752411600@bangaloreinternationalcentre.org",
    "name": "Chittara",
    "startDate": "2025-07-13T11:00:00+05:30",
    "endDate": "2025-07-13T13:00:00+05:30",
    "description": "The Chittara art form practised by the Deevaru Community is engaged primarily by the women folk of the community as a socio-cultural practice. Nestled in the ranges of verdant western ghats of North Canara live the Deevaru people, a matriarchal-agrarian community of nature-worshippers, residing in and around Sagara, Karnataka. Chittara art has become an integral part of their daily routines. It was never a profession, but a practice that has artistic and socio-cultural value. For women of the Deevaru community Chittara paintings are a source of great joy, beauty and creativity. For painting, women artists use eco-friendly natural resources like ground rice paste for white, charred rice for black, powdered Gurige seeds for yellow, and soil/earth for red. \nIn this workshop, you will learn to draw a few motifs of Chittara along with their description. You can then draw these on a small cane tray to take home to. You will also get to know how natural paints are used in this art along with the eco-friendly handicrafts they make. \nWhat will you take home?\nKnowing the socio-cultural aspects of the community\nLearn a folk art form of Karnataka\nCompleted piece of artwork done by yourself \nWhat do you need to bring?\nWater bottle to keep you hydrated.\nKindly get a note book/notepad, a pencil, an eraser and a rag cloth.\nNote: Other essential materials will be provided by the host. \nCenter for Revival of Indigenous Art (CFRIA), founded by Ms Geetha Bhat, is a non-profit organisation working to preserve and promote Chittara folk art, Karnataka. CFRIA has showcased events, Lec-dems, workshops at various educational, cultural institutions, and exhibitions. Chittara murals can be witnessed at Indira Gandhi National Centre for Arts (IGNCA) Indian Music Experience (IME) Bosch, Taneira showrooms to name a few. CFRIA is now working on the Chittara folk art Archival book, which aims to address the dearth of resources on Chittara, essential for its preservation. This book will capture Deevaru’s lifestyle , culture, challenges and way forward, aimed at a wide range of audiences \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/chittara/",
    "keywords": [
      "Culture",
      "Heritage",
      "Visual Arts",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-926.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76148-1752258600-1752264000@bangaloreinternationalcentre.org",
    "name": "EK Janaki Ammal & the Re-Ordering of the Western Ghats",
    "startDate": "2025-07-11T18:30:00+05:30",
    "endDate": "2025-07-11T20:00:00+05:30",
    "description": "The Western Ghats enjoyed a central place in the life and science of cytogeneticist E. K. Janaki Ammal (1897-1984). To her, the dense and tall tropical evergreen forests found here was the epitome of climax vegetation in India, or the mature stage of ecological succession. In order to understand how this balance was reached and stability attained, she undertook a grand and pioneering project— a study of the relationship between peoples and plants of the region, both in deep history and the immediate present. One of her chief aims was the making of a modern and decolonialised version of the Hortus Malabaricus— a new compendium of medicinal plants from the Western Ghats, reordered on the basis of chromosomes, and containing information on their uses, as gathered from the forest dwellers, who she believed were the primary interlocutors of indigenous medico-botanical knowledge. Also, quite tellingly, in her advancing years, rather than expend energy directly wrestling with the Kerala government on the Silent Valley issue, she championed for its conservation by mobilising international support and creatively embarked on an innovative project— the cytogenetics of the flora of these undisturbed forests. \nThis lecture is part of the Obaid Siddiqi Lectures, Annual lectures delivered by the Obaid Siddiqi Chair in the History and Culture of Science at the Archives at NCBS. \nImage credit: Thumbnail and Header Art by Megha Ramachandra \nIn collaboration with \n     \n",
    "url": "https://bangaloreinternationalcentre.org/event/ek-janaki-ammal-the-re-ordering-of-the-western-ghats/",
    "keywords": [
      "Environment",
      "Heritage",
      "Science",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-918.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76253-1752231600-1752436800@bangaloreinternationalcentre.org",
    "name": "Language of Lines",
    "startDate": "2025-07-11T11:00:00+05:30",
    "endDate": "2025-07-13T20:00:00+05:30",
    "description": "Exhibition Opening: 6:00 pm | Friday, 11 July\nTimings: 11:00 am – 8:00 pm\nExhibition on show until Sunday, 13 July\n \nWalkthroughs: \nFriday, 11 July | 6:30 pm\nSaturday, 12 July | 11:00 am & 5:00 pm\nSunday, 13 July | 2:00 pm & 5:00 pm \nWelcome to the world of Chittara, an indigenous folk art practiced in Karnataka’s Malenadu region. Created and refined over generations, Chittara is inspired from nature, architecture, and lifestyle, its exquisite lines laden with meaning and symbolism. Experience the many facets of this living tradition through the lens of the Deevaru community in this three-day exhibition at BIC, featuring Chittara paintings by many artists, photographs by Smitha Tumuluru from the Deevara Chittara book project, displays of various eco-friendly products and installations including creative re-creations of Deevaru lifestyle. \nCenter for Revival of Indigenous Art (CFRIA) is a non-profit organization dedicated to the preservation and revival of Chittara, an intricate folk art practiced by the women of the Deevaru community in the Malenadu region of Karnataka. The organisation has spent the last 20 years working closely with artisans from this region to preserve and celebrate this sacred and intricate mural art form. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/language-of-lines/",
    "keywords": [
      "Culture",
      "Design",
      "Heritage",
      "Photography",
      "Society",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-924.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "76239-1753210800-1753216200@bangaloreinternationalcentre.org",
    "name": "The Rhythm of Calm",
    "startDate": "2025-07-22T19:00:00+05:30",
    "endDate": "2025-07-22T20:30:00+05:30",
    "description": "What if music could quiet the world around you? \nStep into an evening of calm, beauty, and tradition with Dhrupad; the oldest form of Indian classical vocal music still performed today. \nRooted in the Dagarvani style, this performance offers a deep, meditative experience. Rich vocal melodies meet the earthy rhythm of the Pakhawaj, creating an atmosphere of calm, clarity, and deep listening. \nEach note is sung with grace. Each rhythm unfolds with purpose.  \nThis evening of Dagarvani Dhrupad invites you to slow down for a night of pure, powerful listening. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-rhythm-of-calm/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Rhythm of Calm"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-934.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "75927-1752345000-1752352200@bangaloreinternationalcentre.org",
    "name": "Ehsaas: A Multi-Sensory Journey",
    "startDate": "2025-07-12T18:30:00+05:30",
    "endDate": "2025-07-12T20:30:00+05:30",
    "description": "Ehsaas is a meditative, multi-sensory experience that invites audiences to step into a world shaped by sound, memory, and emotion. This quiet, immersive performance centers around narrative fragments, ambient audio, and subtle sensory cues that evoke personal and collective histories. \nPresented in an intimate, contemplative setting, Ehsaas is not theatre in the conventional sense — it is a space for listening, sensing, and remembering. Stories unfold through voice, texture, and sonic layering rather than action or spectacle. The work leans into silence as much as it does into sound, creating room for individual interpretation and emotional resonance. \nRooted in lived experience and artistic experimentation, Ehsaas invites the audience to witness — and be witnessed — through the intangible yet deeply felt realms of inner life. It offers a rare pause, a shared breath, and a gentle return to feeling. \nIn collaboration with:\n \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/ehsaas-a-multi-sensory-journey/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Ehsaas: A Multi-Sensory Journey"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-927.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76139-1752258600-1752264000@bangaloreinternationalcentre.org",
    "name": "The Untold Stories of the Indian Rupee",
    "startDate": "2025-07-11T18:30:00+05:30",
    "endDate": "2025-07-11T20:00:00+05:30",
    "description": "Indian paper money has a rich history, filled with numerous fascinating stories and unique aspects that reflect the country’s diverse heritage and evolving economy. \nOne of the most remarkable pieces is the only surviving ancient paper note of India, which was circulated during the British colonial period. Equally significant is the first One Rupee note issued in 1917, marking the early stages of formal paper currency in the country. Among the rare denominations is the unusual Two and a Half Rupees note, which stands out for its distinct value and limited circulation. \nThe influence of foreign colonial powers is also evident in the paper money issued by the Portuguese and French in their respective territories in India. Additionally, several princely states across the subcontinent issued their own forms of paper currency, showcasing the regional autonomy and diversity of pre-independence India. \nOther intriguing aspects include the issuance of Prisoners of War Camp Money and the use of paper cash coupons as a substitute for currency in certain regions. A rare and noteworthy event in monetary history is the Reserve Bank of India’s simultaneous issuance of currency notes for two different countries—an occurrence seldom seen elsewhere. \nIndia has also seen the release of commemorative banknotes on a single known occasion, adding a unique dimension to its numismatic record. More recently, the 2016 demonetisation marked a historic turning point, acting as a catalyst for increased digital economy awareness and financial literacy across the nation. \nIn this session, Mr. Rezwan Razack dives into some fascinating anecdotes of Indian paper money. He’ll also be in conversation with Ramjee Chandran about the evolving nature of currency in India. A Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-untold-stories-of-the-indian-rupee/",
    "keywords": [
      "Economics",
      "Heritage"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-916.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76023-1752606000-1752611400@bangaloreinternationalcentre.org",
    "name": "Aum: Tracing the Journey Within",
    "startDate": "2025-07-15T19:00:00+05:30",
    "endDate": "2025-07-15T20:30:00+05:30",
    "description": "Emanating from Shiva’s damaru and the radiant sun rays the omnipresent sound of Aum, the cosmic vibration, echoes through the universe. This performance invites you on a soulful journey across India’s Sacred Kshetras, aligned across a single longitude. These holy sites honour Shiva and his transcendent nature.  \nDr. Sahana Selvaganesh (Bharatanatyam) and Pooja Kale (Odissi) join hands in this heartfelt collaboration. Through graceful movement and powerful rhythm, the dancers bring ancient stories to life.  \nWhether you’re new to dance or a long-time admirer, this performance offers something special. It’s not just a visual spectacle, it’s an experience of the universal truth – AUM. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/aum-tracing-the-journey-within/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-919.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "76365-1753297200-1753304400@bangaloreinternationalcentre.org",
    "name": "ಕ್ರಾಂತಿ ಬಂತು #ಕ್ರಾಂತಿ | Kranthi Bantu #Kranthi",
    "startDate": "2025-07-23T19:00:00+05:30",
    "endDate": "2025-07-23T21:00:00+05:30",
    "description": "\n110 minutes | Kannada | For all ages \nಕ್ರಾಂತಿ ಬಂತು #ಕ್ರಾಂತಿ ನಾಟಕವನ್ನು ಸಾಹಿತಿ ಪಿ. ಲಂಕೇಶ್‌ ಅವರ “ಕ್ರಾಂತಿ ಬಂತು ಕ್ರಾಂತಿ” ನಾಟಕದ ಪಠ್ಯವನ್ನು ಪ್ರಸ್ತುತಕ್ಕೆ ಅಳವಡಿಸಿಕೊಂಡು ಕಟ್ಟಲಾಗಿದೆ. ಈ ನಾಟಕವು ಮೊದಲ ಬಾರಿಗೆ ಪ್ರಕಟವಾಗಿದ್ದು 1971ರಲ್ಲಿ. ಸಾಮಾಜಿಕ ಮತ್ತು ರಾಜಕೀಯ ಪರಿಸ್ಥಿತಿಗಳಲ್ಲಿ ಅಂದಿಗೂ – ಇಂದಿಗೂ ಸಾಕಷ್ಟು ಬದಲಾವಣೆಗಳು ಕಂಡುಬಂದರು, ಆ ಬದಲಾದ ಪರಿಸ್ಥಿತಿಗಳು ತಮ್ಮ ಮೂಲ ಸ್ವರೂಪವನ್ನು ಹಾಗೆಯೇ ಉಳಿಸಿಕೊಂಡಿರುವುದು ನೋವಿನ ಸಂಗತಿ. ಸಮಾಜವಾದ, ಸಮತಾವಾದ, ಕ್ರಾಂತಿಯಂತಹ ವಿಚಾರಗಳ ಘರ್ಷಣೆ ಉತ್ತುಂಗದಲ್ಲಿದ್ದಾಗ ಬರೆಯಲ್ಪಟ್ಟಿರುವ ನಾಟಕ ಇಂದಿನ ಸಾಮಾಜಿಕ ಮತ್ತು ರಾಜಕೀಯ ಸನ್ನಿವೇಶಗಳನ್ನು ಕೂಡ ಸಮರ್ಥವಾಗಿ ಪ್ರತಿಧ್ವನಿಸುತ್ತದೆ. ಮೂಲ ಪಠ್ಯವನ್ನು ಕಲಾವಿಲಾಸಿ ತಂಡದ ಕಲಾವಿದರು ಈಗಿನ ಕಾಲದ ಸಂಕೀರ್ಣ ಮತ್ತು ಸೂಕ್ಷ್ಮ ಘಟನೆಗಳನ್ನು ಇಟ್ಟುಕೊಂಡು ಇಂದಿನ ತಲೆಮಾರಿಗೆ ಹತ್ತಿರವಾಗುವ ಹಾಗೆ ವಿಸ್ತರಿಸಿದ್ದಾರೆ. \nಬಂಡವಾಳಶಾಹಿಗಳ ದೋರಣೆ, ವ್ಯವಸ್ಥೆಯ ಹಸ್ತಕ್ಷೇಪ, ತಮ್ಮ ಲಾಭಕ್ಕಾಗಿ ಅಮಾಯಕರ ದಿಕ್ಕು ತಪ್ಪಿಸುವ  ಪ್ರಭಾವಿಗಳ ಅವಕಾಶವಾದಿ ಧೋರಣೆ, ಕ್ಷಮತೆ ಕಳೆದುಕೊಳ್ಳುವ ಯುವಕರ ಆಕ್ರೋಶ, ಸಾಮಾಜಿಕ ಜಾಲತಾಣಗಳ ಸಾಮೂಹಿಕ ಅಭಿಪ್ರಾಯಗಳು… ಹೀಗೆ ನಾಟಕವು ಹಲವು ಜ್ವಲಂತ ಸಮಸ್ಯೆಗಳಿಗೆ ಪ್ರೇಕ್ಷಕರನ್ನು ಮುಖಾಮುಖಿಗೊಳಿಸುತ್ತಾ ಹೋಗುತ್ತದೆ. ಸರಿ ತಪ್ಪುಗಳು ಅವರವರ ವಿವೇಚನೆಗೆ ಬಿಟ್ಟಿದ್ದು. ನಾಟಕದುದ್ದಕ್ಕೂ ತಮಗೆ ಸರಿ ಎನಿಸುವ ನಿರ್ಧಾರಗಳನ್ನು ತಗೆದುಕೊಂಡು ತಮ್ಮ ದಾರಿಗಳನ್ನು ಆರಿಸಿಕೊಳ್ಳುವ ಪಾತ್ರಗಳು ಈ ಸಂಕೀರ್ಣ ವ್ಯವಸ್ಥೆಯ ಸುಳಿಯಲ್ಲಿ ಸಿಕ್ಕಿಕೊಂಡು ಕುತೂಹಲವನ್ನು ಕೆರಳಿಸುತ್ತವೆ. ಹಾಸ್ಯ ಮಿಶ್ರಿತ ವಿಡಂಭನೆಯೊಂದಿಗೆ ಕಟ್ಟಿರುವ ನಾಟಕ ಪ್ರೇಕ್ಷಕರಿಗೆ ಸಾಕಷ್ಟು ಮನರಂಜನೆಯನ್ನೂ ಒದಗಿಸುತ್ತದೆ. \nThe play Kranthi Banthu #Kranthi has been adapted to the present times from P. Lankesh’s original “Kranthi Banthu Kranthi”, first published in 1971. Although there has been a significant shift in the political and social climate, the fact that the roots of these issues have remained constant makes it feel almost natural. The original play, written during an era when socialism, communism and revolution were at their peak, still manages to capture and reflect the present political and social order. Team Kalavilasi has adapted the original to fit today’s scenario, making it more relatable to the current generation while being mindful of the play’s complex and sensitive aspects. \nThe play explores pressing issues such as the tyranny of capitalists, systemic interference, the opportunistic behavior of influencers for personal gain, the outrage of disempowered youth, the flood of opinions on social media, and how the media capitalizes on these dynamics. It engages the audience with these timely themes. \nThe question of what is right or wrong is subjective. Throughout the play, the characters make decisions they believe to be right, only to become trapped in the system’s nuances, sparking curiosity in the audience. Woven with humor and satire, the play offers ample entertainment while provoking thought. \nCast and Crew | ತಾರಾಗಣ ಮತ್ತು ತಾಂತ್ರಿಕ ಬಳಗ: \nVaishnavi | ವೈಷ್ಣವಿ\nMadhukar Hirisave | ಮಧುಕರ್ ಹಿರಿಸಾವೆ\nSiddaramu K | ⁠ಸಿದ್ದರಾಮು ಕೆ\nNamitha Ramu | ⁠ನಮಿತಾ ರಾಮು\nPallavi Hegde | ⁠ಪಲ್ಲವಿ ಹೆಗಡೆ\nHarsha Vardhan | ⁠ಹರ್ಷ ವರ್ಧನ್\nNarayan Badiger | ನಾರಾಯಣ್ ಬಡಿಗೇರ್\nNagaraj | ನಾಗರಾಜ್\nSuhas Srinivas | ಸುಹಾಸ್ ಶ್ರೀನಿವಾಸ್\nAbhishek Chakrannavar | ಅಭಿಷೇಕ ಚಕ್ರಣ್ಣವರ\nAbhinav Iyengar | ಅಭಿನವ್ ಅಯ್ಯಂಗಾರ್ \nBackground Music | ಹಿನ್ನೆಲೆ ಸಂಗೀತ : Sathya Radhakrishna | ಸತ್ಯ ರಾಧಾಕೃಷ್ಣ\nLighting Design | ಬೆಳಕು ವಿನ್ಯಾಸ : Manju Narayan | ಮಂಜು ನಾರಾಯಣ & Surya | ಸೂರ್ಯ\nCo-ordinator | ರಂಗ ನಿರ್ವಹಣೆ : Basavaraj Emmiyavar | ಬಸವರಾಜ ಎಮ್ಮಿಯವರ \n\n\nSupported by:\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%95%e0%b3%8d%e0%b2%b0%e0%b2%be%e0%b2%82%e0%b2%a4%e0%b2%bf-%e0%b2%ac%e0%b2%82%e0%b2%a4%e0%b3%81-%e0%b2%95%e0%b3%8d%e0%b2%b0%e0%b2%be%e0%b2%82%e0%b2%a4%e0%b2%bf-kranthi-bantu-kranthi/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "ಕ್ರಾಂತಿ ಬಂತು #ಕ್ರಾಂತಿ | Kranthi Bantu #Kranthi"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-935.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75651-1753468200-1753473600@bangaloreinternationalcentre.org",
    "name": "Kailash-Manasarovar",
    "startDate": "2025-07-25T18:30:00+05:30",
    "endDate": "2025-07-25T20:00:00+05:30",
    "description": "For centuries, Tibet has remained a land of mystery. Though sacred to millions, Mount Kailash and Lake Manasarovar, were still wrapped in myth as recent as the 1900’s. This session retraces the journey of two travelers, a Swedish explorer and an Indian ascetic, whose visits illuminated the mythical and sacred Kailash-Manasarovar region in Tibet. \nBetween 1907 and 1909, Swedish explorer Sven Hedin mapped the region. He traced the sources of the three great rivers – the Brahmaputra, Indus, and Sutlej – and became the first European to walk around Mount Kailash. Three decades later, Indian monk Swami Pranavananda arrived in the region. He offered a fresh view, challenging Hedin’s identification of the rivers’ sources, offering, for the first time, an informed Asian perspective on Tibet’s geography. \nThis visually rich talk brings their stories to life. Rare archival material, contemporary photos, and new research reveal how these journeys shaped our understanding of a sacred landscape. \nThe Q&A after the session offers room for your participation – whether curious about history, travel, or sacred places. \n",
    "url": "https://bangaloreinternationalcentre.org/event/kailash-manasarovar/",
    "keywords": [
      "Cities",
      "Culture",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-931.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76478-1753036200-1753041600@bangaloreinternationalcentre.org",
    "name": "English & Our Many Selves",
    "startDate": "2025-07-20T18:30:00+05:30",
    "endDate": "2025-07-20T20:00:00+05:30",
    "description": "Rita Kothari argues that English rarely exists in isolation; it is accompanied by other languages that often remain hidden in our personal and domestic spheres. Emphasising language as lived experience and advocating for linguistic democracy, her talk explores how people express the desire for self-redefinition through shifts in language, from subtle changes in pronunciation to fully adopting or rejecting a language. Kothari highlights how marginalised communities use language to resist dominant norms, showing that linguistic expression is deeply tied to identity and power. She reminds us that while all experiences are shaped by language, not all meaning depends solely on it. \nThe talk will be followed by a Q&A session with the audience. \nThis lecture is a part of Azim Premji University’s Public Lecture Series. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/english-our-many-selves/",
    "keywords": [
      "Culture",
      "Development",
      "Language",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-70.jpg"
  }
]