[
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "70691-1740333600-1740339000@bangaloreinternationalcentre.org",
    "name": "Voices of Teesta",
    "startDate": "2025-02-23T18:00:00+05:30",
    "endDate": "2025-02-23T19:30:00+05:30",
    "description": "42 minutes, 04 seconds | Nepali, English & Lepcha | English Subtitles \n“Before the formation of this holy Rongnue (Teesta) from the bottom of Kongchen (Khanchendzonga), \nWe used to narrate the parentage of River Rongnue, \nWater of the river Teesta we use to offer during the ritual, \nIf this water dries up, there will be a drought, \nRongnue is a holy water, it is a god of water… Achulay, we narrate as a song, \nAchulay \nRongnue is the god of water…” \nWith hydro energy being one of the convenient and available energy source for the development of any given State, the film tries to understand the relationship between various groups and communities of Sikkim and West Bengal with River Teesta. This film tries to trace the faint and unheard voices of local people who are affected by these developments. It travels from the source of River Teesta till the tip of the plains of North Bengal, traverses through mini and mega hydel projects to capture these naked voices and their bond, angst, adaptation and reconciliation with River Teesta. \nThe story particularly revolves around the unique practice and beliefs of mountain communities and they express their significance of the river through their folklore, sacred ritual and scriptures. Communities from downstream struggle to balance their faith and religion with such developments and others confess the helpless need of sustaining and adapting to the changing economic patterns and surmounting unemployment. The film eventually ends with a question if Teesta will ever speak for herself. \nThe film screening will be followed by a discussion and Q&A with the audience. \nCredits:\nDirector: Minket Lepcha\nEditor: Wangyal Sherpa & Salil Mukhia\nCinematographer: Anup Aadin Das\nSound: Hishey Bhutia\nResearch: Kachyo Lepcha & Minket Lepcha \n",
    "url": "https://bangaloreinternationalcentre.org/event/voices-of-teesta/",
    "keywords": [
      "Culture",
      "Environment",
      "Film",
      "Society",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ne",
    "workPresented": {
      "@type": "Movie",
      "name": "Voices of Teesta"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-42.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "70475-1739991600-1739997000@bangaloreinternationalcentre.org",
    "name": "Alma Trio",
    "startDate": "2025-02-19T19:00:00+05:30",
    "endDate": "2025-02-19T20:30:00+05:30",
    "description": "Alma Trio is an eclectic confluence of Indian and Spanish jazz fusion sounds, by virtuosic performers Carola Ortiz from Spain (Vocals & Clarinet), Vishnu R (Navtar) & Charu Hariharan (Indian & World Percussion). \nRooted in tradition and with a contemporary outlook, Alma Trio weaves a rich tapestry of string, wind and percussive elements that take listeners on a journey from India to the Mediterranean. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/alma-trio/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Alma Trio"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "70351-1740078000-1740083400@bangaloreinternationalcentre.org",
    "name": "Khusro Ke Shyam",
    "startDate": "2025-02-20T19:00:00+05:30",
    "endDate": "2025-02-20T20:30:00+05:30",
    "description": "Amir Khusro, a revered disciple of the great Sufi saint Hazrat Nizamuddin Auliya, was not only a mystic but also a spiritual poet whose works transcended boundaries. After Auliya had a vision of Lord Krishna in a dream, he encouraged Khusro to compose songs and poems in honor of the deity. \nThis evening will feature a beautiful presentation of Khusro’s heartfelt tribute to Krishna. Six distinctive compositions, created by Hindustani Classical vocalist Madhumita Ray, will showcase Khusro’s genius in various classical genres such as Khayal, Thumri, Hori, and Qawwali. Each piece will offer a unique musical journey, illustrating the depth and creativity of Khusro’s work. \nSupported by : \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/khusro-ke-shyam/",
    "keywords": [
      "Heritage",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Khusro Ke Shyam"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-2.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "70196-1740240000-1740247200@bangaloreinternationalcentre.org",
    "name": "The Plate is a Portal",
    "startDate": "2025-02-22T16:00:00+05:30",
    "endDate": "2025-02-22T18:00:00+05:30",
    "description": "Food holds the power to nourish and sustain us, to delight and transport us. A good meal can collapse the distance between my past and my present, ferry me to faraway family, or bring me closer to my inner child. For writers, food is an especially potent means to delve into memory, notions of home, heritage, and relationships. \nIn this workshop, open to writers in all genres, we will consider the plate as a portal, reaching through sensorium and memory to explore what food can offer to our practice. We will read prose and poetry about food together and discuss the role that food plays as a cultural signifier, as a love language in the domestic space, as a carrier for history, and more. \nThrough guided generative work, participants will be invited to consider the food that has nourished them in its fullness – where it comes from, what historical and personal narratives it holds, what language it allows them to access, how it might have changed over time. We’ll read, write, and share, working together to discover the ways in which the theme of food can nourish our writing. \nWhile the workshop will be conducted in English, and we’ll be reading primarily English-language texts, writers are welcome to make use of any language(s) they wish to. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-plate-is-a-portal/",
    "keywords": [
      "Food",
      "Language",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_poster-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "63762-1740769200-1740772800@bangaloreinternationalcentre.org",
    "name": "The Earthquake",
    "startDate": "2025-02-28T19:00:00+05:30",
    "endDate": "2025-02-28T20:00:00+05:30",
    "description": "\n54 minutes | English, Hindi, Kannada | Suitable for 13+ Years\nTrigger Warnings: Themes of Loneliness \n\n\n\n\nDo you ever feel alone, even when surrounded by people? Do you crave connection, even when it cracks a little? \nMira and Sameer meet every week, their meeting as familiar as the apple they share. They speak. Someone leaves. They do this again. And again. Mira goes on a boat ride. Sameer stays in a bubble. There is silence. And again. Mira and Sameer are friends… Yet, their unspoken words scream louder than their conversations. \nThis is a story of cycles. Of coming together, drifting apart, and all the spaces in between. \nWhat happens when we finally face our truth? Maybe we hear a strange noise… \nThis is an adaptation of “Bhūmikampa – Das Erdbeben” which received funding for International Cultural Projects from The Department of Arts and Culture of the City of Munich \n\n\nFrom the Playwrights (Samragni Dasgupta and Marvin Krause):\nTwo young artists from India and Germany meet on a farm in Bengaluru as part of an exchange program. They get to know each other and realise that cultural differences are just one aspect of human connection. They come together to develop something together. But what?The idea for this collaboration started with a conversation about loneliness. Above all, how loneliness is a common factor for young people in all countries. From loneliness to the intricacies of human relationships, two people began an intensive writing process to explore the many facets of human connection.\n\nFrom the Director:\n“Mira and Sameer find themselves surrounded by unspoken words. ‘The Earthquake’ delves into the essence of human relationships—our connections, routines, distances, and all the spaces in between. It asks us what it means to be truly seen or heard. What happens when we finally face the unspoken truths in our interpersonal relationships?”\n\n\n  \nCredits: \nPlaywrights: Marvin Krause and Samragni Dasgupta\nDirector: Shania Mathew \nCast: \nMira: Samragni Dasgupta\nSameer: Naman Roy \nThe Earthquake received the Internationaler Kulturprojekte Grant 2023 from the Landeshauptstadt München Kulturreferat (City of Munich). \nProduced by     \n\nWith Support from \n\n \n\n",
    "url": "https://bangaloreinternationalcentre.org/event/the-earthquake/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "The Earthquake"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-599.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70251-1740164400-1740169800@bangaloreinternationalcentre.org",
    "name": "Athaah",
    "startDate": "2025-02-21T19:00:00+05:30",
    "endDate": "2025-02-21T20:30:00+05:30",
    "description": "Athaah is an exploration of innovative ways to engage with the depth of tradition. By integrating the classical Odissi repertoire with fresh compositions, it offers a contemporary perspective while honouring its roots. \nThis is the fifth edition of the ‘All For Dance’ series presented by Kalavaahini in association with BIC curated by Malavika Sarukkai. The ‘All For Dance’ series is presented every quarter at BIC to spotlight some of the best of classical dance from across India. The series is supported by Tanishq and Taneira. The event is managed by Shreya Nagarajan Singh Arts Development Consultancy. \nIn collaboration with: \n \nSupported by: \n   \n",
    "url": "https://bangaloreinternationalcentre.org/event/athaah/",
    "keywords": [
      "Culture",
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-37.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70485-1740076200-1740081600@bangaloreinternationalcentre.org",
    "name": "The Nature of Clay",
    "startDate": "2025-02-20T18:30:00+05:30",
    "endDate": "2025-02-20T20:00:00+05:30",
    "description": "Kate Malone, one of the UK’s leading ceramic artists, speaks about her relationship with clay, what it is, where it is from, why it behaves the way it does, and how we live with it from day to day. She will discuss the wonders of her wide palette of crystalline glazes and provide a brief introduction to her own work in decorative arts, public arts, and her place within her ceramic community. She will also provide a personal overview of the spectrum of ceramic artists in the UK today, including their work in decorative arts, interiors, fine art, and installations. \nImage Credits: \nHeader and Instatory: Photo by Alun Callender \nThumbnail and Poster: Photo by William Taylor \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-nature-of-clay/",
    "keywords": [
      "Design",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-39.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "69836-1739989800-1739997000@bangaloreinternationalcentre.org",
    "name": "Agents of Happiness",
    "startDate": "2025-02-19T18:30:00+05:30",
    "endDate": "2025-02-19T20:30:00+05:30",
    "description": "2024 | 90 minutes | Nepali and Dzongkha with English subtitles | Bhutan/Hungary \nCan you measure happiness? The country of Bhutan invented Gross National Happiness to do just that, and Amber is one of the agents who travels door to door to meet people and see how they feel. However, he hasn’t gotten around to measuring his own happiness level. Still living with his mother at the age of 40, he’s nevertheless a hopeless romantic who dreams of finding love. But as one of the Nepali minorities who were deprived of their citizenship, Amber isn’t the most eligible bachelor. We embark with Amber on his bittersweet journey to encounter Bhutanese from all walks of life. At the end of the road, we are reminded of the fragility and beauty of our own happiness. No matter where we live. \nFollowing the screening, Director, Arun Bhattarai will participate in the discussion with Usha Rao, followed by a Q&A session with the audience. \nProducers: Arun Bhattarai, Máté Vince, Noémi Veronika Szakonyi \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/agents-of-happiness/",
    "keywords": [
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ne",
    "workPresented": {
      "@type": "Movie",
      "name": "Agents of Happiness"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-34.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70543-1740308400-1740315600@bangaloreinternationalcentre.org",
    "name": "From Playground to Podium",
    "startDate": "2025-02-23T11:00:00+05:30",
    "endDate": "2025-02-23T13:00:00+05:30",
    "description": "Parents play a vital role in the sports journeys of any athlete. Whether it is introducing them to sport, providing transport support, managing nutrition, providing encouragement or financing a career, they are a vital cog in the wheel. \nParenting is challenging at the best of times. Parenting a child playing, and aspiring to excel at, sport is a complex balance that can stretch even the most confident and knowledgeable parent. Yet, there are few resources for parents on navigating the complexities of career planning and management, emotional support, ambiguous progression pathways and opaque governance structures. \nThis event aims give an opportunity to parents who finds themselves searching for insights and experiences that might be valuable in their own journeys and those of their children and to foreground issues and provide perspectives to support parents on the journey of parenting their sports child.  \nThe event will host two panel discussions involving parents who have supported their children’s quests for sports excellence followed by a panel of experts who have advised athletes and parents on their journeys. Each panel discussion will be followed with a brief Q&A session. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/from-playground-to-podium/",
    "keywords": [
      "Health & Wellness",
      "Society",
      "Sports"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-41.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "70248-1740308400-1740315600@bangaloreinternationalcentre.org",
    "name": "The Art of Lines",
    "startDate": "2025-02-23T11:00:00+05:30",
    "endDate": "2025-02-23T13:00:00+05:30",
    "description": "Join us for a calligraphy event where you’ll discover the art of writing and visual storytelling that combines learning, creativity, and inspiration, offering a hands-on journey into the world of calligraphy. \nThe event will start with a presentation by the artist on calligraphy as an expressive art form, followed by a showcase of Parameshwar Raju’s Ramayanam slides, revealing his narrative calligraphic artistry. \nThis will be followed by a hands-on workshop to learn dip nibs and pens basics, briefly touch upon rhythm and control, and create personalized patterns and images. Showcase your work for a chance to win a prize! \nThe event wraps up with  a look into the art in the book The Wonderful Calligraphy of Poosapati Parameshwar Raju and include an interactive discussion with the author and artist. \nThroughout, admire select paintings by Parameshwar Raju, showcasing his blend of tradition and innovation and walk away inspired and with a newfound appreciation for this timeless art. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-art-of-lines/",
    "keywords": [
      "Books",
      "Visual Arts",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-36.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "70212-1740596400-1740600900@bangaloreinternationalcentre.org",
    "name": "This Is Not a Solo",
    "startDate": "2025-02-26T19:00:00+05:30",
    "endDate": "2025-02-26T20:15:00+05:30",
    "description": "This is not a solo | 23 min | Vanessa Vieira da Cunha\n(De)construction. The hidden. The exposed. What is. What was. What it no longer is but could be again. Antagonistic relationships create space for a gray place, the place that inhabits what is not yet one thing or the other. This is not a solo aims to research and deepen issues related to identity, the exposure of the self, the importance we attribute to the set of qualities and particularities that we think define us, the place of confrontation with the vision of the another, the dizzying sensation of detaching ourselves from what is known and comfortable to reveal inner layers that remain inaccessible to others.\n \nEgo | Echo | 15 min | Indrek Kornel\nA dialogue between self and surroundings, Ego | Echo explores the interplay of reflection an resonance. Hyper-aware of the textures, sounds, tastes, and rhythms of the here and now, the performer navigates the constant feedback loop between their body and the world around them. How does the echo of their presence alter the ego of their being? In this improvised journey, they let each moment reshape them—a push and pull between intention and instinct, order and chaos, heaven and hell. It is a movement through the shifting landscapes of self and space, where the only constant is the present. \nFloating Clouds | 15 min | Abhilash Ningappa\nFloating Clouds is a contemplative performance that examines the complexities of life through the lens of artistic expression. It reflects on the universal challenges, aspirations, and fleeting triumphs that shape the human experience The piece combines expressive dance, spoken word, and symbolic gestures to create a rich tapestry of movement and meaning. The choreography, marked by fluidity and grace, evokes the transient beauty of clouds, offering a metaphor for the impermanence of life. Spoken text serves as a bridge, drawing the audience into the narrative and fostering a shared space of reflection. Through its interplay of movement and language. Floating Clouds invites audiences to engage with themes of transformation, resilience, and the ephemeral nature of existence.\n \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/this-is-not-a-solo/",
    "keywords": [
      "Dance",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "This Is Not a Solo"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-721.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69739-1739903400-1739908800@bangaloreinternationalcentre.org",
    "name": "Exploring the Temples of the Deccan",
    "startDate": "2025-02-18T18:30:00+05:30",
    "endDate": "2025-02-18T20:00:00+05:30",
    "description": "Of all regions of India, the Deccan has the most diverse architectural traditions, nowhere better shown than in the variety of stone temples sponsored under a succession of dynasties which ruled peninsular India over some 700 years. To illustrate this unique diversity, Michell explores religious monuments at lesser-known sites. He begins with Early Chalukya temples overlooking the Tungabhadra river at Alampur, and ends with the imposing Kakatiya monument at the out of the way village of Palampet, both in Telangana. In between, he discusses the Nolamaba period shrines at Nandi and Shravana Belgola, and those of the Later Chalukyas at Sudi, Kuruvatti and Lakkundi, all in Karnataka. He concludes with the little visited Hoysala period shrines at Belavadi, Mosale and Agraha Bachhahalli. \nThe lecture will be followed by a Q&A Session with the audience. \nImage credit – Surendra Kumar \nIn collaboration with:\n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/exploring-the-temples-of-the-deccan/",
    "keywords": [
      "Architecture",
      "Design",
      "Faith",
      "Heritage",
      "History"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-705.jpg"
  }
]