[
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Moon on the Man",
    "startDate": "2024-07-02T18:30:00+05:30",
    "endDate": "2024-07-02T20:00:00+05:30",
    "description": "2021 | 75 mins | English and Hindi | India \nMoon on the Man is an observational and exploratory feature length documentary that questions the most basic assumptions of reality, perception and choices. As such, it is synonymous with every individual’s struggle to find direction, some that bear fruit in the ever-evolving landscape of human perspectives and others that segue into mental illness, old age and broken dreams. \nThe film looks at two eccentric personalities Praklawn and Sailesh, through their stories, life experiences and their everyday activities. This narrative is annexed by Aasif and Wadood at a juncture when the stories of Praklawn and Sailesh enter into the realms of magic realism. They scrutinize Praklawn’s and Sailesh’s eventful past and their debate on the men’s life throws open a Pandora’s box which questions the very nature of our reality. \nThe screening of the film will be followed by a discussion with Director, Prince Shah and Filmmaker, Sunanda Bhat. A Q&A with the audience will follow. \nCredits:\nDirector: Prince Shah\nCinematographer: Vaibhav Sorte\nEditors: Ashish Ranglani, Prince Shah\nMusic Composer: Prassanna Vishwanathan\nSound: Tarun Bhandari\nGrade: Kabir Nagranee\nProducers: Anshul Pandey, Prince Shah \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/moon-on-the-man/",
    "keywords": [
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-516.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Fourth Wave",
    "startDate": "2024-06-23T11:30:00+05:30",
    "endDate": "2024-06-23T13:00:00+05:30",
    "description": "Despite the clear danger of the rise of totalitarianism in India today, Radha Kumar’s book, The Republic Relearnt: Renewing Indian Democracy (1947-2024) aims is to look forward to the moment when democracy will be renewed in the country and ask what lessons can be learnt from past experience to anchor it more firmly when the opportunity arises. \nIt is generally assumed that Indian democracy has had an unbroken run since Independence, with the brief disruption of the 1975–77 Emergency. While those two years saw a stark assault on democratic institutions, Indian democracy had been repeatedly punctured prior to the Emergency, and it has been threatened many times since. The country underwent almost four decades of democracy decay after the founding years of the republic, as compared to the three relatively short-lived waves of democracy renewal. That fact makes an examination of these three waves rather significant. \nExamining the three waves of democracy renewal, Kumar finds that the most valuable lessons lie in policy actions as well as proposals that were left unimplemented. These, which ranged from electoral reform to human development, social justice and institutional as well as federal autonomy, could form the bedrock for a third republic, albeit partly. India’s democratic future, Kumar concludes, depends on the extent to which a revived political opposition and civil and political society can draw on the lessons of the three waves of democracy renewal. \nIn this session, she is in conversation with Lakshmi Arya Thathachar, Professor, RV University. A Q&A with the audience will follow. \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-fourth-wave/",
    "keywords": [
      "Books, Governance, Nonfiction, Policy & Regulation"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-515.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Living the Past, Dancing in the Present",
    "startDate": "2024-06-20T19:00:00+05:30",
    "endDate": "2024-06-20T20:30:00+05:30",
    "description": "Living the Past, Dancing in the Present is an illustrated lecture-demonstration of the Sattriya dance tradition of Assam. \nThe presentation will be supported by audio-visuals and archival recordings that elaborate upon the historical roots of the dance form, its distinctive features, the present context in relation to changing time and space and the celebration of dance as a living art heritage. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/living-the-past-dancing-in-the-present/",
    "keywords": [
      "Culture*, Dance, Heritage, Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-500.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "A Ballet Soirée",
    "startDate": "2024-06-25T19:00:00+05:30",
    "endDate": "2024-06-25T20:15:00+05:30",
    "description": "The National Youth Ballet company will present an evening of repertoire that is curated with excerpts from classical and modern ballets. Among the varied selection are pieces from timeless ballets like The Nutcracker, Paquita, La Bayadere, and Swan Lake. \nFrom the wintry escapade of the Waltz of the Snowflakes, the charm of the tambourine in La Esmeralda to the gripping Ankle Scarf Dance from La Bayadere, the pieces will be weaved together to transcend the audience into a land of ethereal artistry. The soirée aims to offer insights into the multifaceted realms of ballet while delving into its nuanced expression. \nIn collaboration with: \n \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-ballet-soiree/",
    "keywords": [
      "Dance, Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-486.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Fact and Fiction – Inside the Election Commission",
    "startDate": "2024-06-24T18:30:00+05:30",
    "endDate": "2024-06-24T20:00:00+05:30",
    "description": "India has emerged as a leader and a model for ‘electoral governance’. The Election Commission, a constitutional body has orchestrated all our elections including the most recent one which by all accounts has been a stellar success; How is the Election Commission managing national and state elections, year after year; what are the challenges it faces; what are the perceptions, and misconceptions political parties in the fray and the voters have during elections; how does the Election Commission address such issues, try to remain above controversy and conduct free and fair polls? \nA presentation by Mr. Vinod Zutshi will be followed by a Q&A with the audience. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/fact-and-fiction-inside-the-election-commission/",
    "keywords": [
      "Governance, Policy & Regulation, Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-511.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Is Demography Destiny?",
    "startDate": "2024-06-19T18:30:00+05:30",
    "endDate": "2024-06-19T20:00:00+05:30",
    "description": "In the context of contemporary US elections, many have claimed that “demography is destiny.” This kind of rhetoric became particularly popular among Democratic strategists after Barack Obama was elected as president in 2008. According to this theory, Democrats will have a significant advantage in upcoming national, particularly presidential, elections, given the party’s widespread appeal among a multiracial and otherwise diverse coalition of voters. The Republican Party, in this view, has made a strategic miscalculation by relying too heavily on white (particularly white male) voters, especially since the Nixon years. In recent years, however, there is a growing sense among many observers that demography may not, after all, be destiny; that voting behavior may not neatly align along a white-nonwhite divide, with non-Hispanic white men voting for the Republican Party and the rest of the country voting Democrat. \nIn this lecture, Prof. Cyril Ghosh will offer an overview of this debate, with some remarks about what we might expect to see in the 2024 US presidential elections. In so doing, he will discuss the demographic make-up of the voting blocs of each of the two major parties in the US, how they came to be, and how they are likely to vote in November 2024. \n",
    "url": "https://bangaloreinternationalcentre.org/event/is-demography-destiny/",
    "keywords": [
      "International Relations, Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-498.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Secularism, Religion and Women",
    "startDate": "2024-07-12T18:30:00+05:30",
    "endDate": "2024-07-12T20:00:00+05:30",
    "description": "This panel discussion is a conversation between two authors who also share a teacher-student relationship. Nivedita Menon will speak on her latest book, Secularism as Misdirection, while Debangana Chatterjee, her student from Jawaharlal Nehru University, will present her first book, Lives of Circumcised and Veiled Women. The intellectual pursuits of two individuals, which converged in classroom discussions once, complete a full circle of knowledge creation. The conversation aims to probe religion and secularism using gender as the focal point. \nThe conversation aims to probe religion and secularism using gender as the focal point. Menon’s title alludes to perspectives from the global South and India. In her argument, secularism performs a “misdirection” as in the performance of a magic trick. It simultaneously hypervisiblises women and religion and obscures caste, capitalism, and the non-individuated, non-rational self.  Chatterjee’s work sheds light on the politics of representation and the process of exoticising women’s bodies in knowledge production; presenting the politics which cloaks the ‘misdirection’. It brings out the intricacies of representational discourses around cultural practices of female circumcision and Islamic veiling. \nThe conversation will be moderated by Rinku Lamba, followed by a Q&A session with the audience. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/secularism-religion-and-women/",
    "keywords": [
      "Books, Faith, Gender, Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-520.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The City and the Scam",
    "startDate": "2024-06-22T18:30:00+05:30",
    "endDate": "2024-06-22T20:00:00+05:30",
    "description": "In this event, Professor Malini Ranganathan will discuss her new book, Corruption Plots: Stories, Ethics, and Publics of the Late Capitalist City (Yoda Press 2024, Cornell University Press 2023). Through ethnographic fieldwork, the book studies what its co-authors call “corruption plots” from the streets of Bengaluru and Mumbai, where black money, skyscrapers, land grabs, encroachment on wetlands, and slum evictions invoke outrage at deepening economic polarization and the impunity with which the real estate lobby operates. Flying in the face of conventional wisdom, the book argues that corruption is a story-telling practice charged with ethical meaning, one that does not simply condemn illegality or bribery, but is also used to call attention to the legal—and legalized—abuses of power by the state, political class, and elites. \nAt the same time, the book warns that anger by various publics about corruption is uneven, inflected by caste, class, and ethno-religious bias, especially in the context of rightwing nationalism and crony capitalism in India. Why do certain things get called “corruption” while others don’t—and why do corruption charges suddenly erupt into public discourse, while at other times remain muted in the background?  \nDrawing on ethnography in two Indian cities undertaken in 2018, as well as a cross-section of films and novels on the global city (in India and beyond), this book attends to the political slipperiness, sensationalism, and opportunism associated with corruption talk, wherein fantastical scams about the city can often appear more fictional than factual. Ultimately, in deriving a humanistic and multifaceted theory of corruption—sorely lacking in one-dimensional policy pronouncements—the book contends that across the world’s ostensible democracies, we need a more grounded analysis of how anti-corruption has been selectively championed and challenged, and with what effects, by both liberal and rightwing regimes. More information available here. The author will briefly discuss the book, followed by a conversation with Professor Sushmita Pati and an audience Q&A. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-city-and-the-scam/",
    "keywords": [
      "Bangalore, Cities, Politics, Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-512.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "ಅಮ್ಮ ಮತ್ತು ಸುಹೇಲ್ | Amma Mattu Suhail",
    "startDate": "2024-07-08T19:00:00+05:30",
    "endDate": "2024-07-08T20:30:00+05:30",
    "description": "Kannada | 90 minutes | Suitable for Ages 16+  \nThe play is an ode to queer love. It is a meditation on the values of empathy and dialogue as powerful agents to bring estranged minds together. The narrative traverses through moments of passion, anger, sadness, and love in its raw human element. The characters attempt to interrogate, understand, and acknowledge each other, and in this process, unveil the universality of all emotions as being the same, irrespective of gender and orientation. The play tries to deconstruct and lay open the psychological and emotional baggage of the characters who are but symbols of the divided humanity that we are today. An interfaith gay couple and the mother of one of the characters venture on a journey of understanding one another rather light-heartedly through uncomfortable conversations, only to explore depths which they never knew or imagined would be possible to unearth. \n\n\n\n\nPlaywright/Director’s Note: \nWith the drastic change in the political discourse the world has witnessed in the last few years, one cannot but notice the drastic emergence of an undeniable divide within humanity. There are two segments that appear to be in stark contrast, constantly struggling and fighting with each other. There is a constant othering and exclusion of minorities by the majority in power. During the pandemic, the apathy by the political class at large was glaringly visible and we witnessed in full display the class disparity that envelops our nation. The Hindu – Muslim rhetoric was constantly fed to us through public discourse and hate was offered as a staple diet for even those who refused to be part of it. \nThe artist felt compelled to speak up, believing that love is the only antidote to the vehement poison of hate. They hence decided to write and direct this play that features the love story of a gay couple hailing from the Hindu and Muslim communities. Diversity cannot be celebrated without the intersectionality that makes for the complex mix of the society we are. The play intends to hold the mirror to the microaggressions and biases that consume us all through humor and emotional storytelling. \nWith music, love, and humor, the play tries to unravel the demons of Islamophobia and homophobia in us all. It celebrates the value of empathetic dialogue and honest communication in eradicating hate. Amma mattu Suhail is a tender story of love, acceptance, and possibilities. \nThe artist is a classical musician, writer, and theatre practitioner, and their arts practice is always an amalgamation of these elements. They create out of necessity! Having grown up queer and gender fluid, they struggled to find representation in the Kannada arts scene and were disappointed. They tried to fit in and adapt to the arts “as is” but eventually found it suffocating and had to carve out their own path and create what they wanted to engage with. They strive to bring marginalized voices to the fore and their stories or creations always aim to question and break patriarchal stereotypes and conditioning. Their search is always to find fluidity. Just like their characters either in the plays they have written or in the dance-based compositions they have created, which always traverse through the non-binary nature of gender identity or sexuality, the art they create yearns to find fluidity in form and content. They break the structure and form using non-linear narratives, democratic – secular emotional indulgences, and fluid emotional paradigms. They attempt to convey the grotesque bizarreness of our social existence with humor and the humorous, funny realities that define us through the macabre. \nThey always like to begin with an uncomfortable space and establish familiarity with the unfamiliar. Most importantly, they want their art to be accessible to all class and caste sections of society. They often find it very difficult to mold their form in a way that does not “other” an audience which has no access to learning arts appreciation or delving into abstraction. While they try to abstain from dumbing down their audience, they make it a priority to make their arts inclusive. Having been in circles where art is created and consumed in the same vicious elitist spaces and circles, they yearn to connect to a larger canvas. \nHaving written, produced, and directed three plays, their exploration has always yearned to find that fluidity between sound and silence, prose and poetry, body and realism. They aim to tell more queer stories which are embraced by the mainstream and more mainstream stories which make the queer community feel that they are “seen”. Whilst they are cognizant of the brutal grays that marginalized voices live in, they believe we need more positive representation of these marginalized characters. Their younger queer self wanted to watch happy endings and stories of hope and not just suicide and tragedies. They work only on stories which are fictional retellings of lived experiences and also for these stories to be specifically told in Kannada. Regional languages have the power to automatically place these stories in a certain space while also making sure to remove them from only English-speaking elite spaces. They strive to create work which opens itself to a more vulnerable audience who need to hear, get uncomfortable, and feel ignited towards a spirit of inquiry through these stories. \nThey will be glad if their art is also entertaining but they will never be okay if it is not activism. \nCredits: \nPlaywright – Direction – Music : Karthik Hebbar\nCast: Dr Seetha Kote, B V Shrunga, Arun D T\nLighting: M G Naveen\nProduction Manager: Murali Sreeram\nSubtitles Execution: Chethana Ramesh Srivatsa\nBackstage: Vishak Bharadwaj and Soumya Dixit\nProduced by Dheemahi Theatre \nDheemahi Theatre was born out of the need to create a safe space for new voices. We are a space for the “outsiders”. We have come together to tell stories that have been oppressed and suppressed in other majoritarian spaces. Empathy and humanity are the main focuses of all the work that we create. We as a team thrive on celebrating diversity and secular narratives by exploring and devising new techniques for facilitating these stories. We work around minimalist production setups and maximal internal processes. With a passion for storytelling that transcends boundaries, we strive to create a stage that reflects the kaleidoscope of human experiences. Our productions are more than performances; they are a canvas of shared narratives that resonate with the richness of our collective journey. We aspire to weave together tales that inspire, provoke thought, and unite us in the magic of the theatre. \nSupported by: \n \n\n\n\n\n\n\n\n  \n\n\n\n\n\n\n\n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%85%e0%b2%ae%e0%b3%8d%e0%b2%ae-%e0%b2%ae%e0%b2%a4%e0%b3%8d%e0%b2%a4%e0%b3%81-%e0%b2%b8%e0%b3%81%e0%b2%b9%e0%b3%88%e0%b2%b2%e0%b3%8d-amma-mattu-suhail/",
    "keywords": [
      "Performing Arts, Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "ಅಮ್ಮ ಮತ್ತು ಸುಹೇಲ್ | Amma Mattu Suhail"
    },
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "ಅಮ್ಮ ಮತ್ತು ಸುಹೇಲ್ | Amma Mattu Suhail"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-506.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "ಆಶ್ಚರ್ಯ ಚೂಡಾಮಣಿ | आश्चर्य चूड़ामणि | Ascharya Choodamani | આશ્ચર્ય ચૂડામણિ | ਅਸਚਾਰ੍ਯ ਚੂੜਾਮਣੀ",
    "startDate": "2024-07-01T19:00:00+05:30",
    "endDate": "2024-07-01T20:00:00+05:30",
    "description": "Hindi, English, Punjabi, Marathi, Kannada, and Gujarati | 60 Minutes | Suitable for all ages \nAscharya Choodamani is a vibrant theatrical adaptation by Prasanna inspired by the timeless classic, Alice in Wonderland, showcasing a delightful fusion of six languages: Hindi, English, Punjabi, Marathi, Kannada, and Gujarati. Audiences get a linguistic rollercoaster, experiencing a delightful confusion of languages that adds to the comic charm of the production. \nAt the heart of the play is the spirited character of Choodamani, a young girl who radiates joy and curiosity, always seeking out surprises in her whimsical world. Her infectious energy draws the audience into her enchanting journey filled with wonder and laughter. \nAccompanying Chudamani are three animals, each adding their own unique flavour to the narrative. Their interactions with Chudamani spark lively exchanges and moments of humour, enriching the theatrical experience. \nOne of the standout features of Ascharya Choodamani is its interactive nature, inviting the audience to become actively engaged in the unfolding story. With rhythmic and live songs interwoven throughout the performance, viewers are transported into a world where music and storytelling seamlessly blend, creating an immersive and memorable theatrical experience for all. \nDirector’s Note: \nOver the past few years, I’ve delved into the realm of Theatre in Education, recognising the profound impact theatre can have on both children and adults alike. \nIn today’s fast-paced world, where digital distractions often take precedence over outdoor activities and meaningful social interactions, it’s imperative that we make efforts to reconnect younger generations with the simple joys of life. Ascharya Choodamani serves as a poignant reminder of the beauty found in community, nature, and human connection. \nAs an initiative of the Indian Theatre Foundation (ITF), this production aims to bridge the gap between modernity and tradition, inviting audiences to rediscover the magic of storytelling and performance art. Through the collaborative efforts of young artists hailing from diverse regions and cultures, we bring to life the vibrant tapestry of Ascharya Choodamani, enriching it with their unique experiences, talents, and musicality. \nThis play is not merely entertainment; it’s a celebration of cultural diversity and a testament to the power of unity. With its humorous and multilingual elements, Ascharya Choodamani promises to captivate audiences of all ages, inviting them on a journey of laughter, reflection, and wonder. \n \n  \nWith Support from: \n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%86%e0%b2%b6%e0%b3%8d%e0%b2%9a%e0%b2%b0%e0%b3%8d%e0%b2%af-%e0%b2%9a%e0%b3%82%e0%b2%a1%e0%b2%be%e0%b2%ae%e0%b2%a3%e0%b2%bf-%e0%a4%86%e0%a4%b6%e0%a5%8d%e0%a4%9a%e0%a4%b0%e0%a5%8d%e0%a4%af/",
    "keywords": [
      "Performing Arts, Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "pa",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "ಆಶ್ಚರ್ಯ ಚೂಡಾಮಣಿ | आश्चर्य चूड़ामणि | Ascharya Choodamani | આશ્ચર્ય ચૂડામણિ | ਅਸਚਾਰ੍ਯ ਚੂੜਾਮਣੀ"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-521.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "#PageTurners",
    "startDate": "2024-06-22T11:30:00+05:30",
    "endDate": "2024-06-22T13:00:00+05:30",
    "description": "The timeless love for reading, particularly young adult fiction, thrives in that glorious corner of the internet—Bookstagram and BookTok—dedicated to books, where heartfelt reviews, discourses on classics, and subs enriching beloved stories with hot takes, POVs, and fanfics converge. This vibrant online ecosystem seamlessly extends into real-life gatherings, creating a dynamic forum where virtual discussions about young adult narratives spark deeper in-person dialogues and connections. It’s a testament to the enduring relevance of stories, whether shared in paperback, hardbound, or PDFs. \nJoin us for a compelling panel discussion centered around Poile Sengupta’s novel, A Higgledy Piggledy Growing Up. This 90-minute session will feature a panel of four passionate readers, writers, and lovers of literature, exploring the evolution and current state of young adult crossover fiction in Indian English literature—a genre that has blossomed significantly over the past two decades. \nThe discussion will dive into how today’s cultural dynamics in India cultivate a fertile ground for innovative narratives that resonate across generations. The panel will explore Higgledy Piggledy Growing Up, following Neel, a fourteen-year-old from Bengaluru, whose ordinary life is swept up in extraordinary adventures—combining humour, romance, and a poignant awareness of societal divides – promising a deeper understanding of how young adult literature both reflects and influences the shifting societal landscape, enhancing appreciation for its transformative impact. \nWhether you’re a seasoned aficionado or a newcomer to the genre, this event is designed to deepen your connection with the transformative world of young adult literature in India. \nThe session will be peppered with readings and the panel will engage in Q&A with the audience towards the end. \n",
    "url": "https://bangaloreinternationalcentre.org/event/pageturners/",
    "keywords": [
      "Books, Fiction, Literature"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-507.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Matters of Plasma",
    "startDate": "2024-06-22T11:00:00+05:30",
    "endDate": "2024-06-22T13:00:00+05:30",
    "description": "Dive into the electrifying world of plasma, the fourth state of matter beyond solids, liquids, and gases. Plasma, made up of ions, electrons, and neutrals, is a quasi-neutral substance where particle motion is influenced by electric and magnetic fields. This state of matter is an excellent conductor of electricity and exhibits unique collective behaviors. \nA combined effort of seven countries (EU as one country) in building the ITER tokamak in France is under progress, where India is a full partner. Low temperature (~ eV) plasmas with similar ion, electron and neutral temperatures can be used as an intense heat source. Such a heat source can dissociate large molecules, and hence such a plasma source is used for waste treatment. Low temperature (electrons ~ few eV, ions and neutrals ~ 0.1 eV) plasmas, where electron temperature is more than ion and neutral temperatures, are chemically very active and can be used for surface modification. \n In this talk, Prof. Subroto Mukherjee will cover various aspects of plasmas and its applications, from energy to environmental solutions. \nThis lecture is a part of RRI’s Vignyana Kathegalu, a series of popular talks on science. \nPresented by: Raman Research Institute, Bangalore \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/matters-of-plasma/",
    "keywords": [
      "Education, Science"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-509.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "दुविधा | Duvidha",
    "startDate": "2024-07-07T11:30:00+05:30",
    "endDate": "2024-07-07T13:00:00+05:30",
    "description": "1973 | 82 Minutes | Hindi with English Subtitles \nBased on a Rajasthani folktale retold by Vijayadan Detha, Duvidha is about a merchant’s son, whose relationship with his young bride, Lachhi is thwarted by his work and a ghost who falls in love with her, resulting in the ghost soon impersonating the husband. \nCalling all cinephiles! BIC is thrilled to present B•Cinematic, an initiative dedicated to celebrating the most essential, impactful, and artistically significant cinematic works from across the state and the country. \nAt B•Cinematic, our mission is to curate and share those remarkable films that is a must-watch (or re-watch) experience for every passionate cinema lover. From groundbreaking classics to under-appreciated gems, our carefully curated selection will take you on an unparalleled (pun not intended) cinematic journey through the ages. \nThrough curated screenings, insightful discussions, and engaging analyses from distinguished cinematic voices, we aim to not only watch these films together but to truly appreciate their craftsmanship, cultural impact, and intellectual depth. Our vibrant community of film aficionados will collectively rediscover Indian cinema’s most stunning and enduring masterpieces. \nSo join us on this quest to experience the films that have defined and redefined the art form. Don’t miss out on crossing these essential works off your bucket list. Because to truly live, you must first watch the films that make life worth living. \nThis month’s film featured in our informal film club is Duvidha (1973) \nDuvidha is a hauntingly beautiful and thought-provoking film that delves into the realms of folklore, desire, and the complexities of human relationships. Based on a Rajasthani folktale, the film weaves a captivating tale of a young bride, Lachhi, whose newfound marriage is immediately put to the test by circumstances beyond her control. \nOn the very day of their wedding, Lachhi’s husband, a merchant’s son, departs on a five-year business trip, leaving her behind in the care of his family. Amidst this lonely existence, a mischievous and longing ghost, enchanted by Lachhi’s beauty, devises a cunning plan to impersonate her husband and gain her affection. \nDirector Mani Kaul’s masterful storytelling and Navroze Contractor’s exceptional cinematography breathe life into this enigmatic narrative, creating a hypnotic and surreal atmosphere that blurs the boundaries between the corporeal and the ethereal. The film’s striking visuals, infused with rich textures and rhythmic sequences, transport the viewer into the vibrant tapestry of Rajasthani culture, where the rhythms of daily life intertwine with the spectral realm. \nAt its core, Duvidha is a metaphysical exploration of love, desire, and the complexities of human relationships. The ghost’s obsession with Lachhi and his subsequent impersonation of her husband raise profound questions about identity, fidelity, and the nature of love itself. The film invites the viewer to ponder the depths of human longing and the lengths to which one might go to satisfy that longing. \nBeyond its captivating narrative, Duvidha also serves as a powerful commentary on societal norms and gender dynamics. Lachhi’s predicament, torn between her duty as a wife and the allure of the supernatural, reflects the constraints and expectations placed upon women in traditional societies. The film subtly challenges these conventions, inviting the viewer to question the foundations upon which societal structures are built. \nUltimately, Duvidha is a cinematic masterpiece that transcends its folktale origins, offering a transcendent and thought-provoking exploration of the human condition. With its mesmerizing visuals, haunting narrative, and profound themes, the film continues to resonate with audiences, inviting them to embark on a journey that blends the fantastical with the deeply human. \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%a6%e0%a5%81%e0%a4%b5%e0%a4%bf%e0%a4%a7%e0%a4%be-duvidha/",
    "keywords": [
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "दुविधा | Duvidha"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-505.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Sakhi Ri",
    "startDate": "2024-07-04T19:00:00+05:30",
    "endDate": "2024-07-04T20:30:00+05:30",
    "description": "Sakhi Ri is a Kathak-based dance drama production that delves into the profound subject of menstruation. This performance weaves the tale of a unique friendship between a woman and her Laal Sakhi, aka her menstrual cycles as she embarks on her journey of womanhood. Together, they navigate the intricacies of life, with each phase of Laal Sakhi adding its own vibrant hue to her human companion – from embarrassment and pain to sensuality, attraction, separation and the profound essence of motherhood. \nAbout SIFF Young Artiste: \nSIFF Young Artiste’s mission is to further the cause of Arts Education by providing a structured and consistent path to learning the arts for any student with the desire to learn. With a steadfast commitment to democratizing access to the arts, SIFF stands firm in their mission to provide easy access to high-quality learning in vocal, instrumental, and dance. The essence of learning – the teacher-student relationship remains at the core and is further enhanced by the creative use of technology. They equally serve the classical and contemporary arts to make arts education an engaging and fruitful pursuit for all learners. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sakhi-ri/",
    "keywords": [
      "Dance, Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-519.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "Longen Folk to Go on Pilgrimage",
    "startDate": "2024-07-20T18:30:00+05:30",
    "endDate": "2024-07-20T20:15:00+05:30",
    "description": "2022 | 88 mins | English with subtitles where necessary | India \nThe film is about what used to be a little-known event until the 1980s but which has now become the single largest annual pilgrimage in India: The Kanwar Yatra. \nThe Kanwar Yatra is an annual pilgrimage dedicated to Lord Shiva in which devotees, known as kanwariyas, fill water from the river Ganga and carry it back to their hometowns for liberations. The devotees walk anywhere between 100-200 km, carrying water in Shiva shrines. \nThe film looks at not just the religious and cultural aspects of the Yatra but also its socio-economic impact, the environmental issues attached to it (for instance, the state of the Ganga), the sheer maleness of the event, and how the occasion is being used by Hindu right-wing groups to push their majoritarian agenda and the showcase it has become for Hindu nationalism. \nThe screening of the film will be followed by a discussion with Director, Kunal Vohra. A Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/longen-folk-to-go-on-pilgrimage/",
    "keywords": [
      "Faith, Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Longen Folk to Go on Pilgrimage"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-518.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "Ranga Taranga",
    "startDate": "2024-06-28T19:00:00+05:30",
    "endDate": "2024-06-28T21:00:00+05:30",
    "description": "Two seemingly distinct forms of the Vishnu, Ranganatha and Panduranga are geographically far apart. Iconographically too, they differ: one is a reclining idol, while another stands with his hands on his hips. What connects these two forms? \nRanga Taranga is a conceptualisation aiming to answer precisely this question, exploring subtle yet powerful connections between the two. Traversing across legends, architecture, experiences, history and more, Ranga Taranga invites its audiences to embrace the shades of two popular deities: Ranganatha and Panduranga. \nThe program comprised storytelling by Vinay Varanasi and music by Kruthi Vittal, B K Raghu and B S Prashanth. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/ranga-taranga/",
    "keywords": [
      "Faith, Heritage, Music, Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Ranga Taranga"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-2_POSTER-11.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Just Hiss",
    "startDate": "2024-06-23T11:00:00+05:30",
    "endDate": "2024-06-23T12:00:00+05:30",
    "description": "50 minutes | English and Kannada  \nJust Hiss is a compelling adaptation of the short folk story titled A Serpent’s Predicament. Just Hiss is an ode to coexistence, following the transformative journey of a snake to choose love over hate. As the play navigates the complex dynamics between the snake, the forest denizens, and the villagers of Rasbharpur, it skillfully tackles the universal themes of unity and understanding. The resonant narrative serves as a reminder of the profound impact that choices, particularly those rooted in love and compassion, can have on fostering harmony in a world shared by diverse beings. \nDirector’s note: \nJust Hiss is not just a play; it is a whimsical journey crafted especially for children, featuring endearing animal characters. At its heart, it unfolds an analogical tale, resonant with the pressing message of our times—understanding the limitations of one’s perspective and the imperative need to embrace and accommodate others. \nConceived with meticulous care and having undergone several work-in-progress phases, this play is a testament to the idea that assumptions should yield to genuine inquiry. It serves as a reminder to care enough to ask, fostering the spirit of coming together and progressing impactfully. \n",
    "url": "https://bangaloreinternationalcentre.org/event/just-hiss/",
    "keywords": [
      "Theatre, Wildlife, Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-487.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Personal and the Political",
    "startDate": "2024-06-25T18:30:00+05:30",
    "endDate": "2024-06-25T20:00:00+05:30",
    "description": "After ten years of reporting from central Africa for The New York Times, Associated Press, and others, Anjan Sundaram finds himself living a quiet life in Shippagan, Canada, with his wife and newborn. But when word arrives of preparations for ethnic cleansing in the Central African Republic, he is suddenly torn between his duty as a husband and father, and his moral responsibility to report on a conflict unseen by the world. \nBreakup: A Marriage in Wartime illuminates the personal price that war correspondents pay as they bear witness on the frontlines of humanitarian crimes across the world. This introspective book is a grounded account of one man’s inner turmoil in the context of a dangerous journey through a warzone. \nIn this session, Anjan is in conversation with Siddharth Raja. A Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-personal-and-the-political/",
    "keywords": [
      "Books, Defence & security, International Relations, Media, Nonfiction, Politics, Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-510.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Leela",
    "startDate": "2024-07-02T19:00:00+05:30",
    "endDate": "2024-07-02T20:30:00+05:30",
    "description": "Leela is an immersive dance production that delves into the timeless spiritual love story of Krishna, Radha, and the Gopis in the sacred town of Vrindavan. Inspired by the rich cultural and spiritual heritage of India, the production aims to bring to life the essence of devotion, longing, and the transcendental nature of love through a fusion of classical Indian dance forms, music, and intricate storytelling. \nSet against the backdrop of the illuminated night of Vrindavan, the production chronicles the emotional journey of Radha and the Gopis as they grapple with the profound yearning for Krishna’s divine presence. Through a series of intricately choreographed dance sequences, the performance portrays the bittersweet symphony of emotions, ranging from intense longing to ecstatic celebration, ultimately emphasizing the universal truth that love transcends all boundaries. \nLeela highlights the spiritual evolution of the characters, as they come to realize the profound spiritual connection that exists beyond the physical realm. The production emphasizes the notion of ‘virah’ (separation) as a catalyst for understanding the depths of true love, and it emphasizes the spiritual bond that unites humanity with the divine. The dance sequences are crafted to reflect the cosmic harmony and the eternal quest for divine love that resonates with audiences across cultural and geographical boundaries. \nThrough a fusion of music, dance, and narrative, Leela aims to create an immersive experience that transports the audience into the mystical realm of Vrindavan, where love, devotion, and the divine converge in a timeless spectacle of spiritual ecstasy. The production seeks to celebrate the universality of love and the enduring power of devotion that transcends the limitations of time and space, leaving a lasting impression on the hearts and minds of the audience. \nA Q&A with the audience will follow the performance. \nDancers:\n\nSanjukta Sinha\nKrutika Ghanekar\nVidhi Shah\nPankaj Sihag\nHiren Gajjar\nShantanu Gosavi\n\nLight Assistance:\n\nDaideepya Leuva\n\nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/leela/",
    "keywords": [
      "Dance, Faith, Mythology, Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-517.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "झुंड | Jhund",
    "startDate": "2024-06-26T19:00:00+05:30",
    "endDate": "2024-06-26T20:00:00+05:30",
    "description": "Hindi | 60 minutes | Suitable for 8+ years  \nJhund (Herd), a dark comedy, unfolds in an unknown room where two strangers navigate their uncertain circumstances. Unsure if they’re there by choice or coercion, they grapple with fear, defending themselves against an indefinable threat. Amid absurd moments, an unknown authority keeps asking for things, making them question who to trust and what they believe. \nThis comedy delves into themes of submission, freedom, and betrayal, revealing the fine line between compliance and rebellion in a gripping, compact narrative. \nCredits: \nWritten and Directed by Chanakya Vyas\nDevised and Performed by Ashwini Kumar Chakre and Vivek Vijayakumaran\nPresented by Our Theatre Collective, Bengaluru\nOriginally produced by Indian Ensemble, Bengaluru\nSet Design and Execution: Sridhar Murthy\nLight Design: Niranjan Gokhale\nLights Execution: Arun DT\nCostume Design: Aloka Gloria D’souza\nSound Design: Mohammed Lehry\nSound Execution: Ankit Tripathi\nProduction Manager: Ankit Tripathi\nPoster Design: Pratyush Singh\nPhoto Credits: Virginia Rodrigues and Team\nProducer: Our Theatre Collective \n \n  \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%9d%e0%a5%81%e0%a4%82%e0%a4%a1-jhund/",
    "keywords": [
      "Performing Arts, Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "झुंड | Jhund"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-502.jpg"
  }
]