[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74402-1749234600-1749240000@bangaloreinternationalcentre.org",
    "name": "First Movers in ‘Second Life’ Start-Ups",
    "startDate": "2025-06-06T18:30:00+05:30",
    "endDate": "2025-06-06T20:00:00+05:30",
    "description": "When it comes to climate change and the environment, they are part of  the problem and part of the solution – Plastics and Lithium-ion. \nWe cannot ignore the role these materials play in today’s world. They have revolutionized many industries even while they have been the cause of negative ecological and social impacts. Mainly because their end-of-life management remains a significant global challenge. Is it possible to bring them into the circular economy in positive and equitable ways? \nThis discussion is with three innovative companies that not just think so, they also walk the talk. The discussion will be followed by a Q&A session with the audience. \nPresented by: \n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/first-movers-in-second-life-start-ups/",
    "keywords": [
      "Environment",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-851.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "74392-1749580200-1749589200@bangaloreinternationalcentre.org",
    "name": "Against the Tide",
    "startDate": "2025-06-10T18:30:00+05:30",
    "endDate": "2025-06-10T21:00:00+05:30",
    "description": "97 minutes | Koli, Marathi and Hindi with English subtitles | 2023 | India \nAgainst the Tide follows Bombay fishermen Rakesh and Ganesh, both belonging to the indigenous Koli community and inheritors of a rich, ancestral knowledge system—one that reads the sea through the moon and tides. Rakesh continues to place his faith in these traditional methods, while Ganesh embraces modern fishing technologies in search of more secure returns. As climate change renders the sea increasingly unpredictable, the pressure to provide for their families begins to fracture their once-unshakeable friendship. \nA deeply human story set against the vast, changing waters of the Arabian Sea, Against the Tide explores the collision of tradition and technology, community and survival, through the intimate bond between two men as close as brothers. \nThe film was selected for the Sundance Film Festival 2023 – World Cinema Documentary Competition, where it received widespread acclaim for its lyrical storytelling and urgent relevance. \nThe screening will be followed by a conversation between the Director, Sarvnik Kaur and Sunanda Bhat, along with an audience Q&A. \nProduction Crew:Director & Producer – Sarvnik KaurProducer – Koval BhatiaCo-Producer – Quentin LaurentEditing – Atanas GeorgievEditing – Blagoja NedelkovskiSound Design – Moinak Bose \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/against-the-tide/",
    "keywords": [
      "Climate Change",
      "Culture",
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "mr",
    "workPresented": {
      "@type": "Movie",
      "name": "Against the Tide"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-860.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74769-1749294000-1749326400@bangaloreinternationalcentre.org",
    "name": "The Earth Remembers",
    "startDate": "2025-06-07T11:00:00+05:30",
    "endDate": "2025-06-07T20:00:00+05:30",
    "description": "This Open Call invited cartoons and comics from cartoonists, graphic novelists and artists around the theme ‘The Earth Remembers’. Selections from the submitted works will be displayed at BIC for our Environment Day Festival on Jun 7. Selections will be announced on June 5. \nThis Exhibition is a part of BIC’s programmes for Environment Day 2025 titled The Earth Remembers: Stories of Justice and Resilience. This year’s Environment Day gathering centres on the people at the frontlines of ecological change, communities whose lives are entangled with the land, the waters, and the skies, and who carry not only the weight of loss but also the seeds of resilience. Rather than viewing the environment as separate from society, we listen to stories where the two are inseparable. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-earth-remembers/",
    "keywords": [
      "Environment",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER2-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "74531-1749319200-1749322800@bangaloreinternationalcentre.org",
    "name": "Huliyappa – A Retelling",
    "startDate": "2025-06-07T18:00:00+05:30",
    "endDate": "2025-06-07T19:00:00+05:30",
    "description": "15 minutes | Kannada with English subtitles | 2025 | India \nHuliyappa is a short documentary in Kannada by first-time filmmaker, Sourabha Rao. Shot entirely in the remote hamlets of the Uttara Kannada district, the film is centred around an ancient custom of worshipping the eponymous tiger deity during Deepavali, for the protection of people and their livestock from large Carnivora – tigers, leopards and bears. \nThe film reveals the losses faced by the residents of this thickly forested Western Ghats landscape to themselves and their prized cattle due to incidents with wildlife, and the surprising tolerance, forgiveness and compassion that prevail in people despite them. It is an exploration of the mythical, emotional and rational origins of the remarkable faith. Through conversations with people from various strata of the local society, including scholars, farmers and cowherds, Rao makes a concise and compelling retelling of a culture that has maintained the unlikeliest harmony between humans and wildlife in the region for centuries, and documents the simple rituals that constitute it. \nRather soberingly, Huliyappa is also a timely reminder of the dire need to impress such indigenous practices upon a generation increasingly disconnected from its roots, if the equilibrium with Nature, so pivotal to the future of humanity, is to be vouchsafed. \nThe screening will be followed by a discussion with the team that made the film, in conversation with Sonu Venugopal. A Q&A with the audience will follow. \nIn collaboration with: \n \nThis screening is part of BIC’s programmes for Environment Day 2025 titled The Earth Remembers: Stories of Justice and Resilience. This year’s Environment Day gathering centres on the people at the frontlines of ecological change, communities whose lives are entangled with the land, the waters, and the skies, and who carry not only the weight of loss but also the seeds of resilience. Rather than viewing the environment as separate from society, we listen to stories where the two are inseparable. \n",
    "url": "https://bangaloreinternationalcentre.org/event/huliyappa-a-retelling/",
    "keywords": [
      "Environment",
      "Film",
      "Society",
      "Sustainability",
      "Wildlife"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "Huliyappa – A Retelling"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-857.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74905-1749405600-1749412800@bangaloreinternationalcentre.org",
    "name": "Muthuswami Dikshitar: Looking Back After 250 Years",
    "startDate": "2025-06-08T18:00:00+05:30",
    "endDate": "2025-06-08T20:00:00+05:30",
    "description": "If the century spanning 1850 to 1950 was that of Tyagaraja, the next one undoubtedly belongs to Muthuswami Dikshitar. He has been the subject of the same intense study that his illustrious contemporary was previously. The corpus of his songs in public circulation has gone up tremendously during this period, though debates continue on the genuineness of some of these. This is exactly the way Tyagaraja kritis went up in circulation and publications were churned out on them from the mid-19th century onwards. Dikshitar like a late-blooming flower is slowly unfurling petal after petal, revealing some, but not all the facets of his personality. There is something about him that seems to speak to the 21st century mind. \nThis lecture by Historian, V Sriram will be followed by a Q&A with the audience. \nPresented by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/muthuswami-dikshitar-looking-back-after-250-years/",
    "keywords": [
      "Heritage",
      "In Memory",
      "Music",
      "Philosophy",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-871.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73689-1752690600-1752696000@bangaloreinternationalcentre.org",
    "name": "The History of Welfare",
    "startDate": "2025-07-16T18:30:00+05:30",
    "endDate": "2025-07-16T20:00:00+05:30",
    "description": "Welfare guarantees and direct benefit transfers are at the heart of the political marketplace but the longer-term history of welfare in India is surprisingly little known. Making India Work: The Development of Welfare in a Multi-Level Democracy (Cambridge University Press, 2025) recovers a history that is crucial for understanding the current juncture of welfare politics and political economy in India. Traversing more than a century of welfare development from the late colonial period to the present-day, the book asks why India has ended up with a small protected formal sector workforce shielded by social security and protection against retrenchment, and a much larger population that labours informally and does not enjoy such protections. It examines why India’s model of industrialisation failed to provide an engine for mass employment or welfare state development, and why the focus of policy efforts has shifted over the last fifty years from employment generation to the rise of ‘direct benefits’ which subsidise precarious livelihoods. \nIn this session, Louise Tillin, the author of the book, Anindita Adhikari and Rajendran Narayanan will be in conversation with Arun Thiruvengadam. The discussion will be followed by Q&A with the audience. \nIn collaboration with: \n \nThis event is sponsored by the Justice VR Krishna Iyer Chair, NLS.  \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-history-of-welfare/",
    "keywords": [
      "Books",
      "Economics",
      "History",
      "Law",
      "Policy & Regulation",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-829.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74777-1749304800-1749310200@bangaloreinternationalcentre.org",
    "name": "What on Earth?!",
    "startDate": "2025-06-07T14:00:00+05:30",
    "endDate": "2025-06-07T15:30:00+05:30",
    "description": "Celebrate Environment Day with a quiz that’s anything but ordinary! \nWhat on Earth?! is a lively, interactive session designed by Quizmaster Berty Ashley to surprise, challenge, and entertain. Expect curious questions, unexpected twists, and a playful dive into themes that connect us to the world we live in. \nWhether you’re a quiz buff or just in it for the fun, this is your chance to learn something new—and maybe even win a prize or two! Bring your friends, bring your curiosity, and get ready to find out… what on Earth is going on?! \nNote: This Quiz is for teams of 2-3. \nIn collaboration with First Principles Lab:\n \nThis event is part of BIC’s programmes for Environment Day 2025 titled The Earth Remembers: Stories of Justice and Resilience. This year’s Environment Day gathering centres on the people at the frontlines of ecological change, communities whose lives are entangled with the land, the waters, and the skies, and who carry not only the weight of loss but also the seeds of resilience. Rather than viewing the environment as separate from society, we listen to stories where the two are inseparable. \n",
    "url": "https://bangaloreinternationalcentre.org/event/what-on-earth/",
    "keywords": [
      "Environment",
      "History",
      "Science",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-870.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74936-1749380400-1749385800@bangaloreinternationalcentre.org",
    "name": "Once Upon a Timetable",
    "startDate": "2025-06-08T11:00:00+05:30",
    "endDate": "2025-06-08T12:30:00+05:30",
    "description": "Pack your giggles and pencils — it’s storytime with librarian Pooja Singh! \nFrom homework that has a mind of its own to nursery rhymes gone hilariously rogue, this session brings together the wonderfully wacky worlds of The Homework by Ashwin Guha and Vaibhav Kumaresh and Hey Diddle Diddle by Anushka Ravishankar and Priya Kuriyan. \nExpect moo-sical mayhem, classroom chaos, and plenty of wordplay as we read, rhyme, and laugh our way back to school! \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/once-upon-a-timetable/",
    "keywords": [
      "Books",
      "Education",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-873.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "74918-1749666600-1749675600@bangaloreinternationalcentre.org",
    "name": "Queer",
    "startDate": "2025-06-11T18:30:00+05:30",
    "endDate": "2025-06-11T21:00:00+05:30",
    "description": "135 minutes | English with English subtitles | Italy & USA | 2024 \nDirector: Luca Guadagnino\nStarring: Daniel Craig, Drew Starkey, Jason Schwartzman, Henrique Zaga, Drew Droege, Andra Ursuta, Ariel Schulman, and others.\nWritten by: Justin Kuritzkes, based on the novel by William S. Burroughs\nMusic: Trent Reznor, Atticus Ross, and Caetano Veloso \nSet in 1950s Mexico City, Queer follows William Lee, an American expat living in quiet solitude until he meets Eugene Allerton, a fellow expatriate and former soldier. Their encounter stirs the possibility of a profound and intimate connection. Adapted from William S. Burroughs’ novel, the film transforms the raw emotional narrative into a tender, richly human story of love and longing. \nDirected by Luca Guadagnino, Queer reimagines Burroughs’ work not as a tale of unrequited desire but as a universal story of love — a delicate interplay between vulnerability, misconnection, and emotional truth. \nIn collaboration with: \n \nThis screening marks the beginning of our collaboration with MUBI, to bring films from their collection, once in two months, to the BIC audiences. We chose Queer for its quiet emotional power and sensitivity as as a meaningful way to mark Pride. The film, and the story, speaks to love, vulnerability, and human connection. \n",
    "url": "https://bangaloreinternationalcentre.org/event/queer/",
    "keywords": [
      "Film",
      "Gender",
      "Literature",
      "Society",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Queer"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-872.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74545-1749326400-1749330000@bangaloreinternationalcentre.org",
    "name": "Bound by Soil: A Requiem for the Forgotten",
    "startDate": "2025-06-07T20:00:00+05:30",
    "endDate": "2025-06-07T21:00:00+05:30",
    "description": "Inspired by ONV Kurup’s evocative Malayalam poem Bhoomikaorru Charmageetham, a requiem to the Earth, this production mournfully echoes the planet’s anguish as it witnesses the destruction of its progeny and the desecration of its sacred body. Drawing from ancient myths of forests sacrificed for the march of civilization to the modern plundering of natural resources, the narrative weaves a searing commentary on humanity’s parasitic progression. It lays bare the devastating impact of ecological imbalance, exposing how the relentless pursuit of growth comes at the expense of both nature and the lives of marginalized communities that remain intimately bound to it. \nThis performance is part of BIC’s programmes for Environment Day 2025 titled The Earth Remembers: Stories of Justice and Resilience. This year’s Environment Day gathering centres on the people at the frontlines of ecological change, communities whose lives are entangled with the land, the waters, and the skies, and who carry not only the weight of loss but also the seeds of resilience. Rather than viewing the environment as separate from society, we listen to stories where the two are inseparable. \n",
    "url": "https://bangaloreinternationalcentre.org/event/bound-by-soil-a-requiem-for-the-forgotten/",
    "keywords": [
      "Dance",
      "Environment",
      "Performing Arts",
      "Society",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ml",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/jun-7.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "74520-1749234600-1749240000@bangaloreinternationalcentre.org",
    "name": "Doddata",
    "startDate": "2025-06-06T18:30:00+05:30",
    "endDate": "2025-06-06T20:00:00+05:30",
    "description": "Discover the raw, immersive power of Doddata, a ritualistic folk theatre tradition from North Karnataka that fuses storytelling, spiritual invocation, music, and movement. Also known as Moodalakatte Bayalata, Doddata is a performance form rooted in village life, where the stage is sacred and every gesture resonates with centuries of lived belief. Presented by GK Kala Vedike, Hubballi and led by Ramesh, this evening offers an intimate and interactive introduction to a tradition where drama is both prayer and pedagogy. \nThrough live demonstrations and audience engagement, the session traces Doddata’s transformation from a ritual offering into a full-bodied dramatic experience. You’ll witness the vibrant Ranga Pooje (stage worship), learn about the significance of traditional instruments like the chende and maddale, and explore the layered symbolism of costume, mudras, and movement. The audience will be invited to participate through chanting invocations, mirroring expressive gestures, and stepping briefly into the performative world of gods, demons, kings, and jesters. The evening culminates in a 20-minute performance of Shalyarajana Saarathya, a tale from the Mahabharata, allowing audiences to experience the full emotional and spiritual arc of this powerful tradition. \nDoddata is not just a theatrical form but a repository of memory, identity, and pedagogy, passed on through generations by rural communities. While modernisation poses challenges to its continuity, programs such as the one being presented, play a vital role in sustaining and revitalising this precious art form. \nThis is not just a performance, it’s an invitation to enter a space where art, ritual, and community converge. Whether you’re a lover of theatre, a student of culture, or simply curious about Karnataka’s rich traditions, Doddata promises a rare, resonant encounter with a living legacy. \nThis is the third performance of our series BIC Jaanapada. \nBIC Jaanapada is a bi-monthly (once in two months) series celebrating Karnataka’s folk traditions through the lens of regional identity and cultural preservation. Curated in collaboration with Tvarita Arts Collective India, the program combines scholarly discourse with live performances to explore the deep connections between geography and artistic expression. Through demonstrations, performances, and academic discussions, each session examines how landscape and local culture have shaped these distinct artistic practices. \nIn collaboration with: \n       \n",
    "url": "https://bangaloreinternationalcentre.org/event/doddata/",
    "keywords": [
      "Culture",
      "Dance",
      "Heritage",
      "Music",
      "Mythology",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Doddata"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/doddata-TB.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74250-1749063600-1749069000@bangaloreinternationalcentre.org",
    "name": "Prabodhan - An Awakening",
    "startDate": "2025-06-04T19:00:00+05:30",
    "endDate": "2025-06-04T20:30:00+05:30",
    "description": "Prabodhan – an awakening is an intimate offering of dance compositions that reflect and reveal the artist’s inner world. Each piece in this journey is a doorway to deeper presence and transformation—an awakening of the senses, the spirit, and the social conscience. \nThe performance opens with Madurapuri Chokkar Kauvuthuvam, a celebration of Śiva’s splendor. In Rāvaṇa – the dot that moved, the lens turns to Rāvaṇa—not as a demon, but as a devotee whose fierce love evokes Śiva’s grace, uncovering a powerful and unexpected reciprocity. \nIn Ganga, ecological and personal histories entwine. It becomes a meditation on legacy—on what we inherit and what we pass on. This is an awakening to responsibility and the urgent need for care. \nThe final piece, Chakra Alarippu, brings the journey to alignment. It is a dance of balance—between breath and movement, the self and the cosmos. \nThis is not performance as display, but a quiet turning toward presence—a call to awaken. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/prabodhan-an-awakening/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-67.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "74756-1749312000-1749317400@bangaloreinternationalcentre.org",
    "name": "Every Grain a Story: Mapping Self and Culture Through Rice Appreciation",
    "startDate": "2025-06-07T16:00:00+05:30",
    "endDate": "2025-06-07T17:30:00+05:30",
    "description": "India has over a lakh rice varieties – each with its own story. A grain that can ease certain illnesses. Another that grows tall enough to hide elephants. One that needs no cooking. A variety so flavourful it’s eaten plain. A Goan rice that thrives during floods. Yet, most of these never reach markets or our kitchens, slipping out of everyday memory and conversation. This workshop, led by Anumitra from Edible Archives, invites participants to explore the edible archive within themselves – the foods and tastes we carry in our bodies and memories. Through a guided rice appreciation session featuring indigenous rice varieties, we’ll learn to observe differences in texture, aroma, and flavour while uncovering the stories behind each grain. \nThe workshop is a space to reflect on the connections between food, place, and identity. It will also open up conversations about what gets lost when agricultural biodiversity disappears, and why bringing these grains back to our plates matters. \nIn collaboration with Edible Archives: Edible Archives, an award-winning restaurant and art /research project based in Anjuna, Goa, works with indigenous ingredients at the intersection of art, culture and food. Edible Archives was one of the Infra Projects at the Kochi Muziris Biennale 2018-19, where it showcased 30 varieties of indigenous rice in 3 months. Since then, Edible Archives has been at the forefront of the ingredient-driven movement in India. With its focus on indigenous varieties, local and seasonal ingredients, and innovative cuisine-agnostic menus that change with the seasons, it has been introducing visitors to an intriguing world of local foods as never imagined before. Most recently, Edible Archives was the winner of the national Outlook Responsible Tourism Awards 2025, both in the Sustainable Food category and as the Overall Winner. \nIn collaboration with: \n    \nThis workshop is part of BIC’s programmes for Environment Day 2025 titled The Earth Remembers: Stories of Justice and Resilience. This year’s Environment Day gathering centres on the people at the frontlines of ecological change, communities whose lives are entangled with the land, the waters, and the skies, and who carry not only the weight of loss but also the seeds of resilience. Rather than viewing the environment as separate from society, we listen to stories where the two are inseparable. \n",
    "url": "https://bangaloreinternationalcentre.org/event/every-grain-a-story-mapping-self-and-culture-through-rice-appreciation/",
    "keywords": [
      "Environment",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Rice_Thumbnail.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74795-1749294000-1749326400@bangaloreinternationalcentre.org",
    "name": "Tasting Climate Change",
    "startDate": "2025-06-07T11:00:00+05:30",
    "endDate": "2025-06-07T20:00:00+05:30",
    "description": "Imagine a world with no coffee! Scientists say that by 2050, your favourite brew could very likely go extinct from changing climate – or at the very least leave you with an unpleasant taste in your cup! \nJoin us for an insightful experience to discover how climate change could affect the flavour of coffee. Of particular interest is a climate reality – what is the evidence that climate change is occurring in coffee, how would we experience and indeed taste its impact? \nTo discover this, participants will be encouraged to sample different coffees as an invitation to taste climate change. \nIn collaboration with: \n \nThis event is part of BIC’s programmes for Environment Day 2025 titled The Earth Remembers: Stories of Justice and Resilience. This year’s Environment Day gathering centres on the people at the frontlines of ecological change, communities whose lives are entangled with the land, the waters, and the skies, and who carry not only the weight of loss but also the seeds of resilience. Rather than viewing the environment as separate from society, we listen to stories where the two are inseparable. \n",
    "url": "https://bangaloreinternationalcentre.org/event/tasting-climate-change-2/",
    "keywords": [
      "Climate Change",
      "Environment"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-869.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74926-1749812400-1750017600@bangaloreinternationalcentre.org",
    "name": "Ambedkar through Ephemera",
    "startDate": "2025-06-13T11:00:00+05:30",
    "endDate": "2025-06-15T20:00:00+05:30",
    "description": "Exhibition Opening: 6:00 pm | Friday, 13 June\nTimings: 11:00 am – 8:00 pm\nExhibition on show until Sunday, 15 June \nWalkthroughs:\nFriday, 13 June | 6:30 pm\nSaturday, 14 June | 6:30 pm\nSunday, 15 June | 11:30 am & 6:30pm \nConversations:\nPanel Discussion – Saturday, 14 June | 4 pm – 5:30 pm \nFrom train tickets to flight boarding passes, Ambedkar features on ephemera across a range of fields. \nAmbedkar through Ephemera explores this exciting visual archive through objects not originally intended to last for more than a short time: calendars, posters, packing labels, Ambedkar Jayanti invite cards, social media posts, wedding invitation cards and music concert tickets. Besides enriching the repertoire of visual images of Ambedkar, such ephemera help convey the diverse spaces where people encounter Ambedkar, even if only fleetingly, and offer glimpses of the variety of effort engaged in preserving his legacy. \nGathered over the years from across the country, the range of ephemera seen in this exhibition invites us to imagine how their original users might have related to these materials with images and written texts as well as appreciate the micro processes behind the emergence of Ambedkar as an icon of social justice. \nProf Gopal Guru will inaugurate the exhibition on June 13, 6 pm. He will comment on the exhibition and locate its images in the larger politics of visual culture. \nA Panel Discussion with Prof Gopal Guru, Shivaji K Panikkar, Former Head of Art History & Aesthetics, Faculty of Fine Arts, M.S. University of Baroda and Vikas Kumar, Curator of the exhibit, will take place on 14 June, 4 pm. \nIn collaboration with Azim Premji University, Bangalore \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/ambedkar-through-ephemera/",
    "keywords": [
      "History",
      "In Memory",
      "Photography",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-874.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74554-1749294000-1749301200@bangaloreinternationalcentre.org",
    "name": "Leafy Tales for Little Explorers",
    "startDate": "2025-06-07T11:00:00+05:30",
    "endDate": "2025-06-07T13:00:00+05:30",
    "description": "A fun and interactive storytelling session inspired by the children’s book So Many Leaves by Harini Nagendra and Seema Mundoli. Through stories and hands-on activities, young participants will explore the shapes, textures, and colors of leaves. \nDesigned for curious young minds and budding nature enthusiasts, the session encourages exploration and discovery of the natural world. \nIn collaboration with: \n \nThis event is part of BIC’s programmes for Environment Day 2025 titled The Earth Remembers: Stories of Justice and Resilience. This year’s Environment Day gathering centres on the people at the frontlines of ecological change, communities whose lives are entangled with the land, the waters, and the skies, and who carry not only the weight of loss but also the seeds of resilience. Rather than viewing the environment as separate from society, we listen to stories where the two are inseparable. \n",
    "url": "https://bangaloreinternationalcentre.org/event/leafy-tales-for-little-explorers/",
    "keywords": [
      "Education",
      "Environment",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-862.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74427-1749148200-1749153600@bangaloreinternationalcentre.org",
    "name": "Souza's Modernism",
    "startDate": "2025-06-05T18:30:00+05:30",
    "endDate": "2025-06-05T20:00:00+05:30",
    "description": "Francis Newton Souza, one of the most provocative and unflinching voices in modern Indian art, challenged the conventions of both European and Indian art traditions. In her new book F.N. Souza: The Archetypal Artist, academic and art critic Janeita Singh offers a deeply interdisciplinary reading of Souza’s life and work, drawing on Jungian analysis, mythology, religion, and philosophy, to examine how Souza confronted the collective unconscious through his art. \nIn this session, she presents the key ideas from her book and then engages in a conversation with art historian Annapurna Garimella to explore how Souza’s expressionism defied colonial and religious authority, reclaimed the fragmented self, and questioned the ideological foundations of modernism. Together, they will reflect on the urgency of rethinking art history from decolonial and non-Western perspectives, and how Souza’s work, with its blend of eroticism, irreverence, and rage, continues to challenge dominant narratives of aesthetics, identity, and power. \nThe conversation will be followed by a Q&A with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/souzas-modernism/",
    "keywords": [
      "Books",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/souza.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "74566-1749294000-1749299400@bangaloreinternationalcentre.org",
    "name": "My Otter Diary",
    "startDate": "2025-06-07T11:00:00+05:30",
    "endDate": "2025-06-07T12:30:00+05:30",
    "description": "52 minutes | English and Kannada with English subtitles | 2025 | India \nIndia’s smooth-coated otters are captivating animals with distinct characters and intricate social lives. In this documentary, wildlife filmmaker Sugandhi Gadadhar explores the playful and resilient lives of an otter family residing in one of India’s most rapidly changing waterways. \nThe banks of the River Cauvery are where Sugandhi spent her childhood holidays. The memories of those times and her fleeting glimpses of the mysterious animals dipping below the waterline have fascinated her ever since. \nNow she is back and with the help of Shivu, a local fisherman, is following Maya, a female otter, and her family in the hope of documenting their family dynamics, challenges, and achievements. But the otters are wary of her presence. They have learnt that staying elusive means staying alive. \nShivu grew up along the banks of the river Cauvery. He not only helps Sugandhi navigate the waters but also opens her eyes to the lives of fishermen and the problems they face.\nAs pollution and destructive dynamite fishing threaten the delicate balance of their habitat, the otters and the fishermen, whose livelihoods also depend on the river, are often in conflict. \nNot many people know that otters exist in India. An otter is to a river what a tiger is to a forest. They are the apex predators in the river. Set along the picturesque landscape of the river Cauvery in southern India, this film captures never-before-filmed otter behaviour while subtly articulating the conflict that is brewing. \nThe screening of the film will be followed by a Q&A with the filmmakers and Shivu. \nThis screening is part of BIC’s programmes for Environment Day 2025 titled The Earth Remembers: Stories of Justice and Resilience. This year’s Environment Day gathering centres on the people at the frontlines of ecological change, communities whose lives are entangled with the land, the waters, and the skies, and who carry not only the weight of loss but also the seeds of resilience. Rather than viewing the environment as separate from society, we listen to stories where the two are inseparable. \n",
    "url": "https://bangaloreinternationalcentre.org/event/my-otter-diary/",
    "keywords": [
      "Environment",
      "Film",
      "Sustainability",
      "Wildlife"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "My Otter Diary"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "74755-1749254400-1749340799@bangaloreinternationalcentre.org",
    "name": "The Earth Remembers: Stories of Justice and Resilience",
    "startDate": "2025-06-07T05:30:00+05:30",
    "endDate": "2025-06-08T05:30:00+05:30",
    "description": "As the climate crisis deepens, it becomes ever more urgent to ask: Who bears the burden? Who holds the wisdom? \nThis year’s Environment Day programming centres on the people at the frontlines of ecological change, communities whose lives are entangled with the land, the waters, and the skies, and who carry not only the weight of loss but also the seeds of resilience. \nRather than viewing the environment as separate from society, we listen to stories where the two are inseparable. From fisherwomen on the coast to forest guardians, waste workers, farmers, and displaced families, the day invites us to witness, to engage, and to reimagine a just, inclusive response to ecological breakdown. \nThrough performances, conversations, and hands-on workshops, we explore not only what is vanishing, but what must be protected, restored, and re-rooted. \nSchedule: \nTasting Climate Change: Could Coffee as We Know It Vanish?\n11am – 8pm | Exhibition | Black Baza Coffee\nLink to know more. \nThe Earth Remembers: Climate Change through Cartoons\n11am – 8pm | Exhibition | Open Call\nLink to know more. \nLeafy Tales for Little Explorers: Discover the World of Leaves Through Stories, Play, and Wonder!\n11am – 1pm | Kids’ Workshop | Harini Nagendra & APU\nLink to know more. \nMy Otter Diary: Playful, Resilient Otters in India’s Shifting Waterways\n11am – 12:30pm | Screening & Conversation | Sugandhi Gadadhar, Rana Belur & Shivu\nLink to know more. \nWhat on Earth?!: An Offbeat Quiz to Ground You in Planet-Friendly Fun and Facts\n2pm – 3:30pm | Quiz | Berty Ashley\nLink to know more. \nBreaking the Nets: An Oral History of India’s Fisherwomen\n4pm – 5:30pm | Screening & Conversation | Shamsheer Yousaf, Monica Jha, Sriram Vittalamurthy & Lakshmi Murthy\nLink to know more. \nEvery Grain a Story: Mapping Self & Culture Through Rice Appreciation: A Sensory Workshop on Heirloom Rice, Memory, & Food Culture\n4pm – 5:30pm | Workshop | Edible Archives \nHuliyappa – A Retelling: Faith, Compassion and Conservation\n6pm – 7pm | Screening & Conversation | Sourabha Rao, Santosh Saligram, Rakesh Kote, Anusha Hegde & Sonu Venugopal\nLink to know more. \nBound by Soil: A Requiem for the Forgotten: Progress Asks for Offerings; The Earth Has Long Borne the Altar\n8pm – 9pm | Performance | Anuradha Venkataraman\nLink to know more. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-earth-remembers-stories-of-justice-and-resilience/",
    "keywords": [
      "Climate Change",
      "Environment",
      "Film",
      "Heritage",
      "Performing Arts",
      "Society",
      "Sustainability",
      "Wildlife",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-866.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "74577-1749312000-1749317400@bangaloreinternationalcentre.org",
    "name": "Breaking the Nets",
    "startDate": "2025-06-07T16:00:00+05:30",
    "endDate": "2025-06-07T17:30:00+05:30",
    "description": "25 minutes (2 films) | Bengali and Tamil with English Subtitles | India | 2024 \nThe films are part of a series Breaking the Nets: An oral history of India’s fisherwomen. At the heart of the fishing industry is the invisible labour of women. Over 12.3 million women in India work in fishing— catching, farming, processing, and selling fish, mending nets, and maintaining fishing gear. But their contribution is largely unacknowledged. Fisherwomen have fought to get recognition for their labour and secure their rights. “Breaking the Nets” brings stories from across India that chronicle the discriminations fisherwomen have faced, the battles they have waged, and the solutions they have crafted. \nFilm 1: This Jungle is Ours \n12 min | Bengali with English subtitles\nUrmila Sardar saw a tiger drag her husband away while they were fishing in the Sundarbans. Parul Haldar had to abandon building a temple dedicated to the forest deity when her husband was killed by a tiger. Still, they defy the Forest Department to work in this mangrove forest, facing the threat of tigers, crocodiles, and snakes. Catching fish and crab has been the sole means for women here to earn a living. With the creation of the Sundarbans Tiger Reserve, the government has restricted people’s access to the forest, and made women’s jobs difficult. Increased frequency of storms and cyclones caused by climate change has added to their woes. Now, fisherwomen are demanding customary harvest rights in Sundarban. \nFilm 2: The Sea is our Mother\n13 min | Tamil with English subtitles\nNamma Thayi has been diving in the Gulf of Mannar to pick seaweed since she was seven. She couldn’t miss work even when heavily pregnant. On one such dive, she delivered her child on an island. Today, as a frail 80-year-old, she still goes to the sea to collect seaweed. The women around the islands of Gulf of Mannar have carved a niche for themselves as India’s sole wild seaweed harvesters. For them, diving in the sea is not an act of recreation or adventure, but a means to their livelihood. With the creation of the Gulf of Mannar Marine National Park, their places of work have come under legal protection for their rich biodiversity. The National Park is also a ‘no-take’ zone, denying them their traditional fishing grounds and seaweed beds. Over 5,000 seaweed collectors have their livelihoods at stake. How do women dependent on protected areas survive in the time of conservation? \nThis project is created by a ‘tiny team’ of three independent journalists Shamsheer Yousaf, Monica Jha, and Sriram Vittalamurthy. They did everything from reporting, writing, shooting and editing photos and videos, and producing multimedia stories, debugging the code and troubleshooting. It was supported by the Pulitzer Center and the Rohini Nilekani Philanthropies. \nThe screening will be followed by a Q&A with the filmmakers and Lakshmi Murthy, a seaweed harvester turned leader. \nIn collaboration with: \n     \nThis screening is part of BIC’s programmes for Environment Day 2025 titled The Earth Remembers: Stories of Justice and Resilience. This year’s Environment Day gathering centres on the people at the frontlines of ecological change, communities whose lives are entangled with the land, the waters, and the skies, and who carry not only the weight of loss but also the seeds of resilience. Rather than viewing the environment as separate from society, we listen to stories where the two are inseparable. \n",
    "url": "https://bangaloreinternationalcentre.org/event/breaking-the-nets/",
    "keywords": [
      "Cities",
      "Climate Change",
      "Environment",
      "Film",
      "Society",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "bn",
    "workPresented": {
      "@type": "Movie",
      "name": "Breaking the Nets"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-864.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74630-1749380400-1749385800@bangaloreinternationalcentre.org",
    "name": "A Perfect Storm",
    "startDate": "2025-06-08T11:00:00+05:30",
    "endDate": "2025-06-08T12:30:00+05:30",
    "description": "What happens when a defiant chronicler and an idealist revolutionary converge in the playground that is India’s freedom struggle? Urdu newspaper Pratap, launched in pre-partition India, was a torchbearer against the British Raj. The man who publicly defended it against colonial censorship was none other than Jawaharlal Nehru. \nThe pen picked up by freedom fighter Virendra, the paper’s editor and the founder’s son who once walked shoulder to shoulder with stalwarts like Bhagat Singh was equally fearless despite threats by the imperial government, Indira Gandhi’s Emergency and a parcel bomb sent to Pratap’s office during terrorism in Punjab. \nVirendra was first arrested in the historic Saunders murder case. He was also in jail with Bhagat Singh the day the legendary revolutionary was hanged, sharing a rare first-hand witness account. In Independent India, too footsteps filled Pratap and its editors with dread and terror. \nPratap: A Defiant Newspaper is a timely reminder of the ethos of a struggle, a template for speaking truth to power at all costs. It is the story of a perfect storm. The book is written by Virendra’s son, distinguished editor Chander Mohan and journalist granddaughter Jyotsna Mohan. Jyotsna and Azeezullah Baig will be in conversation with Maya Sharma. There will be a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-perfect-storm/",
    "keywords": [
      "Books",
      "Heritage",
      "History",
      "Media",
      "Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ur",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-865.jpg"
  }
]