[
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "73428-1746644400-1746648000@bangaloreinternationalcentre.org",
    "name": "Manthan",
    "startDate": "2025-05-07T19:00:00+05:30",
    "endDate": "2025-05-07T20:00:00+05:30",
    "description": "Manthan is a performance that brings together, for the first time, two ancient art forms from opposite corners of India—Kaavad storytelling from Rajasthan and Mohiniyattam dance from Kerala. Rooted in the myth of Samudra Manthan, the churning of the ocean, it unfolds as a series of seven symbolic ‘manthans’ or churnings, exploring what it means to be human—psychologically, emotionally, philosophically, and socially. \nThe performance emerges from a long process of research, exploration, and experimentation. It weaves original writing, choreography, and music into a layered structure of stories within stories, drawing on Indian mythology alongside imagined and contemporary experiences. Themes of existence, duality, and the paradoxes of life surface through metaphor, movement, and voice. \nMohiniyattam, known for its fluidity and depth, brings grace and quiet power to the performance, while the rarely-seen Kaavad Katha—supported by over six years of dedicated study—offers a rich narrative tradition that is both visual and oral. The Kaavad box opens and closes like a book, revealing worlds within, as the dancer and storyteller move in and out of each other’s rhythms. \nManthan holds space for the interplay of tradition and innovation, creating a performance that is reflective, immersive, and intimate. Rather than offering answers, it invites the audience into a shared space of reflection—where stories, images, and movement gently churn beneath the surface. The performance was first curated by Mayuri Upadhya and commissioned by Serendipity Arts Festival. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/manthan/",
    "keywords": [
      "Dance",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Manthan"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-823.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "73528-1746558000-1746563400@bangaloreinternationalcentre.org",
    "name": "Ecstasy",
    "startDate": "2025-05-06T19:00:00+05:30",
    "endDate": "2025-05-06T20:30:00+05:30",
    "description": "KJ Diliip, Ila Diliip, Sunaad Anoor, and Diptangshu Bhowmik form the core of Lakkshya’s debut Album, Ecstasy. Inspired by their European tour, which took them to countries like the Netherlands, Germany, and France, the Album reflects the deep musical exploration and cultural exchange that defined their journey and the amazing artists they met there. For the Album, these artists blend traditional Carnatic sounds with innovative contemporary influences, featuring artists such as Mohini Dey on “The Way Home” “Bhavani,” Achal Murthy on “Envy,” and BC Manjunath on the title track. The six-track album produced by Pramath Kiran is a sonic odyssey, where each track immerses the listener in a world of emotion, energy, and joy. From intensely stirring moments to vibrant, uplifting rhythms, Ecstasy invites deep exploration of its rich layers. It’s a celebration of raw, powerful emotions—both profound and playful—capturing the essence of connection, freedom, and the exhilaration of pure musical expression. With Ecstasy, Lakkshya offers a truly unforgettable journey for every listener. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/ecstasy/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Ecstasy"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-825.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "73793-1746817200-1746820800@bangaloreinternationalcentre.org",
    "name": "Gurudev and Bapu",
    "startDate": "2025-05-09T19:00:00+05:30",
    "endDate": "2025-05-09T20:00:00+05:30",
    "description": "Gurudev and Bapu explores the extraordinary exchange of letters and ideas between Mahatma Gandhi and Rabindranath Tagore, set against the backdrop of the Indian freedom struggle. Over 25 years, their correspondence reveals sharp differences on key issues—nationalism, civil disobedience, education—but also unwavering respect and affection between the two. \nTheir dialogue reflects a time in India’s history marked by thoughtful disagreement and political maturity—offering insights into how principled dissent and mutual regard can coexist. \nBangalore Little Theatre was honoured to present early performances of the play at places closely associated with Gandhi and Tagore—Sabarmati Ashram, Santiniketan (Visva Bharati), and Thakurbari-Jorasanko (Rabindra Bharati). It has also been staged for the President of India. \nAdapted from the internationally acclaimed production with over 130 performances in India and abroad, this staging promises a compelling reflection on two great minds and the values that shaped a nation. This performance is a tribute to Gurudev Rabindranath Tagore’s enduring legacy, presented around the time of his birth anniversary. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/gurudev-and-bapu/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Gurudev and Bapu"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-65.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73412-1746297000-1746302400@bangaloreinternationalcentre.org",
    "name": "Chaturanga to Chess",
    "startDate": "2025-05-03T18:30:00+05:30",
    "endDate": "2025-05-03T20:00:00+05:30",
    "description": "From boasting of a lone International Master (IM) in Manuel Aaron in 1962, India has come a long way in the world of chess, particularly in the last two-and-half decades of the new Millennium. Today, India has 85 Grandmasters, including three women, 23 Woman Grand Masters, 140 International Masters and 42 Woman International Masters while the list of FIDE masters is growing by the day. \nIn the top 10 of any category or age group, Indians figure so prominently that they are second only to the US and China in the men’s and women’s section respectively. The double-gold at the 2024 Olympiad and India’s superb performance in the Candidates added to its growing reputation as a superpower. \nBut if you look from an historic perspective, our champions of today are merely continuing the legacy of a 5,000-year-old tradition which can be traced back to the Indus Valley Civilization when chess (called Chaturanga then) was, among other things, used for war stimulation. \nAccording to legend, Ravan’s wife Mandodari taught him Chaturanga so that he could plan battle strategies. Later, Chaturanga became Chatrang in Persian and Shatranj in Arabic before travelling to Spain and the rest of the western world. In the modern era, chess is looked at in different ways. A gymnasium of the mind. A cerebral tug-of-war. \nFor India, Anand can be the best reference point to start any debate involving chess. In fact, Indian chess can be neatly divided into Pre-Anand and Post-Anand eras. The Pre-Anand period was nascent with not many players around, no infrastructure to talk about or any support from the government or the private sector. Indian chess style was one of the many variants of the official chess as recognized by the ruling body FIDE. By the time Anand became India’s first Grandmaster in 1987 and triggered the post-Anand era, chess was a rapidly growing sport. Let’s look at some figures. Till the start of the new Millennium, India had just three GMs with Dibyendu Barua (1991) and Pravin Thipsay (1997) following in the footsteps of Anand. The first decade of the new century produced 20 GMs and the next 10 a staggering 44. The present decade has already witnessed 16 GMs to take the tally to 85. \nToday’s panel will discuss this phenomena and the reasons behind it, the personalities involved, look at the milestones crossed so far and the ones that are ahead as Indian chess passes through a Golden Era. A Q&A session with the audience will follow. \n\n",
    "url": "https://bangaloreinternationalcentre.org/event/chaturanga-to-chess/",
    "keywords": [
      "Sports"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-824.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73747-1746356400-1746360000@bangaloreinternationalcentre.org",
    "name": "Sexual Violence, Justice, and Digitality",
    "startDate": "2025-05-04T11:00:00+05:30",
    "endDate": "2025-05-04T12:00:00+05:30",
    "description": "Indian social and economic life have undergone a rapid digital transformation in recent years. How has this digital environment altered both the scale of the problem of sexual violence as well as ways to respond to this problem? In her lecture, Dr. Ashwini Tambe will detail new types of harms engendered by digital technologies, how standards for evidence have changed, and how digital mobilisation against sexual violence has unfolded. She will also discuss the pitfalls of responding to violence purely through conventional legal routes, drawing on the experience of those doing crisis-intervention work. \nA Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/sexual-violence-justice-and-digitality/",
    "keywords": [
      "Gender",
      "Law",
      "Policy & Regulation",
      "Society",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-63.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73656-1747162800-1747168200@bangaloreinternationalcentre.org",
    "name": "Dual Margam 3",
    "startDate": "2025-05-13T19:00:00+05:30",
    "endDate": "2025-05-13T20:30:00+05:30",
    "description": "As the third event in the series, embark on an enchanting journey celebrating the rich tapestry of India’s classical dance traditions. This captivating evening will harmoniously blend the rhythmic grace of Bharatanatyam from the South with the emotive storytelling of Kathak from the North. Each solo performance will delve into the intricacies of its respective tradition, presenting time-honored repertoire that reflects centuries of artistic evolution. Highlighting the event, a mesmerizing Bharatanatyam-Kathak duet will seamlessly intertwine, offering a breathtaking tableau of contrasting styles, accentuating their distinctive aesthetics and cultural nuances. \nThe Dual Margam series curates two classical dance forms of India to highlight their similarities and differences. The solo performances honour traditional repertoire (the Margam), while the duet will juxtapose each unique form with another. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dual-margam-3/",
    "keywords": [
      "Culture",
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-826.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73774-1747767600-1747773000@bangaloreinternationalcentre.org",
    "name": "Mānushī – On a Quest",
    "startDate": "2025-05-20T19:00:00+05:30",
    "endDate": "2025-05-20T20:30:00+05:30",
    "description": "Mānushī – On a Quest traces the spiritual and emotional journeys of four extraordinary women: the elusive River Saraswathi, the devoted Meerabai, the yearning mother Devaki, and the mystic poet Akka Mahadevi. Rooted in literature, poetry, and deep personal exploration, this Bharatanatyam solo presentation is the culmination of over two years of immersive research and creative engagement. \nThe performance opens with the mystical tale of Saraswathi, inspired by the book The Lost River, exploring whether the river still flows—physically and spiritually. We then journey with Meerabai, who seeks her beloved Krishna through soulful bhajans marked by longing, devotion, and unanswered questions. Devaki’s poignant voice follows, reflecting on the joys of motherhood she never fully experienced and her yearning to reclaim lost moments with her son, Krishna. The production concludes with Akka Mahadevi, whose powerful Vachanas guide us on a quest for liberation, echoing the eternal human desire for union and truth. \nEach piece is supported by evocative compositions, guided by literary scholars, and brought to life through thoughtful choreography. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/manushi-on-a-quest/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-827.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73355-1746210600-1746216000@bangaloreinternationalcentre.org",
    "name": "Living with Many Loves",
    "startDate": "2025-05-02T18:30:00+05:30",
    "endDate": "2025-05-02T20:00:00+05:30",
    "description": "All Our Loves: Journeys with Polyamory in India is an eye-opening book on polyamory—the practice of being in love, with or without sexual intimacies with more than one person simultaneously, with the consent of all. For anyone who has ever dreamed of love, sex, and companionship beyond the limits of traditional monogamy, this groundbreaking exploration navigates the infinite possibilities that polyamory can offer within the complex realities in India. \nThe discussion on the book will revolve around dispelling myths about the practice and understanding the skills necessary to live a fulfilling and responsible polyamorous life. Arundhati will also shed light on negotiating jealousy, coping with breakups and honouring boundaries. As practicing polyamorists she and the discussants will share their experiences, struggles and joys and ways to define relationships on their own terms. \nIf you are polyamorous, have a partner who is, or are just curious – this conversation will open up ways to foster honest intimacy without guilt, fear or shame; find supportive partners and community; enable practices of safe sex, and much more. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/living-with-many-loves/",
    "keywords": [
      "Books",
      "Gender",
      "Nonfiction",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-816.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "73376-1746892800-1746900000@bangaloreinternationalcentre.org",
    "name": "Paper. Play. Intuition.",
    "startDate": "2025-05-10T16:00:00+05:30",
    "endDate": "2025-05-10T18:00:00+05:30",
    "description": "Can paper play lead to intuition or vice versa? Images, textures are a pathway to explore deeper inner truths – experiences, memory and association between ideas. When one is exposed to random imagery- it triggers and leads one on a personal journey like never before. Through the tactile paper and the medium of collage, we will witness beautiful inner worlds expressed through images led by intuition.\n.\nA hands-on two hour workshop to mindfully tap into the world of paper and images, the chance and play of visuals, tread exciting journeys of compositions and celebrate creative expressions in full glory. Best suited for working professionals, students, individuals passionate about arts and design or life-learners – you will find yourself working your way through visuals and letting your thoughts come to life. \nWhat to expect:\n– A guided session on how to link your very own experiences to found images\n– Create collage based personalised artwork\n– Exploring various themes and ideas through visuals \nAll materials will be provided including books, magazines, papers, scissors and glue. \nNo prior art experience needed – just bring your presence and curiosity and get onto the journey of exploration and creativity. \nIn collaboration with: \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/paper-play-intuition/",
    "keywords": [
      "Design",
      "Visual Arts",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-1-4.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "73434-1746374400-1746381600@bangaloreinternationalcentre.org",
    "name": "Void and Verse",
    "startDate": "2025-05-04T16:00:00+05:30",
    "endDate": "2025-05-04T18:00:00+05:30",
    "description": "Join us at the BIC Library for a Blackout Poetry event where you’ll get to transform pages from your favourite books into original poems. \nBlackout poetry is a unique form of artistic expression that involves taking an existing text, often a page from a book, newspaper, or magazine, and selectively blacking out or “blacking over” certain words and phrases to create a new, cohesive, and visually striking piece of poetry. \nCome with a few pages of text from a book you like (or peruse our selection), grab your marker and get started! Participants are given a dedicated period to create their blackout poetry. During this, they flip through the pages of their choice, looking for words or phrases that resonate with them, and use markers to black out the remaining text. \nThe goal is to craft meaningful and visually engaging poems that personally resonates with you followed by a small sharing circle where you’ll get to read out your work! \n",
    "url": "https://bangaloreinternationalcentre.org/event/void-and-verse/",
    "keywords": [
      "Literature",
      "Poetry",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-61.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "73514-1746874800-1746880200@bangaloreinternationalcentre.org",
    "name": "Raviraag: In the Light of Melody",
    "startDate": "2025-05-10T11:00:00+05:30",
    "endDate": "2025-05-10T12:30:00+05:30",
    "description": "Commemorating the maestro’s 105th birth anniversary, this morning concert pays tribute to Pt. Ravi Shankar, the legendary sitar virtuoso whose artistry bridged tradition and innovation within Hindustani classical music. \nThe performance features vocal interpretations of two ragas conceived by Ravi Shankar—Raga Bairagi and Raga Natbhairav. Originally explored through the sitar, these ragas will be reimagined in the vocal tradition, offering a unique insight into their melodic essence. \nBoth morning ragas embody a serene, meditative spirit, inviting listeners into a space of peace and reflection. This concert stands as both a homage and a heartfelt musical offering to a musician whose legacy continues to inspire generations. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/raviraag-in-the-light-of-melody/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Raviraag: In the Light of Melody"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-62.jpg"
  }
]