[
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "75086-1749897000-1749927600@bangaloreinternationalcentre.org",
    "name": "ಅವಳ ಹೆಜ್ಜೆ ಕಿರುಚಿತ್ರೋತ್ಸವ 2025 | 'Avala Hejje' Short Film Festival 2025",
    "startDate": "2025-06-14T10:30:00+05:30",
    "endDate": "2025-06-14T19:00:00+05:30",
    "description": "Avala Hejje (‘Her Step’) is a day-long Kannada short film festival that presents twelve unique films by and on women. The festival celebrates Kannada female voices—through storytelling, experiment, and resistance. Each film takes to the screen the intimate, political, and ordinary lives of women, navigating memory, identity, and place. \nShepherded with a keen feminist eye, the festival spans three sessions. Filmmaker Q&A sessions follow each session, and the evening concludes with an awards ceremony. The festival encourages audiences to discover how stories by women filmmakers break film conventions and create room for new, daring storytelling. \nSchedule: \nRegistration & Refreshments | 10:30 AM – 11:00 AM \nSession 1 | 11:00 AM – 12:15 PM \n11:15 AM – 11:30 AM: Cakewalk\nA nuanced look at gender roles and labor in the domestic kitchen, Cakewalk reflects on generational ideas of ‘normalcy’ in everyday relationships.\n(English Subtitles Available) \n11:30 AM – 11:45 AM: Solo Traveler\nA woman embarks on a solo journey—quiet, persistent, and reflective—challenging expectations and discovering herself in the process.\n(English Subtitles Available) \n11:45 AM – 12:00 PM: The Last Happy Customer\nSet in a quiet Bengaluru café, this short unfolds a humorous yet intimate moment between a customer and a waiter on the cusp of closing.\n(English Subtitles Available) \n12:00 PM – 12:15 PM: Pushpa\nA poignant narrative about a woman navigating survival and dignity in the margins of the city.\n(English Subtitles Available) \nJury Panel Discussion | 12:15 PM – 12:45 PM \nQ&A Session | 12:45 PM – 1:15 PM \nLunch Break | 1:15 PM – 2:30 PM \nSpecial Screening | 2:30 PM – 3:00 PM \n2:30 PM – 3:00 PM: Neerellavoo Teertha\nRooted in ritual and memory, this lyrical film explores womanhood, water, and drought through folklore and personal inheritance.\n(English Subtitles Available) \nSession 2 | 3:00 PM – 4:15 PM \n3:00 PM – 3:25 PM: How Are You?\nA visual conversation between mother and daughter unfolds over domestic scenes, exploring care, exhaustion, and quiet endurance.\n(English Subtitles Available) \n3:25 PM – 3:45 PM: Online\nAn evocative take on cyberbullying and teenage isolation, Online follows a girl navigating school, shame, and surveillance.\n(English Subtitles Available) \n3:45 PM – 3:55 PM: Ubhaya\nA young trans woman negotiates the contradictions of ritual, gender identity, and belonging in this intimate coming-of-age film.\n(English Subtitles Available) \n3:55 PM – 4:30 PM: Unheard Echoes\nA meditative audiovisual collage of women’s voices and silences—interweaving gesture, absence, and poetic memory. \nFilmmaker Interaction | 4:30 PM – 4:45 PM \nAudience Vote & Conversations | 4:45 PM – 5:00 PM \nLaunch of Pen2Premier | 5:00 PM – 5:20 PM \nPanel Discussion | 5:20 PM – 6:00 PM \nKey Note Speech | 6:00 PM – 6:20 PM \nAwards Ceremony & Closing Remarks | 6:20 PM – 7:00 PM \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%85%e0%b2%b5%e0%b2%b3-%e0%b2%b9%e0%b3%86%e0%b2%9c%e0%b3%8d%e0%b2%9c%e0%b3%86-%e0%b2%95%e0%b2%bf%e0%b2%b0%e0%b3%81%e0%b2%9a%e0%b2%bf%e0%b2%a4%e0%b3%8d%e0%b2%b0%e0%b3%8b%e0%b2%a4%e0%b3%8d%e0%b2%b8/",
    "keywords": [
      "Film",
      "Gender"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "ಅವಳ ಹೆಜ್ಜೆ ಕಿರುಚಿತ್ರೋತ್ಸವ 2025 | 'Avala Hejje' Short Film Festival 2025"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/AH-thumbnail.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "75415-1750789800-1750795200@bangaloreinternationalcentre.org",
    "name": "The Unreserved",
    "startDate": "2025-06-24T18:30:00+05:30",
    "endDate": "2025-06-24T20:00:00+05:30",
    "description": "60 minutes | Hindi with English subtitles | 2020 | India \nThe Unreserved is an intimate exploration of the lives of passengers who travel in the Unreserved Compartment—the most economical way to journey across India via the Indian Railways. Through candid conversations and personal stories, the film captures the aspirations, struggles, and perspectives of these travelers. \nSince its release, The Unreserved has been showcased at several notable festivals, including Film Southasia 2017 (Nepal), the EFF BRICS Film Festival 2017 (Russia), the South Asian International Docufest 2018 (USA), and the PAME Film and Music Festival 2020 (Nepal). Most recently, it was screened at Screen Southasia 2025 (Online). The film was honoured with the National Film Award for Best On-Location Sound at the 65th National Film Awards in 2018. \nThe screening will be followed by a conversation between the Director, Samarth Mahajan and Mahima Venugopalan which will be followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-unreserved/",
    "keywords": [
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "The Unreserved"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-892.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "74677-1749985200-1749990600@bangaloreinternationalcentre.org",
    "name": "Timeless Ragas, A Modern Instrument",
    "startDate": "2025-06-15T11:00:00+05:30",
    "endDate": "2025-06-15T12:30:00+05:30",
    "description": "Experience the rich tapestry of Hindustani classical music through a uniquely modern voice—the saxophone. Timeless Ragas, A Modern Instrument is a concert that bridges tradition and innovation, presenting ancient ragas with the expressive depth of a contemporary wind instrument. \nPriyank Krishna is the first and only “A Grade” Hindustani Classical Saxophonist of All India Radio & Doordarshan. One of the few exponents of Hindustani classical saxophone, his performance takes the audience on a musical journey which reimagines the sonic possibilities of the genre.\n \nWith the emotive nuances of raga, the emphatic rhythm of taal, and the meditative depth of alaap, this performance captures the soul of Indian classical music while offering a fresh, resonant sound.  \nIn this performance, he’s accompanied by Gurumurthy Vaidya on Tabla.  \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/timeless-ragas-a-modern-instrument/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Timeless Ragas, A Modern Instrument"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-68-e1749133872719.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "74835-1750359600-1750365000@bangaloreinternationalcentre.org",
    "name": "IT IS YOU",
    "startDate": "2025-06-19T19:00:00+05:30",
    "endDate": "2025-06-19T20:30:00+05:30",
    "description": "Ever felt trapped by unchosen rules? Silenced your voice because “that’s how it’s done”? What if your nods and obedience weren’t entirely yours? \nIT IS YOU invites you to explore beyond roles, rituals, and language. This immersive experience follows a carefully crafted narrative—two figures, trained in Kalakshetra (Manipur), Koodiyattam, and contemporary movement, embark on a journey of tension and harmony. Yet within this structure, there’s no fixed meaning. Through movement and a layered, resonant soundscape, you become the co-creator, weaving your emotions and memories into their story.\nWithout spoken words, the piece lives in the space between the performers’ intent and your introspection. \nWritten by Vivek Vijayakumaran\nCreated, Devised and Performed by Pangambam Tyson Meitei & Vivek Vijayakumaran\nDuration : 65 Min\nMusic and Sound Design : Chaoba Thiyam\nMusic Operated : Abhitej Gupta\nLight Design and Execution  : Arun DT\nCostume Design : Aastha & Aloka D’souza\nMarketing and Publicity : Swati Shukla & Gana\nProduced by Our Theatre Collective, Bangalore in collaboration with Kalakshetra Manipur\n \nSpecial Thanks \nRukmini Iyer, Ima Sabitri, Heisnam Tomba, Abhitej Gupta,Laxmi Priya, Sachin Ravindran, Sachin Gurjalee, Garima Mishra, Nitin Sharma, Veena Basavarajaiah, Apoorva Arthur, Ajiithlal, Sreehari Ajith, Leya Mammen, Suranjay Patil, Khumukcham Rahul, Lanchingba Laishram, Chanakya Vyas, and Infinite Souls Farm and Artists Retreat \n Supported by: \n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/it-is-you/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "IT IS YOU"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-884.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75274-1750530600-1750536000@bangaloreinternationalcentre.org",
    "name": "Sustainable Development & Public Policy",
    "startDate": "2025-06-21T18:30:00+05:30",
    "endDate": "2025-06-21T20:00:00+05:30",
    "description": "Institutions and Public Policy for India’s Sustainable Development – Perspectives on Governance, Technology, and Finance, is an edited volume in honour of Professor Vinod Vyasulu (with editors – Sukhpal Singh, Jyotsna Jha, A. Indira and A. V. Arunkumar). \nThe book addresses one of the most urgent challenges of our time – sustainable development. Across the globe economies are grappling with the combined pressures of climate change, inequality, and unsustainable growth. Basic needs remain unmet for large sections of the population, prompting a growing recognition that we must rethink how we define and pursue development. Sustainability is no longer a peripheral concern—it is central, complex, and evolving, requiring new approaches and frameworks. \nThe book brings together diverse perspectives on the critical drivers of sustainable development, namely, governance through institutions, readiness through technology and accessibility to finance. While technology is often seen as a key enabler, its transformative potential depends deeply on the institutional and policy environment in which it is embedded. Institutions—formal and informal—shape development outcomes, and public policy plays a crucial role in aligning these efforts with sustainability goals. \nFocusing on the Indian context, the book event will have eminent panel members exploring the three interconnected themes of (1) Institutions and Development; (2) Technology and Innovation; and (3) Policy and Governance. \nWe look forward to an engaging conversation as we reflect on the ideas in the volume and their relevance for policy, research, and practice. \n",
    "url": "https://bangaloreinternationalcentre.org/event/sustainable-development-public-policy/",
    "keywords": [
      "Policy & Regulation",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-887.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75057-1750357800-1750363200@bangaloreinternationalcentre.org",
    "name": "Adolescence & Algorithms",
    "startDate": "2025-06-19T18:30:00+05:30",
    "endDate": "2025-06-19T20:00:00+05:30",
    "description": "The years between ages 10 and 19 are marked by intense physiological, psychological, and social change. Adding to the challenges of this already turbulent phase are mobile devices and social media. These platforms often exploit insecurities, creating echo chambers and negative feedback loops. While digital life can connect us, it also has the power to isolate. The TV series Adolescence highlights the potentially dangerous consequences of these overlapping forces. \nIn this conversation, a panel of experts, drawing from both professional knowledge and lived experience, explores what adolescence looks like in the age of social media, particularly in urban India. Taking the TV show as a starting point, the discussion will look at the realities young people face today and consider how parents, schools, and other adults can help support individual and collective well-being. \n",
    "url": "https://bangaloreinternationalcentre.org/event/adolescence-algorithms/",
    "keywords": [
      "Health & Wellness",
      "Public Health",
      "Science",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-885.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74941-1750185000-1750190400@bangaloreinternationalcentre.org",
    "name": "Revisiting Tamil History",
    "startDate": "2025-06-17T18:30:00+05:30",
    "endDate": "2025-06-17T20:00:00+05:30",
    "description": "Nearly 90 million Tamil people, spread across India and a vibrant global diaspora, have preserved a distinct cultural identity while continuously evolving through time, geography, and social transformation. One of the world’s oldest continuous cultures, the Tamil community continues to leave a powerful imprint on literature, philosophy, politics, science, the arts, and beyond. \nIn her book The Tamils, Nirmala Lakshman speaks about the origins of Tamil civilization, from the Stone Age and the Sangam era to the Bhakti movement and colonial history, and how these shaped the Tamil consciousness. \nTogether with Ranvir Shah, she will delve into the themes of the book and also address the complexities that mark Tamil society today, including intersections of caste, religion, gender, and modernity, and reflect on what it means to be Tamil in the 21st century. Themes such as migration, resilience, identity, and creativity will be explored as the speakers examine how Tamil culture continues to thrive and adapt in an ever-globalising world. \nA Q&A with the audience will follow. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/revisiting-tamil-history/",
    "keywords": [
      "Anthropology",
      "Books",
      "Culture",
      "Heritage",
      "Nonfiction",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/RevisitingTamilHistoryThumbnail.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "75215-1750003200-1750008600@bangaloreinternationalcentre.org",
    "name": "What Happens When We Talk?",
    "startDate": "2025-06-15T16:00:00+05:30",
    "endDate": "2025-06-15T17:30:00+05:30",
    "description": "In a world that rushes on and rarely looks up, Doors is a social card game designed to bring people together and rediscover the joy of conversation. Created as a response to our overstimulated, hyper-digital lives, it invites you to slow down, stay curious, and see what unfolds when different minds meet. \nThe session will begin with a short introduction to the social intent behind the game, after which we’ll seal our phones away and dive into gameplay—exploring thoughtful questions, lighthearted arguments, big ideas, and what it means to be human. \nJoin us for an evening of wholesome connection and unexpected conversation! \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/what-happens-when-we-talk/",
    "keywords": [
      "Society",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-882.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73689-1752690600-1752696000@bangaloreinternationalcentre.org",
    "name": "The History of Welfare",
    "startDate": "2025-07-16T18:30:00+05:30",
    "endDate": "2025-07-16T20:00:00+05:30",
    "description": "Welfare guarantees and direct benefit transfers are at the heart of the political marketplace but the longer-term history of welfare in India is surprisingly little known. Making India Work: The Development of Welfare in a Multi-Level Democracy (Cambridge University Press, 2025) recovers a history that is crucial for understanding the current juncture of welfare politics and political economy in India. Traversing more than a century of welfare development from the late colonial period to the present-day, the book asks why India has ended up with a small protected formal sector workforce shielded by social security and protection against retrenchment, and a much larger population that labours informally and does not enjoy such protections. It examines why India’s model of industrialisation failed to provide an engine for mass employment or welfare state development, and why the focus of policy efforts has shifted over the last fifty years from employment generation to the rise of ‘direct benefits’ which subsidise precarious livelihoods. \nIn this session, Louise Tillin, the author of the book, Anindita Adhikari and Rajendran Narayanan will be in conversation with Arun Thiruvengadam. The discussion will be followed by Q&A with the audience. \nIn collaboration with: \n \nThis event is sponsored by the Justice VR Krishna Iyer Chair, NLS.  \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-history-of-welfare/",
    "keywords": [
      "Books",
      "Economics",
      "History",
      "Law",
      "Policy & Regulation",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-829.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "74469-1750273200-1750280400@bangaloreinternationalcentre.org",
    "name": "Abhang Mela",
    "startDate": "2025-06-18T19:00:00+05:30",
    "endDate": "2025-06-18T21:00:00+05:30",
    "description": "Abhang is a genre of classical music from Maharashtra, primarily sung in praise of Sri Vitthala of Pandharpur. The term Abhang means no ending or no interruption. Over 10,000 Abhangs were composed by various Sants of Maharashtra, including Sant Dnyaneshwar, Sant Eknath, Sant Tukaram, Sant Namdev, and Sant Janabhai. Emerging from the Bhakti Sampradaya in the 12th century, Abhangs have become integral to Concerts and Bhajans. Varkaris (devotees of Sri Vitthala) sing Abhangs while walking towards Pandharpur. Sri. Purandaradasa adopted the name ‘Purandara Vitthala’ as his ankitanama, as ‘Vitthala’ was his Ishta Murti, while the name ‘Purandara’ was bestowed upon him by his guru, Sri Vyasa Raya. \nUma Kumar, Carnatic Singer from Switzerland, and the ensemble will perform 12 Abhangs composed by 10 composers, set in 12 different Hindustani ragas and presented in both on-beat and off-beat rhythms. She will render these Abhangs in the Carnatic style, accompanied by Violin and Mridangam, while complementing the sound with Tabla and Manjira to fully express these divine compositions’ deep emotions. \nAbhang Mela aims to create a musical symphony, blending the bhava from singing, the nada from the Violin, the laya from the Tabla and Mridangam, and the high-pitched rhythms from the Manjira, alongside the melodious sound of the Tanpura. Music lovers are invited to enjoy this unique musical experience. \nPresented by: \nUma Kumar \n",
    "url": "https://bangaloreinternationalcentre.org/event/abhang-mela/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Abhang Mela"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_AM-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "74793-1750532400-1750537800@bangaloreinternationalcentre.org",
    "name": "InstaRagam",
    "startDate": "2025-06-21T19:00:00+05:30",
    "endDate": "2025-06-21T20:30:00+05:30",
    "description": "How do we each feel a Raga? While Western classical music often associates major scales with happiness and minor scales with sadness, Indian Ragas evoke a wide spectrum of emotions—unique to each listener. Could a Raga that brings joy to one person stir a different emotion in another? \nIs there hidden information in the space between two notes? While the twelve notes of the well-tempered scale were standardized only in the 18th century, Indian classical music has long embraced microtones—subtle pitches between the familiar notes. Can the human mind truly perceive these shades of sound? \nAnd must we always stay within the bounds of musical grammar? What happens when we take a set of notes and let them breathe, transform, and find their own flow? \nThis World Music Day, join us for Insta-Ragam—an immersive exploration of Raga structures, followed by a live session where you get to make music with the artists. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/instaragam/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "InstaRagam"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-891.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "74996-1750273200-1750278600@bangaloreinternationalcentre.org",
    "name": "Sounds from the Library (#3)",
    "startDate": "2025-06-18T19:00:00+05:30",
    "endDate": "2025-06-18T20:30:00+05:30",
    "description": "BIC brings back Sounds From The Library for a third time! \nSounds From The Library is a series that features artists of the Toto Awards for Music for an evening of conversations and live music. Held in BIC’s intimate library space, our audience will experience a unique live performance along with the chance to learn more about the artists’ journeys and processes.  \nIn this edition, we present the edgy, alternative synthpop duo Dreamhour & Dokoroko from Siliguri & Gangtok (Toto Awards for Music 2024 Longlister) along with Bangalore’s own RnB Singer-Songwriter Rudy Mukta (Toto Awards for Music 2023 Winner). \nIn collaboration with: \n \n\n",
    "url": "https://bangaloreinternationalcentre.org/event/sounds-from-the-library-3/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sounds from the Library (#3)"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-878.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "74478-1750590000-1750597200@bangaloreinternationalcentre.org",
    "name": "Journey Through Raaga",
    "startDate": "2025-06-22T11:00:00+05:30",
    "endDate": "2025-06-22T13:00:00+05:30",
    "description": "Raaga music is the core essence of Indian classical music. It is not just a set of swaras/notes but a flow of melodic content, defined by certain contours which gives each raga s unique flavor. \nUnique relationships exist between the notes. While individual notes define a swara position, the reflection of the swara relationship expounds the melodic variations. \nHence it is essential to understand these relationships and how they flower into a raaga. While manodharma (creativity) has a big part in it, our huge repository of compositions plays an important role in providing a framework for this exploration. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/journey-through-raaga/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Journey Through Raaga"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-889.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74926-1749812400-1750017600@bangaloreinternationalcentre.org",
    "name": "Ambedkar through Ephemera",
    "startDate": "2025-06-13T11:00:00+05:30",
    "endDate": "2025-06-15T20:00:00+05:30",
    "description": "Exhibition Opening: 6:00 pm | Friday, 13 June\nTimings: 11:00 am – 8:00 pm\nExhibition on show until Sunday, 15 June \nWalkthroughs:\nFriday, 13 June | 6:30 pm\nSaturday, 14 June | 6:30 pm\nSunday, 15 June | 11:30 am & 6:30pm \nConversations:\nPanel Discussion – Saturday, 14 June | 4 pm – 5:30 pm \nFrom train tickets to social media posts, this visual archive has curated images of Ambedkar’s legacy across space and time.  \nThe collection of ephemera (items originally designed to last only for a short time) tell a unique story of the micro processes behind the emergence of Ambedkar as an icon of social justice. Gathered over the years and from around the country, this exhibition invites us to imagine how their original users might have related to these materials through images and writing.  \nFeaturing calendars, posters, packing labels, Ambedkar Jayanti invite cards, flight boarding passes, wedding invitation cards and music concert tickets, Ambedkar through Ephemera will be open for 3 days.  \nProf Gopal Guru will inaugurate the exhibition on 13th June at 6 pm. He will share his perspective on the collection and contextualize the images in the larger politics of visual culture. \nA Panel Discussion with Prof Gopal Guru, Shivaji K Panikkar, Former Head of Art History & Aesthetics, Faculty of Fine Arts, M.S. University of Baroda and Vikas Kumar, Curator of the exhibit, will take place on 14 June, 4 pm. What kind of art objects are ephemera? How do we grasp their significance for understanding the symbolic life of political icons? This panel engages with these and other related issues. \nIn collaboration with Azim Premji University, Bangalore \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/ambedkar-through-ephemera/",
    "keywords": [
      "History",
      "In Memory",
      "Photography",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-874.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "75241-1749985200-1749990600@bangaloreinternationalcentre.org",
    "name": "Spots, Snouts & Shouts",
    "startDate": "2025-06-15T11:00:00+05:30",
    "endDate": "2025-06-15T12:30:00+05:30",
    "description": "Join us for a rollicking storytelling session where animals take center stage – and the punchlines too! From the grasslands of Africa comes The Cheetah and the Lazy Hunter, a traditional Zulu tale that’s as quick-witted as its spotted star. And from the imagination of Mickey Patel comes Rupa the Elephant, whose trunk is just as twisty as the story she’s in! \nWith puppets and plenty of laughs, this session is perfect for kids aged 4 and up who love animals, antics, and age-old stories with a twist. \nBring your wildest imagination – and maybe a tail or two! \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/spots-snouts-shouts/",
    "keywords": [
      "Books",
      "Wildlife",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-883.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74984-1750185000-1750190400@bangaloreinternationalcentre.org",
    "name": "Queering Law",
    "startDate": "2025-06-17T18:30:00+05:30",
    "endDate": "2025-06-17T20:00:00+05:30",
    "description": "What would justice look like if it spoke in a queer voice? How might legal judgments shift if they were written through the lived experiences and realities of LGBTQIA+ individuals? \nIn this session, we explore the bold and imaginative work of The Queer Judgments Project, an initiative that seeks to re-think, re-write, and re-invent legal judgments through queer and complementary perspectives. Emerging from a series of conversations among scholars, activists, and legal thinkers, the project asks a vital question: how could legal decisions involving sexual orientation, gender identity and expression, and sex characteristics be expressed differently, more inclusively, more justly? \nAt the heart of the discussion is the project’s first major output: an edited collection that offers 26 re-imagined judgments and commentaries from across the globe. Through this collection, contributors bring their diverse disciplinary backgrounds and personal insights to bear on the law, queering traditional frameworks and imagining alternative approaches to legal reasoning. \nThis session will engage with the creative, critical, and deeply personal work that underpins these re-written judgments. It will reflect on how the project aims not just to critique existing legal structures but to open up new possibilities for justice that better reflect the experiences of LGBTQIA+ and other minoritized communities. \nThis year, BIC celebrates Pride Month through a series of programs that embrace Queerness as it is — unconforming, changing and alternative. Every program aims to embody the fluid and non-normative possibilities of existence that queerness creates, while fostering a community that welcomes difference in an unbending society, whether that be through new models of living or unique modes of self-expression. Pride, Insists Upon Itself! \n",
    "url": "https://bangaloreinternationalcentre.org/event/queering-law/",
    "keywords": [
      "Books",
      "Gender",
      "Law",
      "Nonfiction",
      "Policy & Regulation",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-876.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "75345-1750608000-1750613400@bangaloreinternationalcentre.org",
    "name": "More Films for Freedom",
    "startDate": "2025-06-22T16:00:00+05:30",
    "endDate": "2025-06-22T17:30:00+05:30",
    "description": "As part of BIC’s Pride Programs, we brings to you five short films that shine a light on the hurdles faced by queer people around the globe as they struggle for existence. These films, selected from British Council’s Five Films for Freedom Collection, explore the stories of those who live their lives unabashedly, enduring injustice yet fostering communities of resilience. \nFilm Schedule: \nThe Men Who Speak Gayle\n11 mins | English and Gayle with English subtitles | Andrew Brukman | UK with South African collaboration | 2020\nYoung drag performer Nathan is one of the last people to speak Gayle – a secret language the gay community were forced to invent during Apartheid. He finds out about Louis, an original Gayle speaker living in a conservative desert town in South Africa and wants to put on a performance with him, but don’t know how the town will react. \nBaba\n18 mins | English and Arabic with English subtitles | Sam Arbor, Adam Ali | UK with Libyan collaboration | 2021\nLiving in the tunnels beneath Tripoli a queer Libyan teenager, Britannia, dreams of escape to a better life, but an unexpected discovery forces him to question whether to stay or flee from his homeland and his friends. (Winner Iris Prize 2021) \nPrayers for Sweet Waters\n16 mins | English, Kirundi and French with English subtitles| Elijah Ndoumbe | UK with South African collaboration | 2021\nA submergence into the vivid realities of three Transgender sex workers living in Cape Town, South Africa during the COVID-19 pandemic. \nThe Enchanted Day of the Eres\n12 mins | Brazilian Portuguese with English subtitles | Coraci Ruiz, Julio Matos | UK with Brazilian collaboration | 2022\nBlending animation and actuality with incredible access, this documentary tells the story of an unusual birthday party. It’s a party for the ‘Erês’ – spirits venerated by the religion of Candomblé, one of the few Afro-Brazilian religions that welcomes the LGBTQIA+ community. \nA Bird Called Memory\n15 mins | Brazilian Portuguese with English subtitles | Leonard Martinelli | UK with Brazilian collaboration | 2022\nLua, a trans woman, has lost her pet bird in the streets of Rio de Janeiro, a city that can often be a hostile place for transgendered people. As Lua journeys to find Memory, we are exposed to streets full of contradictions. When Lua begins to sing the songs of the musicals that Memory and her often watched together, music and cinema become a space of resistance and hope. \n  \n \n  \nThis year, BIC celebrates Pride Month through a series of programs that embrace Queerness as it is — unconforming, changing and alternative. Every program aims to embody the fluid and non-normative possibilities of existence that queerness creates, while fostering a community that welcomes difference in an unbending society, whether that be through new models of living or unique modes of self-expression. Pride, Insists Upon Itself! \n",
    "url": "https://bangaloreinternationalcentre.org/event/more-films-for-freedom/",
    "keywords": [
      "Film",
      "Gender",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "More Films for Freedom"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-890.jpg"
  }
]