[
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Main Tawaif",
    "startDate": "2024-05-22T19:00:00+05:30",
    "endDate": "2024-05-22T20:30:00+05:30",
    "description": "Main Tawaif is a presentation by Manjari Chaturvedi, under The Courtesan Project Series. 15 years in existence, the series is founded and conceptualised by Classical Dancer, Creator of Sufi Kathak, and Restorer of the Dance of Tawaifs, Manjari Chaturvedi. The Courtesan Project has become one of the most successful dance revival movements in today’s time. Giving a voice to the women and 100s of years of creative contribution to theatre, cinema and performing arts. \nThis performance is an exploration of the gender dynamics within the arts, unveiling the pivotal influence of women performers – the enigmatic Tawaifs and Baijis – of North India from the 16th to the 20th century. The performance is set as an intimate mehfil performance of how the Tawaifs would perform in yesteryears. Their music, their stories, their dance enacted by a single performer. \nThis is a bold statement that is needed to finally accord respect for the performance art of the Tawaif, to go beyond the drawing room sniggers and laughter associated with the word Tawaif, and to finally acknowledge their role in history. \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/main-tawaif/",
    "keywords": "Dance, Performing Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-451.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "Exordium",
    "startDate": "2024-05-15T19:00:00+05:30",
    "endDate": "2024-05-15T20:15:00+05:30",
    "description": "Exordium is a modern Indian dance theatre production aimed at discussing the contemporary social and political human structures through innovative Indian dance. \nThe production presents 2 full length pieces Yele Oota (‘Grand meal’ in Kannada) and Jaaga Illa (lack of space in Kannada). Yele Oota talks about our response and participation as a human community in the food shortage and management crisis, particularly during covid, through intricately designed movement pieces and dramatic compositions, whereas, Jaaga Illa speaks of the impact of hyper-metropolitanism on cities (here we specifically talk about the impact on Bengaluru) through multiple retinal designs and innovative movement grammar performed on a small wooden box. \nDancers: Vishwakiran Nambi, Shrijani Rao, Priyanka Saxena, Simran Thakur, Ananya S Kashyap, Bhuvana V, Dinesh Kumar RA, Ranjini Hemanth\nMusic: Gopu Krishnan\nLyrics: Kiran Kaverappa\nCostumes: Sumukha P Tamankar\nProps: Vishwakiran Nambi\nPictures: Sushrutha \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/exordium/",
    "keywords": "Dance, Performing Arts, Society, Theatre",
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Exordium"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-450.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Nagari - Filming Urban Realities",
    "startDate": "2024-05-12T10:30:00+05:30",
    "endDate": "2024-05-12T13:00:00+05:30",
    "description": "The Nagari Short Film Competition is an annual competition designed to guide and develop films that focus on urban issues, specific to Indian cities. Nagari intends to be a bioscope for the city and through this lens, they explore diverse conditions and engage with urban issues.  \nSince 2020 Charles Correa Foundation has organised 4 editions of short, 7-minute films on urban India. The aim is to serve as a platform for filmmakers, architects, urban designers, and planners to present their visions of, and for, the city, thereby using film as a medium to make the public aware of the issues. \nThe previous editions have looked at themes such as Water in Urban India, People and Livelihoods, the Housing Inadequacy in rapidly growing towns and cities across India, and Reclaiming the Urban Commons through the Lens of Waste Management. This event will present a selection of the films from across four years of the festival. \nThe screenings will be followed by a brief discussion with Deepa Dhanraj, Writer and Independent Documentary Filmmaker and,  Shruti Parthasarathy, Filmmaker. A Q&A with the audience will follow. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/nagari-filming-urban-realities/",
    "keywords": "Architecture, Cities, Design, Development, Environment, Film",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-467.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Contemporary Expressions in Movement",
    "startDate": "2024-05-11T15:00:00+05:30",
    "endDate": "2024-05-11T18:00:00+05:30",
    "description": "Through various improvisational exercises and choreographic processes Contemporary Expressions in Movement seeks to introduce and make movement vocabularies accessible to participants. The workshop will employ movement phrases developed by Attakkalari’s contemporary movement practice, which is informed by contemporary dance, and draws its grammar and structure from embodied movement and somatic practices such as Yoga, Kalarippayattu, Bharatnatyam. \nDuring this 3-hour workshop, participants will be gently acquainted with and encouraged to keenly observe a set of movement phrases. They will be guided to find ways to embody these movement phrases. \nThe workshop will briefly cover: \n\nMovement exploration: Participants will engage in a series of movement exercises and improvisational activities designed to help them connect with and observe their bodies, exploring different ways of moving.\nChoreographic process: Participants will have the opportunity to work collaboratively to create short dance/movement pieces, using the techniques and principles they have learned during the workshop.\nPerformance: The workshop will culminate in a sharing session where participants will have the opportunity to perform their choreographic creations for each other.\n\nThis workshop is open to anyone with an interest in movement and dance, regardless of their previous experience. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/contemporary-expressions-in-movement/",
    "keywords": "Dance, Health & Wellness, Workshops",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-461.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Dancin' India",
    "startDate": "2024-05-05T16:00:00+05:30",
    "endDate": "2024-05-05T20:30:00+05:30",
    "description": "As per UN Convention, April 29 is designated as International Dance Day. We celebrate this on the first Sunday following it, since India is home to a rich plethora of classical, folk, film dances and Bangalore is a hub to all of these forms. \nFeaturing over 55 dancers, the occasion brings three generations of gurus, dancers, writers and more. The best of Bharatanatyam, Kathak, Odissi, Mohiniattam, Kuchipudi, and Modern come together through prodigious talents and established stars. This is the 10th year of this famed Dance Day celebration, mentored and curated by Ashish Khokar, the editor of India’s only yearbook on dance – attendance, now in its 25th year! \nThe evening begins with a display of 21 photos at the entrance leading to an onstage assembly of 30 shishyas in many forms followed by 9 top soloists, one ballet group work and in the end, coming together of the male ang. The evening brings diversity of forms and this careful curation ends in a crescendo of many dancers coming together. \nProgramme: \n4:00 pm | DANCIN’ PHOTOS | A photo exhibition by Trio – Suresh Babu, Madhukar & Ravi \n4:25 pm | Inauguration by Vani Ganapathy \n4: 30 pm  | Opening Ceremony\nBharatanatyam by guru Gayatri Keshavan ensemble\nKathak by NADAM ensemble\nOdissi by Nrityantar ensemble\nModern by  Vishwakiran Nambi\nMohiniattam by Nair Sisters’ Shishyas\nKuchipudi by guru Veena Murthy Shishyas \n5:00 pm | Film and Book Launch of Mohan Khokar – The Father-Figure of Indian Dance History by IGNCA \n5:15 pm | The Art of the Soloists\nBharatanatyam by Aditya Nataraja BN\nBharatanatyam by Shaivi Gururaj\nKathak by Laxminarayan Jena\nBharatanatayam by Archana-Chetana\nKuchipudi by Washim Raja\nBharatanatayam by Bianca Radhakrishnan\nGandhi Gita by Rasadhwani\nBharatanatyam by Shobhit Ramesh\nBharatanatyam by Aishwarya Nityanand\n \n8:15 pm | Purush Ensemble\nNikhil Pawar, Anil Iyer, Raja and Vishwakiran Nambi \nIn collaboration with: \n \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/dancin-india/",
    "keywords": "Dance, Performing Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-460.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "A Home in the Constant Flux",
    "startDate": "2024-05-25T11:00:00+05:30",
    "endDate": "2024-05-26T20:00:00+05:30",
    "description": "Installation Opening: Saturday, 25th May 2024, 11am\nInstallation on show until Sunday, 26th May 2024, 8pm \nWalkthrough with the Curator: \nSaturday, 25th May, 6pm – 7pm\nSunday, 26th May, 12:15pm – 1:15pm \nPanel Discussion:\nSunday, 26th May, 11am – 12pm \nThe exercise to retrace the intangible memories entwined with tangible objects is what created the research-based series of thirty-six photos A Home in the Constant Flux: A Call to the Verb Memory. The central idea of this photo-series is that during migration of people across geographies, the objects of love and necessity undergo the arduous ordeal, and that these, bearing the patina of age, create a desire to develop an understanding that personal histories are not isolated from the political selves. \nThe technique of cyanotypes, which is used to print the archival maps for A Home in the Constant Flux: A Call to the Verb Memory metamorphoses into a metaphor of capriciousness – endured by refugees. As the cartographic lines, in various shades of blue and white, overlap the digital images of the objects, they gesture at the fluidity of the memory only to find itself resistant to the burden of confinement around the refugees. The aesthetic of distortion – in the form of borders, the viscosity of the blues and whites, and the ballet of letters – epitomises the inevitability of embracing impermanence as one of the few constants in a life on the move. The element of distortion serves as a bridge between abstract and representation to encourage the viewer to navigate and map the photo series in order to question the boundaries of perception. \nThe panel discussion on the second day of the event will delve into the influence of visual representation on refugee narratives, particularly in light of the surge of imagery overpowering the social and print media in recent years. This influx frequently drowns out the individual voices of refugees, maintaining stereotypical visual stereotypes that confine visual language of that of a destitute ‘other’. Furthermore, the conversation will confront the inherent tendency to marginalize migrants through photography, highlighting the disparity between mainstream portrayals and the more empathetic and authentic depictions found in the research-based project A Home in the Constant Flux: A Call to the Verb Memory. \nIn collaboration with:\n \n  \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/a-home-in-the-constant-flux/",
    "keywords": "Heritage, History, Media, Photography, Politics, Visual Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-470.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Echoes of AI",
    "startDate": "2024-05-04T18:30:00+05:30",
    "endDate": "2024-05-04T20:00:00+05:30",
    "description": "On the surface, an Indian doctor, a British poet, an UberEats courier in Pittsburgh, and a Chinese activist in exile have nothing in common. But they are in fact linked by a profound common experience―unexpected encounters with artificial intelligence. In her debut book Code Dependent, shortlisted for the inaugural Women’s Prize for Non-fiction 2024, Madhumita Murgia shows how automated systems are reshaping our lives all over the world, from technology that marks children as future criminals, to an app that is helping to offer medical diagnoses to a remote tribal community. \nBy highlighting the voices of ordinary people in places far removed from the cozy enclave of Silicon Valley, Madhumita explores the impact of this often-exploitative technology on individuals, communities, and our wider society. \nVidushi Marda, a lawyer and researcher, specialises in examining the socio-legal ramifications of data-driven technologies. Her research centers on technology regulation, asymmetric power dynamics, and fundamental rights. Through her endeavors, she collaborates with governments, corporations, and technical communities to promote social justice. \nTogether, they will discuss and unpack how AI can strip away our collective and individual sense of agency, and shatter our illusion of free will. AI has already infiltrated our day-to-day, through language-generating chatbots like ChatGPT and social media. But it’s also affecting us in more insidious ways. It touches everything from our interpersonal relationships, to our kids’ education, work, finances, public services, and even our human rights. It is already changing what it means to be human, in ways large and small, and Madhumita and Vidushi reveal what could happen if we fail to reclaim our humanity. \nA Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/echoes-of-ai/",
    "keywords": "Books, Development, Nonfiction, Technology",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-438.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Kaafi",
    "startDate": "2024-05-03T19:00:00+05:30",
    "endDate": "2024-05-03T20:00:00+05:30",
    "description": "Urdu and Hindi | 60 mins | Suitable for all ages \nKaafi is a dance theatre production that explores the multifaceted nature of blindness, both physical and metaphorical, through the lens of the character Gandhari from the Indian epic, Mahabharata. The performance uses the form of Bharathanatyam to delve into themes of ideals and examples, conformity, oppression, the roles assigned to a woman, and the consequences of our choices. Kaafi contextualises evocative political poetry to narrate the story in the nostalgic memory of Gandhari, her absurd choices, and examines the unseen forces that dictated it. The performance imagines and weaves an intimate tale of her reasons and feelings. A haunting voice that cursed her to perpetual darkness; shackled by the multiple roles of a daughter, wife, mother, and queen, that competed and tore her apart; her relationship with her only kin; her participation and perpetrating of the oppression and violence and an obscured vision of what her life could have been. \nKaafi becomes a mirror reflecting the universal struggle of every woman across time and space. It explores the perpetual tension between aspiration and reality that is predestined for every woman; aspiring to be ideal but perennially falling short—forever insufficient, yet infinitely compelling. Through a combination of dance, symbolism, and internal monologues, the performance invites the audience to reflect on how we navigate the intricacies of our existence, condition of our life and the act of seeing, constantly tugging at the personal question and political state of affairs. \nArtists and Collaborators  \nEnsemble – Adithi, Karuna, Smitha, Keerthana, Krutika,\nChoreography- Priyanka Chandrasekhar\nLanguage – Urdu and Hindi\nStyle of dance – Bharathanatyam\nMusic production – Dheeraj Baneerjee\nAssistance in composition – Karuna Kirtivasan and Arvind Sridhar\nVocals and voice – Deepthi Baskar\nVocal and voice support – Karuna Kirtivasan and Talin Subbaraya\nLights – Arvind Sridhar\nText – Poetry by Faiz Ahmed Faiz, Akhtar Sheerani, Excerpts from Kartika Nair’s – Until the Lions\nCreatives, photos and film – Arvind Sridhar \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/kaafi/",
    "keywords": "Culture*, Dance, Performing Arts",
    "inLanguage": "ur",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-457.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Tracing Origins",
    "startDate": "2024-05-02T18:30:00+05:30",
    "endDate": "2024-05-02T20:00:00+05:30",
    "description": "Karthik Venkatesh, in his book, 10 Indian Languages and How They Came to Be, traces the long and varied journeys of ten languages through time, examining the cultural shifts and political and social influences that have shaped them. He provides a glimpse of their literature, tracks the growth of their scripts and identifies landmark moments that have preserved and reinvented these ten Indian languages. \nVenkataraghavan Subha Srinivasan, in his book, The Origin Story of India’s States, gives us an account of the genesis of India’s states, presenting the incredible origin stories of each of India’s twenty-eight states and eight union territories, spanning from Independence until today. \nThe authors come together in this session to delve into the historical, cultural, and political dimensions of both subjects, to compare and contrast their development and to share with us their process in putting together books that are accessible and of historical import. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/tracing-origins/",
    "keywords": "Books, Governance, Language, Nonfiction",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-465.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Travelling without Travelling",
    "startDate": "2024-05-04T11:00:00+05:30",
    "endDate": "2024-05-04T13:00:00+05:30",
    "description": "“The world is a book and those who do not travel read only one page.” – St Augustine \nIn this silent reading session, we’ll journey through the captivating world of travel writing. From historical explorers like Marco Polo and Ibn Batutta to modern authors such as Dervla Murphy, Pico Iyer and Michael Palin, we’ll explore how the themes of travel have evolved over time. Through their words, we’ll glimpse not only different regions but also the authors’ unique perspectives and passions, allowing us to travel the world vicariously through their eyes. \nYou can bring your own book or choose one from the collection at the library, pick a cosy spot and read with us for 90 minutes. Post this, spend a few minutes chatting with us about your read. \nLooking forward to seeing you all there! \nThis event is a part of BIC’s Programmes at the Library. \nBIC Library Programmes are designed to mould the library into a community-centered reading space. Our primary goal is to curate sessions that cater to the diverse interests and ages within our library community. Through this programming we wish for the library to become a dynamic space that goes beyond traditional book-related activities. \nWe also aim to provide a platform for members of the community to sometimes host these events we curate. If you have event ideas that align with our vision, please reach out to us at collab@bangaloreinternationalcentre.org \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/travelling-without-travelling/",
    "keywords": "Books, Cities, Culture*, Environment, Literature, Nonfiction",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-41.png"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Pressing Matters",
    "startDate": "2024-05-05T11:00:00+05:30",
    "endDate": "2024-05-05T12:30:00+05:30",
    "description": "This is a beginner-friendly, creative workshop to introduce you to the world of letterpress printing – the oldest traditional form of relief printing. This 500-year-old printing method was used to make the very first books and newspapers. \nAfter a brief foray into the pleasingly tactile, analogue world of letterpress printing, you’ll be taken through its history, background and all the niche terms involved. Dabble in some old-fashioned typesetting, learn to compose metal type and print your own piece of typographic art using a 90-year-old tabletop printing press to produce mini card prints! \nNote: This workshop is designed for a small group of around 15 individuals, so please RSVP only if you can definitely attend! All necessary materials will be provided at the event venue. \nIn collaboration with:\n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/pressing-matters/",
    "keywords": "Design, Visual Arts, Workshops",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-454.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "Decoding the Language of a Cinematic Polymath",
    "startDate": "2024-05-04T14:30:00+05:30",
    "endDate": "2024-05-05T21:00:00+05:30",
    "description": "A new cinema movement emerged in India in the late 1960s with a proposition for artistic cinema not influenced by any considerations other than creative and aesthetic. The promise of this movement, known variously as “Indian New Wave”, “New Cinema” or “Parallel Cinema” was that conscientious filmmakers will make cinema which will bear the distinct stamp of the creative artist and not that of a studio. In form and aesthetics, the new wave aimed to reject the forms and values of commercial cinema which relied on the stars, the gaudy sets, many irrelevant musical sequences and melodrama. This movement attracted many young artists who went on to become well-known auteurs. Indian new wave’s body of work, spanning close to three decades, charted a new course in cinema aesthetics with its zealous attempts to experiment with the language of cinema. At the same time, the new wave auteurs’ steadfast political commitment resulted in a critical examination of the complexities of India’s socio-political realities. \nIt is important to point out that there was no formal process or a formally run operation for this movement. Although the initial impetus to the movement came from the loans provided by the Film Finance Corporation, the passion to make artistic cinema, fuelled by the newly trained filmmakers from the Film and Television Institute of India, spread to different parts of the country. \nIn the Kannada language, serendipitously, the first artistic attempt to break free from reigning commercial filmmaking practices came in 1970 when Pattabhirama Reddy produced and directed Samskara – at approximately the same time when the Film Finance Corporation was funding what are considered as the first three films of the Indian new wave: Uski Roti, Ankur and Sara Aakash. Samskara’s success was followed by a few other experiments by filmmakers such as Girish Karnad, N Lakshminarayan and BV Karanth. \nBut the one auteur who went on to make some of the most influential and groundbreaking films and put Kannada cinema on the world map was Girish Kasaravalli. \nGirish Kasaravalli graduated from the Film and Television Institute of India in 1975, and his first film as a Director was Ghatashraddha (1977). In the last 47 years since, Girish’s body of work – 17 feature films and one television series – has critically engaged with the social, political, ideological, philosophical and environmental concerns of the Kannada society and, in a larger sense, of India. Kasaravalli’s films have won him four Golden Lotuses (National Award for best feature film from the Government of India), a Padma Shri and many other awards and recognitions in film festivals across the world. \nToday, when we have access to a variety of content at our fingertips, it is essential to engage with the work of Girish Kasaravalli and learn his remarkable mastery of the formal, aesthetic and thematic aspects of filmmaking and understand his contributions to film art.. \nIn this retrospective of Girish Kasaravalli, we screen five of his films and also have conversations with him and other collaborators after each screening. \n\n\n\nEvent \nDate \nTime \n\n\nIntroduction and Context Setting\nSaturday, May 4\n2:30 – 2:45 pm\n\n\nGhatashraddha (The Ritual) \n108 mins | Kannada with English subtitles | 1977\nSaturday, May 4\n2:45 – 4:45 pm\n\n\nGirish Kasaravalli in conversation with Basav Biradar\nSaturday, May 4\n5:30 – 6:30 pm\n\n\nThaayi Saheba \n119 mins | Kannada with English subtitles | 1997\nSaturday, May 4\n7:00 – 9:00 pm\n\n\nIntroduction and Context Setting​\nSunday, May 5\n10:30 – 11:00 am\n\n\nGulabi Talkies  \n118 mins | Kannada with English subtitles | 2008\nSunday, May 5\n11:00- 1:00 pm\n\n\nKoormavatara \n115 mins | Kannada with English subtitles | 2011\nSunday, May 5\n2:30 – 4:45 pm\n\n\nGirish Kasaravalli in conversation with Nikhila H\nSunday, May 5\n5:30 – 6:30 pm\n\n\nKanasemba Kudareyeneri \n105 mins | Kannada with English subtitles | 2010\nSunday, May 5\n6:45 – 9:00 pm\n\n\n\n  \nB-Cinematic \nCalling all cinephiles! BIC is thrilled to introduce B-Cinematic, an initiative dedicated to celebrating the most essential, impactful, and artistically significant cinematic works from across the state and the country. \nAt B-Cinematic, our mission is to curate and share those remarkable films that is a must-watch (or re-watch) experience for every passionate cinema lover. From groundbreaking classics to under-appreciated gems, our carefully curated selection will take you on an unparalleled (pun not intended) cinematic journey through the ages. \nThrough curated screenings, insightful discussions, and engaging analyses from distinguished cinematic voices, we aim to not only watch these films together but to truly appreciate their craftsmanship, cultural impact, and intellectual depth. Our vibrant community of film aficionados will collectively rediscover Indian cinema’s most stunning and enduring masterpieces. \nSo join us on this quest to experience the films that have defined and redefined the art form. Don’t miss out on crossing these essential works off your bucket list. Because to truly live, you must first watch the films that make life worth living. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/decoding-the-language-of-a-cinematic-polymath/",
    "keywords": "Film",
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "Decoding the Language of a Cinematic Polymath"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-464.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "कहत गुरुदास | Kahath Gurudas",
    "startDate": "2024-05-14T19:00:00+05:30",
    "endDate": "2024-05-14T20:30:00+05:30",
    "description": "Pt. Vinayak Torvi has completed his 75 years. To celebrate his life and contribution to music field, his disciples and well wishers have come together and organised concerts in Mumbai, Pune, Delhi, Varanasi, Bangalore, Dharwad and San Francisco, USA. \nThis event will showcase his prowess as Guru and a composer, wherein his prime disciples will present few of his compositions. The programme will also include a performance by Pt. Torvi where he will join his disciples, to present one of the compositions. \nVocals:\nSiddhartha Belmannu\nDhananjay Hegde\nArchana Shenoy\nVibha Kinhal\nSrilakshmi Belmannu\nChinmay Joshi\nM.K. Narasimha \nTabla:\nRoopak Kallurkar \nHarmonium:\nBharat Hegde\n\n\n\n\n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%95%e0%a4%b9%e0%a4%a4-%e0%a4%97%e0%a5%81%e0%a4%b0%e0%a5%81%e0%a4%a6%e0%a4%be%e0%a4%b8-kahath-gurudas/",
    "keywords": "Music, Performing Arts",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "कहत गुरुदास | Kahath Gurudas"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-449.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Caste in Modern India",
    "startDate": "2024-05-31T11:00:00+05:30",
    "endDate": "2024-06-02T20:00:00+05:30",
    "description": "Exhibition Opening: Friday, 31 May\nTimings: 11:00 am – 8:00 pm\nExhibition on show until Sunday, 2 June \nWalkthroughs:\nFriday, 31 May | 6:00 pm\nSaturday, 1 June | 11:30 am & 5:30 pm\nSunday, 2 June | 10:45 am \nConversations:\nInaugural Address – Friday, 31 May | 6:45 pm\nPanel Discussion – Sunday, 2 June | 11:30 am \nRailways and postal services were introduced in colonial India in the early 1850s. In due course, these new technologies made long-distance travel and communication widely accessible and affordable. In a parallel development, the introduction of limited representation in legislatures in the 1890s added urgency to tap the potential trans-local identities enumerated in the decennial censuses beginning in 1871-72. \nIn view of these developments, local communities, in particular, castes, tapped new technologies to connect with kindred groups across the country and combine to form pan-Indian communities. Post offices allowed members of these aggregate groupings to correspond with each other, while railways enabled them to meet periodically and devise strategies to capture a share in legislatures, educational institutions and public employment proportionate to their census population. Drawing upon philatelic material covering a century, the exhibition highlights the role of the postal system in this new politics. \nThe exhibition is divided into two broad parts that bring together correspondence and publications of several caste-based community organisations and individuals from across the country and the philatelic output of the post-colonial state. \nProf Gopal Guru will inaugurate the exhibition and deliver the inaugural address on May 31, 6:45 pm. He will offer his comments on the exhibition and locate the images in the larger politics of visual culture. \nA Panel Discussion with Prof. Satish Deshapnde, a distinguished social scientist who has made seminal contributions to our understanding of caste in independent India, Vaishna Roy, Editor-in-Chief, Frontline magazine and Vikas Kumar, Curator of the exhibit, will take place on 2 June, 11:30 am. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/caste-in-modern-india/",
    "keywords": "In Memory",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-468.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "Asamana Anasuya",
    "startDate": "2024-05-12T18:30:00+05:30",
    "endDate": "2024-05-12T20:30:00+05:30",
    "description": "92 Minutes 36 Seconds | English & Telugu with English Subtitles | 2023 \nAsamana Anasuya (Incomparable Anasuya), is a documentary directed by Seetha Ratnakar as a tribute to her mother Vinjamuri Anasuya Devi.  \nVinjamuri Anasuya Devi was a musical prodigy who started giving concerts at the age of 7. Her first gramophone recording, Ayyo Koyyoda at age 8, ignited her lifelong love affair with folk music. She was a trailblazer who introduced folk songs on a concert platform when she was 11. Encouraged by the overwhelming response she started giving full length folk concerts along with her sister, Vinjamuri Seetha Devi. Popularly known as the Vinjamuri Sisters, they became a phenomenon that took the music world by storm.  \nAnasuya started composing music for her uncle, Devulapalli Krishna Sastri when she was 9 and became a sought-after music composer. She was multi-talented and excelled in music of every genre but folk music remained her passion. She dedicated her life to popularising and propagating traditional and folk songs. She bequeathed an invaluable legacy to posterity by categorising her vast collection into 7 volumes and publishing them along with lyrics and music notations. At the age of 80, Anasuya became a writer and published 4 books including her autobiography Asamana Anasuya, at the age of 94.  \nThe film screening will be followed by a Q&A with the director. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/asamana-anasuya/",
    "keywords": "Biography, Film, Music",
    "inLanguage": "te",
    "workPresented": {
      "@type": "Movie",
      "name": "Asamana Anasuya"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-439.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Rise and Fall of the Vanderbilts",
    "startDate": "2024-06-11T18:30:00+05:30",
    "endDate": "2024-06-11T20:00:00+05:30",
    "description": "Once upon a time, there was a family whose very name connoted wealth. The Vanderbilts had a vast empire built on freight through steamboats and railroads. Over a few generations, the wealth-worth billions in today’s money-had been frittered away and the business itself faded as new options came up in the freight business. Their story remains an enduring example of what happens when business leaders fail to embrace the future and transform. \nBusiness transformation is a dynamic topic that is explored by authors R Gopalakrishnan and Hrishi Bhattacharyya in their book Embrace the Future. A key lesson in the success or failure of such transformations lies in harmonising the art and science of change – the emotional and the rational – and striking the right balance between them. Both in life and in business, a compelling narrative that inspires the organisation is essential for effecting transformation. Equally important is viewing transformation as an ongoing effort integrated into the work culture, rather than solely reacting to crises. \nTheir book resonates with anyone who has encountered change—something prevalent in today’s ever-evolving business landscape. R Gopalakrishnan and Hrishi Bhattacharyya underscore that companies unwilling to adapt are bound to fade away. The authors will share their insight on how it’s imperative to draw lessons from the past, navigate the present, and prepare for the future. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-rise-and-fall-of-the-vanderbilts/",
    "keywords": "Books, Business, Nonfiction",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-428.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Accelerating Expanding Universe",
    "startDate": "2024-05-27T18:30:00+05:30",
    "endDate": "2024-05-27T19:45:00+05:30",
    "description": "Dark energy is the leading candidate for the mechanism that is responsible for causing the cosmological expansion to accelerate. Bharat Ratra will describe the astronomical data which persuade cosmologists that (as yet undetected) dark energy and dark matter are by far the main components of the energy budget of the universe at the present time. He will review how these observations have led to the development of a quantitative “standard” model of cosmology that describes the evolution of the universe from an early epoch of inflation to the complex hierarchy of structure seen today. In this non-technical talk, he will also discuss the basic physics, and the history of ideas, on which this model is based. \nIn collaboration with Raman Research Institute, Bangalore. \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-accelerating-expanding-universe/",
    "keywords": "Science",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-462.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "ಕೆರೆಗಳ ನಗರಿಯಿಂದ ಟ್ಯಾಂಕರ್ ನಗರದೆಡೆಗೆ | City of Lakes to City of Tankers",
    "startDate": "2024-05-03T18:30:00+05:30",
    "endDate": "2024-05-03T20:00:00+05:30",
    "description": "In Bangalore, the dynamic interplay between urban forests, lakes, and groundwater exemplifies both the challenges and opportunities of managing natural resources in a rapidly growing metropolis. \nUrban forests in Bangalore, including iconic green spaces like Lalbagh and Cubbon Park, serve as vital lungs for the city, offering respite from the urban bustle and enhancing air quality. These wooded areas not only provide recreational opportunities but also support biodiversity conservation efforts, hosting a rich array of flora and fauna amidst the urban sprawl. However, the sustainability of Bangalore’s urban forests faces threats from encroachment, pollution, and inadequate management practices, highlighting the need for concerted conservation efforts and community engagement to safeguard these green havens. \nSimilarly, Bangalore’s numerous lakes, once the pride of the city, now grapple with pollution, encroachment, and diminishing water levels. From iconic water bodies like Ulsoor Lake to smaller neighborhood ponds, these lakes play critical roles in replenishing groundwater, supporting biodiversity, and providing recreational spaces for residents. Efforts to rejuvenate Bangalore’s lakes, such as the rejuvenation of Bellandur and Varthur Lakes, underscore the importance of holistic approaches that address water quality, ecological restoration, and community participation. \nGroundwater, a lifeline for Bangalore’s burgeoning population, faces sustainability challenges due to rapid urbanization, unchecked extraction, and contamination. The city’s reliance on groundwater for drinking water, industrial, and agricultural needs underscores the urgency of adopting efficient water management practices, promoting rainwater harvesting, and curbing pollution to safeguard this precious resource. Initiatives like the “Recharge Bengaluru” campaign aim to replenish groundwater levels by restoring traditional water harvesting structures and enhancing infiltration of rainwater into the aquifer. \nThis panel will discuss the nexus of urban forests, lakes, and groundwater in Bangalore which underscores the complex relationship between urbanisation, natural resource management, and environmental sustainability. A Q&A with the audience will follow. \nThis session will be in Kannada and English. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/city-of-lakes-to-city-of-tankers/",
    "keywords": "Bangalore, Cities, Climate Change, Environment, Sustainability",
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-466.jpg"
  }
]