[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84787-1769538600-1769543100@bangaloreinternationalcentre.org",
    "name": "On Stone and Sculpture",
    "startDate": "2026-01-27T18:30:00+05:30",
    "endDate": "2026-01-27T19:45:00+05:30",
    "description": "Isamu Noguchi—one of the preeminent sculptors of the twentieth-century—wrote in 1949 that the ancient site of Mahabalipuram was his “first and most authentic lesson.” Between then and his death in 1988, Noguchi visited India at least eleven times. Yet there has been little investigation into the nature of this connection and the impact it had on the sculptor’s work. The few studies on the topic emphasize Noguchi’s interest in the architectural modernity of post-independence India. \nThis talk explores instead the sculptor’s enduring attentiveness towards the stone sculpture of early India. It highlights Noguchi’s engagement with ancient sites such as Sanchi, Elephanta, and Mahabalipuram, among numerous others, and traces the centrality of the “matter of sculpture” in his approach. In looking at and alongside Noguchi, we expand not only our current understanding of the sculptor’s oeuvre but also the study of early Indian sculpture. \n",
    "url": "https://bangaloreinternationalcentre.org/event/on-stone-and-sculpture/",
    "keywords": [
      "Heritage",
      "History",
      "In Memory",
      "Photography",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-new_OSS.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84726-1769967000-1769972400@bangaloreinternationalcentre.org",
    "name": "Tree Tales: Stories from India’s Fruitful Landscapes",
    "startDate": "2026-02-01T17:30:00+05:30",
    "endDate": "2026-02-01T19:00:00+05:30",
    "description": "When we pick a fruit in the bazaar or slice one open at home, we rarely pause to think about it beyond its taste. Yet inside that familiar fruit lies an extraordinary story that was shaped by millions of years of evolution, intricate ecological partnerships, centuries of human history, and layers of culture, belief, and science. \nThe story of fruits and fruiting trees begins deep in evolutionary time. Fleshy fruits evolved as ingenious biological strategies, forming partnerships with animals such as birds, bats, insects, fish, and primates. By offering sweetness, colour, and aroma, fruiting plants persuaded animals to pollinate flowers and disperse seeds, allowing forests to regenerate and spread. Many fruits still carry the signatures of these ancient relationships, including partnerships with species that no longer exist. Even today, wild and domesticated fruit trees play a vital ecological role, sustaining wildlife and supporting human communities. \nIts not just forests, fruits even entered our myths, rituals, art, and language as powerful symbols of love, abundance, devotion, and prosperity. Mangoes, bananas, pomegranates, figs, and jamun trees appear in epics, festivals, temple carvings, poetry, songs, and everyday expressions. These cultural traces reveal that fruits did far more than nourish bodies. They shaped values, metaphors, memories, and ways of understanding the natural world. Fruits also travelled with people, quietly reshaping landscapes and diets. India is rich in the diversity of edible fruits and they are deeply connected to global exchange. Rulers and states invested in orchards and experimentation, treating horticulture as a serious pursuit tied to prestige, power, and knowledge. Fruit trees became markers of place, preserving geography and history in their names even as political borders shifted. During the last few centuries, botanical gardens, experimental farms, and public parks became testing grounds where fruit trees from across the world were introduced, studied, and distributed. These spaces reshaped what farmers grew and what people ate, linking plants to systems of governance, science, and economy. \nPerennial fruit trees offer hope in a warming world. They support biodiversity, store carbon, stabilise soils, and build ecological and social resilience. By weaving together evolution, ecology, culture, history, and climate, this talk attempts to show that fruit trees are not just sources of sweetness. The talk attempts to invite everyone to see the humble fruit tree not just as food, but as a living thread that binds India’s landscapes, livelihoods, and legends. \n  \nWith this programme, the Bangalore International Centre remembers the contributions of our member Vijay Thiruvady in three landmark lectures that he gave at the BIC, on the “Greening of Bangalore” with Girish Karnad and Capt. Prabhala (2015), on “Botanical Illustrations” with Nirupa Rao (2019), and on “Why Lalbagh Matters” (2021). \nAmong the accounts of our city, Vijay Thiruvady’s book, Lalbagh – Sultans’ Garden to Public Park, published by the Bangalore Environment Trust, presents the most comprehensive history of Lalbagh written to date. Ranging across five centuries, it presents a panoramic view from Kempegowda’s flower garden in 1537, through Haider and Tipu (1760 to 1799), to the East India Company years — Scottish army men and surgeons — and over a century by six Kew trained gardeners. The book is based on research from several archives, including Kew Gardens and the Royal Botanic Gardens Edinburgh, and of course on Vijay Thiruvady’s intimate knowledge of Lalbagh having conducted inspiring nature walks for over 18 years that were attended by over 15,000 walkers. \nVijay Thiruvady was always interested in various aspects of nature and more specifically horticulture. In addition to the Green Heritage Walks in Lalbagh, he conducted Imperial Colonial Walks in Cubbon Park and Military Heritage Walks at the MEG&C, and participated in the various activities of Bangalore Environment Trust as a Trustee. These have included the publishing of notable books on Heritage Trees in and around Bangalore and on Devarakadus and Gundutopus in the vicinity of Bangalore. \nThiruvady spent his early years in Delhi.  His academic interests were pursued at\nSt. Stephen’s College, Delhi and School of Architecture, Ahmedabad.  When in Delhi, he had exposure to the world of nature and environment through association with a number of distinguished people in the field and institutions. \nHe gave talks on Bangalore, its environment and history at many institutions, including the National Institute of Advanced Studies, Raman Research Institute, BIC, Bangalore Club, National Gallery of Modern Art, and Azim Premji University. A gifted raconteur, his encyclopedic knowledge of trees and of Bangalore’s history were conveyed through stories that kindled a love of nature and made his walks, lectures and books memorable, connecting with young and old from around the world, from experts in the field to school children. His passing in August 2023 is a profound loss to the city. \nVijay Thiruvady’s talk on Lalbagh at the BIC, which has been widely viewed as an introduction to the botanical garden and to Bangalore and its history, is available here. \nHis short essays on trees are available here. \nAn article about him in Frontline magazine is available here. \n  \nTea will be served at 5 pm. \n",
    "url": "https://bangaloreinternationalcentre.org/event/tree-tales-stories-from-indias-fruitful-landscapes/",
    "keywords": [
      "Environment",
      "Heritage",
      "In Memory",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-3-5.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84707-1770057000-1770062400@bangaloreinternationalcentre.org",
    "name": "Education in an Age of Polarisation",
    "startDate": "2026-02-02T18:30:00+05:30",
    "endDate": "2026-02-02T20:00:00+05:30",
    "description": "How do we teach children to hold difference without fracturing? \nAs worldviews polarize globally, education becomes critical terrain for cultivating resilience, communicating values, and building social connectedness among the youth of today. Professor Arniika Kuusisto, leading scholar of early childhood education at the University of Helsinki, presents empirical findings from Finland exploring this urgent challenge. \nThis talk examines educational approaches that equip children to navigate difference constructively. Rather than erasure, Kuusisto focuses on developing capacities for genuine engagement across divides. In increasingly pluralistic societies, the question extends beyond tolerance: how do we foster peer communities where diversity becomes source of strength rather than fragmentation? \nThis lecture is a part of Azim Premji University’s Public Lecture Series. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/education-in-an-age-of-polarisation/",
    "keywords": [
      "Education",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-4-14.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84379-1769273100-1769288400@bangaloreinternationalcentre.org",
    "name": "Futures - Day 2",
    "startDate": "2026-01-24T16:45:00+05:30",
    "endDate": "2026-01-24T21:00:00+05:30",
    "description": "Futures Hubba originated as an ideas-festival at BLR Hubba, where some of the brightest national and international minds play Nostradamus to connect the dots of a likely future for humanity. It is a gathering designed to hold space for contradictions and uncertainty in this technology-shifting era, and to explore what new forms of meaning can emerge between the known and the unknown. \nFutures is a space for collective imagination: it’s a space that holds tension between art and algorithm, ethics and innovation, intuition and data. It resists the safety of linear silos and instead operates at the intersections, where new ways of thinking are born from friction. Each session inside Futures is a deliberate provocation: a chance to expand what we consider knowledge, and to explore how interdisciplinary thinking might co-create more conscious futures. \nThe Fool Who Knows | Varun Marichi | 4:45 PM\nThe Fool Who Knows is a mime and physical-clowning performance that explores intelligence in an age of certainty. Through failure, hesitation, and embodied play, the fool reveals what rational systems often miss: that not-knowing is not a weakness, but a form of wisdom. In a world obsessed with control and prediction, this performance invites the audience to sit with uncertainty, and recognise it as the starting point of all futures. \nWhat is the Future of Art? | Reema Desai Gehi | 5:15 PM\nAmid global upheaval, what role is creative expression called upon to fulfil? How does it remain responsive in an age where technology has advanced beyond human comprehension, and where self-censorship quietly precedes its public counterpart? Can art, in its many forms, truly function as a living archive of the present moment? Reema Desai Gehi engages with these pressing inquiries as she reflects on the evolving landscape of art through the prism of ART India magazine’s 30th anniversary. \nHuman Dreams and Speculative Machines | Horst Höertner | 6 PM\nThe real disruption today is not AI, robotics, or digital culture: it is the shifting role of creativity itself. Art and technology have stopped reflecting the world and started constructing it. Drawing on 30 years working at the intersection of art and technology, Horst Hörtner shows how real innovation emerges when artists and technologists are given the freedom to challenge foundational assumptions. This lecture pulls back the curtain on how Ars Electronica turns experimentation into institutional practice, how it protects curiosity from bureaucracy, and why the future will belong to organizations that stop optimizing the present and start prototyping new realities. Art and tech will transform society. The only choice left is whether to participate, or be shaped by those who do. \nRise of Creative & Cultural AI Models | Caroline Pegram & Kartini Ludwig | 7 PM\nJoin Caroline Pegram and Kartini Ludwig as they chart the evolving fusion of music and machines, from the early days of algorithmic composition to today’s rise of generative sound factories. This session offers a clear foundation on how AI models are steering creative approaches, authorship, and performance and looks at the rise and possible uses of creative & cultural foundation models. The talk will extend beyond reflection, challenging attendees to consider how we might intentionally design fair and sustainable futures for music, where machines amplify and augment human creativity. There’ll be fresh insights, critical questions, and an invitation to rethink what it means to compose and create in an age of sonic mutation. \n2º: An Immersive Sonic Performance | Tarun Balani & Parizad D | 8 PM\n2° is a live audio-visual performance by drummer–composer Tarun Balani and visual artist Parizad D that shares stories and messages about the artists’ experience of climate change. The performance unfolds through shifting sonic textures, experimental ambient sounds and immersive visual worlds inviting the audiences to deeply listen and inhabit these worlds. As a part of the performance audiences are encouraged to reflect, share and contribute their own climate change stories and messages on postcards —linking sound and touch—creating a sensory dialogue. 2° serves as a reminder that every story and every voice matters and our individual stories have the power to begin conversations about climate equity, justice, and our shared responsibility to reimagine the future of our world. \nAbout BIC Elsewhere: \nWhile the majority of our events find a home at our premises in Domlur, BIC Elsewhere represents our commitment to bringing conversations, arts, and culture directly to diverse audiences. Through this initiative, we collaborate with various venues, extending the reach of our events beyond our own space. These partnerships not only breathe life into our gatherings but also play a crucial role in cultivating an environment for the flourishing of arts and culture in the city. \nIn collaboration with: \n      \n",
    "url": "https://bangaloreinternationalcentre.org/event/futures-day-2/",
    "keywords": [
      "Business",
      "Development",
      "Gender",
      "Governance",
      "Management",
      "Philosophy",
      "Policy & Regulation",
      "Science",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Alliance Française de Bangalore, Thimmaiah Rd, opposite UNI, Kaverappa Layout, Vasanth Nagar, Bengaluru, Karnataka, 560001, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-83-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84352-1770229800-1770235200@bangaloreinternationalcentre.org",
    "name": "From Grievance to Vision",
    "startDate": "2026-02-04T18:30:00+05:30",
    "endDate": "2026-02-04T20:00:00+05:30",
    "description": "We have forgotten how to be citizens of our cities. \nWalk through any Indian metropolis and witness a peculiar contradiction: millions inhabit these spaces, yet relate to them only as consumers demanding services. Grievances fragment predictably: the affluent lobby for metro lines while informal settlements fight for sanitation. Each sees the city as a provider that has failed them specifically. \nThis transactional relationship reveals something deeper. Unlike villages steeped in cultural memory or monuments heavy with civilizational pride, the contemporary Indian city exists in our imagination as politically neutral backdrop; a space for commerce and commute, stripped of meaning beyond utility. Without empowered local governance in our collective memory, we cannot envision what urban citizenship might demand. \nThis talk outlines a strategy for civic activism that reimagines the city as living system, shaping who we become through daily encounters. It argues we must ask radical questions. Not merely what services we need, but what kind of city allows dignity, creativity, joy. What connections between citizens create genuine community? What relationship between citizen and state honors our full humanity? \nThe struggle for better governance is simultaneously a struggle to define what kind of people we wish to be—together. \n",
    "url": "https://bangaloreinternationalcentre.org/event/from-grievance-to-vision/",
    "keywords": [
      "Cities",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-2-9.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84909-1769797800-1769803200@bangaloreinternationalcentre.org",
    "name": "How India Appeared in Edinburgh",
    "startDate": "2026-01-30T18:30:00+05:30",
    "endDate": "2026-01-30T20:00:00+05:30",
    "description": "Empire wasn’t just distant colonies, it was an idea that lived in Edinburgh’s lecture halls, Sunday sermons, and salon debates. \nFor three centuries, India haunted Scotland’s intellectual capital as an immediate presence that resisted abstraction. Indian students walked cobblestone streets. Returned missionaries preached with unsettling zeal. Critics penned fierce opposition while officials defended their fortunes. In universities, churches, clubs, and newspapers, ordinary Edinburgh wrestled with an extraordinary question: what did India mean? \nPerceptions of Empire recovers these forgotten encounters through voices that crackle with life in first-hand accounts revealing how one city’s relationship with India transformed across generations. Early wonder curdled into Victorian anxiety. Hostility eventually fractured, making space for genuine dialogue. Empire wasn’t monolithic; it was messy, contested, evolving. \nIn this talk the editors will share discoveries from three hundred years of archival intimacy, closing with an audience Q&A. \n",
    "url": "https://bangaloreinternationalcentre.org/event/how-india-appeared-in-edinburgh/",
    "keywords": [
      "Books",
      "History",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_HIAIE.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84700-1770550200-1770555600@bangaloreinternationalcentre.org",
    "name": "Art History Made Accessible",
    "startDate": "2026-02-08T11:30:00+05:30",
    "endDate": "2026-02-08T13:00:00+05:30",
    "description": "Art History Made Accessible is an illustrated talk from James Payne of Great Art Explained designed to open up art history to everyone. \n“In a world of noise and distraction,” Payne says, “great art slows us down. It demands attention, reflection, and interpretation. It doesn’t exist to give us easy answers – but it does give us better questions.” \nUsing carefully chosen images and clear, engaging storytelling, the talk explores some of the world’s most celebrated artworks not as distant masterpieces, but as works made by real people, shaped by the pressures, beliefs, and ambitions of their own time. Rather than relying on academic jargon or dense theory, it focuses on essential questions: why was this work made, what did it mean when it was created, and why does it still matter today? \nVisual analysis is combined with historical context and human stories to show how art is influenced by power, class, money, religion, politics, and everyday life. Throughout the talk, Payne encourages audiences to slow down and really look. Details often missed in galleries are brought into focus, helping viewers understand how artists guide the eye, create meaning, and communicate emotion. As much as it is about learning facts, the talk is about learning how to look. \nAt its heart, this talk on Art History Made Accessible is about openness. Now Payne has created a book, which like his channel takes the same no-nonsense approach to art analysis. It challenges the idea that art history belongs only to experts or institutions, and instead presents it as something open, democratic, and relevant. \nPayne will be signing copies of the book after the session. \n",
    "url": "https://bangaloreinternationalcentre.org/event/art-history-made-accessible/",
    "keywords": [
      "Books",
      "Media",
      "Nonfiction",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_AHMA.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84754-1769945400-1769950800@bangaloreinternationalcentre.org",
    "name": "Bangalore Raani",
    "startDate": "2026-02-01T11:30:00+05:30",
    "endDate": "2026-02-01T13:00:00+05:30",
    "description": "In SheThePeople’s signature style, this is an evening of wit and grace. \nBangalore Raani is a vibrant celebration placing female voices precisely where they’ve always belonged: centerstage. Unapologetic and electric, this dialogue brings together women whose presence, choices, and courage bring Bengaluru to life. In this edition, Shaili Chopra is joined by mother and daughter, Yasmin and Kubbra Sait. \nThrough candid storytelling that moves from ambition to reinvention, relationships to those small everyday rebellions that shift culture, the conversation flows freely: sometimes hilarious, always real. Relatable yet aspirational, intimate yet energizing, this is the rare space where women’s stories don’t just resonate, but reverberate through lingering conversations, lasting inspiration and undeniable connection as a result of being deeply, and truly, seen. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/bangalore-raani/",
    "keywords": [
      "Gender",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-110.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84837-1769943600-1769949000@bangaloreinternationalcentre.org",
    "name": "Beep Beep! Moo Moo!",
    "startDate": "2026-02-01T11:00:00+05:30",
    "endDate": "2026-02-01T12:30:00+05:30",
    "description": "Moo-ve over, traffic! Kempi the cow needs to get through! \nIn this special reading, author Anupama Benachinamardi presents her award-winning book Kempi – The Cow. Published in 2025 by Awwa Pustaka, this is Kannada’s first-ever die-cut children’s book, winning the Best Children’s Book Cover of the Year 2025 at the Publishing Next Industry Awards. \nThe roads are crowded, horns are loud, and Bengaluru’s traffic is moving so slow. Little Kempi the cow is stuck in the mess, just like all of us. Is Kempi scared? Or will she find a kind and clever way to escape the jam? \nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \nIn collaboration with:\n \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/beep-beep-moo-moo/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Bangalore",
      "Children's Books",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_BBMM.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84689-1769452200-1769457600@bangaloreinternationalcentre.org",
    "name": "Science, Stewardship, and Solidarity",
    "startDate": "2026-01-26T18:30:00+05:30",
    "endDate": "2026-01-26T20:00:00+05:30",
    "description": "Madhav Gadgil (1942-2026) was the country’s pre-eminent ecologist, whose work and writing had a profound influence in shaping environmental policy and action in India. Educated in Pune, Mumbai and Harvard, Professor Gadgil spent more than three decades at the Indian Institute of Science in Bengaluru, where he founded the Centre for Ecological Sciences. \nIn the course of his rich and varied career Professor Gadgil conducted fieldwork in most of India’s states, acquiring an unparalleled knowledge of the country’s cultural and ecological diversity. He authored numerous scientific papers that became ‘citation classics’, and pioneering books on environmental history that are still discussed decades after their publication. He was widely known for the report of a committee on the Western Ghats that he chaired, which presciently warned of the ecological disasters that would follow unregulated mining, tourism and road construction in this vital mountain ecosystem. \nThe Bangalore International Centre shall celebrate Madhav Gadgil’s life and legacy in a special memorial meeting held on 26th January. The date is appropriate; for Professor Gadgil himself had a deeply democratic sensibility, and embodied in his person the finest values of the Indian Republic. The speakers are two scientists, two economists, a journalist and a historian, all of whom knew Professor Gadgil and his work well. \n",
    "url": "https://bangaloreinternationalcentre.org/event/science-stewardship-and-solidarity/",
    "keywords": [
      "Environment",
      "Heritage",
      "In Memory",
      "Science",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-109.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84309-1769857200-1769864400@bangaloreinternationalcentre.org",
    "name": "Bookmarked",
    "startDate": "2026-01-31T11:00:00+05:30",
    "endDate": "2026-01-31T13:00:00+05:30",
    "description": "“A reader lives a thousand lives before he dies… The man who never reads lives only one.” — George R.R. Martin \nBegin your year surrounded by fellow readers in our cozy library. This silent reading session invites you to bring any book calling to you and settle into an hour of companionable quiet. \nAtta Galata adds to the experience with a curated selection of quick reads by Indian authors, perfect for browsing or discovery. After the reading hour, the silence gently gives way to conversation; an easy exchange about the books that stayed with you, surprised you, or shaped your 2025. \nThere’s something magical about a room full of people lost in their own worlds yet together in the same space. No pressure, no performance. Just pages, pauses, and the rare pleasure of reading in truly good company! \nThis event is part of our Programmes at the Library series at BIC. \nWe’re reimagining the BIC Library as a warm, welcoming space for connection and exploration. Through thoughtfully curated sessions, we aim to engage the diverse interests and ages within our community. Our goal is to create an enriching environment for discovery, experimentation, and collaboration, beyond the books on our shelves! \nWe welcome your ideas and input. If you have ideas for events or activities that align with our vision, we’d be delighted to hear from you. Please reach out to us at library@bangaloreinternationalcentre.org \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/bookmarked-16/",
    "keywords": [
      "Books",
      "Literature"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_BM1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84509-1769540400-1769546700@bangaloreinternationalcentre.org",
    "name": "Anunaada Murali Rasa",
    "startDate": "2026-01-27T19:00:00+05:30",
    "endDate": "2026-01-27T20:45:00+05:30",
    "description": "\n\n\n\n\n\nAn experience that lingers gently; a memory refusing to fade. \nThis performance unfolds through carefully chosen poetry, musical textures, and the delicate play between presence and absence. Through her descriptive movements, Sahana portrays a young maiden recalling Krishna not as distant divinity, but as a presence woven into lived moments: glimpses, fragrances, gestures, and the lingering sound of a flute. \nAccompanied by esteemed musicians, Raghuram Rajagopalan on vocals, Harsha Samaga on mridangam, Divya Ravi on nattuvangam, and Vivek V. Krishna on flute; the evening moves through verses where desire and devotion coexist without hierarchy, shaping an intimate portrait of remembrance and longing. \nWhat can we hold on to, when what we love is no longer tangible? \n\n\n\n\n\n\nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/anunaada-murali-rasa/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_AMR.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84671-1770145200-1770148800@bangaloreinternationalcentre.org",
    "name": "YĀTI - Moving Towards Light",
    "startDate": "2026-02-03T19:00:00+05:30",
    "endDate": "2026-02-03T20:00:00+05:30",
    "description": "Where ancient form dissolves into luminous freedom. \nThis Odissi work approaches the Margam as sacred passage of five stages tracing transformation from discipline to transcendence. Each movement becomes a threshold: technique awakening into spirit, storytelling deepening into personal truth, classical rigor flowering into individual voice. \nForm and fluidity merge, revealing the Margam as it was always meant to be; a living journey where the dancer’s inner landscape meets centuries of inherited wisdom. Structure liberates, offering a steady foundation from which authentic expression can soar. This is choreography as discovery: each gesture a step toward light, each phrase an invitation inward. \nWitness tradition transformed into revelation. \nCredits:\nLight Design: Amlan Chaudhuri\nSupporting Dancers: Joyita Pal, Agnisha Basak, Parama Samanta, Priyanka Roy, Minakshi Kundu, Audrija Roy & Paramita Samanta \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/yati-moving-towards-light/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_Y-MTL.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "84413-1769625000-1769634000@bangaloreinternationalcentre.org",
    "name": "Marching in the Dark",
    "startDate": "2026-01-28T18:30:00+05:30",
    "endDate": "2026-01-28T21:00:00+05:30",
    "description": "104 minutes | Marathi with English subtitles | Belgium, India, The Netherlands | 2024 \nWhat does courage look like when survival itself is an act of defiance? \nSet against the backdrop of India’s agrarian crisis, this film follows Sanjeevani, a young widow who refuses to be defined by loss or by the social isolation imposed on women like her. Determined to build a future for herself and her children, she finds strength not in solitary endurance, but in community; connecting with other widows who share their grief, their fears, and their resolve. Together, they transform private sorrow into collective resilience. \nFollowing the screening, filmmaker Kinshuk Surjan is joined by Kavita Kuruganti of Makaam, in conversation moderated by Swati Dandekar, to reflect on women farmers, labour, and the power of shared struggle. The session will close with a Q&A. \nIn collaboration with: \n\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/marching-in-the-dark/",
    "keywords": [
      "Agriculture",
      "Film",
      "Gender"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "mr",
    "workPresented": {
      "@type": "Movie",
      "name": "Marching in the Dark"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_MITD.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84399-1769625000-1769630400@bangaloreinternationalcentre.org",
    "name": "Who Owns India’s Past?",
    "startDate": "2026-01-28T18:30:00+05:30",
    "endDate": "2026-01-28T20:00:00+05:30",
    "description": "Just outside Madurai, beneath the scorching southern sun, the excavations at Keeladi have unsettled long-held ideas about India’s ancient history. \nSince its discovery in 2014, the site has emerged as one of the country’s most contested digs: celebrated by some as evidence of a thriving urban civilisation in South India, and questioned by others as political mythmaking. In her book The Dig, journalist and author Sowmiya Ashok traces this journey from serendipitous find to cultural flashpoint, traveling from Iron Age Tamil Nadu to Harappan Rakhigarhi, revealing how battles over the past shape our understanding of India’s layered identity today. \nSowmiya will be joined by archaeometallurgist Dr. Sharada Srinivasan whose pioneering work has brought to light insights into ancient mining and metallurgy, having also worked on Iron Age-Early Historic sites especially in Tamil Nadu. They will be in conversation with Pooja Prasanna, of The News Minute. Together they will explore how archaeology, science, and power intersect: revealing an ancient diversity that continues to shape contemporary India. \n",
    "url": "https://bangaloreinternationalcentre.org/event/who-owns-indias-past/",
    "keywords": [
      "Anthropology",
      "Books",
      "Culture",
      "History"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-2-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "84332-1770570000-1770577200@bangaloreinternationalcentre.org",
    "name": "Menace",
    "startDate": "2026-02-08T17:00:00+05:30",
    "endDate": "2026-02-08T19:00:00+05:30",
    "description": "42 minutes |  English & Hindi with English subtitles | India | 2025 \nMenace examines one of the most contested questions in contemporary Indian cities: how do we coexist with stray dogs? Set against recent judicial directions and everyday urban realities, the film moves beyond polarised debates to explore the moral, legal, and governance dimensions of the issue. Through voices from animal welfare practitioners, veterinarians, lawyers, municipal actors, adopters, and citizens, Menace traces the shift from historical practices of dog culling to the Animal Birth Control (ABC) framework, while questioning why humane policies often fail in implementation. \nStructured around four themes—compassion, conflict, culling, and care – the documentary reflects on fear, empathy, public safety, and state responsibility, asking what humane coexistence truly means in dense urban environments. The screening will be followed by a moderated conversation bringing together perspectives from law, animal welfare, and civic practice. Rather than advocating a single position, the programme invites audiences to engage with complexity, contradiction, and ethical choice—opening space for reflection on how cities negotiate care and safety without resorting to cruelty or neglect. \nThe screening will be followed by an interaction with the filmmaker. \n",
    "url": "https://bangaloreinternationalcentre.org/event/menace/",
    "keywords": [
      "Film",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "Menace"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-1-15.jpg"
  }
]