[
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Tales of Tenacity",
    "startDate": "2024-03-31T11:00:00+05:30",
    "endDate": "2024-03-31T12:30:00+05:30",
    "description": "Enter an enchanting world of storytelling with Devanshi Joshi, author of Young Hearts, Wise Minds who will share stories inspired by real people and their life journeys. \nThrough fun activities and engaging tales, Devanshi will help young participants explore the meaning behind stories and how it relates to their life. \nThis event is a part of BIC’s Programmes at the Library. \nBIC Library Programmes are designed to mould the library into a community-centered reading space. Our primary goal is to curate sessions that cater to the diverse interests and ages within our library community. Through this programming we wish for the library to become a dynamic space that goes beyond traditional book-related activities. \nWe also aim to provide a platform for members of the community to sometimes host these events we curate. If you have event ideas that align with our vision, please reach out to us at collab@bangaloreinternationalcentre.org \nIn Collaboration with:\n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/tales-of-tenacity/",
    "keywords": "Books, Young BIC",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-401.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Open Frame",
    "startDate": "2024-04-01T18:30:00+05:30",
    "endDate": "2024-04-01T20:00:00+05:30",
    "description": "English | 55 minutes | Suitable for All Ages \nThe Open Frame tracks the artistic and personal journey of S G Vasudev – his early years, the establishment of Cholamandal Artists’ Village, his creative process, his collaborations with craftsmen and his sustained efforts to nourish and foster the art world. Art historians, colleagues and friends provide insights into the life and times of Vasudev. \nThe Open Frame is a visually rich celebration of colour and texture. The screening will be followed by an informal discussion on 60 years of a Life in Art with Ravikumar Kashi, Nalini Malaviya and Suman Gopinath, followed by a Q&A with the audience. The artist will be present. \nAbout the Artist: \nBorn in Mysore, Karnataka in 1941, S G Vasudev received recognition as a painter early in his career. While he was a student of the Government College of Art, Madras, he won the National Award from the All India Lalit Kala Akademi in 1967. Awards from State Academies of Karnataka, Tamil Nadu and Kerala, besides prestigious Karnataka Rajyotsava Award, Venkatappa Award and Paniker Puraskaram. \nVasudev is a founder-member of the Cholamandal Artists’ Village on the outskirts of Madras (now Chennai) where he lived and worked till 1988. He now lives and works in Bangalore. Vasudev works in various mediums (drawings, paintings, reliefs in copper and tapestries in silk). He became well-known for his “Vriksha” (Tree of Life) series, which evolved over nearly a decade, turning into the Tree of Life and Death in the latter half of the 1980s. He also explored the theme of “Maithuna” (Act of Love) through a series of drawings, paintings and copper reliefs. Eventually his tree grew into faces titled “Humanscapes” and “Earthscapes.” The tree is still sometimes visible in his series titled “Theatre of Life,” and “Rhapsody” Vasudev has participated in several important group exhibitions in India and abroad. In addition, he has held solo exhibitions in different parts of India and the world(including the USA, Canada, England and Germany). Exhibitions\nof his drawings based on the late A.K. Ramanujan’s poetry and translations, titled “Tribute to Ramanujan,” have been held in Bangalore, Chennai, Delhi, London and Chicago. Vasudev is founder and managing trustee of Arnawaz Vasudev Charities, a non-profit organisation providing financial assistance to young artists and art-related initiatives since 1989. He has helped in establishing Visual Art Department at the Bangalore University, National Gallery of Modern Art Bangalore, Ananya Drishya and Art Park, both, artists’ initiatives. \nVasudev conducted his Retrospective Exhibition titled “Inner Resonance- Return to Sama” at National Gallery of Modern Art, Bangalore and Mumbai, and also at Lalit Kala Akademi galleries, Chennai, during 2018-2019. \nIn collaboration with International Music & Arts Society \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-open-frame/",
    "keywords": "Biography, Film",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-404.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Seeds of Democracy",
    "startDate": "2024-04-06T18:30:00+05:30",
    "endDate": "2024-04-06T20:00:00+05:30",
    "description": "In India, the question of whether voters are truly getting what they vote for remains a complex and often debated issue. While elections provide a platform for citizens to express their preferences and hold their representatives accountable, challenges such as electoral misconduct, corruption, and the influence of money and power continue to cast doubt on the efficacy of the electoral process. Moreover, the disconnect between campaign promises and actual governance outcomes further muddles the picture. Despite strides in transparency and electoral reforms, the gap between voter expectations and political realities underscores the need for sustained efforts to enhance accountability, strengthen institutions, and foster a more responsive and inclusive democracy. \nCultivating Democracy: Politics and Citizenship in Agrarian India by Mukulika Banerjee is an anthropological study of the relationship of formal political democracy and the cultivation of active citizenship in one particular rural setting in India, studied from 1998 to 2013. It draws on deep ethnographic engagement with the people and social life in two villages, both during elections and in the time in between them, to show how these two temporalities connect. The analysis shows how an agrarian village society produces the social imaginaries required for democratic and republican values. The ethnographic microscope on a single paddy growing setting allows us to examine how the various social institutions of kinship, economy, and religion are critical sites for the continual civic cultivation of cooperation, vigilance, redistribution, inviolate commitment, and hope—values that are essential for democracy. \nA talk by Mukulika Banerjee will be followed by a discussion with A Narayana, moderated by Tara Krishnaswamy and a Q&A session with the audience. \nThis event is a part of BIC’s Election series. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/seeds-of-democracy/",
    "keywords": "Governance, Policy & Regulation, Politics",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-395.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "ಕಾಕದೋಷ | Kaakadosha",
    "startDate": "2024-04-10T19:00:00+05:30",
    "endDate": "2024-04-10T21:00:00+05:30",
    "description": "Kannada | 110 minutes |  Suitable for Ages 14+  \nಸರಿ ತಪ್ಪುಗಳಾಚೆ ಕುಟುಂಬ ಮನೆತನದ ಗೌರವಗಳು ನಿಲ್ಲಬಹುದೇ ? \nಬೆಂಗಳೂರಿನಲ್ಲಿ ಇರಬಹುದಾದ ಒಂದು ಸಾಂಪ್ರದಾಯಿಕ ಕುಟುಂಬ. ಗಂಡನನ್ನು ಕಳೆದುಕೊಂಡು ಕುಟುಂಬವನ್ನು ಸಂಭಾಳಿಸುತ್ತಿರುವ ಶಾರದಳಿಗೆ ಇರುವ ಒಂದೇ ಒಂದು ಭರವಸೆ ಎಂದರೆ ದೂರದ ಮುಂಬೈನಲ್ಲಿ ಕೆಲಸ ಮಾಡುತ್ತಿರುವ ಮಗ ಅಕ್ಷಯ್‌. ಹಳೆ ತಲೆಮಾರಿನ ಕೊಂಡಿಯಾಗಿ ಸಂಪ್ರದಾಯದ ಆಲದ ಮರವಾಗಿರುವ ಅತ್ತೆ ಸೀತಮ್ಮ ಮತ್ತು ಹೊಸ ಭವಿಷ್ಯದ ಸಂಕೇತವಾಗಿರುವ ಮಗ, ಇವರಿಬ್ಬರ ಮಧ್ಯೆ  ನಿಂತಿರುವ ಶಾರದಳಿಗೆ ಭೂತಕಾಲದ ಸತ್ಯವೊಂದು ನಿಜಭೂತವಾಗಿ ಹಠಾತ್ತನೆ ನಿಲ್ಲುತ್ತದೆ, ಅದೂ ತನ್ನ ಮಗ ಅಕ್ಷಯ್‌ನ ಮೂಲಕ. ಹೀನಕೃತ್ಯವೊಂದರಲ್ಲಿ ಆರೋಪಿಯಾಗಿ ಮಗ ಮನೆ ಸೇರಿದಾಗ, ಶಾರದಳ ಮುಂದಿರುವ ಆಯ್ಕೆಗಳೇನು ?ತಾನು ನಂಬಿದ ಮೌಲ್ಯಗಳು ಆಕೆಗೆ ಸರಿದಾರಿ ತೋರಿಸಿದವೇ ಅಥವಾ ಆಕೆಯ ಮನೆ ಕಾಗೆ ಹೊಕ್ಕ ದೋಷದ ಮನೆಯಾಯಿತೇ ? \nಪ್ರಖ್ಯಾತ ನಾಟಕಕಾರ ಹೆನ್ರಿಕ್‌ ಇಬ್ಸೆನ್‌ ನ ʼಘೋಸ್ಟ್ಸ್‌ʼ ನಾಟಕದ ಎಳೆಯೊಂದನ್ನು ಹಿಡಿದು , ಭಾರತದಲ್ಲಿ ೨೦೧೨ ರಲ್ಲಿ ನಡೆದ ನಿಜಘಟನೆಯೊಂದನ್ನು ಆಧರಿಸಿ ಅನುಪಮಾ ಚಂದ್ರಶೇಖರ್‌ ರವರು When the Crows Visit  ಎಂಬ ನಾಟಕವನ್ನು ವೆಂಕಟೇಶ್‌ ಪ್ರಸಾದ್‌ ರವರು ಕನ್ನಡಕ್ಕೆ ʼಕಾಕದೋಷʼ ಎಂಬ ಹೆಸರಿನಲ್ಲಿ ಅನುವಾದಿಸಿ ನಿರ್ದೇಶಿಸಿದ್ದಾರೆ. ಲಂಡನ್ನಿನಲ್ಲಿ ೨೦೧೯ ರಲ್ಲಿ ಇಂಗ್ಲೀಷಿನಲ್ಲಿ ಮೊದಲಿಗೆ ಪ್ರದರ್ಶನಗೊಂಡ ಈ ನಾಟಕ ಈಗ ಮೊದಲ ಬಾರಿಗೆ ಭಾರತದಲ್ಲಿ ಕನ್ನಡ ಭಾಷೆಯಲ್ಲಿ ‘ಕಾಕದೋಷʼ ಎಂಬ ಹೆಸರಿನಲ್ಲಿ ಪ್ರದರ್ಶನ ಕಾಣುತ್ತಿದೆ.  \nHow far can one go to save the Family’s ‘honour’? \nSet in a traditional family in a city like Bangalore, Kaakadosha revolves around the widow, Sharada, and her only hope, her son, Akshay who lives in distant Mumbai. Sharada, who is balancing the household with her Mother in law, Seethamma who roots the house with her traditional values, a link between the distant past and the present and Akshay the promise of a new future. Sharada is suddenly faced with the ghosts of the past, through the actions of her son, Sharada is left in cross roads. When Akshay returns home, accused of a heinous crime, what are Sharada’s choices? Will her trusted values show her the right path? Or are they all cursed in the old family house? \nDrawing inspiration from Henrik Ibsen’s “Ghosts,” Anupama Chandrasekhar crafted the play When the Crows Visit is based on a true incident from 2012. Venkatesh Prasad has translated to Kannada directed Kaakadosha. The English original premiered at Kiln Theatre, London, in October 2019, directed by Artistic Director Indhu Rubasingham. The play for the first time is being staged in an Indian language.  \n  \nCast and Crew: \nDesign: S. Surendranath \nSet Build: Sridhar Murthy \nProducer: Sushma \nProduction Manager: Bhyrava N \nLight Design: Arun D T \nSound Design: Utthana Barighat \nCostumes: Sushma \nOn Stage \nGauri Dattu, Divyashree J, Nandini Patvardhan, Shrunga B. V., Naveen Kumar J., Mario Jerome, Vasantha Krishnamurthy, Vidhya Ulithayya, Sunil Kumar V., Raag Urs \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%95%e0%b2%be%e0%b2%95%e0%b2%a6%e0%b3%8b%e0%b2%b7-kaakadosha/",
    "keywords": "Performing Arts, Theatre",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-406.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Cracking The Code Of Sleep",
    "startDate": "2024-04-03T18:30:00+05:30",
    "endDate": "2024-04-03T20:00:00+05:30",
    "description": "This discussion will examine the intricate realm of sleep through the dual perspectives of modern scientific knowledge and ancient Eastern wisdom. \nDespite significant advancements in knowledge, there remain uncharted territories in our comprehension of sleep. Do underlying physiological factors hinder restful sleep, and could individualised combinations of root causes contribute to the sleep challenges faced by each person? When viewed through the contrasting lenses of science and ancient wisdom, sleep challenges may manifest differently. Is there a way to harmonise the insights from both realms for a more comprehensive understanding? Exploring the scientific intricacies of the body’s systems alongside the ancient principles of Ayurveda, particularly the concept of the three doshas, presents a promising avenue. This approach aims to transcend dichotomies and foster a synergistic relationship between various perspectives. \nFollowing two presentations by Deepa Kannan, author of the book How To Sleep Better-The Miraculous 10-Step Protocol To Recharge Your Mind & Body, and Dr Uma Maheswari Krishnaswamy will be a dialogue moderated by writer Thomas Abraham and a Q&A session with the audience. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/cracking-the-code-of-sleep/",
    "keywords": "Books, Health & Wellness, Public Health, Science",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_poster-7.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "China through Another Prism",
    "startDate": "2024-04-16T18:30:00+05:30",
    "endDate": "2024-04-16T20:00:00+05:30",
    "description": "Discussions surrounding China and India’s relationship remain urgent and crucial due to their geopolitical significance, economic interdependence, and potential for conflict. As two of the world’s most populous nations and emerging global powers, their interactions shape regional stability and have far-reaching implications for international relations. With ongoing territorial disputes, trade tensions, and differing strategic interests, understanding and managing their relationship is vital for fostering cooperation, averting conflicts, and navigating the complexities of a rapidly changing world order. \nExploring themes from his book Beyond Binaries: The World of India and China based on his writings on India, China and their often-tumultuous relationship, Shastri Ramachandaran unravels a succinct history of how ties between the two Asian neighbours have evolved over the 15 years from 2008–2022 and the internal and bilateral compulsions that shaped them. The book makes the reader aware about the strategic thinking that went into each move and counter-move by the two nations that are often at odds with each other, as they are at present. It is an attempt to deepen understanding of the recent history of Sino-Indian relations and, as the title suggests, look at India-China relations without putting it in the category of good or bad. \nIn this session, author Shastri Ramachandran will be in conversation with Manoj Kewalramani taking the listener beyond the binaries in which perceptions of India and China, their relationship and their role on the world stage is trapped. A Q&A with the audience will follow. \nThis is the first event in BIC’s two-part China Series. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/china-through-another-prism/",
    "keywords": "History, International Relations, Politics",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-400.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Jump",
    "startDate": "2024-04-08T19:00:00+05:30",
    "endDate": "2024-04-08T20:00:00+05:30",
    "description": "90 minutes | English and Hindi | Mature Content for Ages 16+ \nTrigger Warnings: Suicide & Self Harm \nA two-actor black comedy about life, death, and everything in between. A successful female executive is ready to commit suicide by jumping off a roof when a male cab driver saves her. \nThis sets the stage for a collision between two completely opposite worlds, personalities,\ncircumstances, beliefs, and perspectives. Despite their contrasting socio-economic classes, backgrounds, and lifestyles, this unusual encounter leads to a night of pure and simple human connection. \nWill the man be able to truly save her, or will she be back to jump again? \nThe play explores the themes of suicide, depression, loneliness, happiness, love, having or not having a purpose in life, and ultimately death, creating an emotionally complex and thought-provoking experience for the audience. Jump delves into the human psyche, showcasing the struggles, challenges, and aspirations of two very different individuals who would never meet in normal circumstances but find a unique connection in the most unexpected of places and in their shared\nhumanity. \nDirector’s Note \nApart from being an actor and director, I’m also a mountaineer. I was in an advanced mountaineering course trying to summit a Himalayan mountain in October 2022. An avalanche came, and we lost 29 people out of a batch of 53 people. I somehow survived the incident and escaped death. The incident changed me, my core beliefs, and my perspective on living life. For the first time, I felt depressed and tried therapy. The incident left me with a lot of questions. WHO recently declared loneliness a ‘global public health concern’. In India, 1 in every 5 individuals suffers from some form of mental health illness, and over 2.6 lakh cases of suicide occur in a year. \nGiven these alarming numbers, considering and addressing mental health is still at a very early stage in India. In a post-pandemic world, the alarming rise in suicide, depression, and loneliness rates around the world shows that our pursuit of success and materialistic goals doesn’t lead us to genuine happiness and fulfilment. In the world of social media, because of personal, sociological, political, and geographical reasons, we feel disconnected more than ever before. We often witness instances where seemingly successful and happy individuals suddenly take their own lives. In spite of the number of self-help books, motivational speakers, and influencers preaching about finding life’s purpose, a significant portion of us are just trying to survive. \nOur individual perspectives play a significant role in shaping our lives. We tend to surround ourselves with like-minded people who share similar perspectives. We believe that our own perspective is the\nultimate and only valid one. If we look closely enough, all the conflicts in the world are just a clash of different and opposing perspectives. \nThe essence of Jump lies in the meeting of these two contrasting characters, identities, perspectives, lifestyles, and worlds within a highly unusual situation. \nAbout Collective Madness\nEvery project for us is an attempt to find a unique connection with our audience around the ideas we believe in. Collective Madness Studios, established in 2004, is a platform for anyone who believes that theatre is a practicing art form and provides a space for those who are passionately attached to theatre. The studio has produced close to 20 projects, including musicals, adaptations and plays with social messages We believe in collaboration & experiential learning. It is at the heart of all our products & initiatives. Every individual human experience is a limiting one, so collaborating with others has become essential. Collaborations challenge one’s current understandings and help to see things from new perspectives. \nCast and Crew: \nActors: Vidushi Chadha and Sandeep Shikhar\nWriter & Director: Maneesh Verma\nDramaturg: Akhshay Gandhi\nAssociate Director & Lights: Vishal\nScenography: Maneesh Verma and Dhanendra Kawade\nProduction Manager: Monika Gupta\nSoundscape: Sahil Vaid\nSong Music Producer: Kaizad Gherda\nSong Lyrics & Music: Asif Ali Beg\nSong Singer: Shazneen Arethna\nProduced by Collective Madness Studios\nSpecial Thanks Kalyani Hiwale, Harsh Khurana, Tushar Pandey \nJump is inspired from “Umbrella” written by Larry Pontius\nCommissioned by Serendipity Arts Festival 2023 \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/jump/",
    "keywords": "Performing Arts, Theatre",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-405.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Memories – English Songs of the 60s, 70s & 80s",
    "startDate": "2024-04-05T19:00:00+05:30",
    "endDate": "2024-04-05T20:30:00+05:30",
    "description": "Nirmala Kannan will be rendering popular English songs from the 1960s to the 80s. The programme will showcase songs of love, romance, heartbreak, woman empowerment and hope. It will include a wide range of genres, from soft soul and country music, to rock and roll, and disco. Her programmes have been well received, including her most recent concert in Kochi on March 8, 2024 (International Women’s Day), a solo charity concert for raising contributions towards the National Defence Fund.  \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/memories-english-songs-of-the-60s-70s-80s/",
    "keywords": "Music, Performing Arts",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-407.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "NCPA @ Freedom Park",
    "startDate": "2024-03-30T18:00:00+05:30",
    "endDate": "2024-03-31T21:00:00+05:30",
    "description": "Venue: Freedom Park \nThe National Centre for the Performing Arts (NCPA), Mumbai has been a coveted space for both audiences and performers for long. Three years ago, the 55-year-old NCPA, South Asia’s first multi-venue and multi-genre cultural centre, decided to step out of its hallowed precinct after the Covid-19 pandemic-driven lockdown was lifted and people were eager to step out. The first edition of NCPA@thePark was inaugurated in March 2022, as an initiative in association with the Brihanmumbai Municipal Corporation (BMC) to exhibit live performances and promote performing arts in the country across prime outdoor locations, free of cost. Attached are the images of the recently-held Mumbai performances for your reference. \nFollowing the success of the earlier seasons that recorded heavy footfalls, the NCPA, situated in Nariman Point, Mumbai is delighted to take its celebrated line-up of live performances to Bangalore. Set against the backdrop of the city’s iconic location – Freedom Park, it aims to deliver a unique and engaging experience featuring an array of live performances ranging from dance, international music, western classical music and spoken word. \nThe evening of 30th March begins with a performance by the country’s first and only professional orchestra—the Symphony Orchestra of India. You’ll hear works by Mozart, Johann Strauss and more, as well as some popular tunes you’re sure to recognise. Spoken word and music by UnErase Poetry will follow. Simar Singh, Priyanshi Bansal and Vanika Sangtani, accompanied by musician Abhin Joshi, will present stories about love, hope and life. \n31st March features Ratikant Mohapatra’s Srjan performing ‘Deesha – Navigating the journey of forging new horizons’, a neo-classical Odissi performance. Ending the weekend is a set by Darren Das & The Sixth Sense, who will have you grooving to the best of pop, retro, rock n roll and classic rock.  \nSaturday | March 30 | 6 pm\nSymphony Orchestra of India – An evening of light classical music\nWestern Classical Music \nSaturday | March 30 | 7:15 pm\nUnErase Poetry – With Simar Singh, Priyanshi Bansal, Vanika Sangtani & Abhin Joshi\nSpoken Word \nSunday | March 31 | 6 pm\nDeesha – Navigating the journey of forging new horizons – By Ratikant Mohapatra’s Srjan\nOdissi Performance \nSunday | March 31 | 7:30 pm\nDarren Das & The Sixth Sense – A vibrant mix of pop, retro, rock n roll & classic rock\nInternational Music \nWith a view to promote use of public transport and convenient access, the organisers will run free shuttle buses on March 30 and 31 evenings from the Vidhana Soudha Metro station to Freedom Park and back.  \nThis is a BIC Elsewhere Event. \nWhile the majority of our events find a home at our premises in Domlur, BIC Elsewhere represents our commitment to bringing conversations, arts, and culture directly to diverse audiences. Through this initiative, we collaborate with various venues, extending the reach of our events beyond our own space. These partnerships not only breathe life into our gatherings but also play a crucial role in cultivating an environment for the flourishing of arts and culture in the city. \nIn collaboration with: \n  \nPresented by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Freedom Park, Seshadri Rd, Gandhi Nagar, Bengaluru, Karnataka, 560009, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/ncpa-freedom-park/",
    "keywords": "Dance, Music, Performing Arts, Poetry, Theatre",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/ThumbnailNCPA@park.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Arduous Pursuit of Dignity for All",
    "startDate": "2024-04-10T18:30:00+05:30",
    "endDate": "2024-04-10T20:00:00+05:30",
    "description": "This talk draws from Matthias Mahlmann’s recent critically acclaimed book, Mind and Rights: The history, law and psychology of Human Rights published in open access mode by Cambridge University Press in February 2023.  The talk critically examines the growth of the concept of human rights, its roots in history and current human rights theories. It scrutinizes in particular the myth of the Western origin of the idea of human rights by highlighting the many roots of human rights in different cultures, including within the Global South and indigenous cultures. \nA particular goal of the talk is to engage with the so-called cognitive revolution and to investigate the relationship between human cognition and human rights.  The talk will argue that insights gained from modern theories of the mind can deepen our understanding of the foundation of human rights. The talk also seeks to answer the question whether the current attacks on democracy can be countered through the use of human rights and its underlying political ethics of egalitarian dignity. Finally, the talk will contend that the pursuit of the human rights idea, with its achievements and tragic failures, is key to understanding what kind of beings humans are. Such self-knowledge is crucial in times in which the human species has put its own survival at risk. \nA conversation between the author, Matthias Mahlmann, and the discussant, Sudhir Krishnaswamy, will be followed by a moderated Q&A session with the audience. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-arduous-pursuit-of-dignity-for-all/",
    "keywords": "Books, Law, Policy & Regulation, Society",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-413.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Sakhi",
    "startDate": "2024-04-03T19:00:00+05:30",
    "endDate": "2024-04-03T20:30:00+05:30",
    "description": "We have all heard about the abduction of Sita, but how many have seen the Ramayana from Sita’s point of view? \nHave you ever wondered how Draupadi would describe the turmoil she faced in the Mahabharata? \nThey are the two most powerful female figures in Hindu mythology, yet their perspective is often overlooked. This dance-theatre production brings Sita and Draupadi face-to-face in a conversation about their lives, told through their voices. A unique amalgamation of Bharatanatyam, contemporary dance, and theatre, this performance will take you on an extraordinary journey as the two goddesses relive their stories through dance. \nThe production is by Jyotsna Shourie Dance Society and Keelaka Dance Company \nDirector: Jyotsna Shourie\nProducer: Aneesha Grover\nSponsor: MADSTARBASE\nMusic: OS Arun and MadStarBase \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/sakhi/",
    "keywords": "Dance, Mythology, Performing Arts, Theatre",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-403.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Snakeman of India",
    "startDate": "2024-03-28T18:30:00+05:30",
    "endDate": "2024-03-28T20:00:00+05:30",
    "description": "Join us for an enthralling evening as we dive into the wild, formative years of Romulus Whitaker through his memoir, Snakes, Drugs and Rock ‘n’ Roll: My Early Years. Esteemed conservationist and the revered ‘Snakeman of India’, Whitaker, along with his co-author Janaki Lenin, will be in conversation with Darius Sunawala. \nThis event brings to life his journey of a boy from the US to the heart of India, where his passion for snakes and wildlife conservation took root. From harbouring a pet python under his boarding school bed to his hair-raising adventures across continents, Whitaker’s story in Snakes, Drugs and Rock ‘n’ Roll is not just about snakes but a love affair with nature. \nThe evening will comprise firsthand experiences that led Whitaker to become a leading figure in the global conservation space. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/snakeman-of-india/",
    "keywords": "Biography, Books, Environment, Sustainability, Wildlife",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-398.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Why Does India Lag Behind Its Poorer Neighbours?",
    "startDate": "2024-03-29T18:30:00+05:30",
    "endDate": "2024-03-29T20:00:00+05:30",
    "description": "A newborn girl can expect to live to eighty in Sri Lanka, seventy-four in Bangladesh and sixty-nine in India. This is but one of a range of Swati Narayan’s insights from a five-year study across four countries: India, Bangladesh, Nepal and Sri Lanka. She found that even poorer neighbours were doing better than India on a range of social indicators: health, nutrition, education, sanitation, with more women working outside the home. \nNarayan’s intensive, immersive research shows that India’s leapfrogging neighbours have worked hard to dilute social inequalities. Land reforms, investments in schools and hospitals, and socio-political reform movements aimed at diluting caste and gender discrimination – all of these have wrought change over the decades. Excellent networks of primary healthcare clinics, village schools and household toilets have transformed the lives of citizens in these countries. \nIn economically booming India, on the other hand, social ills like sex-selective abortion, child stunting, illiteracy and preventable deaths are rampant. Inequalities are stark here—not only between the burgeoning billionaire class and the neglected masses, but also among the northern states and their southern counterparts. However, it is in fact the successes in states like Tamil Nadu and Kerala that offer grounds for optimism—India is capable of transformation if governments commit to social welfare investments and bridging social inequities. \nPacked with human stories as well as hard data, and shot through with empathy and hope, Swati Narayan’s Unequal is a necessary book for our times. \nSwati will be in conversation with Aakar Patel. A Q&A with the audience will follow. \nPresented by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/why-does-india-lag-behind-its-poorer-neighbours/",
    "keywords": "Books, Development, Gender, Governance, Health & Wellness, Nonfiction, Policy & Regulation",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-399.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Book for All, Yet for None",
    "startDate": "2024-03-31T18:00:00+05:30",
    "endDate": "2024-03-31T19:30:00+05:30",
    "description": "Traverse philosophical landscapes illuminated by the youthful wisdom captured in the writings of 18-year-old author Karan Lad. \nHis book, A Glitch in the Simulation, sheds light on how we inadvertently design the values and morality for the weakest while often forgetting the powerful. As we build faster cars, we forget the roads and laws that punish speeding; while we value the best designer wear, we are indifferent to the low wages paid to the workers who make it. The book discusses the paradox of our existence and seeks to search for new answers from a fresh pair of eyes with a challenging perspective. It unapologetically questions our belief system via the lens of a young man’s attempt to find his own meaning of life, happiness, purpose, and existence. \nJoining the author in conversation about his early interest in philosophy, his journey toward getting published as a young writer, and his process will be philosophy enthusiast and jazz musician Abhijit Nath. The session ends with an audience Q&A. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/book-for-all-yet-for-none/",
    "keywords": "Books, Faith, Literature, Philosophy",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-408.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Meeting Kabir in the 21st Century",
    "startDate": "2024-03-31T17:30:00+05:30",
    "endDate": "2024-03-31T19:30:00+05:30",
    "description": "The aim is to present a performative piece with story and song, based on the values of trust, surrender and love. The storytelling is based on Deepa’s lived experiences during the pandemic from Delhi to Auroville in 2020, on a cycle without phone & money. These stories will be complemented and enriched with songs by Anahita based on Sufi and Nirgun Bhakti poetry. \nDeepa’s storytelling comes from a space of intuition, honesty and vulnerability. She talks as openly about the gifts received on this journey, as she does about the struggles and difficulties that came along the way. Her style of narration is engaging and immersive, taking the audience on a journey within themselves. \nAnahita sings the works of mystic poets like Kabir, Khusro, Bulleh Shah, and others, and explores how we relate to them in our own lives. She would weave this poetry in folk, Hindustani classical and qawwali styles of singing. \nAs Anahita sings songs, Deepa will narrate stories from her journey, thus making this collaboration akin to a bridge that connects the root ideas reflected in mystic poetry from centuries ago, to the lived experience based on these very ideas in the 21st century. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/meeting-kabir-in-the-21st-century/",
    "keywords": "Faith, Music, Performing Arts, Poetry",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-24.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Suflet",
    "startDate": "2024-04-11T19:00:00+05:30",
    "endDate": "2024-04-11T20:00:00+05:30",
    "description": "The project “SUFLET – Soundscapes from the Carpathians and the Himalayas” is an international music collaboration which aims to create a cultural bridge between Romania and India. Through the confluence of traditional wind instruments panflute and bansuri, with the accompaniment of tabla and keyboard, the artists present modern reinterpretations of Romanian folklore masterpieces as well as new compositions which bring together Romanian and Indian music. \nThe concert illustrates the beauty and musical diversity of the two cultures, from doina to dhun, from hora to hori, from sârba to raga, inviting the audience on a fascinating sound journey across two continents. “Suflet” refers to both “breath” and “soul”. Combining their creativity, the four musicians create an exceptional music which speaks to the heart and transcends all boundaries. \nIn collaboration with:\n      \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/suflet/",
    "keywords": "Music, Performing Arts",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-415.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Joy of Creativity in Khayal",
    "startDate": "2024-03-29T00:00:00+00:00",
    "endDate": "2024-04-01T00:00:00+00:00",
    "description": "Explore the essence of Hindustani music through three sessions of our Masterclass series with Pandit Satyasheel Deshpande. Session 1 will illuminate the role of rhythm in fostering individual expression, showcasing its diverse applications in folk, film, and classical genres. In Session 2, we will delve into the gharana traditions as distinct aesthetic ideologies, dissecting their unique approaches to ragas and talas. Finally, Session 3 will unveil the significance of bandishes as carriers of musical expression, offering insights into their nuanced composition and performance dynamics. This journey through the landscape of Hindustani music, where tradition meets innovation at every turn, is suitable for seasoned professionals, gayikas, young performers and music enthusiasts alike. \nSession 1: The Khayal and Individual Expression\nFriday | Mar 29 | 6pm – 8pm\nThis session will introduce the unique nature of rhythm in Hindustani music, and will frame it as an enabler of individual creative expression. Through demonstrations of folk, film and classical music, the session will demonstrate to participants how the tala-system of Hindustani music creates space and scope for creative, improvisatory play. It will also look at how diverse musicians have used this facility to make the music uniquely their own. \nSession 2: Gharanas and Aesthetic Ideologies\nSaturday | Mar 30 | 6pm – 8pm\nThis session will look at some of the  major gharanas of vocal Hindustani music, but instead of seeing them purely as pedagogical lineages, we will think of them as particular aesthetic ideologies, particular ways of handling raga and tala that innovative musicians gave birth to. Through live demonstrations and curated archival recordings, we will do an intensive review of the gharana traditions of Hindustani music and the aesthetics they embody \nSession 3: Bandish\nSunday | Mar 31 | 11am – 1pm\nThis final session will look at bandishes in Hindustani music as carriers of unique musical expression. We will discuss the importance of the bandish to Hindustani music, its uniqueness as a song-genre, and how it is different from other kinds of compositions. We will then look at various kinds of carefully selected bandishes from various ragas, talas, tempos, gharanas, and innovative composers. We will learn to appreciate the nuanced ways in which bandishes use text, how starting from a particular beat in the tala creates new beauty and new challenges for the singer, and many other such forces that drive performance. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-joy-of-creativity-in-khayal/",
    "keywords": "Masterclass, Music",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-402.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Ranji Triumph",
    "startDate": "2024-04-09T18:30:00+05:30",
    "endDate": "2024-04-09T20:00:00+05:30",
    "description": "Led by the great off spinner Erapalli Prasanna, the newly-renamed Karnataka state first won the Ranji Trophy in 1973-74. They ended Mumbai’s 15-year reign and then beat Rajasthan in the final. It began a redistribution of power in Indian cricket. Soon six Karnataka players from that final were in a touring Indian squad. \nHere, discussing the event are Ramachandra Guha, Suresh Menon and Sharda Ugra with Prasanna and the baby of that victorious team, Sanjay Desai. They recall the event, its impact on Indian cricket and the many stories behind the story. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/ranji-triumph/",
    "keywords": "Sports",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-412.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Making Rights Real",
    "startDate": "2024-03-26T18:30:00+05:30",
    "endDate": "2024-03-26T20:00:00+05:30",
    "description": "On International Women’s Day 2024, standards of equality reflected in the CEDAW (Convention on the Elimination of All Forms of Discrimination Against Women) continue to be elusive in the private sphere. In India, legal pluralism in family laws has historically seen  men and women treated differently, as well as a reluctance to look beyond the gender binary. \nLaws on reproductive and sexual rights have fallen short of fully protecting rights of women. Making Rights Real examines legal rights in India against the backdrop of the CEDAW. \nDr. Sarasu Esther Thomas will deliver a talk which will be followed by a conversation with Cynthia Stephen and a Q & A session with the audience. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/making-rights-real/",
    "keywords": "Gender, Law",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-23.jpg"
  }
]