[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76841-1754418600-1754424000@bangaloreinternationalcentre.org",
    "name": "Nehru’s India in the World",
    "startDate": "2025-08-05T18:30:00+05:30",
    "endDate": "2025-08-05T20:00:00+05:30",
    "description": "Scholars of international relations, political thought, and India’s diplomatic history continue to debate the meaning and relevance of non-alignment in India’s foreign policy today. The origins of these debates lie in Jawaharlal Nehru’s articulation of non-alignment at the height of the Cold War, a concept both resolute and ambiguous. \nIn this talk, Dr. Swapna Kona Nayudu will draw on her acclaimed book, The Nehru Years: An International History of Indian Non-Alignment (Cambridge University Press UK, Juggernaut Books India), to explore how India’s approach to international affairs and the United Nations now understood in summary as non-alignment. Based on meticulous archival research in multiple languages, her work uncovers India’s diplomatic and peacekeeping contributions in pivotal global events such as the Korean War, the Suez Crisis, the Hungarian Revolution, and the Congo Crisis. \nTracing the evolution of non-alignment from Nehru’s time to the present, Dr. Kona Nayudu will examine its contested meaning and its influence on India’s position as the only non-aligned founding member of the UN. \nDr. Kona Nayudu will be in conversation with Jahnavi Phalkey. The discussion will be followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/choosing-not-to-choose-non-alignment-as-strategy/",
    "keywords": [
      "Books",
      "History",
      "International Relations"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_CNTC.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77350-1754737200-1754742600@bangaloreinternationalcentre.org",
    "name": "Partition: Memory, Responsibility & Voice",
    "startDate": "2025-08-09T11:00:00+05:30",
    "endDate": "2025-08-09T12:30:00+05:30",
    "description": "Partition: Memory, Responsibility & Voice explores how this episode is remembered, who holds the responsibility of preserving its stories, and what it means to give them an honest voice. Through literature, oral testimony, archives, or immersive media, each speaker has engaged with histories marked by silence, trauma, and survival. In this session, they will reflect on the choices they have made – whose voices to amplify, how to tell different stories with care, and how to avoid reducing complex truths into simplified narratives. \nAt the heart of this conversation is a shared responsibility – not only as writers, educators, or artists, but as individuals shaped by inherited memory. How do we move beyond binaries of victim and perpetrator? How do we honour truths without exploitation or erasure? How and what does one embrace and acknowledge? \nAs Partition fades from lived memory, this panel asks how the stories we carry today might shape the understanding of future generations, and the ways they remember, question, and imagine. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/partition-memory-responsibility-voice/",
    "keywords": [
      "History",
      "In Memory",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_P_MRV.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76626-1753988400-1753992000@bangaloreinternationalcentre.org",
    "name": "गीर्वाण वाणी -BHARATHI",
    "startDate": "2025-07-31T19:00:00+05:30",
    "endDate": "2025-07-31T20:00:00+05:30",
    "description": "Step into a heartfelt journey across time and tradition. In this special performance, the untouched poetic gems of Mahakavi Subrahmanyam Bharathiyar are brought to life, exploring the vision and passion behind words he once held close. \nOur story begins with the late Prof. K. V. Krishnan from Varanasi, Bharathiyar’s own nephew, whose lifelong love for his uncle’s work unearthed these hidden verses. Through his research, we glimpse Bharathiyar not only as a poet but as a dreamer, lighting fires of change. \nThe name Bharathi, born of the Sanskrit “Abhāyām + Ratah”, means “one who delights in fearlessness.” This performance honors him as a beacon of courage, his words as arms of inspiration. \nThis evening offers a warm celebration of dance and verse; a simple yet powerful tribute to our fiery national poet, whose voice still stirs hearts today. \nCredits \nMusic Direction – Dr. Rajkumar Bharathi\nVocal & Nattuvangam – Swati Athmanathan\nMridangam, Tabla & Voiceover – Sri. Sarvesh Karthick\nViolin -Smt. TV Sukanya\nFlute – Sri. Sujith S Naik\nMusic compositions by Dr. Rajkumar Bharathi & Late Prof C.V. Chandrasekhar\nConcept & Choreography – Swati Athmanathan \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%97%e0%a5%80%e0%a4%b0%e0%a5%8d%e0%a4%b5%e0%a4%be%e0%a4%a3-%e0%a4%b5%e0%a4%be%e0%a4%a3%e0%a5%80-bharathi/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-11-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76773-1754074800-1754078400@bangaloreinternationalcentre.org",
    "name": "The Nation Wants to Know - A Stand up Special",
    "startDate": "2025-08-01T19:00:00+05:30",
    "endDate": "2025-08-01T20:00:00+05:30",
    "description": "From Mumbai to New York, laughter truly needs no visa! \nAnuvab Pal’s The Nation Wants To Know is a fast-paced, razor-sharp comedic journey through the quirks of modern India, and how they echo with (or utterly confuse) audiences across the globe. With his signature blend of wit, warmth, and wild storytelling, Anuvab moves from the absurdities of colonial hangovers to the chaotic charm of startups, social media spats, and airline adventures. \nThis isn’t just a stand-up show; it’s a cultural joyride. After sold-out performances in 11 countries and 27 cities, Anuvab now brings back his international tales, asking: what happens when India’s inside jokes meet the world’s outside gaze? \nPraised as “hysterically funny” by Time Out and “brilliant” by the Hindustan Times, Anuvab’s satire strikes a chord with audiences of all ages. Whether you’re nostalgic for Doordarshan or deep into meme culture, his humour finds you and welcomes you in. \nIt’s one evening, many Indias, and more than a few unexpected truths as punchlines. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-nation-wants-to-know-a-stand-up-special/",
    "keywords": [
      "Performing Arts",
      "Science"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-938.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76827-1753986600-1753992000@bangaloreinternationalcentre.org",
    "name": "Freedom and Integrity",
    "startDate": "2025-07-31T18:30:00+05:30",
    "endDate": "2025-07-31T20:00:00+05:30",
    "description": "There are many different views on what it means to be free. One popular perspective sees freedom as a form of independence: being free means not being held back or restricted by the expectations, obligations, or interference from others. After explaining the basic idea in more detail, the talk discusses Bob Dylan’s work to illustrate the value of this kind of freedom while noting that some other parts of Dylan’s work seem to question this very idea of freedom. To explore the critique of freedom, the talk turns to Robert Musil’s (1880-1942) unfinished novel The Man Without Qualities. One way to understand this celebrated novel is to see it as a partly hilarious, partly deeply tragic and moving description of putting too much emphasis on an ideal of freedom as independence. Drawing on insights from moral philosophy, the talk suggests that a proper understanding of the relation between independence and personal integrity can lead to a better appreciation of freedom as independence. \nA Q&A with the audience will follow the lecture. \nThis lecture is a part of Vidyashilp University’s Public Lecture Series. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/freedom-and-integrity/",
    "keywords": [
      "Philosophy",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_FI.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "76724-1754161200-1754166600@bangaloreinternationalcentre.org",
    "name": "Three Geniuses from a Little Town",
    "startDate": "2025-08-02T19:00:00+05:30",
    "endDate": "2025-08-02T20:30:00+05:30",
    "description": "In Karnatik music, a composer is referred to as a ‘vaggeyakara’ – someone who creates both the text (vak) and the music (geya) for a composition. The kirtana is the most important compositional form in Karnatik music. It is a beautiful balance between the sahitya (text), raga (melody) and tala (rhythm). These kirtanas have sprung from the creative flow of melody and text, thus creating a unified aesthetic identity.  \nThree eighteenth-century composers, Thyagaraja (1767-1847), Muthusvami Dikshithar (1775-1835) and Shyama Shastri (1762-1827), were masters and innovators of this compositional form, reverentially referred to as the ‘Trinity’ of Karnatik music. \nThe oldest among the three, Shyama Shastri, composed fewer compositions than his other two contemporaries, but each one of his compositions stand out as a unique piece. He used complex rhythmic structures which give a special quality to his kirtanas. \nThe prolific composer Thyagaraja viewed ragas with utmost clarity and definition. In his kirtanas, you find defined nuggets of the raga’s phrases in almost every line. \nThe esoteric Muthusvami Dikshithar looked at a composition with a different lens. His kirtanas are one whole melodic movement where the raga flows in an unstructured manner, overflowing from one line to another. The deeper one dwells on his compositions, their beauty unravels. \nAt this concert, Sangeetha Sivakumar will be presenting compositions of the Trinity with a special focus on Muthusvami Dikshithar since we are celebrating his 250th birth anniversary this year. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/three-geniuses-from-a-little-town/",
    "keywords": [
      "Culture",
      "Heritage",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Three Geniuses from a Little Town"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_TGFLT.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77046-1754420400-1754425800@bangaloreinternationalcentre.org",
    "name": "Skandaanubhavam- The World of Blissful Consciousness",
    "startDate": "2025-08-05T19:00:00+05:30",
    "endDate": "2025-08-05T20:30:00+05:30",
    "description": "Skandaanubhavam – The Inner World of Bliss Consciousness is a humble offering to Lord Muruga – the vibrant Tamil deity and to the literary world that has tried to capture his essence for centuries. This production is an artistic journey through Muruga’s many stories and moods, as seen through the eyes of poets, saints, and seekers. Through the twin disciplines of Harikatha and Bharatanatyam, we bring to life not only the narratives but the emotions, dilemmas, and revelations that these stories carry. Harikatha, with its flowing rhythm and spoken word, sets the stage with historical, philosophical, and devotional context. Bharatanatyam, with its gestural beauty and powerful physicality, takes us deeper into the emotional landscape of the characters. This production is also rooted in the idea of “Atma Anubhava”—the deeply personal, transformative experiences that poets and composers have shared in their devotion to Lord Muruga. It is these experiences that make ancient stories timeless, that allow us to feel a 12th-century poet’s longing or a saint’s moment of revelation. \nCredits \nArtistic Director: Acharya Anitha Guha\nResource Consultant & Harikatha: Suchithra B\nVocals: Sriranjani Tapasya Santhanagopalan\nNattuvangam: Jayashree Ramanathan\nMridangam and Rhythmic Composition: Raam Shankar Babu\nViolin: Eashwar Ramakrishnan\nFlute: Sruti Sagar\nMusic Interludes and Jathi Composition: Vijay Kumar\nLighting Design: Surya Rao\nSkandaanubhavam Logo and Invite Design: Avanti Natarajan (Art Brew) \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/skandaanubhavam-the-world-of-blissful-consciousness/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_Skandaanubhavam.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "76591-1754245800-1754251200@bangaloreinternationalcentre.org",
    "name": "Peace Notes - An Evening at the Opera",
    "startDate": "2025-08-03T18:30:00+05:30",
    "endDate": "2025-08-03T20:00:00+05:30",
    "description": "Experience the drama, passion, and romance of opera in a concert featuring timeless masterpieces from Bizet’s Carmen, Verdi’s La Traviata, and Gounod’s Romeo and Juliet! \nThe South Asian Symphony Orchestra will be led by India-born Danish conductor Maria Badstue, and joined by stellar soloists—Indian-American tenor Alok Kumar and soprano Cheryl Bains. This concert brings the emotional power of grand opera to life in Bengaluru. \nThe South Asian Symphony Orchestra brings together talented musicians from across the region to foster peace and unity through music. Inspired by Ambassador Nirupama Menon Rao’s extensive years in diplomacy, the orchestra provides a platform to promote dialogue, cultural synergy, and friendly understanding. \nNirupama Rao, Founder/ Trustee of The South Asian Symphony Foundation says, “There is something profoundly symbolic about an orchestra. It is more than a group of musicians gathered to perform a piece of music; it is a living metaphor for what society could be — and perhaps what it must be, if we are to thrive together… This metaphor becomes even more powerful in today’s world, where individualism often overshadows community, and noise threatens to replace music. The orchestra reminds us that true greatness lies not in volume, but in harmony — in listening, adapting, and playing our part with care and respect.” \n \n  \nIn collaboration with: \n \nSupported by: \n       \n",
    "url": "https://bangaloreinternationalcentre.org/event/peace-notes-an-evening-at-the-opera/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Peace Notes - An Evening at the Opera"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-SASO-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77036-1754764200-1754769600@bangaloreinternationalcentre.org",
    "name": "The Indo-Pacific Outlook: An Australian Perspective",
    "startDate": "2025-08-09T18:30:00+05:30",
    "endDate": "2025-08-09T20:00:00+05:30",
    "description": "As global power dynamics continue to shift, the Indo-Pacific sits at the heart of a rapidly evolving strategic and economic landscape. In this timely and wide-ranging session, Peter Varghese, former Australian Foreign Secretary and High Commissioner to India, offers a perspective shaped by decades of diplomacy and deep engagement with the region. \nHis address will explore the complex forces redefining the Indo-Pacific: from the sharpening rivalry between the US and China, to China’s expanding influence and the evolving policy direction in Washington. The session will also examine how key regional players (India, Japan, Korea, Indonesia) are shaping their own responses to these pressures, and what this means for the broader security of the region. \nAlongside geopolitics, the conversation will turn to trade tensions, economic nationalism, and the slowing pace of globalization; factors that now cast long shadows over our economic future. Can traditional regional institutions hold, or will more agile, interest-based minilateral groups take their place? \nFollowing his presentation, Peter Varghese will converse with Latha Reddy, Nitin Pai, and Ranjan Mathai. The evening concludes with an audience Q&A, inviting reflections on a region that will shape the 21st century. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-indo-pacific-outlook-an-australian-perspective/",
    "keywords": [
      "International Relations",
      "Policy & Regulation",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-4-8.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76983-1753660800-1753747199@bangaloreinternationalcentre.org",
    "name": "373. EMIs & Other Existential Crises",
    "startDate": "2025-07-28T05:30:00+05:30",
    "endDate": "2025-07-29T05:30:00+05:30",
    "description": "In this refreshingly jargon-free session, Lavanya Mohan, author of Money Doesn’t Grow on Trees, gets real about why personal finance often feels confusing, boring, or just plain overwhelming. \nFrom spending in your 20s to planning in your 40s, Lavanya’s approach is simple, meme-filled, and judgment-free. Whether you’re dealing with your first paycheck, lifestyle creep, or just trying to adult responsibly, this conversation covers how to spend smarter at every life stage—without spreadsheets or guilt. \nLavanya will be in conversation with Dipika Jaikishan, Co-Founder and COO of Basis, a platform focused on financial independence for women. Together, with their understanding of how financial literacy intersects with everyday life, especially for younger and often overwhelmed audiences, Lavanya and Dipika bring both insight and clarity to a conversation that promises to be as useful as it is fun. \nExpect memes, pop culture references, stories from the book, and zero jargon. Just real talk about money—how we use it, why we fear it, and how to make it work for us. \nIn this episode of BIC Talks, Lavanya Mohan will be in conversation with Dipika Jaikishan. This is an excerpt from a conversation that took place in the BIC premises in May 2025. \nSubscribe to the BIC Talks Podcast on your favorite podcast app!\nBIC Talks is available everywhere, including Apple Podcasts, Spotify, Google Podcasts, Castbox, Overcast, Audible, and Amazon Music. \n",
    "url": "https://bangaloreinternationalcentre.org/event/373-emis-other-existential-crises/",
    "keywords": [
      "Books",
      "Economics",
      "Gender",
      "Nonfiction",
      "Podcast",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-1-6.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "77109-1754505000-1754508600@bangaloreinternationalcentre.org",
    "name": "Driving Elephants",
    "startDate": "2025-08-06T18:30:00+05:30",
    "endDate": "2025-08-06T19:30:00+05:30",
    "description": "26 minutes | English with subtitles | 2019 \nForests inspire awe, yet fragmentation, monocultures, and urban sprawl disrupt their balance, driving biodiversity loss and human-elephant conflict (HWC). Elephants, as ecosystem engineers, adapt by moving through both wild and cultivated lands, exposing the blurred lines of modern landscapes. \nSet in regions like Bannerghatta, Cauvery, and Mysore, where A Rocha India works closely with communities and frontline staff, Driving Elephants documents the fatal consequences faced by free-ranging elephants when they venture into human spaces. Male elephants, in particular, are increasingly pushed to the fringes, navigating traffic, raiding crops at night, and forming risky coalitions in search of survival. \nWith over 730 humans and 336 elephants dying annually due to HWC, this crisis demands more than tolerance; it calls for empathy, equity, and space for all. The screening of Driving Elephants is an invitation to reflect on coexistence in these shared landscapes and to reimagine a future where people and elephants can thrive together. \nThe screening will be followed by an audience Q&A session with Avinash Krishnan \n",
    "url": "https://bangaloreinternationalcentre.org/event/driving-elephants/",
    "keywords": [
      "Environment",
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Driving Elephants"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_DE.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77414-1754046000-1754251200@bangaloreinternationalcentre.org",
    "name": "A Visual Encyclopedia of Indian Food ",
    "startDate": "2025-08-01T11:00:00+05:30",
    "endDate": "2025-08-03T20:00:00+05:30",
    "description": "Exhibition Opening: 6:00 pm | Friday, 1 August\nTimings: 11:00 am – 8:00 pm\nExhibition on show until Sunday, 3 August \nWalkthroughs: \nFriday, 1 August| 6:30 pm\nSaturday, 2 August| 12:00 pm & 5:00 pm\nSunday, 3 August| 12:00 pm & 5:00 pm \n  \nThe Visual Encyclopedia of Indian Foods (VEIF) is the first attempt to look at India’s culinary diversity in a visually rich, ingredient-led narrative. \nMani’s images are stunningly nuanced portraits of the subjects where ingredients, their botany, preparations, and material culture become scenes, dioramas, tableaus or altars, appropriately drawing upon their compositional qualities as displays of study. Along with insightful and accessible texts for each entry, the Visual Encyclopedia of Indian Food connects the many lateral stories that exist in the Indian food narrative – from ingredients to preparations, traditional kitchen tools, eating and drinking vessels, as well as the broader context of seasons, producers and communities. \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-visual-encyclopedia-of-indian-food/",
    "keywords": [
      "Culture",
      "Food",
      "Photography",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_VEIF.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "76934-1754593200-1754597700@bangaloreinternationalcentre.org",
    "name": "The Open Couple",
    "startDate": "2025-08-07T19:00:00+05:30",
    "endDate": "2025-08-07T20:15:00+05:30",
    "description": "Language: English \nWhen the rules of love are rewritten, what’s left standing? \nDario Fo’s The Open Couple is a bold, sharp, and darkly comic exploration of modern relationships pushed to the edge. What begins as a provocative experiment (a husband proposing an open marriage) quickly spirals into chaos, confrontation, and unexpected revelations. \nSet against the backdrop of shifting gender roles and social expectations, the play peels back the layers of a marriage unravelling. With biting wit and disarming vulnerability, Fo exposes the emotional toll of jealousy, the absurdity of control, and the fragile line between freedom and fear. The couple’s battles are fast, funny, and painfully familiar, as they try to navigate the messy terrain of love, power, and identity. \nThrough its rapid dialogue and theatrical twists, The Open Couple holds up a mirror to our ideas of commitment and connection; asking what we’re really seeking when we ask for more. \nA deeply human comedy that leaves room for both laughter and reckoning. \nCredits:\nWriter : Dario Fo\nDirector : Faraz Khan\nCreative Producer : Ragini Roychowdhury\nActors : Vaishali Bisht & Rohan Joshi\nSound : Charvi Ojha \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-open-couple/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "The Open Couple"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-2-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "76948-1754218800-1754227800@bangaloreinternationalcentre.org",
    "name": "IMF Mountain Film Festival – India Tour 2025",
    "startDate": "2025-08-03T11:00:00+05:30",
    "endDate": "2025-08-03T13:30:00+05:30",
    "description": "The infinite inspiration of the mountains, through the lens of some of India’s most passionate filmmakers.  \nCurated by the Indian Mountaineering Foundation, the IMF Mountain Film Festival – India Tour 2025 brings the spirit of the mountains to the big screen with a selection of short adventure films from across the nation. Following the 6th edition of the festival held in New Delhi, the India Tour showcases award-winning films to audiences around the country. \nEach film captures adventure: the thrill of exploration, the solitude of high altitudes, and the resilience it takes to move through wild, unforgiving terrain. From remote rock faces to glacial rivers, from biking to climbing to deep cave dives, these stories are as diverse as the landscapes in which they unfold. \nThis event offers you the chance to witness a range of films highlighting India’s natural beauty and the remarkable talent within its adventure community! \nFilm Schedule: \nFirst Session: 11am – 12:00pm \nDirt Nuggets\n15 minutes | English | Vinay Menon\nSix mountain bikers tread the untouched terrain of Ladakh in India at 3600mts. These riders from across India come from varied walks of life, and wide styles of riding, with one thing in common – their love for mountain biking. Join India’s biggest names in Downhill and Freeride Mountain Biking as they find unridden big mountain descents, untouched trails, and carved features. \nLife Uphill – The Tenzing Dolma Story\n8 minutes | Hindi | Akshat Jain\nLife Uphill is a heartwarming tale of a woman who breaks barriers, proving that dreams know no bounds, set against the stunning backdrop of the Himalayas. \nCreativity on the Rock\n18 minutes | English & Hindi | Rakesh Meena and 4Play Media & Communications\nCreativity on the Rock is a documentary that explores the unique world of rock climbing in a remote area renowned for its diverse and exceptional rock formations. The documentary delves into the personal and meditative aspects of climbing where climbers describe the sport as an artistic endeavor, emphasizing the creativity of finding and mastering new climbing lines. The film is shot mainly in Sethan near Manali. \nGanga Girls\n18 minutes | English & Hindi | Prasant Bhatt\nNaina Adhikari, an Indian professional kayaker aims to bring girls together and create an inclusive community in India’s male-dominated kayaking scene. Ganga Girls, which became the first all-girls kayak expedition in India, is an empowering project which supports girls, introducing them to kayaking and self-discovery. Witness their transformative journey as they paddle in the Ganga River. Get ready to be inspired by their courage, camaraderie, and determination! \nBREAK: 12:00pm – 12:10pm \nSecond Session: 12:10pm – 1:30pm \nA Himalayan Gamble\n29 minutes | English | Akshat Jain\nThis feature is a gripping exploration of the challenges and triumphs of Indian alpinism, as four climbers face the harsh realities of self-funded expeditions in the extreme Indian Himalayas \nIn search of Kasturi\n23 minutes | English | Neha Dixit & Roundglass Sustain\nIn Search of Kasturi, is a personal exploration of the filmmaker and her team to find the mystical Himalayan musk deer. Against the stunning and challenging landscape of the Indian Himalayas, the film embarks on a journey filled with curiosity and longing to uncover the secrets of one of the most elusive creatures of these mountains. Their ultimate encounter with the musk deer becomes a poignant reminder of the beauty and fragility of our natural world. \nDescent into Darkness: Krem Umladaw\n16 minutes | English | Biont & Roundglass Sustain\nUnder the green valleys of Meghalaya is a spectacular subterranean world of dark tunnels, vertical shafts, underground rivers, and a host of creatures. Few have descended into the absolute darkness of Krem Umladaw, which is one of India’s deepest vertical caves and extremely tricky to navigate. Join Dhritiman Mukherjee and his team on an expedition to document the barely known ecosystem. \nIn collaboration with: \nIndian Mountaineering Foundation\nIndian Mountaineering Foundation (IMF) is the apex national body for mountaineering and allied sports. IMF supports, promotes and regulates national and international climbing and mountaineering in India and is affiliated to the UIAA (International Mountaineering and Climbing Federation). IMF is also the regulatory body for the competitive Olympic sport of Sport Climbing and is affiliated to the IFSC (International Federation of Sport Climbing). IMF is also engaged in mountain protection work, knowledge building and creating awareness of the Indian Himalaya. \nThe Himalayan Club\nThe Himalayan Club, founded in 1928, is one of the earliest mountaineering clubs to have been established in the sub-continent for promotion of adventure and mountaineering. The club has presence across the country and outside too. The club’s objectives is not confined to just mountain climbing but to a much wider range of interest and activities related to mountain world like publications, awards, lectures, social activities, sponsorships and mountain film festivals. First published in 1928, The Himalayan Journal (THj) has achieved a world -wide recognition as the most reliable reference on the Himalaya, Karakoram and the Hindukush. Members of the club include some of the most famous and decorated mountaineers and explorers in India and abroad. The club would soon be celebrating its centenary year with a series of activities! \n  \n                              \n  \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/imf-mountain-film-festival-india-tour-2025/",
    "keywords": [
      "Film",
      "Sports"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-1-5.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "76871-1754593200-1754598600@bangaloreinternationalcentre.org",
    "name": "Sounds from the Library (#4)",
    "startDate": "2025-08-07T19:00:00+05:30",
    "endDate": "2025-08-07T20:30:00+05:30",
    "description": "Sounds From The Library returns for its fourth edition! \nAn intimate evening where conversation and performance intertwine in the cozy, listener-focused space of the BIC library. This hybrid series spotlights emerging voices from the Indian music scene, all past longlisted artists from the Toto Awards for Music. \nThis edition hosts Krameri from Vadodara, who brings a moody, atmospheric blend of electro, dance, and alt-pop, a soundscape that’s as textured as it is emotional. Sharing the stage is Lettisha, a Trivandrum-based artist whose fresh take on contemporary hip-hop and R&B is equal parts soulful and sharp. \nMore than a gig, Sounds From The Library invites audiences into the creative lives of the artists; offering insight into their inspirations, processes, and personal journeys. With music that moves and conversations that linger, this is a rare chance to experience live performance in its most thoughtful form.  \n\nIn collaboration with: \n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/sounds-from-the-library-4/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sounds from the Library (#4)"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-6-5.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77117-1754591400-1754596800@bangaloreinternationalcentre.org",
    "name": "Split Screens",
    "startDate": "2025-08-07T18:30:00+05:30",
    "endDate": "2025-08-07T20:00:00+05:30",
    "description": "Karim and Maya: \n• share a home\n• worry about money\n• binge-watch films\n• argue all the time \nKarim, a young film-maker, carries with him the starry-eyed dreams of the Arab Revolution. Maya carries her own pressing concerns: an errant father, an unstable job, a chain-smoking habit, a sudden pregnancy. When Karim’s brother disappears in Tunis, and Karim wants to go after him, Maya must choose between her partner and her home city, her future and her history… In a conversation between forms, fictions and truths, Exquisite Cadavers is a novel about a young couple navigating love in London, and a literary hall of mirrors about an author navigating the inspirations behind her work. \nMeena Kandasamy will be in conversation with Samhita Arni. A Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/split-screens/",
    "keywords": [
      "Fiction",
      "Gender",
      "Language",
      "Literature",
      "Nonfiction",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-5-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "77326-1754218800-1754224200@bangaloreinternationalcentre.org",
    "name": "In Search of the Ghost Cat",
    "startDate": "2025-08-03T11:00:00+05:30",
    "endDate": "2025-08-03T12:30:00+05:30",
    "description": "Begin your day with an immersive journey into the wild landscapes of Ladakh. This interactive session brings together conversations about the region’s elusive wildlife, its silence, its stark beauty, and its secrets, centering around one person’s quest to witness the majestic snow leopard. \nThe morning continues with an evocative audio-visual storytelling experience that brings the mountains to life. \n",
    "url": "https://bangaloreinternationalcentre.org/event/in-search-of-the-ghost-cat/",
    "keywords": [
      "Workshops",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-9-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77128-1755023400-1755028800@bangaloreinternationalcentre.org",
    "name": "The Great Trigonometrical Survey",
    "startDate": "2025-08-12T18:30:00+05:30",
    "endDate": "2025-08-12T20:00:00+05:30",
    "description": "A scientific quest, a vast subcontinent and an imperial impulse. \nThe Great Trigonometrical Survey combined all these, resulting in one of the most astounding projects in the history of science. This talk by writer, Meera Iyer takes you through the GTS story, beginning with its origins in Bangalore and going all the way to the Himalayas. The intrepid surveyors handled devilishly delicate instruments, braved the monsoons, fell prey to disease, all in their quest for inch-perfect maps. Besides some of the most famous people in the GTS including William Lambton and George Everest, the talk will also speak about some of the forgotten Indians who were a part of this extraordinary work, and the relevance of the GTS today. \nA Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-great-trigonometrical-survey/",
    "keywords": [
      "Books",
      "Design",
      "History",
      "Nonfiction",
      "Science",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-8-7.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "77143-1755025200-1755028800@bangaloreinternationalcentre.org",
    "name": "Mosaics of Motion",
    "startDate": "2025-08-12T19:00:00+05:30",
    "endDate": "2025-08-12T20:00:00+05:30",
    "description": "A dancer performing is akin to ink on paper, both embody the timeless art of storytelling. Utilising the medium of the stage to express the chosen character’s emotions, histories, and the many lives they have lived, Ballet emanates from the vocabulary of movement and strives to depict these layered tales. The stage comes alive with the confluence of years of practice and the timeless ambition to share stories within communities. \nThe National Youth Ballet company will present a selection of Pas Seuls (solo variations) and ensemble pieces that transcend the test of time to bring forth emotions and true artistry. The evening is curated to understand layered characters like Swanhilda from Coppelia, the Lilac Fairy from Sleeping Beauty, Sylvia from the eponymous ballet, exploring the Tea dance from the Nutcracker, a Jazz Waltz rendering the momentum of fire, and culminating in excerpts from The Cave of Wonders from Aladdin The Ballet, The Lewis Foundation of Classical Ballet’s forthcoming production. \nIn collaboration with: \n \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/mosaics-of-motion/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-10-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "76739-1754132400-1754140500@bangaloreinternationalcentre.org",
    "name": "Perfect Days",
    "startDate": "2025-08-02T11:00:00+05:30",
    "endDate": "2025-08-02T13:15:00+05:30",
    "description": "123 minutes | Japanese with English subtitles | Japan | 2023 \nWriter & Director: Wim Wenders\nScriptwriter: Takuma Takasaki\nStarring: Koji Yakusho, Tokio Emoto, Arisa Nakano, Aoi Yamada, and others.\nComposer: Patrick Watson \nA quiet life with all its nuances, beautifully observed. \nLegendary filmmaker Wim Wenders returns to fiction with a luminous story set in the heart of Tokyo, where the extraordinary hides in plain sight. At its center is Hirayama, played with quiet brilliance by Cannes 2023 Best Actor Koji Yakusho. He finds peace and purpose in the rhythms of his days: tending to the city’s public toilets, listening to old cassette tapes, reading paperbacks, and capturing light through a camera lens. \nBut beneath his seemingly simple routine lies a life shaped by memory, mystery, and choice. As gentle disruptions begin to ripple through his orderly world, we’re invited into a meditation on solitude, dignity, and the invisible richness of everyday existence. \nWenders, long admired for his contemplative, human-centered cinema, draws inspiration from Ozu while offering a rare, unromanticized view of Tokyo; one that honours its quiet workers and fleeting beauty. With a nostalgic soundtrack and a deeply empathetic gaze, Perfect Days is a film that lingers long after it ends. \nNominated for Best International Film at the 96th Academy Awards, this is a cinematic poem for anyone who’s ever found meaning in a daily ritual, or longed to. \nWim Wenders, born in 1945, is a celebrated German filmmaker and a leading voice of New German Cinema. Rising to prominence in the 1970s, he is known for his deeply human films and visual storytelling across fiction, documentary, photography, and writing. A former film critic and co-founder of Filmverlag der Autoren, Wenders gained early acclaim with The American Friend and his iconic road movie trilogy. He won the Palme d’Or at Cannes for Paris, Texas and earned Oscar nominations for Buena Vista Social Club and Pina. His work continues to shape global cinema with emotional depth and artistic innovation. \nThis is the second film in our collaboration with MUBI. Once in two months we will bring a new film from the extensive MUBI collection to our beloved BIC audience! \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/perfect-days/",
    "keywords": [
      "Film",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Perfect Days"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-77.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "77056-1754506800-1754512200@bangaloreinternationalcentre.org",
    "name": "The Expressive Companion: From Europe to India",
    "startDate": "2025-08-06T19:00:00+05:30",
    "endDate": "2025-08-06T20:30:00+05:30",
    "description": "Born in Europe and reshaped in Calcutta, the harmonium arrived in India’s classical music world with baggage: too rigid, too foreign, and too limited. Critics called it unfit for the fluidity of Indian ragas. All India Radio banned it for thirty years.  \nAnd yet, it endured. Its warm, resonant tones have become the soulful undercurrent to melodious ghazals, emotional bhajans, and classical ragas. \nThis evening, journey through that remarkable evolution with Dr. Ravindra Katoti, one of India’s leading harmonium maestros, in conversation with celebrated vocalist Sri Dhananjay Hegde. With Sri Yogesh Bhat on tabla, they bring alive the stories, struggles, and triumphs of this powerful instrument. \nAn evening of sound, memory, and musical legacy awaits. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-expressive-companion-from-europe-to-india/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Expressive Companion: From Europe to India"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-7-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "76813-1754150400-1754159400@bangaloreinternationalcentre.org",
    "name": "Tasty Trivia: All Things India",
    "startDate": "2025-08-02T16:00:00+05:30",
    "endDate": "2025-08-02T18:30:00+05:30",
    "description": "Tasty Trivia brings together people who love quirky facts and brain teasers. Whether you’re flying solo, coming with a friend, or on a fun date night, you’re in for an evening that’s friendly, engaging, and full of surprises. \nThis edition features an experimental format, with questions spanning all things India — food, culture, people, personalities, business, and more. The event is designed to be work-outable (not obscure!), making it accessible but still challenging and beginner-friendly! \nNote: This is an event for Teams of 2 (come solo and we’ll pair you up!) \nIn collaboration with:\n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/tasty-trivia-all-things-india/",
    "keywords": [
      "Cities",
      "Education",
      "History",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_RSEN.jpg"
  }
]