[
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "73938-1748458800-1748464200@bangaloreinternationalcentre.org",
    "name": "Alva Kuuto",
    "startDate": "2025-05-28T19:00:00+05:30",
    "endDate": "2025-05-28T20:30:00+05:30",
    "description": "Alva Kuuto with their eclectic soundscape and rooted narratives present a 2500-year-old Dravidian language -Tulu- in the sound of now. \nA performance which engages the audience and will nudge them to imagine; as Alva Kuuto’s genre blending songs give them a glimpse of India’s southwestern coastal land of Tulunadu and its people. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/alva-kuuto/",
    "keywords": [
      "Culture",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Alva Kuuto"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-835.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73911-1747765800-1747771200@bangaloreinternationalcentre.org",
    "name": "Signs From the Sky",
    "startDate": "2025-05-20T18:30:00+05:30",
    "endDate": "2025-05-20T20:00:00+05:30",
    "description": "\nThe session builds on Asko Parpola & Iravatham Mahadevan’s extensive works to show that a substantial portion of the IVC seals was a Celestial Omens List with the planet Venus occupying a central role in their astronomy. The study presents the full decipherment of 75 inscriptions and a partial decipherment of 61 inscriptions forming approximately 5% of the total number of inscriptions. \n\n\n\nKey findings demonstrate the exceptional astronomical sophistication of the Harappan civilization, including: (1) proof that bilingual parallels can effectively decipher the IVC script; (2) evidence that Harappan astronomical knowledge predated Babylonian astronomy by centuries; (3) the first complete decipherment of the Swastika symbol, revealing its astronomical significance; (4) identification of signs for planetary movements, conjunctions, and their associated omens; (5) discovery of Harappan meteorological methods using Venusian astronomy; and (6) a new understanding of the Great Bath Complex as a venue for astronomical rituals. \n\n\nThis work represents a significant breakthrough in understanding the intellectual and religious life of one of the world’s earliest urban civilizations, revealing their deep engagement with astronomical observation and its application to social and religious practices. Through archaeoastronomical analysis, the paper reconstructs the probable actual dates of celestial events tracked by the Harappans, providing empirical validation for the proposed decipherments.\n​​​​​​​​​​​​​​​​\n\nThe discussion will be followed by a Q&A session with the audience.\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/signs-from-the-sky/",
    "keywords": [
      "History",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-838.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "74115-1748457000-1748464200@bangaloreinternationalcentre.org",
    "name": "Tibet in Song",
    "startDate": "2025-05-28T18:30:00+05:30",
    "endDate": "2025-05-28T20:30:00+05:30",
    "description": "86 minutes | English & Tibetan with subtitles | 2009 | USA \nTibet in Song follows Ngawang Choepel, a Tibetan exile who risks everything to preserve his homeland’s endangered folk music. Arrested and imprisoned by Chinese authorities for alleged espionage, he served nearly seven years in prison before being released in 2002 as a result of massive international advocacy. Through rare music and personal stories, the film shows how Tibetan identity endures through song, even in the face of Chinese state-imposed “patriotic” pop music. \nThe screening will be followed by a Q&A session with the audience. \nIn collaboration with: \n \nThis screening is part of our three day Tibet festival, titled, Where the Sky Meets the Himalayas: Stories from Tibet. The festival invites audiences into the lived experience of a people shaped by exile, resilience, and enduring cultural identity. Through conversations, film, performance, visual art, and cuisine, the festival explores how Tibetans continue to tell their stories—across borders and generations. It is a tribute to the strength of a culture that survives in song, ritual, memory, and the written word. \n",
    "url": "https://bangaloreinternationalcentre.org/event/tibet-in-song/",
    "keywords": [
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Tibet in Song"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-843.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "73825-1747940400-1747945800@bangaloreinternationalcentre.org",
    "name": "Equus",
    "startDate": "2025-05-22T19:00:00+05:30",
    "endDate": "2025-05-22T20:30:00+05:30",
    "description": "Equus derived from the Latin word for ‘Horse’ is a psychological drama that delves deep into the mind’s primal corners. Written in 1973, the English “whydunit”, inspired by a real-life incident, unravels the mystery behind a shocking act of violence; “Seventeen-year-old, Alan Strang, blinds four horses with a metal spike, in a single night”. \nThe story follows Martin Dysart, a child psychiatrist, who begins treating Alan, only to find himself grappling with his inner turmoil. As the investigation unfolds, Dysart brings to light, Alan’s religious, emotional, and sexual obsession for horses, which leads him to confront unsettling truths about the nature of normalcy, worship, and desire. Consumed by envy of Alan’s raw, unfiltered passion, he is forced to confront the suffocating monotony of his own life. \nPlayhouse re-imagines the classic through Jung’s lens of ‘Shadow Self’, and makes use of the evocative power of shadow theatre to throw light on the darkness that remains hidden. Alan’s intense passion and obsession with horses becomes a powerful metaphor for humanity’s most profound extremes—what we suppress, what we idolize, and what ultimately defines our very existence. \nCrafted by Peter Shaffer \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/equus/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Equus"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-831.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "73893-1748113200-1748118600@bangaloreinternationalcentre.org",
    "name": "Velvet & Vinyl",
    "startDate": "2025-05-24T19:00:00+05:30",
    "endDate": "2025-05-24T20:30:00+05:30",
    "description": "Velvet & Vinyl is a curated musical journey through themes of love, longing, and quiet introspection — a heartfelt tribute to legendary women in jazz, pop, and blues whose voices have shaped cultural memory across generations. Blending storytelling with original compositions, the performance traces an emotional thread from Billie Holiday to Amy Winehouse, from Ella Fitzgerald to Etta James, and from Aretha Franklin to Adele — artists who have each echoed, challenged, or redefined the female experience through their music. \nAs a voice-and-guitar duo, this concert offers an intimate listening experience — a space where melody meets memory, and where personal truth is held in conversation with history and genre. Original songs are interwoven throughout the set, offering a contemporary and deeply personal reflection on the same themes. \nAct / Theme Songs Program: \nAct I – Love \n1. At Last – Etta James\nAn iconic celebration of love and all it took to get there, a milestone in jazz vocal history. \n2. Blue Skies – Ella Fitzgerald\nA hopeful melody tinged with melancholy — love as something fleeting and fragile. \n3. Dream a Little Dream of Me – Doris Day\nEarly pop-jazz charm; sweet, sentimental, and quietly profound. \n4. Valentine – Laufey\nA modern take on timeless romantic longing, blending classical elegance with jazz softness. \n5. Used to You – Original Song (Unreleased)\nA personal reflection on consuming love — “taking up space in terabytes” in one’s mind. \nAct II – Heartbreak \n6. Back to Black – Amy Winehouse\nGritty and honest; heartbreak laced with soul, blues, and unfiltered emotion. \n7. Someone Like You – Adele\nA stripped-back ballad capturing the ache of goodbye and the grace of acceptance. \n8. Fire in the Cold – Original Song\nA haunting confrontation with emotional imbalance — where pain feels safer than solitude. \nAct III – Longing \n9. Misty – Sarah Vaughan\nElegant and vulnerable — a portrait of emotional confusion and surrender. \n10. It Ain’t No Way – Aretha Franklin\nLonging meets powerlessness in this soulful plea for love and recognition. \n11. Blueprints – Original Song\nA restless search for closure, echoing the desire to fill the space someone else once held. \nAct IV – Clarity / Defiance \n12. You Don’t Own Me – Lesley Gore\nA bold, early voice of independence in pop — refusing to be defined by others. \n13. Bust Your Windows – Jazmine Sullivan\nMessy and fierce — a cathartic act of revenge, reframing heartbreak as power. \n14. Society – Original Song\nA powerful moment of self-assertion. This song challenges societal expectations and reclaims personal identity. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/velvet-vinyl/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Velvet & Vinyl"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-836.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "74148-1748197800-1748203200@bangaloreinternationalcentre.org",
    "name": "Garam Roti",
    "startDate": "2025-05-25T18:30:00+05:30",
    "endDate": "2025-05-25T20:00:00+05:30",
    "description": "Language: English, Tamil & Hindi \nDurga and Lakshmi, two artists – one a human, the other a sentient stereo player set out for a performance of fears – to rant her truth and perform the dare. Durga asks herself what epitomizes ‘a woman’, finally landing on the idea of a ‘Garam Roti’- the humble Indian flatbread.  \nWhat starts as a personal reflection on the matter, culminates into an exercise of communal listening to rants (recordings) of women from across India. The play moves through borders of fiction into the non-fiction realm with the ‘Garam Roti Library’- an audio collection of women sharing their anecdotes, thoughts on tradition, labour and revolution. \nCredits:\nProduced by Playhouse Productions\nWriter, Director, Performer: Durga Venkatesan\nExecutive Producer: Sukrit Mahajan\nProduction: Meghna Manglani, Nikhil Bansal & Varad Salvekar\nSound: Nikhil Bansal\nProjection: Sukrit Mahajan\nLights Design: Surya Saathi\nSound Design & Edit: Pause.Dxa, Nikhil Bansal\nSound Dubbing: Rohan Kanwar\nVoice of Lakshmi: Durga Venkatesan\nSet & Publicity Design: Devika Saxena\nWelcome Kit Design: Rama Shivakumar\nArtistic Consultation: Mohammed Ellyas Lehry\nThe project was developed at Rangamadu in collaboration with Namkampani. \nThe Garam Roti Library has been developed with recordings of women from across India. The project extends gratitude to the women who contributed their voices to the library. The current recordings have been carried out by Durga Venkatesan, Meghna Manglani, Nikhil Bansal & Saran Vashisht. \nThe stereo played is a contribution by Anusha Mehra & family. \nThe album covers have been designed using Midjourney (AI platform) Courtesy – Havish \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/garam-roti/",
    "keywords": [
      "Food",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Garam Roti"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-842.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "74092-1747584000-1747591200@bangaloreinternationalcentre.org",
    "name": "Save the Drama",
    "startDate": "2025-05-18T16:00:00+05:30",
    "endDate": "2025-05-18T18:00:00+05:30",
    "description": "The experience of theatre is dynamic; plays are meant to be read and heard as much as they are performed and imbibed. \nCome, participate in the BIC’s dramatised reading of Mahesh Dattani’s On a Muggy Night in Mumbai. \nOn a Muggy Night in Mumbai is the first contemporary Indian play to openly tackle gay themes of love, partnership, trust and betrayal. Kamlesh—young, gay and clinically depressed—invites his friends home ostensibly for an evening of camaraderie. However, with the arrival of his sister and her fiancé, a series of dramatic confrontations is set into motion, leading to startling revelations and unexpected catharsis. \nThis session will be structured as a cold and dramatic group reading carried by participants and facilitated by Samragni Dasgupta and the BIC team. \nPlease note: This is an interactive participatory event designed for a small group of people. Please RSVP only if you can make it to the event and make sure to bring along a device you can comfortably read the play on! \n",
    "url": "https://bangaloreinternationalcentre.org/event/save-the-drama-4/",
    "keywords": [
      "Theatre",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-4-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "73888-1747566000-1747571400@bangaloreinternationalcentre.org",
    "name": "Sitar for Soul",
    "startDate": "2025-05-18T11:00:00+05:30",
    "endDate": "2025-05-18T12:30:00+05:30",
    "description": "The traditional form of sitar performance is the solo sitar recital, typically accompanied by the tabla. In this setting, the sitar is used to explore and express the depth of North Indian classical ragas, while the tabla provides rhythmic support, showcasing the intricate patterns and cycles that are fundamental to the music. \nOne of the most distinguished styles of sitar playing is the Jafferkhani Baaj, innovated by Padma Bhushan Ustad Abdul Halim Jaffer Khan. This style is known for its bold, structured, and rhythmically dynamic approach, combining the precision of been-baaj. Jafferkhani Baaj emphasizes powerful right-hand techniques, intricate rhythmic phrasing, and clear melodic articulation, offering a unique balance of melody and rhythm that makes it both intellectually profound and aesthetically captivating. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sitar-for-soul/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sitar for Soul"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-839.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "73782-1747854000-1747858500@bangaloreinternationalcentre.org",
    "name": "Bag Dancing",
    "startDate": "2025-05-21T19:00:00+05:30",
    "endDate": "2025-05-21T20:15:00+05:30",
    "description": "Bag Dancing, written by Mike Kenny, one of England’s foremost playwrights for young audiences, is directed by Ujwala Rao and produced by Butai. The cast features acclaimed Kannada and English theatre artists B V Shrunga and Surabhi J Herur. \nThe play poignantly follows Imelda, a homeless woman who carries her life’s memories and stories in bags. Neville, a young worker at a homeless shelter, guards his emotions, burdened by his own past. As their unexpected friendship blossoms, they begin to share their stories, creating a meaningful bond between them. \nDirector’s Note: \nBag Dancing is a play that has drawn me in repeatedly. What continues to captivate me is how playwright Mike Kenny thoughtfully and playfully explores powerful themes such as war, displacement, and the intersection of mental health and authority—particularly through a lens that resonates with children and young audiences. \nDuring the creative process, I’ve found the exploration of boxes and borders especially intriguing—who defines them, who decides their importance, and how we navigate the spaces they limit. \nThis play presents a unique opportunity for families and schools to engage in meaningful conversations with children, sparking discussions about complex topics that might otherwise seem too difficult or uncomfortable to address. \nI hope Bag Dancing fosters reflection, curiosity, and open dialogue. \nCredits: \nProduction Assistant: Rachana R\nChoreography: Asha Basavaraj \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/bag-dancing/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Bag Dancing"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-840.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74137-1747852200-1747857600@bangaloreinternationalcentre.org",
    "name": "Uniformity or Justice?",
    "startDate": "2025-05-21T18:30:00+05:30",
    "endDate": "2025-05-21T20:00:00+05:30",
    "description": "The Uniform Civil Code (UCC) has long been at the heart of India’s constitutional and cultural tensions — hailed by some as a promise of equality, and critiqued by others as a tool of homogenisation. As the political momentum around the UCC gathers pace once again, with the recent Uttarakhand legislation in the news, this session revisits the debate from a constitutional, feminist, and social justice lens. \nWhat does “uniformity” mean in a deeply plural society? Can equality be achieved without erasing difference? How do we center the lived realities of women, religious minorities, Dalits, and Adivasis in this conversation? \nA moderated discussion with the panelists will be followed by a Q&A with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/uniformity-or-justice/",
    "keywords": [
      "History",
      "Law",
      "Policy & Regulation"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-844.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73774-1747767600-1747771200@bangaloreinternationalcentre.org",
    "name": "Mānushī – On a Quest",
    "startDate": "2025-05-20T19:00:00+05:30",
    "endDate": "2025-05-20T20:00:00+05:30",
    "description": "Mānushī – On a Quest traces the spiritual and emotional journeys of four extraordinary women: the elusive River Saraswathi, the devoted Meerabai, the yearning mother Devaki, and the mystic poet Akka Mahadevi. Rooted in literature, poetry, and deep personal exploration, this Bharatanatyam solo presentation is the culmination of over two years of immersive research and creative engagement. \nThe performance opens with the mystical tale of Saraswathi, inspired by the book The Lost River, exploring whether the river still flows—physically and spiritually. We then journey with Meerabai, who seeks her beloved Krishna through soulful bhajans marked by longing, devotion, and unanswered questions. Devaki’s poignant voice follows, reflecting on the joys of motherhood she never fully experienced and her yearning to reclaim lost moments with her son, Krishna. The production concludes with Akka Mahadevi, whose powerful Vachanas guide us on a quest for liberation, echoing the eternal human desire for union and truth. \nEach piece is supported by evocative compositions, guided by literary scholars, and brought to life through thoughtful choreography. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/manushi-on-a-quest/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-827.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "74077-1748631600-1748637000@bangaloreinternationalcentre.org",
    "name": "Bhava Vrindavan",
    "startDate": "2025-05-30T19:00:00+05:30",
    "endDate": "2025-05-30T20:30:00+05:30",
    "description": "The bansuri is known for its beautiful deep meditative tone and its ability to convey a wide range of emotions .Raga- Improvisation Flute solo is based on a specific raga, which is a melodic framework in Indian classical music, defining the notes, scales, and emotional effect of that raga. A significant portion of the solo involves improvisation, allowing the musician to explore the raga’s potential and express their creativity along with rhythm here. The flute player’s breath control is very important for producing the characteristic sound and achieving the desired musical effects. Tabla is the main rhythm accompanying instrument for hindustani vocal as well as instruments. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/bhava-vrindavan/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Bhava Vrindavan"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-841.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74191-1748370600-1748548800@bangaloreinternationalcentre.org",
    "name": "Where the Sky Meets the Himalayas",
    "startDate": "2025-05-27T18:30:00+05:30",
    "endDate": "2025-05-29T20:00:00+05:30",
    "description": "A three-day festival of voices, images, and memories from Tibet, Where the Sky Meets the Himalayas invites audiences into the lived experience of a people shaped by exile, resilience, and enduring cultural identity. Through conversations, film, performance, visual art, and cuisine, the festival explores how Tibetans continue to tell their stories—across borders and generations. \nFeaturing writers, artists, performers, and community voices from Bangalore and beyond, the festival is a tribute to the strength of a culture that survives in song, ritual, memory, and the written word. \nProgram Schedule \nMay 27 | Tuesday | 6:30pm\nBelonging and Unbelonging | Understanding Tibetan Life in Exile\nThis conversation between writer and journalist Tsering Namgyal Khortsa and educator Ngawang Gyatso will explore themes of exile, identity, memory, and belonging within the Tibetan diaspora. Focusing on the lived experience of Tibetans beyond the spiritual lens often associated with their narrative, the session will examine how literature becomes a space for cultural preservation, political reflection, and personal inquiry. \nMay 28 | Wednesday | 6:30pm\nTibet in Song | The Struggle to Save Tibet’s Musical Soul\nTibet in Song follows Ngawang Choepel, a Tibetan exile who risks everything to preserve his homeland’s endangered folk music. \nMay 29 | Thursday | 6:30pm\nEchoes Across the Plateau | Performances from Tibet \n",
    "url": "https://bangaloreinternationalcentre.org/event/where-the-sky-meets-the-himalayas/",
    "keywords": [
      "Culture",
      "Fiction",
      "Film",
      "Food",
      "Heritage",
      "Nonfiction",
      "Performing Arts",
      "Philosophy",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-845.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "74220-1748196000-1748201400@bangaloreinternationalcentre.org",
    "name": "EMIs & Other Existential Crises",
    "startDate": "2025-05-25T18:00:00+05:30",
    "endDate": "2025-05-25T19:30:00+05:30",
    "description": "In this refreshingly jargon-free session, Lavanya Mohan, author of Money Doesn’t Grow on Trees, gets real about why personal finance often feels confusing, boring, or just plain overwhelming. \nFrom spending in your 20s to planning in your 40s, Lavanya’s approach is simple, meme-filled, and judgment-free. Whether you’re dealing with your first paycheck, lifestyle creep, or just trying to adult responsibly, this conversation covers how to spend smarter at every life stage—without spreadsheets or guilt. \nLavanya will be in conversation with Dipika Jaikishan, Co-Founder and COO of Basis, a platform focused on financial independence for women. Together, with their understanding of how financial literacy intersects with everyday life, especially for younger and often overwhelmed audiences, Lavanya and Dipika bring both insight and clarity to a conversation that promises to be as useful as it is fun. \nExpect memes, pop culture references, stories from the book, and zero jargon. Just real talk about money—how we use it, why we fear it, and how to make it work for us. \n",
    "url": "https://bangaloreinternationalcentre.org/event/emis-other-existential-crises/",
    "keywords": [
      "Books",
      "Economics",
      "Gender",
      "Nonfiction",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-846.jpg"
  }
]