[
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Wet Histories",
    "startDate": "2024-05-30T18:30:00+05:30",
    "endDate": "2024-05-30T19:45:00+05:30",
    "description": "Consisting of a complex of hazardous port-related industries and marginalised populations, Mumbai’s east coast was first produced as a site for furthering British imperial designs and later Indian nationalist ambitions. More recent government interventions seek to (re)value this industrial landscape through new infrastructure that prioritises marine logistics, real estate development and ecotourism.  \nBoth these imaginaries of the east coast are founded on capitalist projects of land reclamation that ‘forget’ its watery history. They also cast aside those who inhabit the coast differently, such as the indigenous fishing community of Kolis. Yet numerous fishing villages of the Kolis hug the city’s coast, revealing older, now forgotten, traditions of inhabitation based on ‘living amidst wetness’. \nThis talk foregrounds their stories to help recover worlds that relate to the movement, relations and knowledge mediated by water as opposed to land, pollution and propertied ownership. Dwelling in these wet stories might urge new dialogues and public action to address current environmental crises and reclaim other ways of being for Coast and City. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/wet-histories/",
    "keywords": "Cities, Climate Change, Development, Environment, Sustainability",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-478.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Bretton Woods at 80",
    "startDate": "2024-06-01T18:30:00+05:30",
    "endDate": "2024-06-01T20:00:00+05:30",
    "description": "Shortly after D-Day, John Maynard Keynes and his colleagues sailed to New York on a secret mission. Accompanying them was a small delegation from India. It included a future finance minister, RBI governor, and a director of Tata sons. Keynes and his co-passengers were headed to the United Nations Monetary Conference convened by President Roosevelt at Bretton Woods – a hill station in New Hampshire – in July 1944. \nAt that conference, forty-four countries including India pledged to reconstruct a war-ravaged world, sustain peace, and promote economic development. To do so, they created the International Monetary Fund and The World Bank. Although it was not fully independent, India played a critical role at the conference. It later became a founding member of both international financial institutions \nJoin us as we explore through rare photographs, oral histories and recently declassified documents the personalities and events involved in this important moment in world history. This talk by Vikram Raghavan will be followed by a Q&A session with the audience. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/bretton-woods-at-80/",
    "keywords": "Economics, History, Policy & Regulation",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-29.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "Bangalore 1974",
    "startDate": "2024-05-29T19:00:00+05:30",
    "endDate": "2024-05-29T20:30:00+05:30",
    "description": "For ‘Bangalore 1974’, Konarak Reddy will perform a range of music from the 17th century to the present, which takes the audience through a meditative experience, while telling the musical story of Bangalore. You can expect to hear the stories behind Brahms‘ Lullaby, Handel’s Presto in D minor, and Konarak’s Prelude in A that leads into ‘Somewhere Over the Rainbow’ by Harold Arlen, while listening to him playing them. You will hear about old music teachers of Bangalore like Marion Fewkes and Mr. Lumas, about a certain Nadaswaram player on Cavalry Road, about the Music Strip in Cubbon Park. You will also be privy to Konarak’s own compositions that span the range of his experiences, growing up in Bangalore, playing at venues like Rex Theatre and RSI, listening to bands at 3 Aces, being arrested during the Emergency at 58 St.Mark’s Road, reading Sri Aurobindo – personal experiences of a certain period of time in Bangalore, interpreted through music.  \nThis concert is part of a series of solo guitar concerts initiated to celebrate 50 years of Konarak Reddy’s music. Each concert is uniquely conceptualised, with a special set list. \nIn collaboration with: \n \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/bangalore-1974/",
    "keywords": "Culture*, History, Music, Performing Arts",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Bangalore 1974"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnailnewkkl.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Shelf Shuffle",
    "startDate": "2024-05-26T17:00:00+05:30",
    "endDate": "2024-05-26T18:30:00+05:30",
    "description": "Got a favorite book you’re dying to share? \nWrap it in paper, mystery and bring it along! You’ll get to talk about it to a group of fellow book lovers, meet enthusiastic readers, share and receive recommendations and walk away with an exciting new read. \nJoin us in a cozy setting to get clued in on what the rest of Bangalore is reading and browse a special selection of books at the BIC library. \nPlease note: This fun, interactive event is for a small group of about 20 people. Bring a physical book to join in. No book, no entry! \nThis event is a part of BIC’s Programmes at the Library. \nBIC Library Programmes are designed to mould the library into a community-centered reading space. Our primary goal is to curate sessions that cater to the diverse interests and ages within our library community. Through this programming we wish for the library to become a dynamic space that goes beyond traditional book-related activities. \nWe also aim to provide a platform for members of the community to sometimes host these events we curate. If you have event ideas that align with our vision, please reach out to us at collab@bangaloreinternationalcentre.org \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/shelf-shuffle/",
    "keywords": "Books, Language, Literature",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-42.png"
  },
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "Cyclotron",
    "startDate": "2024-05-25T18:30:00+05:30",
    "endDate": "2024-05-25T20:15:00+05:30",
    "description": "English, Punjabi and Hindi, with English Subtitles | 2020 | 59 minutes \nDirector and Producer: Jahnavi Phalkey\nEditor: Tanya Singh \nCyclotron is a film about the world’s oldest functional particle accelerator and the people who keep it running today. \nOperational in 1936 at the University of Rochester, United States, it was built merely three years after the very first cyclotron was built by Ernest Lawrence at Berkeley. The entire set-up in Rochester was dismantled and sent to India in 1967, and is now housed at the Panjab University, Chandigarh. With the cyclotron, the regional university became one of the very few places in India for research and education in nuclear physics. This was otherwise possible only in the facilities of the Department of Atomic Energy. The cyclotron has been running for nearly fifty years in Chandigarh. \nThe film explores the life and legacy of the machine as well as the struggles and triumphs of its technicians, researchers and students. It is a comment on the state of experimental research and higher education in Indian universities. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe film first premiered online at BIC during the pandemic, and now we’re excited to have a real screening. The screening will be followed by a discussion with Director and Producer, Jahnavi Phalkey and Science Communicator, Thomas Abraham. A Q&A with the audience will follow. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/cyclotron-2/",
    "keywords": "Education, Film, Science, Technology",
    "inLanguage": "pa",
    "workPresented": {
      "@type": "Movie",
      "name": "Cyclotron"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_1_POSTER.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "Tyagaraja's Musical Garland",
    "startDate": "2024-05-26T11:30:00+05:30",
    "endDate": "2024-05-26T13:00:00+05:30",
    "description": "Saint Tyagaraja, the prolific eighteenth century composer is most well known for his mastery in interweaving lyric and music. Hidden amongst his many compositions, however, are songs composed in celebration of the essential tenets of Sangita – swara, raga, nada (sound), laya (rhythm) and sangita itself. \nHe summarises that the knowledge of sangita, laced with the nine rasas (emotions)  is a transcendental experience and equivalent of a union with God. He also exclaims that the Gods themselves are effulgent because of the worship of the element, ‘Nada’. To him, Lord Shiva is the embodiment of Nada itself. Tyagaraja was a fervent devotee of Lord Rama and to him, his beloved Rama would be resplendent in a garland of ragas.  \nJoin Carnatic vocalist Aishwarya Vidhya Raghunath as she takes us through a garland of compositions adorning music itself! \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/tyagarajas-musical-garland/",
    "keywords": "Faith, Music, Performing Arts",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Tyagaraja's Musical Garland"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-_POSTER.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "Guitar Waali Baithak",
    "startDate": "2024-05-24T19:00:00+05:30",
    "endDate": "2024-05-24T20:30:00+05:30",
    "description": "Guitar Waali Baithak is a concept that combines Indian Classical Music with the electric guitar in an intimate setting. Unlike more formal concerts held for large audiences, a baithak brings together artists and listeners in relatively close quarters. This allows for direct interaction between the artist and the audience, fostering a deeper understanding and appreciation of the art form. \nBaithaks are vital in preserving the essence of Indian classical music, and this modern take infuses it with the vibrant sounds of the electric guitar, revitalising the age-old tradition with contemporary flair. \nIn Guitar Waali Baithak, Aniket Gundewar performs Hindustani Classical Music in the traditional style on the Electric Guitar. The performance commences with soulful Alaap, intricate Jod, and rhythmic Jhala on the Electric Guitar. These melodic explorations set the stage, allowing the raga’s essence to unfold. As Anand HS joins on tabla, the performance transitions into a composition in Vilambit Tala (slow tempo). The tempo gradually accelerates with 2-3 compositions in Drut Tala (medium-fast tempo). \nAt the exhilarating Ati Drut tempo, Aniket and Anand engage in a musical dialogue – a Sawaal Jawab between the Electric Guitar and Tabla. The recital reaches its zenith with a Chakradhaar Tihaai—a rhythmic pattern that circles back seamlessly. Transitioning into a semi-classical mode, Aniket and Anand explore the emotional nuances of Semi-Classical Dhun (Second Raga) concluding the performance with Raga Bhairavi. \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/guitar-waali-baithak/",
    "keywords": "Music, Performing Arts",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Guitar Waali Baithak"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-479.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "ನಾಟ್ಯದೇವಚರಿತೆ | Natyadevacharite",
    "startDate": "2024-05-28T19:00:00+05:30",
    "endDate": "2024-05-28T20:15:00+05:30",
    "description": "Kannada | 75 mins | Suitable for Ages 8+ \n‘ನಾಟ್ಯದೇವಚರಿತೆ’ ನಾಟಕದ ಕಥಾವಸ್ತುವು ಹಾಸ್ಯ ಮತ್ತು ವಿಡಂಬನೆಯ ಮಿಶ್ರಣದಿಂದ ಕೂಡಿದೆ. ನಾಟಕವು ಶ್ರೀಮಂತ ವ್ಯಕ್ತಿಯೊಬ್ಬನ ಕುಟುಂಬದ ಸುತ್ತ ಸುತ್ತುತ್ತದೆ. ಆ ಶ್ರೀಮಂತನು ಧಾರ್ಮಿಕತೆಯ ಬೂಟಾಟಿಕೆಯನ್ನು ಪ್ರದರ್ಶಿಸುವ ಒಬ್ಬ ನಕಲಿ ಗುರುವಿನ ತಂತ್ರಕ್ಕೆ ಮಾರುಹೊಗುತ್ತಾನೆ. ಕಳ್ಳ ಗುರುವು ಶ್ರೀಮಂತ ವ್ಯಕ್ತಿಯ ಪ್ರಶ್ನಾತೀತ ಅನುಸರಣೆಯ ಲಾಭವನ್ನು ಪಡೆಯುತ್ತಾನೆ. ಇದರಿಂದ ಬೇಸೆತ್ತ ಕುಟುಂಬವು ಉಪಾಯವಾದ ಯೋಜನೆಯನ್ನು ರೂಪಿಸುವಲ್ಲಿ ತೊಡಗುತ್ತದೆ. ಈ ಯೋಜಬೆಯ ಬಲೆಯಲ್ಲಿ ಕಪಟ ಗುರುವು ಸಿಕ್ಕಿಬೀಳಿತ್ತಾನೆಯೇ ಎಂಬ ಕಾತುರತೆಯನ್ನು ಈ ಪ್ರಸ್ತುತಿಯು ಪ್ರೇಕ್ಷಕರಲ್ಲಿ ಉಂಟುಮಾಡುತ್ತದೆ. ನಾಟಕವು ಮುಖ್ಯ ವಿಷಯವಾದ ಧಾರ್ಮಿಕ ನಡವಳಿಕೆಯಲ್ಲಿನ ಅಪ್ರಾಮಾಣಿಕತೆ, ತಪ್ಪು ಜನರನ್ನು ನಂಬುವ ಅಪಾಯಗಳು ಮತ್ತು ಯಾರನ್ನಾದರೂ ಕುರುಡಾಗಿ ಅನುಸರಿಸುವುದನ್ನು ಹಾಸ್ಯದ ಲೇಪನದಲ್ಲಿ ತೋರಿಸುತ್ತದೆ. ಹಾಸ್ಯ ಮತ್ತು ವಿಡಂಬನೆಯ ಮೂಲಕ, `ನಾಟ್ಯದೇವಚರಿತೆ~ ಕುರುಡು ನಂಬಿಕೆಯ ಪರಿಣಾಮಗಳನ್ನು ಮತ್ತು ಧಾರ್ಮಿಕ ಬೂಟಾಟಿಕೆಗಳ ಹಾಸ್ಯಮಯ ಅಂಶಗಳನ್ನು ಬಿಚ್ಚಿಡುತ್ತದೆ. \nThe play ‘Natyadevacharite,’ revolves around a rich man who becomes vulnerable to a fake imposter guru pretending to be pious and religious. The plot unfolds through a mix of comedy and drama, revealing the guru’s insincerity. The guru takes advantage of the wealthy man`s unquestioning admiration. As the family plots a smart plan, the audience is invited to watch the unfolding events, wondering if the imposter will be caught. The main theme humorously explores the dishonesty in religious behavior, the risks of trusting the wrong people, and the outcomes of blindly following someone, all presented in a satirical manner. The play aims to entertain while shedding light on the dangers of blindly trusting those who manipulate religious appearances for personal gain. Through its mix of comedy and drama, ‘Natydevacharite’ unfolds a tale that prompts the audience to reflect on the consequences of misplaced trust and the humorous aspects of religious hypocrisy. \nAbout the Team \nSanchaya is a theatre group which has made a name for itself in the art and culture circles of Bangalore. Established in 1988, Sanchaya was the dream child of G. S. Rama Rao, a teacher at MES High School, Jayanagar, Bangalore. Fondly called GSR by Sanchayans, he envisioned the role of art and culture in moulding human personalities, and brought together his students to form a troupe. Aptly named Sanchaya (meaning “Coming together of”), it was intended to be a melting pot of drama, literature, and creativity. The team started out by putting together plays by the then students and now, founding members. The very first play “Vallabhapuriya Dantakathe” set the beginning for the wonderful journey that is in its 33rd year now. Many plays followed and with it, the transformation of the troupe from a student-centered group to a professionally managed popular theatre team. Today we have a repertoire of more than 40 plays. Along the way, we have had gratifying achievements that make us proud. We have reached theatre lovers across many cities in India. We have performed at “Bharat Rang Mahotsav” hosted by National School of Drama, New Delhi. The play “Pratibimbagalu” garnered wide critical acclaim for the multi-dimensional portrayal of a classic play. We have also organized many Theatre Festivals to provide a platform for young amateur teams to showcase their plays. With the vision of bringing all the theatre teams of Bangalore together, we organized a flagship event called “Ranga-Ugadi”. We call these endeavors “Enriching Theatre Brotherhood”. Not restricting our vista to plays alone, we have been organizing musical events as well. Sanchaya’s directorial repertoire includes prominent theatre artists like C.G. Krishnamurthy, R. Nagesh, S. Surendranath, Suresh Anagalli, Krishnamurthy Kavathar, S. K. Madhava Rao, Abbur Jayatheertha, Kathlu Satya, Iqbal Ahmed, Joseph John, Shashidhar Barighat, among others. It has groomed many artists who have become famous film and TV actors, producers, and directors today. We are also very proud of having enticed a whole new generation of youngsters towards theatre, keeping with the true spirit of GSR. Our theatre family, as we like to call it, has grown to include more than 200 members. \nಬೆಂಗಳೂರಿನ ಕಲಾ ಪ್ರಪಂಚದಲ್ಲಿ ಸಂಚಯ ತಂಡ ತನ್ನದೇ ಆದ ಛಾಪನ್ನು ಮೂಡಿಸಿದೆ. 1988ರಲ್ಲಿ ಸ್ಥಾಪನೆಯಾದ ಸಂಚಯ, ಎಂ.ಇ.ಎಸ್ ಪ್ರೌಢಶಾಲೆಯ ಶಿಕ್ಷಕರಾದ ಜಿ.ಎಸ್.ರಾಮರಾವ್ ಅವರ ಕನಸಿನ ಕೂಸು. ಜಿ.ಎಸ್.ಆರ್ ಮಾನವ ವ್ಯಕ್ತಿತ್ವವನ್ನು ರೂಪಿಸುವಲ್ಲಿ ಕಲೆ ಮತ್ತು ಸಂಸ್ಕೃತಿಯ ಪಾತ್ರವನ್ನು ಕಲ್ಪಿಸಿಕೊಂಡವರು. ಇದಕ್ಕಾಗಿ ಅವರು ತಮ್ಮ ವಿದ್ಯಾರ್ಥಿಗಳನ್ನು ಒಟ್ಟುಗೂಡಿಸಿ ತಂಡವನ್ನು ರಚಿಸಿದರು. ಸಂಚಯ (ಅಂದರೆ “ಒಟ್ಟುಗೂಡಿಸುವುದು”)ಎಂಬುದಾಗಿ ಸೂಕ್ತವಾಗಿ ಹೆಸರಿಸಲಾದ ಈ ತಂಡವು ನಾಟಕ, ಸಾಹಿತ್ಯ ಮುಂತಾದ ಹಲವು ಸೃಜನಶೀಲ ಕಲೆಗಳ ಸಮ್ಮಿಳನದ ಉದ್ದೇಶವನ್ನು ಹೊಂದಿದೆ. ಈ ತಂಡವು ಅಂದಿನಿಂದ ಇಂದಿನವರೆಗೆ ನಿರಂತರವಾಗಿ ನಾಟಕಗಳನ್ನು ಪ್ರದರ್ಶಿಸುತ್ತಾ ಬಂದಿದೆ. \n“ವಲ್ಲಭಪುರಿಯ ದಂತಕಥೆ”ಎಂಬ ನಾಟಕದಿಂದ ಅದ್ಭುತ ರಂಗಪಯಣಕ್ಕೆ ನಾಂದಿ ಹಾಡಿದ ನಮ್ಮ ತಂಡ ಈಗ್ಗೆ ಮೂರು ದಶಕಗಳನ್ನು ಕಂಡಿದೆ. ತಂಡವು ವಿದ್ಯಾರ್ಥಿ-ಕೇಂದ್ರಿತ ಗುಂಪಿನಿಂದ ವೃತ್ತಿಪರವಾಗಿ ನಿರ್ವಹಿಸಲ್ಪಡುವ ಜನಪ್ರಿಯ ನಾಟಕ ತಂಡವಾಗಿ ರೂಪಾಂತರಗೊಂಡಿದೆ. ಇಂದು ನಮ್ಮಲ್ಲಿ 40ಕ್ಕೂ ಹೆಚ್ಚು ನಾಟಕಗಳ ಸಂಗ್ರಹವಿದೆ. \nಸಂಚಯ ತಂಡವು ಭಾರತದ ಅನೇಕ ನಗರಗಳಲ್ಲಿ ರಂಗಭೂಮಿ ಪ್ರೇಮಿಗಳನ್ನು ತಲುಪಿದೆ. ನವದೆಹಲಿಯ ನ್ಯಾಷನಲ್ ಸ್ಕೂಲ್ ಆಫ್ ಡ್ರಾಮಾ ಆಯೋಜಿಸಿದ “ಭಾರತ್ ರಂಗ್ ಮಹೋತ್ಸವ”ದಲ್ಲಿ “ಪ್ರತಿಬಿಂಬಗಳು” ನಾಟಕವನ್ನು ಪ್ರದರ್ಶಿಸಿದ್ದೇವೆ. ಶಾಸ್ತ್ರೀಯ ನಾಟಕದ ಬಹು ಆಯಾಮದ ಚಿತ್ರಣಕ್ಕಾಗಿ ಈ ನಾಟಕವು ವಿಮರ್ಶಕರ ಮೆಚ್ಚುಗೆಯನ್ನು ಗಳಿಸಿತು. ರಾಜ್ಯದ ಇತರ ಹವ್ಯಾಸಿ ತಂಡಗಳಿಗೆ ಅವರ ನಾಟಕಗಳ ಪ್ರದಶನಕ್ಕಾಗಿ ವೇದಿಕೆಯನ್ನು ಒದಗಿಸುವ ಹಲವು ನಾಟಕೋತ್ಸವಗಳನ್ನು ಆಯೋಜಿಸಿದ್ದೇವೆ. ಬೆಂಗಳೂರಿನ ಎಲ್ಲಾ ನಾಟಕ ತಂಡಗಳನ್ನು ಒಂದೇ ವೇದಿಕೆಗೆ ತರುವ ಉದ್ದೇಶದಿಂದ “ರಂಗ-ಯುಗಾದಿ” ಎಂಬ ಕಾರ್ಯಕ್ರಮವನ್ನು ಆಯೋಜಿಸಿದ್ದೇವೆ. ನಮ್ಮ ಚಟುವಟಿಕೆಗಳನ್ನು ನಾಟಕ ಪ್ರದರ್ಶನಗಳಿಗಷ್ಟೇ ಸೀಮಿತಗೊಳಿಸದೆ, ಹಲವಾರು ಸಾಹಿತ್ಯ, ಸಂಗೀತ ಕಾರ್ಯಕ್ರಮಗಳನ್ನೂ ಆಯೋಜಿಸಿದ್ದೇವೆ. \nಕನ್ನಡ ರಂಗಭೂಮಿಯಲ್ಲಿ ಪ್ರಮುಖ ನಿರ್ದೇಶಕರಾದ ಸಿ.ಜಿ. ಕೃಷ್ಣಮೂರ್ತಿ, ಆರ್.ನಾಗೇಶ್, ಎಸ್.ಸುರೇಂದ್ರನಾಥ್, ಸುರೇಶ್ ಆನಗಳ್ಳಿ, ಕೃಷ್ಣಮೂರ್ತಿ ಕವತಾರ್, ಎಸ್.ಕೆ.ಮಾಧವ ರಾವ್, ಅಬ್ಬೂರು ಜಯತೀರ್ಥ, ಕತ್ಲು ಸತ್ಯ, ಇಕ್ಬಾಲ್ ಅಹಮದ್, ಜೋಸೆಫ್ ಜಾನ್, ಶಶಿಧರ್ ಭಾರಿಘಾಟ್ ಮುಂತಾದವರು ಸಂಚಯಕ್ಕಾಗಿ ನಾಟಕಗಳನ್ನು ನಿರ್ದೇಶಿಸಿದ್ದಾರೆ. ಪ್ರಸಿದ್ಧ ಚಲನಚಿತ್ರ ಮತ್ತು ಟಿವಿ ನಟರು, ನಿರ್ಮಾಪಕರು ಮತ್ತು ನಿರ್ದೇಶಕರಾದ ಅನೇಕ ಕಲಾವಿದರನ್ನು ಇಂದು ಸಂಚಯ ಅಲಂಕರಿಸಿದೆ. ಜಿ.ಎಸ್.ಆರ್ ಅವರ ನಿಜವಾದ ಸ್ಪೂರ್ತಿಯನ್ನು ಇಟ್ಟುಕೊಂಡು ಹೊಸ ಪೀಳಿಗೆಯ ಯುವಕರನ್ನು ರಂಗಭೂಮಿಯತ್ತ ಆಕರ್ಷಿಸಿದ್ದಕ್ಕಾಗಿ ನಾವು ತುಂಬಾ ಹೆಮ್ಮೆಪಡುತ್ತೇವೆ. ನಮ್ಮ ರಂಗಭೂಮಿ ಕುಟುಂಬ 200ಕ್ಕೂ ಹೆಚ್ಚು ಸದಸ್ಯರನ್ನು ಒಳಗೊಂಡು ಬೆಳೆದಿದೆ. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%a8%e0%b2%be%e0%b2%9f%e0%b2%bf%e0%b2%a6%e0%b3%87%e0%b2%b5%e0%b2%9a%e0%b2%b0%e0%b2%bf%e0%b2%a4%e0%b3%86-natyadevacharite/",
    "keywords": "Performing Arts, Theatre",
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "ನಾಟ್ಯದೇವಚರಿತೆ | Natyadevacharite"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-473.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "A Home in the Constant Flux",
    "startDate": "2024-05-25T00:00:00+00:00",
    "endDate": "2024-05-27T00:00:00+00:00",
    "description": "Exhibition Opening: Saturday, 25th May | 2 pm\nExhibition on show until Sunday, 26th May | 8 pm \nWalkthrough with the Curator: \nSaturday, 25th May | 6 pm – 7 pm\nSunday, 26th May | 12:15 pm – 1:15 pm \nPanel Discussion:\nSunday, 26th May | 11 am – 12 pm \nThe exercise to retrace the intangible memories entwined with tangible objects is what created the research-based series of thirty-six photos A Home in the Constant Flux: A Call to the Verb Memory. The central idea of this photo-series is that during migration of people across geographies, the objects of love and necessity undergo the arduous ordeal, and that these, bearing the patina of age, create a desire to develop an understanding that personal histories are not isolated from the political selves. \nThe technique of cyanotypes, which is used to print the archival maps for A Home in the Constant Flux: A Call to the Verb Memory metamorphoses into a metaphor of capriciousness – endured by refugees. As the cartographic lines, in various shades of blue and white, overlap the digital images of the objects, they gesture at the fluidity of the memory only to find itself resistant to the burden of confinement around the refugees. The aesthetic of distortion – in the form of borders, the viscosity of the blues and whites, and the ballet of letters – epitomises the inevitability of embracing impermanence as one of the few constants in a life on the move. The element of distortion serves as a bridge between abstract and representation to encourage the viewer to navigate and map the photo series in order to question the boundaries of perception. \nThe panel discussion on the second day of the event will delve into the influence of visual representation on refugee narratives, particularly in light of the surge of imagery overpowering the social and print media in recent years. This influx frequently drowns out the individual voices of refugees, maintaining stereotypical visual stereotypes that confine visual language of that of a destitute ‘other’. Furthermore, the conversation will confront the inherent tendency to marginalize migrants through photography, highlighting the disparity between mainstream portrayals and the more empathetic and authentic depictions found in the research-based project A Home in the Constant Flux: A Call to the Verb Memory. \nIn collaboration with:\n \n  \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/a-home-in-the-constant-flux/",
    "keywords": "Heritage, History, Media, Photography, Politics, Visual Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-470.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Sufi Lyrics",
    "startDate": "2024-05-31T18:30:00+05:30",
    "endDate": "2024-05-31T20:00:00+05:30",
    "description": "The poetry of Bullhe Shah (d. 1758) is considered one of the glories of premodern Panjabi literature. Born in Uch, Panjab, in present-day Pakistan, Bullhe Shah drew profoundly upon Sufi mysticism in his writings. His lyrics, famous for their vivid style and outspoken denunciation of artificial religious divisions, have long been held in affection by Hindus, Muslims, and Sikhs, and they continue to win audiences today across national boundaries and in the global Panjabi diaspora. \nThe new translation from Murty Classical Library of India, published by Harvard University Press, in English is presented alongside the Panjabi text, in the Gurmukhi script, re-edited on the basis of the best modern Pakistani and Indian editions. Bullhe Shah’s Sufi Lyrics thus offers the most complete and approachable version of this great poet’s works. \nThis event features Bullhe Shah’s poetry coming to life with a musical performance by Harpreet, accompanied by readings from the book and a narration of Shah’s life story by Soni Wadhwa. \nAbout the Murty Classical Library of India:\nThe Murty Classical Library aims to reintroduce some of the greatest literary works of India, written over the past two millennia, to a new generation of readers. Each volume in the series has been translated into English by world-renowned scholars, and reflect the highest standards of contemporary book design with elegant and newly-commissioned typefaces. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/sufi-lyrics/",
    "keywords": "Books, Literature, Music, Philosophy, Poetry",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-480.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Caste in Modern India",
    "startDate": "2024-05-31T11:00:00+05:30",
    "endDate": "2024-06-02T20:00:00+05:30",
    "description": "Exhibition Opening: Friday, 31 May\nTimings: 11:00 am – 8:00 pm\nExhibition on show until Sunday, 2 June \nWalkthroughs:\nFriday, 31 May | 6:00 pm\nSaturday, 1 June | 11:30 am & 5:30 pm\nSunday, 2 June | 10:45 am \nConversations:\nInaugural Address – Friday, 31 May | 6:45 pm\nPanel Discussion – Sunday, 2 June | 11:30 am \nRailways and postal services were introduced in colonial India in the early 1850s. In due course, these new technologies made long-distance travel and communication widely accessible and affordable. In a parallel development, the introduction of limited representation in legislatures in the 1890s added urgency to tap the potential trans-local identities enumerated in the decennial censuses beginning in 1871-72. \nIn view of these developments, local communities, in particular, castes, tapped new technologies to connect with kindred groups across the country and combine to form pan-Indian communities. Post offices allowed members of these aggregate groupings to correspond with each other, while railways enabled them to meet periodically and devise strategies to capture a share in legislatures, educational institutions and public employment proportionate to their census population. Drawing upon philatelic material covering a century, the exhibition highlights the role of the postal system in this new politics. \nThe exhibition is divided into two broad parts that bring together correspondence and publications of several caste-based community organisations and individuals from across the country and the philatelic output of the post-colonial state. The exhibition has been curated by Vikas Kumar, who teaches economics at Azim Premji University. \nProf Gopal Guru will inaugurate the exhibition and deliver the inaugural address on May 31, 6:45 pm. He will comment on the exhibition and locate its images in the larger politics of visual culture. \nA Panel Discussion with Prof. Satish Deshpande, a distinguished social scientist who has made seminal contributions to our understanding of caste in independent India, Vaishna Roy, Editor-in-Chief, Frontline magazine and Vikas Kumar, Curator of the exhibit, will take place on 2 June, 11:30 am. \nIn collaboration with Azim Premji University, Bangalore \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/caste-in-modern-india/",
    "keywords": "Heritage, History, Visual Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-468.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Rise and Fall of the Vanderbilts",
    "startDate": "2024-06-11T18:30:00+05:30",
    "endDate": "2024-06-11T20:00:00+05:30",
    "description": "Once upon a time, there was a family whose very name connoted wealth. The Vanderbilts had a vast empire built on freight through steamboats and railroads. Over a few generations, the wealth-worth billions in today’s money-had been frittered away and the business itself faded as new options came up in the freight business. Their story remains an enduring example of what happens when business leaders fail to embrace the future and transform. \nBusiness transformation is a dynamic topic that is explored by authors R Gopalakrishnan and Hrishi Bhattacharyya in their book Embrace the Future. A key lesson in the success or failure of such transformations lies in harmonising the art and science of change – the emotional and the rational – and striking the right balance between them. Both in life and in business, a compelling narrative that inspires the organisation is essential for effecting transformation. Equally important is viewing transformation as an ongoing effort integrated into the work culture, rather than solely reacting to crises. \nTheir book resonates with anyone who has encountered change—something prevalent in today’s ever-evolving business landscape. R Gopalakrishnan and Hrishi Bhattacharyya underscore that companies unwilling to adapt are bound to fade away. The authors will share their insight on how it’s imperative to draw lessons from the past, navigate the present, and prepare for the future. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-rise-and-fall-of-the-vanderbilts/",
    "keywords": "Books, Business, Nonfiction",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-428.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Accelerating Expanding Universe",
    "startDate": "2024-05-27T18:30:00+05:30",
    "endDate": "2024-05-27T19:45:00+05:30",
    "description": "Dark energy is the leading candidate for the mechanism that is responsible for causing the cosmological expansion to accelerate. Bharat Ratra will describe the astronomical data which persuade cosmologists that (as yet undetected) dark energy and dark matter are by far the main components of the energy budget of the universe at the present time. He will review how these observations have led to the development of a quantitative “standard” model of cosmology that describes the evolution of the universe from an early epoch of inflation to the complex hierarchy of structure seen today. In this non-technical talk, he will also discuss the basic physics, and the history of ideas, on which this model is based. \nThis lecture is a part of RRI’s Vignyana Kathegalu, a series of popular talks on science. \nIn collaboration with Raman Research Institute, Bangalore. \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-accelerating-expanding-universe/",
    "keywords": "Science",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-462.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "India’s Defence and Security Imperatives",
    "startDate": "2024-06-18T18:30:00+05:30",
    "endDate": "2024-06-18T20:00:00+05:30",
    "description": "In an increasingly complex and dynamic world of Geo-Politics & Geo-Economics, safeguarding India’s national interests involves multifaceted challenges and strategic considerations in the context of the nation’s defence & security. Ambassador Sujan Chinoy, India’s leading defence & security expert will through his talk give an overview and provide a comprehensive understanding of this scenario. \nThis talk will help understand India’s position in the global geopolitical landscape, including regional power dynamics, strategic partnerships, emerging threats and internal and external security challenges, such as terrorism, insurgency, cyber threats, and border tensions. He will also touch upon emerging defence technology and innovation, assessing military capabilities and fostering defence indigenisation in the Indian context. \nThe talk will be followed by a moderated Q&A with the audience. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/indias-defence-and-security-imperatives/",
    "keywords": "Defence & security, International Relations, Politics",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-484.jpg"
  }
]