[
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "83667-1768417200-1768422600@bangaloreinternationalcentre.org",
    "name": "Tapestry of Traditions",
    "startDate": "2026-01-14T19:00:00+05:30",
    "endDate": "2026-01-14T20:30:00+05:30",
    "description": "A simple, resonant idea turned into an immersive, evocative performance. \nLed by vocalist Samarth Nagarkar, this programme looks at khayal as a tradition shaped by centuries of dialogue through devotional song, folk expression, courtly aesthetics, and theatrical imagination. Light, space, and sound work together to draw listeners into the unfolding emotional landscape of the raag. \nMusic endures not by remaining closed, but by absorbing, listening, and transforming. This evening’s performance is a true testament to the trends that have become tradition. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/tapestry-of-traditions/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Tapestry of Traditions"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_ToT-1-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "83687-1768415400-1768420800@bangaloreinternationalcentre.org",
    "name": "Sidis of Gujarat",
    "startDate": "2026-01-14T18:30:00+05:30",
    "endDate": "2026-01-14T20:00:00+05:30",
    "description": "Hidden within Gujarat’s landscape is the living memory of the malunga: a sacred musical bow of the African-Indian Sidi community, whose sound carries histories of migration, faith, and resilience. This event opens a rare window into a niche cultural world in India, where music is not performance alone, but inheritance. Through documentary and dialogue, it introduces the Sidis as Sufi Muslims of the Rifa’i tariqa, rooted in the spiritual lineage of Bava Gor, the fourteenth-century saint from Nubia who journey and settled in India. \nThe evening begins with a screening of The Sidi Malunga Project: Rejuvenating the African Musical Bow in India (2002), by Amy Catlin-Jairazbhoy and Nazir Ali Jairazbhoy: a film that documents not only the malunga’s near-disappearance, but also captures the extraordinary moment of revival that brought elders and youth together to ensure its survival. The screening is followed by a presentation of the newly formed Sidi Culture and Heritage Trust, outlining ongoing efforts to sustain Sidi musical, spiritual, and cultural life. \n\n\n\n\n\n\n\n\nA rare window into a living, resilient culture: a musical world few know, but many will remember. \n\n\n\n\n\n\n\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/sidis-of-gujarat/",
    "keywords": [
      "Anthropology",
      "Culture",
      "Film",
      "Heritage",
      "Music"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-77-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "83285-1768156200-1768161600@bangaloreinternationalcentre.org",
    "name": "The Beauty of Physics",
    "startDate": "2026-01-11T18:30:00+05:30",
    "endDate": "2026-01-11T20:00:00+05:30",
    "description": "Curiosity might have killed the cat, but it is the life of every scientific revolution. \nThis lecture celebrates the radical power of curiosity through the life and work of Michael Faraday, whose devotion to understanding nature for its own sake transformed how we see the physical world. Faraday’s experiments with electricity and magnetism did more than solve isolated puzzles; they reshaped reality itself, laying the foundations for technologies that now define modern life. \nIn this talk, Arthur Eisenkraft traces the evolution of physics from early questions about electrostatics to the breakthroughs of Ørsted, Faraday, and Maxwell, culminating in the birth of field theory. Along the way, he reflects on why curiosity-driven research (often dismissed as abstract or impractical) remains essential to innovation. \nAn invitation to rediscover wonder in scientific inquiry, this lecture speaks to anyone interested in how asking the right questions can change the world. \nThis lecture is a part of Azim Premji University’s Public Lecture Series. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-beauty-of-physics/",
    "keywords": [
      "Science"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-78-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "83426-1768330800-1768336200@bangaloreinternationalcentre.org",
    "name": "Wind, Wood and Wire",
    "startDate": "2026-01-13T19:00:00+05:30",
    "endDate": "2026-01-13T20:30:00+05:30",
    "description": "A jugalbandi for the new age! \nThis Hindustani concert brings together three musicians whose journeys converge at the frontier that is Indo-jazz. Saxophonist Phill Scarff, long associated with cross-cultural explorations, meets Bengaluru-based slide guitarist Dr. Prakash Sontakke, whose fluid phrasing draws from Hindustani grammar while remaining open to contemporary sound worlds. Tabla maestro Gurumurthy Vaidya completes the trio, grounding the dialogue with rhythmic depth and supple responsiveness. \nWhat unfolds is a conversation through improvisation. The saxophone’s burnished tone, the gliding resonance of the slide guitar, and the intricate play of taal move between structure and freedom, tradition and risk. Rooted in classical sensibility yet shaped by jazz’s openness, the music charts a shared space where genres blur, listening deepens, and new possibilities quietly emerge. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/wind-wood-and-wire/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Wind, Wood and Wire"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-81-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84123-1768129200-1768134600@bangaloreinternationalcentre.org",
    "name": "From Spiders to Monkeys",
    "startDate": "2026-01-11T11:00:00+05:30",
    "endDate": "2026-01-11T12:30:00+05:30",
    "description": "\nDid you know that spiders hold 44 Guinness World Records or that a pair of monkeys helped make space travel possible and that a pigeon saved the lives of about 200 American soldiers? \nJoin author Deepa Padmanaban to learn how creatures that live in and around our homes have shaped human lives and this planet. Each of these creatures has something to teach us about humanity, civilisation, history and science. Through this activity-filled storytelling journey, this is your chance to peak into the everyday wild world around you. \nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \n\n\nSupported by:\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/from-spiders-to-monkeys/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Books",
      "Environment",
      "Mythology",
      "Wildlife"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-108.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "83678-1768503600-1768509000@bangaloreinternationalcentre.org",
    "name": "Monkey See, Monkey Do, Seetha Says Boo",
    "startDate": "2026-01-15T19:00:00+05:30",
    "endDate": "2026-01-15T20:30:00+05:30",
    "description": "Humour and elegance share the stage!  \nLakshmi Girish and Parvathi Jayaram, a newly formed duo, explore a classical form through a modern lens. Inspired by the Subhashitha Ratnabhandagaram, this performance offers a satirical retelling of an encounter between two mischievous monkey wives and Seetha, reframing an epic moment through humour and surprise.  \nThis evening showcases a rarely explored comic register of Mohiniyattam: hasyam. Synonymous with grace and lyricism, Mohiniyattam here is choreographed with a refreshing perspective. Live music featuring mizhavu, vocals, edakka, and flute deepens the rhythmic and narrative play.  \nMusicians:\nMizhavu (Kerala’s ancient drum) – Kalamandalam Ratheesh Bhas (Kerala,India)\nEdakka – Kalamandalam Sarod Kumar (Kerala, India)\nFlute – Rakesh Dath (Bangalore, India)\nLive carnatic vocals – Harshitha Vidya (Bangalore, India)\nNattuvangam – Vinaya Narayanan (Bangalore, India) \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/monkey-see-monkey-do-seetha-says-boo/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_MSMD2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "84338-1768152600-1768159800@bangaloreinternationalcentre.org",
    "name": "ನೀಲಿ ಪರದೆ | Neeli Paradé (Season 3)",
    "startDate": "2026-01-11T17:30:00+05:30",
    "endDate": "2026-01-11T19:30:00+05:30",
    "description": "Neeli Paradé is a curated showcase of short films by Bahujan filmmakers under Neelavarana. The program celebrates Bahujan lives and experiences while creating a space for meaningful engagement with the filmmakers through conversations and discussions. \nFollowing the screening, the filmmakers will be in conversation with the audience, moderated by Apeksha Singegol. The session will be in Kannada. \nFilm Schedule: \nSong of Ghetto – Keri Haadu | 33 minutes | Kannada with English subtitles | 2025 | Chandrashekara K \nIt’s a film that documents the aftermath of a revolutionary protest that took place in Dindguru, a village in Karnataka. The event that sparked this revolution was when a man was not allowed to enter a coffee shop because he was a Dalit. This is unfortunately the case in every village in India. Caste is woven into the very fabric of the nation, an inescapable foe. \nThe Dalit Ghettos in Dindguru and the neighbouring village organised their movement against casteism. While the movement was successful, they now had to face the consequences of this protest. This is what the film captures, the state, stories of and resilience of the people and the many shapes and forms it takes. For those living in this ghetto, survival itself has become a form of resistance. The film captures the everydayness of this resistance as well as the everydayness of oppression. \nHalgi Naadha | 8 minutes 27 seconds | Kannada with English subtitles | 2025 | Mahishaa and Bharath Dingri \nThe Tamte is everywhere in India except in its cultural institutions. Sounding through life’s most important moments of celebration and mourning, the instrument remains marginalised because of the caste of those who play it. Through the journey of Bharath Dingri, a generational Tamte artist, this documentary follows a quiet yet radical rebellion to challenge caste-based exclusion. By reimagining Tamte through workshops and pedagogy, Bharath asserts its place within India’s classical arts and works to restore dignity to its players. \nBabasaheb in Bangalore | 4 minutes 22 seconds | Kannada with English subtitles | 2025 | Mahishaa \nBengaluru is a metropolitan city but you can’t escape the imagery of Dr. B.R. Ambedkar as a sign of assertion from India’s subaltern Marginalized castes. Statues are built by the blood and sweat of the people. Dr. B.R. Ambedkar or Babasaheb as his admirers affectionately call him has the most number of statues in India but the interesting fact is that none of these are built by the government like other statues. The film is a dedication to the people who have kept the philosophy of Dr. B R Ambedkar alive through his statues, we hear from the filmmaker and young people in the city & their relationship with these images. \nCase & Bobbin – Casu Mathu Bobbin | 6 minutes 33 seconds | Kannada with English subtitles | Bharath Raj \nIn the heart of Bengaluru’s thriving garment industry, Shankuntala, Munira Banu, and Vijayamma work tirelessly in factories where the clothes of multinational brands are produced. While their labor is the backbone of the global fashion world, their lives are far from the glamorous image the industry projects. Enduring long hours, meager wages, and grueling working conditions, these women navigate a world defined by sacrifice and struggle, with little hope for work-life balance or personal fulfillment. \nTheir stories are a reflection of the millions of women in the industry who face similar challenges, yet continue to press on with remarkable resilience. Amidst the harsh reality, it is the dream of a better future for their children that keeps them going. Through their personal journeys, this documentary reveals the strength, endurance, and quiet defiance of women who fight not only for survival, but for dignity and hope. \nIn collaboration with: \nNeelavarana \nNeelavarana is a Bengaluru-based Ambedkarite production house and artist collective working primarily in the Kannada language. Engaging in counter-cultural practice through Dalit-Bahujan aesthetics, the collective produces films, music, and cultural events while nurturing artists from marginalized communities. Through collaboration, mentorship, and community-driven processes, Neelavarana creates spaces where Dalit and Adivasi voices can tell their own stories, challenge dominant narratives, and reclaim cultural expression. \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%a8%e0%b3%80%e0%b2%b2%e0%b2%bf-%e0%b2%aa%e0%b2%b0%e0%b2%a6%e0%b3%86-neeli-parade-season-3/",
    "keywords": [
      "Culture",
      "Film",
      "Language",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "ನೀಲಿ ಪರದೆ | Neeli Paradé (Season 3)"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_NP.jpg"
  }
]