[
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "78999-1758220200-1758228300@bangaloreinternationalcentre.org",
    "name": "Aunty Sudha Aunty Radha",
    "startDate": "2025-09-18T18:30:00+05:30",
    "endDate": "2025-09-18T20:45:00+05:30",
    "description": "49 mins | Hindi with English subtitles | 2019 | India \nIn a quiet village outside Delhi, two sisters grow old without growing tired. \nSet in Lahra, this tender documentary follows 86- and 93-year-old widowed sisters who have chosen a slower pace and fuller life in a village far from the noise of the city. With creaky knees and sharp tongues, they navigate their days with walkers and wit. Unapologetic, unhurried, and largely unbothered by the looming presence of age or death. \nTheir closest companions are not blood relatives, but their adopted family of domestic help. Together, they share a rhythm of television, sun-soaked afternoons, casual gossip, and everyday caregiving. Shot by their niece visiting for the first time, the film captures this unusual household with quiet affection and a light, observant eye. \nIn their unassuming way, the sisters offer a radical lesson: that talking openly about death can make life more meaningful. \nThe screening will be followed by a Q&A with the filmmaker and producer. \nFilm Trailer \n",
    "url": "https://bangaloreinternationalcentre.org/event/aunty-sudha-aunty-radha/",
    "keywords": [
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "Aunty Sudha Aunty Radha"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-23-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79674-1758999600-1759005000@bangaloreinternationalcentre.org",
    "name": "Rabia’s Journey | ராபியாவின் பயணம்",
    "startDate": "2025-09-27T19:00:00+05:30",
    "endDate": "2025-09-27T20:30:00+05:30",
    "description": "At its heart, The Dark Hours of the Night is a story about girlhood under constraint, about how adolescence, desire, and freedom are shaped and stifled within the walls of a conservative household. \nRabia’s journey, woven together with the lives of her friends and cousins, illuminates the subtle negotiations, unspoken rebellions, and fragile solidarities that mark women’s coming-of-age in a patriarchal world. The novel opens a conversation about the everyday intimacies of restriction and resistance: the ache of thwarted desire, the bonds of friendship, the weight of silence, and the difficult balance between compromise and courage. It asks what it means to grow up when the future has already been decided, and whether education, love, or even small acts of defiance can shift those boundaries. \nIn this session, Subodh Sankar and Salma will reflect on these resonant themes, of gender, family, power, and the search for selfhood, that lie at the centre of The Dark Hours of the Night and across Salma’s larger body of work. \nஇரண்டாம் ஜாமங்களின் கதை என்பது கட்டுப்பாடுகளின் நடுவே வளரும் பெண் சிறுவயதின் கதை. இளமையின் ஆசைகள், சுதந்திரத்தின் கனவுகள் மற்றும் எதிர்பார்ப்புகள், ஒரு மரபுவழி குடும்பத்தின் சுவர்களுக்குள் எவ்வாறு கட்டுப்படுத்தப்படுகின்றன என்பதை இந்த நாவல் வெளிப்படுத்துகிறது. \nராபியாவின் வாழ்க்கைப் பயணம், அவளது தோழிகள் மற்றும் சொந்தங்கள் இணைந்து, பெண்களின் வளர்ச்சிப் பாதையில் அமைதியான எதிர்ப்புகள், நுட்பமான சமரசங்கள், சொல்லப்படாத போராட்டங்கள் மற்றும் உறவுகள் எவ்வாறு உருவாகின்றன என்பதை சுட்டிக்காட்டுகிறது. இந்த நாவல் அன்றாட வாழ்க்கையில் காணப்படும் கட்டுப்பாடுகள் மற்றும் எதிர்ப்புகளைப் பற்றி உரையாடலைத் தொடங்குகிறது: நிறைவேறாத ஆசைகள், நட்பு பந்தங்கள், மௌனத்தின் சுமை, சமரசம் மற்றும் துணிச்சலின் இடைநிலைகள். எதிர்காலம் ஏற்கனவே தீர்மானிக்கப்பட்டிருக்கும் சூழலில் வளர்வது என்றால் என்ன, கல்வி, அன்பு அல்லது சிறிய எதிர்ப்புகள் கூட அந்த எல்லைகளை மாற்ற முடியுமா என்பதையும் கேட்கிறது. \nஇந்த உரையாடலில், சுபோத் சங்கருடன் சல்மா, இரண்டாம் ஜாமங்களின் கதை மற்றும் தனது விரிவான படைப்புகளின் மையத்தில் இருக்கும் பாலினம், குடும்பம், அதிகாரம் மற்றும் தனித்தன்மை தேடல் போன்ற கருக்களை ஆராயவுள்ளனர். \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/rabias-journey-%e0%ae%b0%e0%ae%be%e0%ae%aa%e0%ae%bf%e0%ae%af%e0%ae%be%e0%ae%b5%e0%ae%bf%e0%ae%a9%e0%af%8d-%e0%ae%aa%e0%ae%af%e0%ae%a3%e0%ae%ae%e0%af%8d/",
    "keywords": [
      "Books",
      "Gender",
      "Literature",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_RJ.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "79496-1758304800-1758312000@bangaloreinternationalcentre.org",
    "name": "Impressions of Nature",
    "startDate": "2025-09-19T18:00:00+05:30",
    "endDate": "2025-09-19T20:00:00+05:30",
    "description": "The scent of earth-rich dyes, the press of carved wood against fabric, the bloom of colour on cloth. \nEach step in block printing is a small act of wonder. This workshop, led by Gandhigram Trust, Tamil Nadu, and guided by senior artisan Manikandan, invites you to step into the world of Kasimkari block printing. \nFrom tracing the journey of natural dyes to preparing fabric and imprinting motifs with hand-carved blocks, the process unfolds slowly, rhythmically, like the craft itself. Beginner-friendly yet deeply rooted in tradition, the workshop offers a new perspective. \nBorn of Khadi traditions and Gandhigram’s commitment to ecological responsibility, this practice reminds us that making by hand is also making with care. Each participant will receive a pre-mordanted kerchief to print on and take home: an intimate keepsake of colour and memory, holding within it the quiet rhythm of a timeless craft. \nWhat You’ll Learn \n\nLearn the basics of natural dyes and their cultural stories\nPrepare fabric through simple mordanting techniques\nMake Kasimkari, the traditional iron-based black dye\nTry block printing with hand-carved tools and simple methods\nSet your fabric, choose a motif, and print your own design\n\nWhat is Provided \n\nFabrics, blocks, dyes and tools\nStep-by-step instruction and hands-on guidance\n\nWhat to Bring \n\nCuriosity and a spirit of exploration\nComfortable clothing that can take a splash of dye\nYour own fabric, garment, or blocks if you’d like to experiment further\n\nThis workshop is conducted by Gandhigram Trust. \nIn Collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/impressions-of-nature/",
    "keywords": [
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_Impressions.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "79491-1758452400-1758457800@bangaloreinternationalcentre.org",
    "name": "Reviving Play",
    "startDate": "2025-09-21T11:00:00+05:30",
    "endDate": "2025-09-21T12:30:00+05:30",
    "description": "Step into a living archive of play where seeds, dice, marbles and stories become tools of connection. This inter-generational workshop invites participants to rediscover the joy, strategy and community spirit embedded in India’s traditional games. From board-based puzzles to outdoor group play, each activity opens a portal to our shared heritage. \nCurated and facilitated by Immaculate Antony, founder of Ima reCreation, the session features 5-8 traditional games tailored to the age group and number of participants. These are not just recreational pastimes but pathways to inclusivity, intergenerational bonding, and the holistic development of body, mind and relationships. \nExpect to encounter a blend of strategy, movement and storytelling through games such as Pallankuzhi, Pagade, Tower of Brahma, Goat and Tiger, Star Game, and more along with nostalgic delights like spinning tops, marbles and cup-and-ball challenges. \nWhether you’re a parent, educator, student or simply curious, join us for an afternoon of laughter, learning and a renewed connection to our roots. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/reviving-play/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Culture",
      "Heritage",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Rev-Play-Thumbnail.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "79415-1758452400-1758457800@bangaloreinternationalcentre.org",
    "name": "Sacred Sojourns: Songs of Vitthal",
    "startDate": "2025-09-21T11:00:00+05:30",
    "endDate": "2025-09-21T12:30:00+05:30",
    "description": "\n\n\n\n\n\n\nWhen voices rise in praise of Vitthal, boundaries fade.\n\nThis concert celebrates the confluence of traditions, tracing how music holds memory, weaves community, and opens doorways to the divine. As part of Very Vari, it extends the pilgrim’s path into sound, where the sacred is not only seen in image but felt in rhythm and voice. \nMaharashtra’s Varkari and Karnataka’s Haridasa traditions become one river of song. Each verse carries centuries of longing, remembrance, and surrender, echoing with the footsteps of pilgrims and the heartbeat of devotion. \nDeepti Navaratna and Madhusudhan Bhat, joined by Ashwin MP on tabla, bring these traditions alive in an evening that is at once meditative and deeply moving. \nSupported by: \n\n\n\n\n\n\n\n\n\n\n\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/sacred-sojourns-songs-of-vitthal/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sacred Sojourns: Songs of Vitthal"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_SS.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79626-1758911400-1758916800@bangaloreinternationalcentre.org",
    "name": "Music, Musicians and Musical Instruments at the Mughal Court",
    "startDate": "2025-09-26T18:30:00+05:30",
    "endDate": "2025-09-26T20:00:00+05:30",
    "description": "The Mughal court breathed in rhythm and melody.  \nFrom dawn prayers to twilight revelries, from joyous weddings to the thunder of battle, music augmented every moment of life. Painters of the time caught these echoes in colour: musicians in the durbar, women singing in the zenana, instruments poised in the naubatkhanas of gateways, songs rising even in hunting fields. \nIn this illustrated lecture, Dr. Asok Kumar Das will discuss the presence of music and musicians in a selection of paintings dating from the reign of Humayun (r.1530-40, 1555-56) to Shah Jahan (r.1628-1658). These exquisite paintings reveal an enduring ensemble of percussion, wind and string instruments, and performers of all genders and creeds making music for specific occasions. \nStep closer to an age where melody was power, poetry, and prayer all at once. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/music-musicians-and-musical-instruments-at-the-mughal-court/",
    "keywords": [
      "Heritage",
      "History",
      "Music",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_MM-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79129-1758738600-1758744000@bangaloreinternationalcentre.org",
    "name": "Voices From the Lab and the Field",
    "startDate": "2025-09-24T18:30:00+05:30",
    "endDate": "2025-09-24T20:00:00+05:30",
    "description": "How do we represent those who peopled Indian agrarian history? \nThese talks explore the place of oral narrative in reconstructing India’s post-Independence agricultural history, especially some of its less known though no less defining moments. As important as watershed events and policy interventions are to the making of agrarian history, the contributions of other actors, among them landless agricultural workers, peasants, political workers and agricultural scientists, must also be given their place. The perceptions of agrarian change as evaluated and voiced by those who made significant contributions to the course of agrarian history makes for a more textured view of social and economic change in rural India. \nThrough first-hand accounts from the lab and the field we see how individual experience and social context shaped the making of agrarian history in India after independence. These stories don’t just add detail; they shift perspective, showing how knowledge and change emerge through lived realities. \nParvathi Menon, former Resident Editor of The Hindu, and historian of science Sandipan Baksi will share insights from two major oral history projects, moderated by Madhura Swaminathan of the Indian Statistical Institute. \nAn invitation to listen closely to the stories that have shaped our reality today. \nThis discussion is part of the 69th edition of the Archives Public Lecture Series, which focuses on explorations in and around the archives at NCBS. \nIn collaboration with: \n        \n\n",
    "url": "https://bangaloreinternationalcentre.org/event/sounds-from-the-field/",
    "keywords": [
      "Agriculture",
      "History",
      "Science"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_Lab-and-the-Field.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79398-1758279600-1758484800@bangaloreinternationalcentre.org",
    "name": "Very ‘वारी’ (Vāri)",
    "startDate": "2025-09-19T11:00:00+05:30",
    "endDate": "2025-09-21T20:00:00+05:30",
    "description": "Exhibition Inauguration & Opening: 6:30pm | Friday, Sep 19\nTimings: 11am – 8pm\nExhibition on show until Sunday, Sep 21 \nWalkthroughs:\n19 Sep, Friday, 7pm\n20 Sep, Saturday, 7pm\n21 Sep, Sunday, 10am & 7pm \nConcert:\nSacred Sojourns: Songs of Vitthal – Sunday, Sep 21 | 11am\nDeepti Navaratna, Madhusoodan Bhat & Ashwin MP | RSVP here \nCenturies of devotion move on foot across Maharashtra through a pilgrimage of song, rhythm, and faith. \nVery ‘वारी’ (vāri) brings this living tradition into an immersive space, where the pulse of the pilgrimage unfolds through image, sound, and touch. \nPhotographs trace the pilgrim’s everyday moments while hinting at the larger social, economic, and political threads woven into the vāri. Field notes and voices of poetry offer another layer, echoing the spirit of those who walk. Artifacts of simple vessels, cloths, and sacred objects carry stories of continuity and belonging, grounding the experience in the tangible. \nThis is not just an exhibition, but an invitation to linger inside a centuries-old journey. Each fragment seen, heard, or held, opens the possibility of feeling the pilgrimage’s essence in the present. \nWander. Listen. Linger. \n",
    "url": "https://bangaloreinternationalcentre.org/event/very-%e0%a4%b5%e0%a4%be%e0%a4%b0%e0%a5%80-vari/",
    "keywords": [
      "Culture",
      "Heritage",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_VV.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "79506-1758366000-1758373200@bangaloreinternationalcentre.org",
    "name": "Stitching Stories",
    "startDate": "2025-09-20T11:00:00+05:30",
    "endDate": "2025-09-20T13:00:00+05:30",
    "description": "To mend is to turn what time has worn, into beauty once more. \nThis workshop with the Porgai Artisans Association from Sittilingi Valley, Tamil Nadu, invites you into the living tradition of Lambadi embroidery, where repair becomes story, memory, and pride. Facilitated by Dr. Lalitha, co-founder of Porgai, alongside two Lambadi craftswomen, the workshop offers an intimate chance to learn stitches that have bound generations together in resilience and artistry. \nOpen to anyone drawn to craft, culture, or inventive ways to mend and reuse, the workshop invites you to see repair not as fixing what is broken, but rather as renewal with every thread as a quiet act of continuity. \nWhat You’ll Learn \n\nDiscover visible mending as a mindful and sustainable practice\nExplore Lambadi embroidery through its motifs, stitches, and meanings\nWork with master artisans and learn by doing\nMend or embellish fabric with care and creativity\n\nWhat We Provide \n\nNeedles, threads, and sample motifs to get you started\nStep-by-step guidance and personal support from artisans\n\nWhat Participants Need to Bring \n\nA garment or textile you wish to mend or decorate\nBeads, patches, or scraps you’d like to weave into your story\n\nThis workshop is conducted by Porgai Artisans Association. \nIn Collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/stitching-stories/",
    "keywords": [
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_Stitching-Stories.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "79284-1758826800-1758832200@bangaloreinternationalcentre.org",
    "name": "Raga Gayan",
    "startDate": "2025-09-25T19:00:00+05:30",
    "endDate": "2025-09-25T20:30:00+05:30",
    "description": "A voice shaped by tradition, carried forward with imagination. \nTrained in the revered lineages of the Gwalior, Jaipur, and Agra gharanas, vocalist Shiv Prasad Rao brings to life the timeless art of khayal gayaki. His music is a delicate balance: lyrical and intricate, contemplative yet deeply expressive, rooted in parampara but alive with improvisation. \nIn this performance, he presents traditional compositions in the styles of his gharanas, shaped by his own distinctive approach to lyrical and rhythmic improvisation. The result is not just your average recital, but an immersion into the evolving, ever-resonant world of Hindustani classical music. \nEnhancing this evening’s performance are two remarkable artists whose journeys reflect equal dedication. Vighnesh Bhagavat Yellapur, Hindustani classical vocalist and harmonium player, brings a blend of rigour and sensitivity, enriching every raga with depth and clarity. On tabla, Kaustuv, channels a lifetime of rhythmic exploration. Praised for his precision and vitality, he anchors and elevates the music with subtlety and power. \nTogether, these artists create a tapestry of melody, rhythm, and improvisation—an evening of Hindustani classical music where tradition meets spontaneity and rhythm flows seamlessly into melody. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/raga-gayan/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Raga Gayan"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-5-5.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79280-1758997800-1759003200@bangaloreinternationalcentre.org",
    "name": "Lessons for Democracy",
    "startDate": "2025-09-27T18:30:00+05:30",
    "endDate": "2025-09-27T20:00:00+05:30",
    "description": "What happens when institutions bend, freedoms collapse, and silence rules? India once knew. \nFive decades may have passed, but the Emergency remains a stark reminder of how swiftly freedoms can be curtailed. In those 21 months, prisons filled, the press was silenced, and democratic institutions bent under the weight of authoritarian rule. The questions it leaves behind are urgent: what does this episode tell us about the fragility of democracy, and what echoes of it persist today? \nA new volume gathers reflections from scholars, writers, historians, journalists, and activists to probe this turbulent chapter and its continuing relevance. Joining the discussion are Peter Ronald de Souza, co-editor of the book, historian Janaki Nair, sociologist Chandan Gowda, and political scientist Rinku Lamba, in a conversation moderated by Thomas Abraham.  \nA Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/lessons-for-democracy/",
    "keywords": [
      "Books",
      "History",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_LfD.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79340-1759257000-1759264200@bangaloreinternationalcentre.org",
    "name": "A Fly on the Wall",
    "startDate": "2025-09-30T18:30:00+05:30",
    "endDate": "2025-09-30T20:30:00+05:30",
    "description": "82 minutes | English | 2024 | India \nWhat does it mean to face the end on one’s own terms—and in the company of friends?\n\nA Fly on the Wall, directed by Nilesh Maniyar and Shonali Bose, traces the final chapter in the life of Chika Kapadia, framed through the intimate lens of friendship. In a quiet Swiss town, loved ones gather from across the world to raise a last toast, while a filmmaker friend documents the delicate passage between celebration and farewell. What unfolds is a tender meditation on choice, companionship, and the courage to define one’s own ending. \nLayered with memory and emotion, the film draws viewers into a journey where the everyday collides with the profound, and where the act of bearing witness becomes as significant as the story itself. \nAfter the screening, directors Nilesh Maniyar and Shonali Bose will be present for an in-person discussion with Sandhya Kumar, followed by a Q&A with the audience. \nCheck out the trailer here \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-fly-on-the-wall/",
    "keywords": [
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_FOTW.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79203-1758220200-1758398400@bangaloreinternationalcentre.org",
    "name": "Hegemony, Revolt and Selfhood",
    "startDate": "2025-09-18T18:30:00+05:30",
    "endDate": "2025-09-20T20:00:00+05:30",
    "description": "The Masterclass Hegemony, Revolt and Selfhood: India’s Encounters with Languages explores three defining moments in India’s linguistic journey: the arrival of Sanskrit, Persian, and English. Each language came from beyond India’s borders, gained a foothold, and extended its influence across diverse cultures, communities, and tongues. Their dominance shaped not only communication but also identity, politics, and thought. Thus, becoming inseparable from the larger story of India itself. \nThese lectures will trace how each language consolidated its power, how resistance took form, and how new voices emerged in the process. Strikingly, in every encounter, it was not the imperial language that endured, but the languages rooted in the soil (the desa, the nadu) that reshaped and redefined the cultural landscape. \nAs we step into an uncertain digital future, this series asks whether India’s linguistic resilience will once again carry it forward, as it has so often before. \nSep 18 | Language and Hegemony | 6:30 PM\nExplore how Sanskrit, Persian, and English reshaped India across centuries. Each entered from outside, claimed cultural power, and ruled the imagination, but India remained a linguistic civilization defined by diversity. This talk uncovers why language became both a tool of hegemony and the essence of India’s selfhood. \nSep 19 | Decline and Transformation | 6:30 PM\nSanskrit reigned for millennia, Persian for centuries, English for decades. Yet, none endured unchallenged. Each gave way to the resilient desi-bhashas, rooted in the land and people. This lecture traces the rise, fall, and transformation of languages in India, and what these shifts reveal about power and imagination. \nSep 20 | Language between Nationalism and Technology | 6:30 PM\nIn today’s charged climate, languages carry the weight of both nationalism and digital futures. This session asks how India’s linguistic diversity will evolve in the twenty-first century, and whether the voices of many can thrive amid the pulls of technology, identity, and the search for cultural belonging. \n",
    "url": "https://bangaloreinternationalcentre.org/event/hegemony-revolt-and-selfhood/",
    "keywords": [
      "History",
      "Language",
      "Masterclass",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_HRS.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79716-1759057200-1759062600@bangaloreinternationalcentre.org",
    "name": "Gandhi and Savarkar",
    "startDate": "2025-09-28T11:00:00+05:30",
    "endDate": "2025-09-28T12:30:00+05:30",
    "description": "Between Gandhi and Savarkar lies the story of India’s unresolved future. \nThe future of India has long been caught between two irreconcilable visions. Mohandas Karamchand Gandhi and Vinayak Damodar Savarkar were not just men, but embodiments of two enduring ideologies: Hind Swaraj and Hindutva. Their contest was never merely personal; it was a struggle over what India could, and should, become. \nPartition was one gash on the body of the nation, its scars still visible. Can India afford new wounds? To even attempt an answer, we must return to the old antagonisms – between communities, yes, but also within Hindu society itself. Few rivalries have been as sharp, or as consequential, as that between Gandhi and Savarkar. \nBased on his new book, Hindutva and Hind Swaraj, this talk reflects on the unresolved gulf between Gandhi and Savarkar. Not as history, but as a question that remains open: can such differences ever be bridged, or are they the fault lines of India’s future? \n",
    "url": "https://bangaloreinternationalcentre.org/event/gandhi-and-savarkar/",
    "keywords": [
      "Biography",
      "Books",
      "History",
      "Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_GS.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79257-1758911400-1758916800@bangaloreinternationalcentre.org",
    "name": "Played and Missed",
    "startDate": "2025-09-26T18:30:00+05:30",
    "endDate": "2025-09-26T20:00:00+05:30",
    "description": "Before the spotlights, who kept the women’s game alive? \nIn 2017, India’s women cricketers came heartbreakingly close to a World Cup win at Lord’s. That match lit a fire, changing how the country saw its women athletes, and laying the foundation for today’s Women’s Premier League – the first women’s sports league to turn profitable even before a single ball was bowled. \nIt’s the first time since that iconic evening at Lord’s that the Women’s World Cup is set to be hosted in India. \nThis session will celebrate those forgotten days when world cups in India were played in front of empty seats, even when the cricket itself was no less significant. Bringing these narratives to life are Karunya Keshav, Ananya Upendran, and Aayush Puthran. This is a chance to hear directly from some of the best storytellers on women’s cricket. \nIn collaboration with: \n \nBookmark is a dating app for readers, created by the founders of Cubbon Reads, where one swipes books, not looks. Through a virtual bookshelf and prompts, people can find book buddies across the world. \n",
    "url": "https://bangaloreinternationalcentre.org/event/played-and-missed/",
    "keywords": [
      "Books",
      "Gender",
      "Sports"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_PM.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "78932-1758654000-1758659400@bangaloreinternationalcentre.org",
    "name": "8",
    "startDate": "2025-09-23T19:00:00+05:30",
    "endDate": "2025-09-23T20:30:00+05:30",
    "description": "Languages: Bhojpuri, Dakhni, English, Hindi, Malayalam, Marathi, Rajasthani, Telugu, Tamil & Urdu. \nWhat do love, rage, longing, and joy look like on today’s women? \nFrom a schoolgirl texting late at night to a farmer waiting by the fields, from a glamorous influencer to a tired new mother, ‘8’ brings the ancient ashta nayika archetypes into the present day. \nWinner of the 2023 Adishakti Theatriculate Fellowship, this solo dance-theatre work reimagines eight classical heroines as women of our times, each wrestling with love in their own way. Blending hip hop theatre with baithak abhinaya, the performance moves fluidly between languages, moods, and worlds. \nAn original score by award-winning musicians layers the stage with what Hindustan Times praised as ‘strikingly beautiful’ sound. The result is at once intimate and electrifying; a portrait of how timeless emotions find new bodies, new rhythms, and new voices. \nA rare chance to see tradition translated into modernity on stage! \nThis production was created through the 2023 Theatriculate Fellowship awarded by Adishakti Laboratory for Theatre Art Research. \nThis performance is part of a 9-city tour, with upcoming stops in Mumbai, Bhopal, and Pune. \nPlease Note:\n1. The performance will be accessible through English ‘sur’titles for all other languages.\n2. This performance contains mature themes and imagery. Adults are responsible for curating their child’s experience.\n3. Late entry will only be permitted at specific points during the show.\n4. Photography and videography are strictly prohibited. All phones must be placed in secure fabric pouches provided at entry, which will be unsealed for you after the show. \nCredits:\nProducer: Deep Design\nScript, Direction, Design and Performance: Deepa D.\nVocals and Composition: Bindhumalini, Charu Hariharan, Deepika Karthik Kumar, Gurupriya Atreya\nMusic Arrangement and Production: Vinayak Netke with Charu Hariharan and Hitesh Dhutia\nTechnical Direction: Niranjan Gokhale\nProduction and House Management: Leslie Andrews David\nOriginal Lyrics: Bilqis Zafirul Hasan, Deepika Karthik Kumar, Kamala Das, Meenal Hajratwala, Muddupalani, Panchaphula Nandurekar, Vijayaraja Mallika\nTraditional Lyrics Sources: Bali Gujar, Gangubai Chunchalwad, Hirabai Gynandev Chavan, Hira Sawant, Indubai Shedge, Lakshmi Bhilare, Malini Awasthi, Mukta Varat, Radha Sakpal, Saru Damle, Shahu Kamble, Sita Pimple, Sushma Pawar\nTranslations: Ann Grodzins Gold, Asha Ogale, Asha Singh, Balakrishnan Gayathri Raghavan, Charu Hariharan, Deeba Zafir, Deepa D., Deepika Karthik Kumar, Gautam Pemmaraju, Jitendra Maid, Maitreyee Kulkarni, Naghma Zafir, P. Vijaya Kumar, Rajani Khaladkar\nSound Engineering: Charu Hariharan, Maniratnam, Nalini Vittobane, Shriraman Chandrasekhar, Sidney Alberts, Vinayak Netke\nSoundtrack Mixing and Mastering: Vinayak Netke\nProjections Design: Percival Crasto\nAdditional Sound Editing: Adriel George\nAdditional Costumes: Sandhya Raman\nDramaturgical Assistance: Jin-Ming Lai\nADHD Coaching: Jennie Jordan\nPoster Photography: Apoorva Saptarshi \n",
    "url": "https://bangaloreinternationalcentre.org/event/8/",
    "keywords": [
      "Gender",
      "Music",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ur",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "8"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-24-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "79300-1759258800-1759264200@bangaloreinternationalcentre.org",
    "name": "Rumi Meets Kabeer",
    "startDate": "2025-09-30T19:00:00+05:30",
    "endDate": "2025-09-30T20:30:00+05:30",
    "description": "A mehfil of mystics where two great voices of devotion find resonance across time and tradition.  \nThis performance weaves together song and story: the earthy nirguni verses of Kabeer alongside the soaring ghazals of Rumi. Tales from Rumi’s Masnavi unfold beside episodes from Kabeer’s life, drawing audiences into the philosophies that shaped them and the spiritual journeys they invite us to walk. \nThough born in different worlds, their words echo the same longing: love, surrender, and the search for the divine. More than a concert, the evening offers an immersion into mysticism itself. Music and poetry intertwine, creating spaces for reflection, wonder, and stillness.  \nThis is a celebration of unity in diversity through the timeless legacies of Kabeer and Rumi that continue to awaken the eternal within us. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/rumi-meets-kabeer/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Rumi Meets Kabeer"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/ThumbnailRK111.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79273-1758452400-1758457800@bangaloreinternationalcentre.org",
    "name": "When the Pot Sings",
    "startDate": "2025-09-21T11:00:00+05:30",
    "endDate": "2025-09-21T12:30:00+05:30",
    "description": "From clay beds to concert halls, what stories does a pot carry? \nThe ghatam begins its life in mud drawn from ponds and lakes, spun carefully on a wheel by the potter’s hand. Once fired, it waits quietly until a musician coaxes rhythm from its body.  \nIn Song of the Clay Pot – My Journey with the Ghatam, Sumana Chandrashekar traces this remarkable journey, weaving together myth, history, and her own life as a ghatam artist. Along the way, she opens a window onto Carnatic music’s hidden histories: from the instrument’s early marginalisation and the years of AIR’s harmonium ban, to the delicate hierarchies that shape relationships between performers. \nChandrashekar also reflects on being a woman in this world: the unspoken rules, the pressure to conform, and her conscious choice to step outside tradition’s prescribed attire. \nIn conversation with Arundhati Ghosh, she invites us to consider not just the sound of the ghatam, but the politics, aesthetics, and lived experiences it holds within its clay. The discussion concludes with a Q&A. \nA morning where earth, music, and memory find rhythm together. \n",
    "url": "https://bangaloreinternationalcentre.org/event/when-the-pot-sings/",
    "keywords": [
      "Books",
      "Music"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-26-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79593-1758477600-1758484800@bangaloreinternationalcentre.org",
    "name": "Retrieving a Distinct Voice",
    "startDate": "2025-09-21T18:00:00+05:30",
    "endDate": "2025-09-21T20:00:00+05:30",
    "description": "This panel revisits the magnificent oeuvre of Rajalakshmi N. Rao, a major modernist writer with the rare distinction of composing powerful fiction in both Kannada and English. Published recently, Sangama – Pastorale gathers the under-discussed stories from Sangama, her pioneering 1956 anthology of Kannada short fiction, alongside five of her later stories in Kannada.  Bringing together for the first time a dozen of her exciting stories written in English and her English translations of two of her Kannada stories, this volume restores to prominence a major voice in Indian writing in English. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/retrieving-a-distinct-voice/",
    "keywords": [
      "Biography",
      "Books",
      "Language",
      "Literature"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_Sangama.jpg"
  }
]