[
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "64874-1729447200-1729453500@bangaloreinternationalcentre.org",
    "name": "Mela Chiraagaa’n | ਮੇਲਾ ਚਿਰਾਗਾਂ | میلہ چراغاں",
    "startDate": "2024-10-20T18:00:00+05:30",
    "endDate": "2024-10-20T19:45:00+05:30",
    "description": "Mela Chiraagaa’n… \n…a MELA of Sufi kalaam, woven with music and narration \n…a MELA that brings Hindus, Sikhs and Muslims together to celebrate a poet from Punjab’s soil \n…a MELA that dissolves boundaries of gender, caste, class, religion \nThe earthy kalaam of 16th century Sufi faqeer Shah Hussain is an inseparable part of Punjab’s soil, its consciousness, its ‘khalqat’, the people of ‘Sanjha’ Punjab. Weaver, mystic, poet, Shah Hussain kept away from ‘peeri’, ‘meeri’, all kinds of high sounding titles, he lives in our hearts as ‘faqeer nimaana’ (the lowly faqeer). \nMela Chiraaga’an Urs is celebrated every year in remembrance of this poet faqeer Shah Hussain and his beloved disciple, a Hindu Brahmin boy Madho Lal, as they lie buried in their twin graves near Lahore. So inextricably connected, Shah Husain is also remembered as Madho Lal Hussain. 2024 marks Madho lal Hussain’s 436th Urs, his death anniversary, a celebration of the final union with the beloved divine ( ‘Urus’ in Arabic is a wedding) \nThis Mela, a confluence of his poetry, woven with music and narrative, is his journey as a Julaaha (weaver), a ‘malaamati’, as Faqeer Nimaana, the lowly faqeer. It celebrates Punjab’s common cultural landscape, the common poetry, the language, the voice, which remains one despite the border that separates us. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/mela-chiraagaan-%e0%a8%ae%e0%a9%87%e0%a8%b2%e0%a8%be-%e0%a8%9a%e0%a8%bf%e0%a8%b0%e0%a8%be%e0%a8%97%e0%a8%be%e0%a8%82-%d9%85%db%8c%d9%84%db%81-%da%86%d8%b1%d8%a7%d8%ba%d8%a7%da%ba/",
    "keywords": [
      "Culture",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Mela Chiraagaa’n | ਮੇਲਾ ਚਿਰਾਗਾਂ | میلہ چراغاں"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-43.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "64984-1729710000-1729715400@bangaloreinternationalcentre.org",
    "name": "Galactic Gossip",
    "startDate": "2024-10-23T19:00:00+05:30",
    "endDate": "2024-10-23T20:30:00+05:30",
    "description": "A temporally themed evening of original poetries strung through with bass and self-produced melodies. Nupur Azadi brings some of her new work, supported by Mario Stevens. Charting through the murmur of the galaxy in secret songs and stories, the evening molds each audience into an intrepid traveler. Each piece turns into an imagined story; each story — someone’s memory. Pulling on the strings of gossip from the celestial, we journey on to listen from a little closer. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/galactic-gossip/",
    "keywords": [
      "Music",
      "Performing Arts",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Galactic Gossip"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTERS-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64735-1729796400-1729801800@bangaloreinternationalcentre.org",
    "name": "Dasamahavidhya",
    "startDate": "2024-10-24T19:00:00+05:30",
    "endDate": "2024-10-24T20:30:00+05:30",
    "description": "A selected piece from the researched choreographic work, Dashamahavidya in Sanskrit which depicts the ten forms of the Parashakti according to the tantra. Considering the fact that the number” ten” is an important number of human life, the history states that the mathematical scenerio of the world was given a full stop before the invention of the digit “zero” by Aryabhatta. On the other hand, The Dasadishi, The Dasakarma, The Dasamandala and The Dasavataram are all related closely to the human life and coincidentally we stay in the mother’s womb for ten months and ten days. \n“Dasamahavidya“ is not only the description of the dhyana mantras of the ten Devis such as  Kamala ,Kali, Tara, Vagala, Bhairabi, Bubaneswari, Dhumabati, Matangi, Chinnamasta and Shorashi, but it is the reflection of the ultimate human life, human emotions (the nine rasas) and the stages through which man goes slowly and gradually towards ultimate completeness. \n\nSet to Dasa-ragamalika and Tala-malika,\nConcept and choreography – Sri Samrat Dutta,\nSanskrit research work – Sri Samipeshu Das , Sri Debopam Das.\nIntermediate slokas creation & narration by – Sri Debopam Das.\nVocal – Sri K G Prasad\nNattuvangam – Smt Mohana Iyer\nMridangam and total music arrangement – Sri Shankar Narayananswami\nFlute – Sri Rupak Mukherjee\nViolin – Sri Natarajan\n\nSupported by \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dasamahavidhya/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-22.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64979-1732042800-1732048200@bangaloreinternationalcentre.org",
    "name": "Akhyāt - Ākhyānā ",
    "startDate": "2024-11-19T19:00:00+05:30",
    "endDate": "2024-11-19T20:30:00+05:30",
    "description": "Words of inspiration from India’s first female teacher…  \nWritings of unabashed desire from the heart of Tamizh land…  \nQuestions of existentialism asked by Buddhist nuns…  \nProse that interrogates anthropocentrism… \nVerses that subvert gender roles and patriarchy…  \n…and more insight into the female perspective of desire, denouncement, faith and activism. Only this time, through poetry authored by women themselves! \nAkhyāt – Ākhyānā is an experiential exploration of rare multilingual poetry tactfully woven into a Bharatanatyam repertoire performed along with live musicians. This work stems from Divya’s diverse encounters with heart-wrenching poetic expressions of women from across timelines and geographies, in a quest to unearth narratives ‘by’, ‘for’ and ‘of’ women. \nCast:\nDance | Choreography | Script – Divya Ravi\nMusic composition | Vocals – Sharan Subramanian\nNattuvangam – DV Prasanna Kumar\nMridangam – Srihari Rangaswamy\nFlute – Vivek Krishna \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/akhyat-akhyana/",
    "keywords": [
      "Dance",
      "Performing Arts",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-629.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "65005-1731092400-1731097800@bangaloreinternationalcentre.org",
    "name": "The End",
    "startDate": "2024-11-08T19:00:00+05:30",
    "endDate": "2024-11-08T20:30:00+05:30",
    "description": "90 mins | English & Hindi \nA college romance slowly takes a turn for something complicated and traumatic. \nA young live-in couple begins to realize that maybe love isn’t all that you need\nto build a home with someone. \nDoubt, deceit, and the past come to haunt a marriage that is struggling to survive. \nAn anthology of 3 stories about 3 couples, ‘The End’ uses text, movement, music, and memory to understand what we look for in romance and relationships when the odds are stacked against us, when love starts making way for loss, and questions about desire and the need for control start popping up. How does one unlearn societal norms and expectations to build relationships that are authentic, nurturing, and filled with love still? \nWe meet these 3 couples near what they think is the end of their (love) stories. \nBut is it, really, The End? \nCredits: \nDesign & Direction: Nikhita Singh \nWriters: Nikhita Singh, Mitali Kalagi, Sambita De \nCast: Mitali Kalagi, Rituparna Sanyal, Kaustav Sinha, Aditya Kashyap \nMovement Director: Babusha Jain \nMusic: Hashparker (Harsh Choudhary) \nLyrics & Poetry: Madhumoy Satpathy \nAssistant Director: Rituparna Sanyal \nProduction Manager & Photographer: Divyansh Thada \nProduction Assistant: Sambita De \nCostume Design: Simran Jagdale \nSet Design: Nikhita Singh, Rituparna Sanyal, Vivek Jadhav \nLight Design: Nikhita Singh, Rahul Kumar \nPoster Design: Vighnesh Kharadkar, Debosmita Mazumdar \nSocial Media Design: Tanya Vaghela \nSocial Media Planning & Strategy: Divya Sundrani \nMarketing & Publicity: Dheeraj Dubey \nCreative Director for Visual Promos: Omkar Phatak \nOutreach & Brand Advocacy Partner: Centre for Contemporary Folklore \nSupported by Tamaasha Studio Foundation’s UsPaar Residency. \n  \nThis is a BIC Elsewhere Event. \nWhile the majority of our events find a home at our premises in Domlur, BIC Elsewhere represents our commitment to bringing conversations, arts, and culture directly to diverse audiences. Through this initiative, we collaborate with various venues, extending the reach of our events beyond our own space. These partnerships not only breathe life into our gatherings but also play a crucial role in cultivating an environment for the flourishing of arts and culture in the city. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-end/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Shoonya Center for the Art and Somatic Practices, 4th Floor, B Block, Brahmananda Court, 37, Lal Bagh Main Rd, K.S. Garden, Raja Ram Mohanroy Extension, Sudhama Nagar,, Bengaluru, Karnataka, 560027, India"
    },
    "inLanguage": "hi",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "The End"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-625.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64862-1729189800-1729195200@bangaloreinternationalcentre.org",
    "name": "Guardians of the River",
    "startDate": "2024-10-17T18:30:00+05:30",
    "endDate": "2024-10-17T20:00:00+05:30",
    "description": "Steven Moss, a British naturalist, once called the otter “the elusive movie-star”. The apex predator of river and stream ecosystems in India, the otter is a charismatic and reclusive mammal that has evolved over millennia to adapt brilliantly to its habitat. And yet, today, the three species of otters found in India are in a vulnerable spot, with declining habitat and increasing demand for water placing critical constraints on their continued survival. \nIn this talk, Gopakumar Menon will make a case for their protection and, thereby, the larger case for the preservation of their riparian habitat. \nThe talk will be followed by a panel discussion with conservationist Praneet Goteti and a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/guardians-of-the-river/",
    "keywords": [
      "Environment",
      "Sustainability",
      "Wildlife"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-622.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65152-1729794600-1729800000@bangaloreinternationalcentre.org",
    "name": "Whisky Unscripted",
    "startDate": "2024-10-24T18:30:00+05:30",
    "endDate": "2024-10-24T20:00:00+05:30",
    "description": "Join us for an insightful panel discussion as we dive into the journey of Indian whisky with Hemanth Rao (the founder of India’s first Whisky Club), Ashok Chokalingam (Master Distiller at Amrut) and Sriram Devatha (Author) inspired by the groundbreaking story of Amrut: The Great Churn. \nThis session will explore the origins of India’s whisky heritage, delving beyond the concept of maturation to uncover the complexities that shape the spirit. We’ll reflect on the pioneers who redefined Indian whisky on the global stage and look ahead to what the future holds for this dynamic industry. \nWhether you’re a whisky connoisseur or simply curious, this conversation promises to be a spirited deep dive into India’s whisky world. \n",
    "url": "https://bangaloreinternationalcentre.org/event/whisky-unscripted/",
    "keywords": [
      "Books",
      "Culture",
      "Food"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-4_POSTER-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64960-1729276200-1729281600@bangaloreinternationalcentre.org",
    "name": "Action or Despair: What Does India Need From Her Citizens?",
    "startDate": "2024-10-18T18:30:00+05:30",
    "endDate": "2024-10-18T20:00:00+05:30",
    "description": "We stand today, at the pinnacle of accomplishments and depths of despair, all at once. We applaud achievements in sports, space science, medical breakthrough, foreign investments and high speed trains. We are highly critical of bad roads, waste mismanagment, pollution, poverty, suppression of freedom, of human rights violations. \nWe look to precepts from anyone, and anything to give us a semblance of order. Many of us don’t stop to think about our own role in all that we criticise. \nWell-known activist Brinda Adige will talk about how each of us (no matter of what age and in whatever capacity, big or small) can contribute towards activating change that will make our city, our country, our world a better place for all. She peppers her talk with snippets from her own wide-ranging and courageous experience as an activist. \nThe Vijay Nambisan Trust: \nThe Vijay Nambisan Trust was formed to perpetuate the cause of Humanities in its many spheres. The Vijay Memorial Lecture to be held every year is the first event to be sponsored by the Trust in partnership with the Bangalore International Centre. \nAbout Vijay Nambisan: \nOne of the best poet-writers of his generation, Vijay Nambisan is known as much for his poetry and prose, as he is for his reclusiveness. He dropped out of IIT Madras in his fourth year of engineering to pursue his love for the written word. He won the first All India British Council Poetry Prize in 1988, worked for a number of years in the literary section of The Hindu and published collections of poetry and prose in his inimitable style. He was married to surgeon and novelist, Kavery Nambisan. \n",
    "url": "https://bangaloreinternationalcentre.org/event/action-or-despair-what-does-india-need-from-her-citizens/",
    "keywords": [
      "In Memory",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-624.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "65127-1729623600-1729629000@bangaloreinternationalcentre.org",
    "name": "Kantha: Weaving Sounds of Asia",
    "startDate": "2024-10-22T19:00:00+05:30",
    "endDate": "2024-10-22T20:30:00+05:30",
    "description": "Music grows and changes at the boundaries – where cultures collide and create something new. This is especially true in Asia, where culture, language and food change every 100 kilometers. \nAbhijit looks at the spread of music across Asia (especially South Asia) and how interesting new music is being created today at these points of flux. The music that we’ll be listening to will be featured at Kantha, a music festival that debuts this year in Bengaluru, spread across 16 days at Freedom Park. \nKantha is part of the BLR Hubba, Bengaluru’s own city festival, being held in it’s second edition this year. This listening session gives attendees a sneak peek into what they can expect to hear, and delve deeper into some of the stories behind the music. \nBIC’s Listening Room Sessions are an opportunity to come together, listen to and discover new music, refine old tastes and share influences, stories and memories. \n",
    "url": "https://bangaloreinternationalcentre.org/event/kantha-weaving-sounds-of-asia/",
    "keywords": [
      "Music",
      "Performing Arts",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Kantha: Weaving Sounds of Asia"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-47.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "64969-1730052000-1730057400@bangaloreinternationalcentre.org",
    "name": "Sound of Streets",
    "startDate": "2024-10-27T18:00:00+05:30",
    "endDate": "2024-10-27T19:30:00+05:30",
    "description": "Teesta Troupers are a collective of musicians, rappers and songwriters that came to life in 2022 in a jam room below a garage on the Teesta highway, set up as a part of the research methodology in the Arts Research project Water Cuts Stone by Veecheet Vigya Dhakal. \nTheir music draws from their experience of growing up along the highway and reflects the hustle, melancholy and dreams of young people from their hometown. They released their debut album Sound of Streets in April 2024. This performance draws an amorphous portrait of the Teesta highway line, capturing the rhythm of life and work along the highway. \nLanguage: Nepali | English \nThis event is in collaboration with India Foundation for the Arts (IFA), as part of their festival Past Forward: The Pleasure, Purpose and Practice of Arts Research, that celebrates the work of over 70 artists in the last 10 years of their Arts Research programme.\n \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sound-of-streets/",
    "keywords": [
      "Music",
      "Performing Arts",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ne",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sound of Streets"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-23.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64974-1730917800-1730923200@bangaloreinternationalcentre.org",
    "name": "Thriving with AI",
    "startDate": "2024-11-06T18:30:00+05:30",
    "endDate": "2024-11-06T20:00:00+05:30",
    "description": "Ravi Bapna and Anindya Ghose, in their new MIT Press book Thrive: Maximizing Well-being in the Age of AI take on the challenge of demystifying AI for the layperson using examples from everyday life. Their hope is that by giving citizens agency and understanding in shaping AI we can get the most out of this newest industrial revolution. \nJoin Ravi Bapna in conversation with Narayan Ramachandran as they chart their way through the ‘House of AI,’ a framework that provides a holistic perspective of the different pillars and layers of AI. They will discuss the role of generative AI versus traditional AI, what barriers companies face in adopting this technology, how we should think about the future of work and reskilling the workforce, and what an agentic future looks like where AI will augment human intelligence and capacity. \nA Q & A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/thriving-with-ai/",
    "keywords": [
      "Society",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-626.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64601-1729418400-1729449000@bangaloreinternationalcentre.org",
    "name": "Cultural Intersections",
    "startDate": "2024-10-20T10:00:00+05:30",
    "endDate": "2024-10-20T18:30:00+05:30",
    "description": "Curated around the Ministry of Culture, Government of India’s targeted sectors, this full-day symposium brings together government representatives, industry professionals, scholars, corporate leaders, and creative practitioners to advance discussions, document insights and learnings, share best practices, and guide policy-making across India’s diverse culture and creative sectors. The two conferences ‘Beyond Tomorrow’ in Kochi and Cultural Continuum in Mumbai were well attended and concluded successfully. The Bengaluru symposium aims to further these conversations and will be followed by a gathering in New Delhi. \nSchedule \n10:00 am – 10:30 am | Registrations \n10:30 am – 10:45 am | Opening Performance – Natyasruti Children’s Music Ensemble | Featuring young talents aged 12 to 15, the Natyasruti Children’s Music Ensemble, will present a performance under the guidance of Sumitra Nitin. Many of these children have won prestigious music competitions, and some have even performed full solo concerts in prominent sabhas. The ensemble members are Aditi Cavale, Aniket Raja PK, Maanasi Gowthaman, Mithil Rao, Pratiksha B Deekshadar, Reethika Rajan, Saikrishna Rajsekar, Saanvi Prasanna, and Tanusri Balakrishnan. The invocation will include slokas and songs honoring the divine, with notable pieces like Sri Muddusvami Dikshithar’s Vatapi Ganapatim Bhajeham in the raga Hamsadhwani and Sri Purandaradasa’s Kannada Devarnama Indina Dinave. \n10:45 am – 10:50 am | Welcome Address by Vikram Bhat \n10:50 am – 11:00 am | Context Setting by Sadhana Rao and Asad Lalljee \n11:00 am – 12:15 pm | Panel 1: Keynote | All collaborators – British Council, UNESCO, Ministry of Culture and representatives from the State Government share their insights with Sanjoy K. Roy, Managing Director, TeamWork Arts. \nLily Pandeya | Joint Secretary, Ministry of Culture, Government of India\nSalma K Fahim, IAS | Secretary, Department of Tourism, Government of Karnataka\nJunhi Han | Programme Specialist and Chief of Section – Culture, UNESCO, New Delhi\nSanjoy K Roy (Moderator) | Co-chair, FICCI Tourism & Culture Committee & MD, Teamwork Arts \n12:15 pm – 1:30 pm | Panel 2: Cultural Platforms and Public Spaces for the Creative Economy | How museums, performing arts centres, and cultural districts are key spaces for creativity – not only preserving history but also fostering artistic experimentation and collaboration, contributing to cultural tourism and local economies. \nPriyanka Mary Francis, IAS | Director, NGMA, Bengaluru\nArundhati Nag | Founder & Managing Trustee, Sanket Trust\nTanya Abraham | Founder, TAOS and Member, FICCI Tourism & Culture Committee\nBijoy Ramachandran | Architect & Partner, Hundredhands\nSanjeev Pasricha (Moderator) | Group CEO, CS Direkt & Member of FICCI Tourism & Culture Committee \n1:30 pm – 2:30 pm | BREAK \n2:30 pm – 2:45 pm | Sufi Kalaam from Punjab | A Performance by Radhika Sood Nayak, Neil Mukherjee & Vinayak Netke \n2:50 pm – 4:05 pm | Panel 3: The Arts, Science, and Economics of the Creative Economy | The symbiotic relationship between the arts, scientific advancements, and economic frameworks within the creative economy. By examining how these disciplines influence each other, the panelists will share insights into the power of creativity as a key driver of economic change and cultural influence. \nJahnavi Phalkey | Founding Director, Science Gallery Bengaluru\nShah Faesal | Deputy Secretary, Ministry of Culture, Government of India\nNeeraj Sharma | Managing Director and Media Industry Practice Lead (APAC), Accenture\nMeru Gokhale | Founder, Editrix.ai\nAsad Lalljee (Moderator) | SVP, Essar Group, CEO, Avid Learning, Curator, Royal Opera House, Mumbai, and Member, FICCI Culture & Tourism Committee \n4:05 pm – 4:30 pm | Tea/ Coffee \n4:30 pm – 5:50 pm | Panel 4: Arts Education: Shaping the Creative Leaders of Tomorrow | The future of arts education and how it must evolve to meet the needs of the creative economy by focusing on the skills required, such as digital literacy, entrepreneurship, and collaboration. \nJanaka Pushpanathan | Director South India, British Council\nVikram Bhat | Director, Bangalore International Center\nPuneeta Roy | Managing Trustee, The Yuva Ekta Foundation\nShilpa Vijaykrishnan | Head of Education & Outreach, MAP\nSadhana Rao (Moderator) | Co-founder, Art Links Learning and Member, FICCI Tourism & Culture Committee \n5:50 pm – 6:10 pm | Stories At The Loom | A Presentation by Pavithra Muddaya, Founder, Vimor | Hear stories of weavers, the custodians of a timeless textile legacy, who have clothed humanity for generations. Handlooms not only preserve cultural heritage but also uphold the dignity of livelihoods, offering sustainable economic success in harmony with both man and nature. \n6:10 pm – 6:20 pm | Vote of Thanks \nIn collaboration with: \n            \n",
    "url": "https://bangaloreinternationalcentre.org/event/cultural-intersections/",
    "keywords": [
      "Culture",
      "Economics",
      "Education",
      "Governance",
      "Performing Arts",
      "Policy & Regulation"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-618.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "64865-1729364400-1729369800@bangaloreinternationalcentre.org",
    "name": "Melodic Revolution",
    "startDate": "2024-10-19T19:00:00+05:30",
    "endDate": "2024-10-19T20:30:00+05:30",
    "description": "The artiste traverses through an exploratory journey covering compelling social themes rendering compositions of renowned poets & composers from yesteryears such as Basavanna, Akka-Mahadevi, Sant Kabir-Das, Annamacharya, Dasa-Saints, Tyagaraja, Subramania Bharatiyar et.al. \nIn this journey, the attempt is to leave the audience with key experiences surrounding social issues such as caste & untouchability, idol worship, patriotism, sacrificial practices etc., while masterfully interspersing Bhakti (devotion) to unify and spread the message of solidarity. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/melodic-revolution/",
    "keywords": [
      "Culture",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Melodic Revolution"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-44.jpg"
  }
]