[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80534-1761937200-1761942600@bangaloreinternationalcentre.org",
    "name": "Mahakali",
    "startDate": "2025-10-31T19:00:00+05:30",
    "endDate": "2025-10-31T20:30:00+05:30",
    "description": "Where time ends, she begins. \nMahakali is a spellbinding Kuchipudi production that delves into the cosmic dance of kAALA (time) and its eternal cycle of creation, preservation, and destruction. Drawing from the mythological universe of the Devi Bhagavatam and Devisaptashati, it brings alive the moment when the universe trembles under the weight of unchecked greed and imbalance, and the divine feminine rises to restore order. Through powerful choreography rooted in classical hastabhinaya, evocative ragas, and richly layered soundscapes, Mahakali captures the goddess’s transformation from Shakti to the vast, all-consuming force of time itself. \nA performance where rhythm becomes ritual, movement becomes mythology, and every beat echoes the turning of time’s eternal wheel. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/mahakali/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_MK.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81232-1761523200-1761609599@bangaloreinternationalcentre.org",
    "name": "389. Aah! Aha! Ha-ha!",
    "startDate": "2025-10-27T05:30:00+05:30",
    "endDate": "2025-10-28T05:30:00+05:30",
    "description": "Are we teaching children what to think, or how to think? When our children focus on rote learning and exam-based academic progress, how do we nurture the inventive Indian who can fuel the imagination of the world with creativity, critical thinking and problem-solving? What if classrooms became labs of imagination, not factories of repetition? \nThese are the questions that the Agastya International Foundation set out to answer 25 years ago, by designing a curiosity-driven, experiential learning model that has transformed education across India. Today, their vision of sparking curiosity, nurturing creativity and instilling confidence and caring has impacted over 25 million schoolchildren and 300,000 teachers in government schools across 23 Indian States. \nAn acclaimed new book from Penguin Random House, The Moving of Mountains traces Agastya’s extraordinary journey in reshaping the classroom by replacing rote learning with hands-on experiments, creative projects and interactive models in science, art and ecology. \nJoin us in a discussion of why this powerful vision for curiosity-driven, experiential learning is critical to the future of India, and has caught the imagination of scientists, industry leaders, educationists and policy makers alike. \nIn this episode of BIC Talks, Adhirath Sethi, Revathi Narayanan, K VijayRaghavan and G K Ananthsuresh will be in conversation with Vikram Bhat. This is an excerpt from a conversation that took place in the BIC premises in Aug 2025. \nSubscribe to the BIC Talks Podcast on your favourite podcast app!\nBIC Talks is available everywhere, including Apple Podcasts, Spotify, Google Podcasts, Castbox, Overcast, Audible, and Amazon Music. \n",
    "url": "https://bangaloreinternationalcentre.org/event/389-aah-aha-ha-ha/",
    "keywords": [
      "Books",
      "Education",
      "Podcast"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-6-7.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80781-1762068600-1762115400@bangaloreinternationalcentre.org",
    "name": "Krishna to Kaveri | ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ",
    "startDate": "2025-11-02T07:30:00+05:30",
    "endDate": "2025-11-02T20:30:00+05:30",
    "description": "Winding and binding, Karnataka’s great rivers have always been more than glorious waterways. From Krishna to Kaveri, our rivers are carriers of culture, stories, and transformation. As they flow across varied landscapes, they shape and are shaped by the people, traditions, and communities they touch.\nKrishna to Kaveri is a two-day celebration that draws from this natural rhythm, exploring how Karnataka’s cultural life is constantly moving, adapting, and renewing itself. From classical roots to contemporary reinterpretations, this festival offers a vibrant weekend that speaks to a new generation. Expect immersive workshops, indulgent cuisines and impactful performances! \nWhether you’re a native Kannadiga or recently moved into Bangalore, this festival is for anyone who wants to connect more deeply with the cultural spirit of the region. Not as outsiders looking in, but as participants in a living, flowing cultural journey.\nLet the rivers lead. Let culture move. Let Karnataka unfold.\nಬಳಸುತ್ತಾ ಬೆಸೆಯುತ್ತಾ ಬೆಳೆಸುತ್ತಾ ಸಾಗುವ ಕರ್ನಾಟಕದ ನದಿಗಳು ವೈಭವದ ಜಲಹರಿವುಗಳು ಮಾತ್ರವಲ್ಲ. ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ ವ್ಯಾಪಿಸಿರುವ ನದಿಗಳು ಸಂಸ್ಖೃತಿಯ, ಕಥೆ-ಪುರಾಣಗಳ, ಪರಿವರ್ತನೆಯ ಚಲನಶೀಲ ವಾಹಕಗಳಾಗಿವೆ. ವೈವಿಧ್ಯಮಯ ಸುಂದರ ಭೂಪ್ರದೇಶಗಳ ನಡುವೆ ಮುನ್ನಡೆವ ಈ ನದಿಗಳು ಜನರನ್ನು, ಪರಂಪರೆಗಳನ್ನು, ಸಮುದಾಯಗಳನ್ನು ರೂಪಿಸುತ್ತಾ, ಪರ್ಯಾಯವಾಗಿ ರೂಪುಗೊಳ್ಳುತ್ತಾ ಸಾಗಿವೆ.\nಈ ಸ್ವಾಭಾವಿಕ ಹರಿವಿನ ಲಯದಿಂದ ಹೊಮ್ಮಿರುವ ಎರಡು ದಿನಗಳ ಉತ್ಸವವೆ ‘ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ ʼ. ಕರ್ನಾಟಕದ ಸಾಂಸ್ಕೃತಿಕ ಬದುಕಿನ ನಿರಂತರ ಚಲನೆಯ, ಹೊಂದಾಣಿಕೆಯ, ಪುನಶ್ಚೇತನದ ಶೋಧನೆ. ಈ ಉತ್ಸವವು ಅಭಿಜಾತ ಬೇರುಗಳಿಂದ ವರ್ತಮಾನದ ಮರುವ್ಯಾಖ್ಯಾನಗಳವರೆಗೆ ಹುರುಪಿನ ವಾರಾಂತ್ಯದಲ್ಲಿ ಹೊಸಪೀಳಿಗೆಗೆ ಒಳನೋಟಗಳನ್ನು ಒದಗಿಸಲಿದೆ. ತಲ್ಲೀನಗೊಳಿಸುವ ಕಾರ್ಯಾಗಾರಗಳು, ರುಚಿಕರ ಆಹಾರ, ಆಕರ್ಷಕ ಸಾಂಸ್ಕೃತಿಕ ಕಾರ್ಯಕ್ರಮಗಳನ್ನು ಈ ಹಬ್ಬದಲ್ಲಿ ನಿರೀಕ್ಷಿಸಬಹುದು.\nನೀವು ಮೂಲ ಕನ್ನಡಿಗರಾಗಿರಿ ಅಥವಾ ಇತ್ತೀಚೆಗಷ್ಟೆ ಹೊರಗಿನಿಂದ ಬೆಂಗಳೂರಿಗೆ ಬಂದಿರುವವರೇ ಆಗಿರಿ. ಈ ನೆಲದ ಸಾಂಸ್ಕೃತಿಕ ಚೇತನದೊಂದಿಗೆ ಆಳವಾಗಿ ಬೆರೆಯುವ ಅವಕಾಶವನ್ನು ಈ ಹಬ್ಬ ನಿಮಗೆ ಒದಗಿಸುತ್ತದೆ. ಇಲ್ಲಿನ ಕಾರ್ಯಕ್ರಮಗಳನ್ನು ನೀವು ಹೊರಗಿನವರಾಗಿ ನಿಂತು ನೋಡುವ ಪ್ರೇಕ್ಷಕರಾಗದೆ ಒಂದು ಜೀವಂತ, ಸಾಂಸ್ಕೃತಿಕ ಯಾನದ ಭಾಗವಾಗಲು ಬನ್ನಿರಿ.\nಮುನ್ನಡೆಸಲಿ ನದಿಗಳು. ಪ್ರವಹಿಸಲಿ ಸಂಸ್ಕೃತಿ. ಗೋಚರವಾಗಲಿ ಕರ್ನಾಟಕದ ಸಿರಿ ವೈಭವ!\nDay 2 Schedule\n7:30 AM – 9:00 AM: Yoga in Karnataka: Concepts and Traditions | ಕನಾ೯ಟಕದಲ್ಲಿ ಯೋಗ:  ಪರಿಕಲ್ಪನೆಗಳು ಮತ್ತು ಪರಂಪರೆ\nExploring the Essence of Yoga in Karnataka  | ಕರ್ನಾಟಕದಲ್ಲಿ ಯೋಗದ ಮೂಲತತ್ವದ ಅನ್ವೇಷಣೆ\nMedha Bhaskar | ಮೇಧಾ ಭಾಸ್ಕರ್\nMedha Bhaskar takes us on a reflective journey into the spirit of yoga as practiced, preserved, and passed on as a living continuum within Karnataka. Beginning with a 45-minute experiential practice of asanas drawn from classical traditions, pranayama, and a short meditation, this session aims to embody the pursuit of balance between the worldly and the transcendent, the individual and the universal. A 30 minute discussion will follow, tracing the evolution of yoga in Karnataka across three broad periods: its ancient roots in Shaiva and Jain ascetic lineages, the medieval flowering of practice and philosophy, and the modern renaissance led by teachers and scholars from Mysore, Bangalore, and beyond. Yoga is both a cultural and contemplative inheritance — a practice through which Karnataka’s intellectual, artistic, and spiritual imagination continues to express itself. The session will close with a Q&A session.\nಮೇಧಾ ಭಾಸ್ಕರ್ ಕರ್ನಾಟಕದಲ್ಲಿ ಆಚರಣೆಯಿಂದ ಬಂದಿರುವ, ಸಂರಕ್ಷಿಸಲ್ಪಟ್ಟಿರುವ ಮತ್ತು ಪೀಳಿಗೆಯಿಂದ ಪೀಳಿಗೆಗೆ ಜೀವಂತವಾಗಿ ಮುಂದುವರಿದಿರುವ ಯೋಗದ ಸಾರವನ್ನು ಪರಿಚಯಿಸುವ ಪರ್ಯಾಲೋಚಕ ಯಾತ್ರೆಗೆ ನಮ್ಮನ್ನು ಕರೆದೊಯ್ಯುತಾರೆ. ಶಾಸ್ತ್ರೀಯ ಪರಂಪರೆಯ ಆಸನ, ಪ್ರಾಣಾಯಾಮ ಮತ್ತು ಸಂಕ್ಷಿಪ್ತ ಧ್ಯಾನದ 45 ನಿಮಿಷಗಳ ಅಭ್ಯಾಸದಿಂದ ಭೌತಿಕ ಮತ್ತು ಆತ್ಮೀಯ ಸಮತೋಲನವನ್ನು ಅನುಭವಿಸಬಹುದು. ನಂತರ 30 ನಿಮಿಷಗಳ ಸಂವಾದದಲ್ಲಿ ಪೌರಾಣಿಕ ಶೈವ-ಜೈನ ಪರಂಪರೆಯ ಬೇರುಗಳು, ಮಧ್ಯಯುಗದ ತತ್ತ್ವ ಮತ್ತು ಅಭ್ಯಾಸದ ಬೆಳವಣಿಗೆ, ಹಾಗೂ ಮೈಸೂರು, ಬೆಂಗಳೂರು ಮುಂತಾದ ಪ್ರದೇಶಗಳ ವಿದ್ವಾಂಸರು, ಶಿಕ್ಷಕರಿಂದ ಉಂಟಾದ ಆಧುನಿಕ ಪುನರುತ್ಥಾನದ ಹಾದಿಯ ಅವಲೋಕನ  ಮಾಡಲಾಗುತ್ತದೆ. ಯೋಗವು ಕರ್ನಾಟಕದ ಬೌದ್ಧಿಕ, ಕಲಾತ್ಮಕ ಮತ್ತು ಆಧ್ಯಾತ್ಮಿಕತೆಯ ಕಲ್ಪನೆಯಾಗಿದ್ದು ಹಿಂದಿನಿಂದ ಬಂದ ಸಾಂಸ್ಕೃತಿಕ ಮತ್ತು ಚಿಂತನಶೀಲ ಬಳುವಳಿಯಾಗಿದೆ. ಪ್ರೇಕ್ಷಕರಿಗೆ ಸಂವಾದದ ಅವಕಾಶ ನೀಡುತ್ತಾ,ಕಾರ್ಯಕ್ರಮವು ಪ್ರಶ್ನೋತ್ತರದೊಂದಿಗೆ ಮುಕ್ತಾಯಗೊಳ್ಳುತ್ತದೆ.\n10:00 AM – 11:00 AM: Songs from the Banks of Krishna and Kaveri | ಕೃಷ್ಣಾ ಮತ್ತು ಕಾವೇರಿ ನದಿ ತೀರದ ಹಾಡುಗಳು\nMelodies of the River Saints | ನದಿ ಸಂತರ ನಾದಗಳು\nChandana Bala Kalyan, Satyajit Sanju & Adarsh Shenoy | ಚಂದನ ಬಾಲ ಕಲ್ಯಾಣ್, ಸತ್ಯಜಿತ್ ಸಂಜು & ಆದರ್ಶ್ ಶೆಣೈ\nStep into the musical world of Karnataka’s rivers, where devotion flows through melody. Chandana Bala Kalyan presents compositions of Saint poets who lived along the Krishna and Kaveri rivers and their tributaries, bringing alive the spiritual voices of centuries past. The evening traces the Abhanga of the Varkaris celebrating Panduranga on the Bhima River, journeys to the Haridasa Sahitya along the Tunga-Bhadra, and celebrates Kodava songs at Talakaveri in Kodagu. It concludes with selections from Mysore composers along the banks of the Kaveri. Accompanied by Satyajit Sanju on harmonium and Adarsh Shenoy on tabla, the performance weaves devotion, rhythm, and story into an immersive experience. \nಭಕ್ತಿ – ನಾದದ ಮೂಲಕ ಹರಿಯುವ ಕರ್ನಾಟಕದ ನದಿಗಳ ಸಂಗೀತ ಲೋಕವನ್ನು ಪ್ರವೇಶಿಸಿ ಬನ್ನಿ. ಚಂದನ ಬಾಲ ಕಲ್ಯಾಣ್ ಅವರು ಕೃಷ್ಣ ಮತ್ತು ಕಾವೇರಿ ನದಿ ತೀರಗಳು ಮತ್ತು ಅಲ್ಲಿನ ಉಪನದಿಗಳ ಸುತ್ತ ಬದುಕಿದ ಸಂತಕವಿಗಳ ರಚನೆಗಳನ್ನು ಪ್ರಸ್ತುತಪಡಿಸಲಿದ್ದಾರೆ.  ಶತಮಾನಗಳ ಹಳೆಯ ಆಧ್ಯಾತ್ಮಿಕ ಧ್ವನಿಗಳನ್ನು ಜೀವಂತಗೊಳಿಸುತ್ತಾರೆ. ಕಾರ್ಯಕ್ರಮವು ಭೀಮಾ ನದಿ ದಂಡೆಯ ಮೇಲೆ ಪಾಂಡುರಂಗನನ್ನು ಸ್ಮರಿಸುವ ವರ್ಕಾರಿಗಳ ಅಭಂಗಗಳನ್ನು ಹಾಡಿಕೊಂಡು ಸಾಗುತ್ತ, ತುಂಗ-ಭದ್ರಾ ನದಿಗಳ ಬಳಿ ಹರಿದಾಸ ಕೃತಿಗಳನ್ನು ಆಸ್ವಾದಿಸುತ್ತಾ, ಕೊಡಗಿನ ತಲಕಾವೇರಿಯಲ್ಲಿ ಕೊಡವರ  ಹಾಡುಗಳನ್ನು ಸಂಭ್ರಮಿಸುತ್ತದೆ. ಅಂತಿಮವಾಗಿ, ಕಾವೇರಿ ತೀರದ ಮೈಸೂರಿನ ವಾಗ್ಗೇಯಕಾರರ ರಚನೆಗಳನ್ನು ಪ್ರಸ್ತುತಪಡಿಸುತ್ತದೆ. ಸತ್ಯಜಿತ್ ಸಂಜು ಹಾರ್ಮೋನಿಯಂ ಮತ್ತು ಆದರ್ಶ್ ಶೆಣೈ ತಬಲಾ ಸಹಕಾರದೊಂದಿಗೆ ನಿರ್ವಹಿಸುವ ಈ ಸಂಗೀತ ಪ್ರದರ್ಶನ ಭಕ್ತಿ, ತಾಳ ಮತ್ತು ಕಥೆಗಳನ್ನು ಮೇಳೈಸಿ ವಿಶಿಷ್ಟ ಅನುಭವವನ್ನು ನೀಡುತ್ತದೆ.\n\n11:00 AM – 12:30 PM: The Missing Rocks of Hampi | ಹಂಪಿಯ ಕಾಣೆಯಾದ ಕಲ್ಲುಗಳು\nHistory, Mystery, and Storytelling for Young Explorers | ಯುವ ಅನ್ವೇಷಕರಿಗೆ ಇತಿಹಾಸ, ನಿಗೂಢತೆ ಹಾಗೂ ಕಥಾ ಹಂದರಗಳು\nFor Ages 6+|6+ ವರ್ಷ ವಯಸ್ಸಿನ ಮಕ್ಕಳಿಗೆ\nMala Kumar | ಮಾಲಾ ಕುಮಾರ್\nRSVP here\nWhat made Hampi one of the most awe-inspiring cities of its time? The Missing Rocks of Hampi uncovers the secret through two thrilling stories: one of Devyani, Sarang, and Nakul, the Seekers from Bengaluru, and another of Shubha, a young dreamer in the Vijayanagara empire. As mysteries unfold along the Tungabhadra, children explore ancient water systems, culture, and clever engineering. The session includes fun, hands-on activities (yes, even acting like langurs!) that make history come alive. This Sunday, Mala Kumar leads an exploration of Hampi: where every rock has a secret to tell! \nಹಂಪಿಯನ್ನು ತನ್ನ ಕಾಲದ ಅತ್ಯಂತ ಅದ್ಭುತ ನಗರವನ್ನಾಗಿಸಿದ್ದು ಏನು? ಕಾಣೆಯಾದ ಹಂಪಿಯ ಶಿಲೆ ಎಂಬ ಕಥೆ ಆ ರಹಸ್ಯವನ್ನು ಅನಾವರಣಗೊಳಿಸುತ್ತದೆ – ಒಂದೆಡೆ ಬೆಂಗಳೂರಿನಿಂದ ಬಂದ ದೇವಯಾನಿ, ಸಾರಂಗ್ ಮತ್ತು ನಕುಲ್‌ ಎಂಬ ಅನ್ವೇಷಕ  ಮಕ್ಕಳ ರೋಚಕ ಸಾಹಸ, ಮತ್ತೊಂದೆಡೆ ವಿಜಯನಗರ ಸಾಮ್ರಾಜ್ಯದ ಕನಸುಗಾರ ಹುಡುಗಿ ಶುಭಾಳ ಬದುಕು. ತುಂಗಭದ್ರಾ ತೀರದಲ್ಲಿ ರಹಸ್ಯಗಳು ಬಿಚ್ಚಿಕೊಳ್ಳುತ್ತಿದ್ದಂತೆ, ಮಕ್ಕಳು ಪುರಾತನ ಜಲವ್ಯವಸ್ಥೆ, ಸಂಸ್ಕೃತಿ ಹಾಗೂ ಕುಶಲ ತಾಂತ್ರಿಕತೆಯನ್ನು ಅನುಭವಿಸುತ್ತಾರೆ. ಈ ಅವಧಿಯಲ್ಲಿ ಇತಿಹಾಸವನ್ನು ಜೀವಂತಗೊಳಿಸುವ ಮೋಜು, ಸಕ್ರಿಯ ಚಟುವಟಿಕೆ (ಮಂಗನಂತಿರುವ ಲಂಗುರ್‌ ನಂತೆ ನಟುಸುವುದೂ ಸೇರಿ) ಎಲ್ಲವೂ ಇರುತ್ತವೆ. ಈ ಭಾನುವಾರ ಮಾಲಾ ಕುಮಾರ್, ಪ್ರತಿಯೊಂದು ಶಿಲೆಗೂ ತಾನು ಹೇಳಬೇಕೆಂದಿರುವ ರಹಸ್ಯದ ಅನ್ವೇಷಣೆಗಾಗಿ ನಿಮ್ಮನ್ನು ಹಂಪಿಯತ್ತ  ಕರೆದೊಯ್ಯುತಾರೆ!\n11:30 AM – 1:00 PM: The Golden Era of Kannada Cinema | ಕನ್ನಡ ಚಿತ್ರರಂಗದ ಸ್ವರ್ಣಯುಗ\nA Journey Through the Cinematic Transformations of 1974–75 | 1974–75 ರ ಚಿತ್ರರಂಗದ ಪರ್ವಕಾಲದೊಳೊಂದು ಪಯಣ\nN S Sridhar Murthy, Sundar Raj & Students of Hamsalekha Desi Vidyalaya | ಎನ್ ಎಸ್ ಶ್ರೀಧರ ಮೂರ್ತಿ, ಸುಂದರ್ ರಾಜ್  & ಹಂಸಲೇಖ ದೇಸಿ ವಿದ್ಯಾಲಯದ ವಿದ್ಯಾರ್ಥಿಗಳು\n\nThe mid-1970s marked a turning point for Kannada cinema, with the shift of film production to Bengaluru and Mysuru, and the arrival of colour films shaping a distinctive identity. Art-house classics like Chomana Dudi and Hamsageethe brought national acclaim, while innovative film music enriched its aesthetic. Legends like Dr. Rajkumar and rising stars such as Vishnuvardhan defined this golden era. This session celebrates that remarkable journey through iconic scenes, vintage posters, and conversations with industry stalwarts, highlighting how these films not only shaped the industry but continue to inspire audiences across generations.\n\n1970ರ ಮಧ್ಯಭಾಗ ಕನ್ನಡ ಚಿತ್ರರಂಗದ ಪರ್ವಕಾಲವಾಗಿದ್ದು, ಚಿತ್ರತಯಾರಿಕೆ ಬೆಂಗಳೂರು ಮತ್ತು ಮೈಸೂರಿಗೆ ಸ್ಥಳಾಂತರಗೊಂಡಿತು. ಬಹುತೇಕ ವರ್ಣಚಿತ್ರಗಳೇ ರೂಪುಗೊಳ್ಳುತ್ತಾ ವಿಶಿಷ್ಟತೆಯನ್ನು ಹೆಚ್ಚಿಸಿತು. ಚೋಮನ ದುಡಿ, ಹಂಸಗೀತೆಯಂತಹ ಕಲಾತ್ಮಕ ಚಿತ್ರಗಳು ರಾಷ್ಟ್ರ ಮಟ್ಟದಲ್ಲಿ ಮೆಚ್ಚುಗೆ ಪಡೆದವು. ನವೀನ ಬಗೆಯ ಪ್ರಯೋಗಗಳು ಚಿತ್ರಸಂಗೀತವನ್ನು ಶ್ರೀಮಂತಗೊಳಿಸಿದವು. ಡಾ. ರಾಜಕುಮಾರ್ ಆಗಲೇ ಜನಪ್ರಯರಾಗಿದ್ದು ವಿಷ್ಣುವರ್ಧನ್ ಮುಂತಾದ ಕಲಾವಿದರು ಈ ಸುವರ್ಣ ಯುಗವನ್ನು ಪ್ರಭಾವಿಸಿದರು. ಇಂದಿಗೂ ಎಲ್ಲ ಪೀಳಿಗೆಯವರನ್ನು ಪ್ರೇರೇಪಿಸುತ್ತಿರುವ ಈ ಚಿತ್ರಗಳ ಯುಗ ಪ್ರವರ್ತಕ ದೃಶ್ಯಗಳು, ಹಳೆಯ ಪೋಸ್ಟರ್‌ಗಳು ಮತ್ತು ಸಿನಿ ತಾರೆಯರೊಂದಿಗಿನ ಸಂವಾದಗಳ ಮೂಲಕ ಆ ಅದ್ಭುತ ಪಯಣವನ್ನು ಸಂಭ್ರಮಿಸಲಾಗುತ್ತದೆ.\n2:00 PM – 3:30 PM: Digital Kannada Fonts | ಡಿಜಿಟಲ್ ಕನ್ನಡ ಅಕ್ಷರಶೈಲಿ\nBridging Traditional and Modern Communication | ಸಾಂಪ್ರದಾಯಿಕ ಮತ್ತು ಆಧುನಿಕ ಸಂವಹನದ ಸೇತುವೆ\nManjunatha R\u2028| ಮಂಜುನಾಥ  ಆರ್\nRSVP here\nDiscover the art and evolution of Kannada script in this hands-on font design workshop with Manjunatha R. Participants will explore how the careful crafting of letters can preserve cultural identity while adapting to modern communication. The session blends tradition and creativity, showing how digital and hand-rendered forms of the script connect heritage with contemporary design. By the end, you’ll gain practical skills, a deeper appreciation for the script, and the confidence to create your own Kannada lettering!\nಮಂಜುನಾಥ ಆರ್ ಅವರೊಂದಿಗೆ ನಡೆಯುವ ಈ ಅನುಭವಾತ್ಮಕ ಅಕ್ಷರ ವಿನ್ಯಾಸ ಕಾರ್ಯಾಗಾರದಲ್ಲಿ ಕನ್ನಡ ಲಿಪಿಯ ಕಲೆ ಮತ್ತು ಬೆಳವಣಿಗೆಯನ್ನು ಅನ್ವೇಷಿಸುತ್ತಾ. ಸೂಕ್ಷ್ಮವಾಗಿ ರೂಪಿಸಿದ ಅಕ್ಷರಗಳು ಸಾಂಸ್ಕೃತಿಕ ಗುರುತನ್ನು ಹೇಗೆ ಉಳಿಸಿಕೊಳ್ಳುತ್ತವೆ ಮತ್ತು ಆಧುನಿಕ ಸಂವಹನಕ್ಕೆ ಹೇಗೆ ಹೊಂದಿಕೊಳ್ಳುತ್ತವೆ ಎಂಬುದನ್ನು ಅನುಭವಾತ್ಮಕವಾಗಿ ಅರಿಯಲು ಅವಕಾಶವಿರುತ್ತದೆ. ಪರಂಪರೆ ಮತ್ತು ಸೃಜನಾತ್ಮಕತೆಯನ್ನು ಬೆಸೆಯುವ ಈ ಅವಧಿ, digital ಹಾಗೂ ಕೈಯಿಂದ ರೂಪಿಸಲಾದ ಲಿಪಿ ರೂಪಗಳು ಪರಂಪರೆ ಮತ್ತು ಸಮಕಾಲೀನ ವಿನ್ಯಾಸದ ನಡುವೆ ಹೇಗೆ ಸೇತುವೆಯಾಗಿ ನಿಲ್ಲುತ್ತವೆ ಎಂಬುದನ್ನು ತೋರಿಸುತ್ತದೆ. ಕಾರ್ಯಾಗಾರದ ಅಂತ್ಯದ ವೇಳೆಗೆ, ನೀವು ಪ್ರಾಯೋಗಿಕ ಕೌಶಲ್ಯಗಳ ಜೊತೆಗೆ ಕನ್ನಡ ಲಿಪಿಯ ಬಗ್ಗೆ ಹೊಸ ಮೆಚ್ಚುಗೆಯನ್ನೂ ಪಡೆದುಕೊಳ್ಳುತ್ತೀರಿ — ಹಾಗೆಯೇ ನಿಮ್ಮದೇ ಅಕ್ಷರವಿನ್ಯಾಸ  ಮಾಡಲು ಆತ್ಮವಿಶ್ವಾಸವನ್ನೂ  ಸಹ!\n\n3:00 PM – 4:30 PM: Ilidu Baa Taaye | ಇಳಿದು ಬಾ ತಾಯೆ\nA Journey Through Emotion and Melody | ಭಾವ ಮತ್ತು ಮಧುರಗಾನದ ಪಯಣ\nSupriya Raghunandan, Mangala Ravi, Anagha Hegde, Shashidhara Narasimhaswamy, Smriti Kumar, Srushti Umesh, Raj Kiran, Ravi Kiran & Srushti Srinivas | ಸುಪ್ರಿಯಾ ರಘುನಂದನ್, ಮಂಗಳಾ ರವಿ, ಅನಘಾ ಹೆಗಡೆ, ಶಶಿಧರ ನರಸಿಂಹಸ್ವಾಮಿ, ಸ್ಮೃತಿ ಕುಮಾರ್, ಸೃಷ್ಟಿ ಉಮೇಶ್, ರಾಜ್ ಕಿರಣ್, ರವಿ ಕಿರಣ್ & ಸೃಷ್ಟಿ ಶ್ರೀನಿವಾಸ್\nThis 90-minute concert celebrates Sugama Sangeetha, Karnataka’s distinctive light music tradition that seamlessly blends classical and folk strains to amplify emotions – devotion, love towards people and nature and philosophical outlook. Experience the timeless verses of literary greats such as Bendre, Kuvempu, Gopalakrishna Adiga, G.P. Rajaratnam, Dr. G.S. Shivarudrappa and Dr. H.S. Venkateshamurthy brought alive through the evocative compositions of Balappa Hukkeri, Padmacharan, H.R. Leelavathi, Mysore Ananthaswamy, Dr. C. Ashwath, and Raju Ananthaswamy. An evening where words and music entwine to stir the heart and mind!\n90 ನಿಮಿಷಗಳ ಈ ಕಾರ್ಯಕ್ರಮವು ಶಾಸ್ತ್ರೀಯ ಮತ್ತು ಜನಪದ ಶೈಲಿಗಳನ್ನು ಮೇಳೈಸಿ ಜನರು ಮತ್ತು ಪ್ರಕೃತಿಯ ಬಗೆಗಿನ ಪ್ರೀತಿ, ಭಕ್ತಿ ಭಾವನೆ ಮತ್ತು ತತ್ತ್ವಚಿಂತನೆಗಳನ್ನು ಹೊರಹೊಮ್ಮಿಸುವ ಕರ್ನಾಟಕದ ಸುಗಮ ಸಂಗೀತದ ವೈಶಿಷ್ಟ್ಯತೆಯನ್ನು ಸಂಭ್ರಮಿಸುತ್ತದೆ. ಬೇಂದ್ರೆ, ಕುವೆಂಪು, ಗೋಪಾಲಕೃಷ್ಣ ಅಡಿಗ, ಜಿ.ಪಿ. ರಾಜರತ್ನಂ, ಡಾ. ಜಿ.ಎಸ್. ಶಿವರುದ್ರಪ್ಪ ಮತ್ತು ಡಾ. ಎಚ್.ಎಸ್. ವೆಂಕಟೇಶಮೂರ್ತಿ ಮುಂತಾದ ದಿಗ್ಗಜ ಸಾಹಿತ್ತಿಗಳ ಕಾಲಾತೀತ ಪದ್ಯಗಳನ್ನು, ಬಾಳಪ್ಪ ಹುಕ್ಕೇರಿ, ಪದ್ಮಚರಣ್, ಎಚ್.ಆರ್. ಲೀಲಾವತಿ, ಮೈಸೂರು ಅನಂತಸ್ವಾಮಿ, ಡಾ. ಸಿ. ಅಶ್ವಥ್ ಮತ್ತು ರಾಜು ಅನಂತಸ್ವಾಮಿ ಅವರುಗಳ ಸಂಯೋಜನೆಗಳು ಜೀವಂತಗೊಳಿಸಿವೆ. ಬನ್ನಿ, ನಮ್ಮ ಹೃದಯ-ಮನಸ್ಸುಗಳನ್ನು ಮುದಗೊಳಿಸುವ, ಸಂಗೀತ ಮತ್ತು ಭಾವಪೂರ್ಣ ಕವಿತೆಗಳು ಮೇಳೈಸುವ ಈ ಸಂಜೆಯಲ್ಲಿ ಜೊತೆಯಾಗೋಣ!\n3:00 PM – 4:30 PM: Chittara Folk Art for Kids | ಚಿತ್ತಾರ – ಮಕ್ಕಳಿಗಾಗಿ ಜಾನಪದ ಕಲೆ\nFrom Mud Walls to Little Hands, Chittara Comes Alive! | ಮಣ್ಣಿನ ಗೋಡೆಗಳಿಂದ ಹಸುಳೆಗಳ ಕೈಗಳವರೆಗೂ, ಚಿತ್ತಾರ ಮತ್ತೆ ಜೀವಂತವಾಗುತ್ತದೆ!\nFor Ages 6+|6+ ವರ್ಷ ವಯಸ್ಸಿನ ಮಕ್ಕಳಿಗೆ\nGeetha Bhat & Shruti Belli | ಗೀತಾ ಭಟ್  & ಶೃತಿ ಬೆಳ್ಳಿ\nRSVP here\n\nChittara is a traditional mural art form of the Deevaru community from the Shivamogga district of Karnataka. In this playful, hands-on workshop, children will discover how simple lines, patterns, and natural colours come together to tell stories of everyday life. They’ll learn about the symbolism and eco-friendly materials behind this beautiful tradition and create their very own Chittara painting: a joyful keepsake of Karnataka’s living heritage!\nಶಿವಮೊಗ್ಗ ಜಿಲ್ಲೆಯ ದೀವರು ಸಮುದಾಯದ ಸಾಂಪ್ರದಾಯಿಕ ಭಿತ್ತಿ ಚಿತ್ರಕಲೆ — ಚಿತ್ತಾರ. ಈ ಹರ್ಷಭರಿತ ಚಟುವಟಿಕೆ ಆಧಾರಿತ ಕಾರ್ಯಾಗಾರದಲ್ಲಿ ಮಕ್ಕಳು ಸರಳ ರೇಖೆಗಳಿಂದ, ವಿನ್ಯಾಸಗಳಿಂದ ಮತ್ತು ನೈಸರ್ಗಿಕ ಬಣ್ಣಗಳಿಂದ ಕಥೆಗಳನ್ನು ಹೇಗೆ ಮೂಡಿಸಬಹುದು ಎಂಬುದನ್ನು ತಿಳಿಯುತ್ತಾರೆ. ಜೀವನದ ದೈನಂದಿನ ಸಂಗತಿಗಳನ್ನೇ ಕಲೆಯಾಗಿ ನೋಡುವ ಈ ಪರಂಪರೆಯಲ್ಲಿರುವ ಅರ್ಥಗಳು, ಸಂಕೇತಗಳು ಮತ್ತು ಪರಿಸರಸ್ನೇಹಿ ವಸ್ತುಗಳ ಕುರಿತು ತಿಳಿದುಕೊಳ್ಳುತ್ತಾರೆ. ಅಂತಿಮವಾಗಿ, ಕರ್ನಾಟಕದ ಜೀವಂತ ಪರಂಪರೆಯ ಸುಂದರ ನೆನಪಾಗಿ ತಮ್ಮದೇ ಕೈಯಿಂದ ರಚಿಸಲಾದ ಸಣ್ಣಪುಟ್ಟ ಚಿತ್ತಾರ ಚಿತ್ರಗಳನ್ನು ತಮ್ಮ ಬಳಿಯೇ ಉಳಿಸಿಕೊಳ್ಳುತ್ತಾರೆ.\n5:00 PM – 6:30 PM: Digital Kannada Fonts | ಡಿಜಿಟಲ್ ಕನ್ನಡ ಅಕ್ಷರಶೈಲಿ\nBridging Traditional and Modern Communication | ಸಂಪ್ರದಾಯ ಮತ್ತು ಆಧುನಿಕ ಸಂವಹನ\nManjunatha R\u2028| ಮಂಜುನಾಥ ಆರ್\nRSVP here\n5:30 PM – 7:00 PM: Wondrous Flow of Krishna and Kaveri | ಕೃಷ್ಣೆ-ಕಾವೇರಿಯರ ಹರಿವಿನ ಬೆರಗು\nEnchanting Glow of Folk Faith | ಜನಪದರ ಭಕ್ತಿ-ನಂಬಿಕೆಯ ಸೊಬಗು\nSrinivasa G Kappanna & Savithakka (Savitha Ganesh Prasad) | ಶ್ರೀನಿವಾಸ ಜಿ ಕಪ್ಪಣ್ಣ & ಸವಿತಕ್ಕ (ಸವಿತಾ ಗಣೇಶ್ ಪ್ರಸಾದ್)\n\nThis 90-minute folk music session celebrates the soulful songs that have flowed through generations along the banks of the Krishna and Kaveri – rivers that nurture the very heart of our cultural spirit. These songs mirror the lives, beliefs, and spiritual faith of village folk, capturing the depth of their lived and devotional experiences. Born of vibrant oral traditions, these melodies give voice to the people’s deep reverence for deities such as Yellamma, Kaveramma, Chamundi, Madeshwara, Shiva, Mailaralinga, and many others. Songs of belief and belonging, they continue to shape both their hearts and ours.\n90 ನಿಮಿಷಗಳ ಜನಪದ ಗೀತೆಗಳ ಈ ಪಯಣದಲ್ಲಿ ನಮ್ಮ ಸಂಸ್ಕೃತಿಯ ಜೀವಾಳವಾದ ಕೃಷ್ಣ ಮತ್ತು ಕಾವೇರಿ ನದಿಗಳ ಆಸು ಪಾಸಿನ ಪ್ರದೇಶಗಳಲ್ಲಿ ಹುಟ್ಟಿದ ಜನಪದರ ಹಾಡುಗಳನ್ನು ಸಂಭ್ರಮಿಸಲಾಗುತ್ತದೆ. ಈ ಹಾಡುಗಳು ನಮ್ಮ ಹಳ್ಳಿಗರ ಬದುಕು, ನಂಬಿಕೆ, ಸಂಸ್ಕೃತಿ, ಆಧ್ಯಾತ್ಮದ ಸ್ಪಂದನೆ ಮತ್ತು ಜೀವನಾನುಭವದ ಪ್ರತೀಕಗಳಾಗಿ ಹೊರಹೊಮ್ಮಿವೆ. ಯಲ್ಲಮ್ಮ, ಕಾವೇರಮ್ಮ, ಚಾಮುಂಡಿ, ಮಾದೇಶ್ವರ, ಶಿವ, ಮೈಲಾರಲಿಂಗ ಮುಂತಾದ ದೈವಗಳ ಮೇಲಿನ ಜನರ ನಂಬಿಕೆಗಳು ಮೂರ್ತಿವೆತ್ತಂತೆ ಈ ಹಾಡುಗಳು ಮೌಖಿಕವಾಗಿ ರೂಪುಗೊಂಡಿವೆ. ಹೀಗೆ ರೂಪುಗೊಂಡ ಸಾಮುದಾಯಿಕ ಗೀತೆಗಳು ಜನರ ಬದುಕನ್ನು, ನಮ್ಮ ಮನಸ್ಸನ್ನು ಹದಗೊಳಿಸುತ್ತವೆ.\n7:30 PM – 9:00 PM: Vasu Dixit Collective | ವಾಸು ದೀಕ್ಷಿತ್‌  ಕಲೆಕ್ಟಿವ್\nElectronic Folk Music | ಇಲೆಕ್ಟ್ರಾನಿಕ್ ಫೋಕ್ ಮ್ಯೂಸಿಕ್\nVasu Dixit, Manu Shrivastava & Joel Sakkari | ವಾಸು ದೀಕ್ಷಿತ್, ಮನು ಶ್ರೀವಾಸ್ತವ & ಜೋಯೇಲ್ ಸಕ್ಕರಿ\nThe Vasu Dixit Collective perform writings of celebrated poets and lyricists set to a fusion of guitars, vocals and synths. Their repertoire includes special renditions of poems by saint poets such as Purandaradasa, Basavanna, and Kabir that reflect the energetic and soulful performance style of front-man Vasu Dixit. A strand from Vasu Dixit’s illustrious journey as a composer, musician, and filmmaker, VDC is a coming together of his many artistic nuances into one space and offers a free-spirited celebration of life. Folktronica or electronic folk is a musical genre that combines elements from folk and electronica, frequently incorporating acoustic instruments, particularly stringed ones and embraces a diverse range of influences that vary based on the artists’ sound choices.\n“ವಾಸು ದೀಕ್ಷಿತ್ ಕಲೆಕ್ಟಿವ್” ಪ್ರಸಿದ್ಧ ಕವಿಗಳು ಮತ್ತು ಗೀತರಚನೆಕಾರರ  ಕೃತಿಗಳನ್ನು ಗಿಟಾರ್, ಗಾಯನ ಮತ್ತು “ಸಿಂಥ್” ಗಳ ಸಂಯೋಜನೆಯೊಂದಿಗೆ ಹೊಸ ರೂಪದಲ್ಲಿ ಪ್ರಸ್ತುತಪಡಿಸುವ ತಂಡ.‌ ಪುರಂದರ ದಾಸ, ಬಸವಣ್ಣ, ಕಬೀರ ರಂತಹ ಸಂತ ಕವಿಗಳ ರಚನೆಗಳನ್ನು ಪ್ರಭಾವಶಾಲಿ ಕಂಠದ ವಾಸು ದೀಕ್ಷಿತ್ ತಮ್ಮದೇ ಶೈಲಿಯಲ್ಲಿ ಹಾಡಿ ಕೇಳುಗರಿಗೆ ಸ್ಪೂರ್ತಿಯಾಗುತ್ತಾರೆ. . ಸಂಗೀತಗಾರ, ಸಂಯೋಜಕ ಮತ್ತು ಚಲನಚಿತ್ರ ತಯಾರಕರಾಗಿ ವಾಸು ದೀಕ್ಷಿತ್ ಹಾದು ಬಂದ ವಿಶಿಷ್ಟ ಕಲಾ ಪಯಣದ ಒಂದು ಅಂಶವಾದ “ವಾಸು ದೀಕ್ಷಿತ್ ಕಲೆಕ್ಟಿವ್” ಜೀವನವನ್ನು ಉಲ್ಲಾಸಮಯ ಸಂಗೀತ ಸಂಭ್ರಮವಾಗಿ ರೂಪಾಂತರಗೊಳಿಸುವ ವೇದಿಕೆಯಾಗಿದೆ. “ಫೋಕ್‌ಟ್ರಾನಿಕಾ” ಅಥವಾ “ಎಲೆಕ್ಟ್ರಾನಿಕ್ ಫೋಕ್” ಅನ್ನುವುದು ಜನಪದ ಮತ್ತು ಎಲೆಕ್ಟ್ರಾನಿಕ್ ಸಂಗೀತದ ಸಂಯೋಜನೆ – ಸಾಮಾನ್ಯವಾಗಿ ತಂತಿವಾದ್ಯಗಳಂತಹ ಸಾಂಪ್ರದಾಯಿಕ ವಾದ್ಯಗಳ ಜೊತೆಗೆ, ಆಧುನಿಕ ಧ್ವನಿವಿನ್ಯಾಸಗಳನ್ನು  ಸಂಯೋಜಿಸಿ, ಕಲಾವಿದರ ಶೈಲಿಗೆ ತಕ್ಕಂತೆ ವೈವಿಧ್ಯಮಯ ಪ್ರೇರಣೆಗೊಳಗಾಗುತ್ತದೆ.\nAcross the Weekend | 11:00 AM – 7:00 PM\nExploring Karnataka Exhibition | ಕರ್ನಾಟಕ ಕುರಿತ ಪ್ರದರ್ಶನದೊಳಗೊಂದು ಸುತ್ತು\nMonuments from across the State by Rudragaud Indi | ರುದ್ರಗೌಡ ಇಂಡಿ ಅವರಿಂದ ರಾಜ್ಯದೆಲ್ಲೆಡೆಯ ಪ್ರದರ್ಶನ ಸ್ಮಾರಕಗಳು\nGround Floor Foyer\nJourney through Karnataka’s monuments and marvels—an ode to the state’s rich heritage, innovation, and timeless artistry captured through striking pieces from across the region.\nಕರ್ನಾಟಕದ ಸ್ಮಾರಕಗಳ ಮತ್ತು ಅದ್ಭುತಗಳ ಲೋಕದಲ್ಲಿ ಒಂದು ಸಂಚಾರ — ಈ ರಾಜ್ಯದ ಸಮೃದ್ಧ ಪರಂಪರೆ, ಹೊಸ ಆವಿಷ್ಕಾರ ಮನೋಭಾವ ಹಾಗೂ ಕಾಲಾತೀತ ಕಲಾಮೌಲ್ಯಗಳನ್ನು ಒಳಗೊಂಡ ಕಲಾಕೃತಿಗಳ ಮೂಲಕ ಸಂಭ್ರಮಿಸುವ ನಮನ.\nAata Aadu Bengaluru by Kavade | ಕವಡೆ ತಂಡದಿಂದ ಆಟ ಆಡು ಬೆಂಗಳೂರು\nLearn to Play Traditional Board Games with Family and Friends | ಮನೆ ಮಂದಿ ಮತ್ತು ಗೆಳೆಯರೊಂದಿಗೆ ಪಾರಂಪರಿಕ ಮಣೆಯಾಟಗಳನ್ನಾಡಲು ಕಲಿಯಿರಿ\nGround Floor Foyer\nRoll the dice, count your seeds, and rediscover joy! Traditional board games for all ages—where fun, family, and a touch of nostalgia meet.\nಪಾಸೆ ಎಸೆದು, ಅಕ್ಕಿ ಎಣಿಸಿ, ಹಳೆ ಖುಷಿಯನ್ನು ಮತ್ತೆ ಕಂಡುಹಿಡಿಯಿರಿ! ಎಲ್ಲಾ ವಯಸ್ಸಿನವರಿಗೂ ಸೂಕ್ತವಾದ ಈ ಪೌರಾಣಿಕ ಆಟಗಳಲ್ಲಿ ಸಂಭ್ರಮ, ಕುಟುಂಬ ಮತ್ತು ನೆನಪಿನ ಸಿಹಿತನ ಒಂದೇ ವೇದಿಕೆಯಲ್ಲಿ ಸೇರುತ್ತವೆ.\nArt Showcase by Art Park | ಆರ್ಟ್‌ ಪಾರ್ಕ್‌ ವತಿಯಿಂದ ಕಲಾ ಪ್ರದರ್ಶನ\nDisplay of Traditional Arts by Modern Artists | ಆಧುನಿಕ ಕಲಾವಿದರಿಂದ ಪಾರಂಪರಿಕ ಕಲಾ ಪ್ರದರ್ಶನ\nFirst Floor Foyer\nA vibrant display where young artists reinterpret Karnataka’s traditional art forms through contemporary eyes—bridging heritage and modernity in bold, creative strokes.\nಯುವ ಕಲಾವಿದರು ಕರ್ನಾಟಕದ ಪಾರಂಪರಿಕ ಕಲಾರೂಪಗಳನ್ನು ಆಧುನಿಕ ದೃಷ್ಟಿಯಿಂದ ಮರುಸ್ವರೂಪಗೊಳಿಸಿರುವ ಚೈತನ್ಯಭರಿತ ಪ್ರದರ್ಶನ — ಪಾರಂಪರ್ಯ ಮತ್ತು ನವೀನತೆಯ ಸೇತುವೆಯಂತೆ, ಕಲಾತ್ಮಕ ಹೊಳೆಯೊಳಗೆ ನಿಮಗೂ ಆಹ್ವಾನ.\nBook Nook by Atta Galata | ಆಟಾ ಗಲಾಟ ವತಿಯಿಂದ ಪುಸ್ತಕ ಮೂಲೆ\nRead. Revel. Rejoice. | ಓದಿ. ಸಂಭ್ರಮಿಸಿ. ಆನಂದಿಸಿ.\nHall 2\nFind your next Kannada favourite! A cozy corner to browse, read, and revel in stories from Karnataka’s literary landscape—perfect for readers of all ages.\nನಿಮ್ಮ ಮುಂದಿನ ನೆಚ್ಚಿನ ಕನ್ನಡ ಪುಸ್ತಕವನ್ನು ಇಲ್ಲಿ ಕಂಡುಹಿಡಿಯಿರಿ! ಕರ್ನಾಟಕದ ಸಾಹಿತ್ಯಲೋಕದ ಕಥೆಗಳಲ್ಲಿ ತಲೆಮರೆಸಿಕೊಳ್ಳಲು ಸೂಕ್ತವಾದ — ಎಲ್ಲಾ ವಯಸ್ಸಿನ ಓದುಗರಿಗೂ ಮನಸೂರೆಗೊಳ್ಳುವ ಹಿತಕರ ಪುಸ್ತಕ ಮೂಲೆ.\nKarnataka Wildlife in Light and Shadow\u2028| ನೆರಳು ಬೆಳಕಿನಲ್ಲಿ ಕರ್ನಾಟಕದ ವನ್ಯಜೀವಿ ಸಂಕುಲ\nCapturing Biodiversity by Arun Kumar Krishnaiah | ಅರುಣ್‌ ಕುಮಾರ್‌ ಕೃಷ್ಣಯ್ಯ ಅವರಿಂದ ಜೀವವೈವಿಧ್ಯದ ಬೆಡಗಿನ ಸೂರೆ\nGallery\nThrough Arun Kumar Krishnaiah’s lens, glimpse Karnataka’s wild heart—majestic, intimate, and alive in every play of light, shadow, and silence.\nಅರುಣ್ ಕುಮಾರ್ ಕೃಷ್ಣಯ್ಯ ಅವರ ಕ್ಯಾಮೆರಾ ಕಣ್ಣಿನ ಮೂಲಕ ಕರ್ನಾಟಕದ ಕಾಡಿನ ಮಿಡಿತವನ್ನು ಅನುಭವಿಸಿ — ಪ್ರತಿಯೊಂದು ಬೆಳಕು, ನೆರಳು ಮತ್ತು ಮೌನದಲ್ಲೂ ಜೀವಂತವಾಗಿರುವ ಗೌರವಪೂರ್ಣ, ಆಂತರಿಕ ಮತ್ತು ಚೇತನಭರಿತ ಪ್ರಕೃತಿಯ ರಹಸ್ಯ ಮುಖಗಳನ್ನು ನೋಡಬಹುದು.\nChasing Clues, Celebrating Culture | ಸುಳುಹುಗಳ ಬೆನ್ನು ಹತ್ತಿ, ಸಂಸ್ಕೃತಿಯ ವಿಜೃಂಭಣೆ\nA Scavenger Hunt through Karnataka! | ಕರ್ನಾಟಕದ ಉದ್ದಗಲಕ್ಕೆ ಒಂದು ಸಂಸ್ಕೃತಿ-ಶೋಧಕ ಬೇಟೆ!\nAcross the Building\nUnravel riddles, uncover stories, and race through Karnataka’s cultural heritage—an exciting scavenger hunt adventure for the whole family at BIC!\nಒಗಟುಗಳನ್ನು ಬಿಚ್ಚಿ, ಕಥೆಗಳನ್ನು ಪತ್ತೆಹಚ್ಚಿ, ಕರ್ನಾಟಕದ ಸಂಸ್ಕೃತಿಯ ಹಾದಿಯಲ್ಲಿ ಓಡಾಡಿ — ಕುಟುಂಬದ ಎಲ್ಲ ಸದಸ್ಯರಿಗೂ ರೋಚಕ ಅನುಭವ ಕೊಡುವ ಈ ಹುಡುಕಾಟ ಸಾಹಸಕ್ಕೆ BICನಲ್ಲಿ ಭಾಗಿಯಾಗಿ!\nWomen Vachana Poets of Karnataka by Azim Premji University | ಅಜೀಂ ಪ್ರೇಮ್‌ಜಿ ವಿಶ್ವವಿದ್ಯಾನಿಲಯದ ವತಿಯಿಂದ ಕರ್ನಾಟಕದ ವಚನಕಾರ್ತಿಯರು\nCataloguing the Wisdom of Life  | ಜೀವನ ವಿವೇಕದ ಸಂಗ್ರಹ\nSecond Floor Foyer\nDiscover the poetic soul of North Karnataka—vachanas brought to life through research, illustration, and design, preserving voices that continue to inspire centuries later.\nಉತ್ತರ ಕರ್ನಾಟಕದ ಕಾವ್ಯಾತ್ಮಕ ಆತ್ಮವನ್ನು ಅನ್ವೇಷಿಸಿ — ಸಂಶೋಧನೆ, ಚಿತ್ರಣ ಮತ್ತು ವಿನ್ಯಾಸಗಳ ಮೂಲಕ ಜೀವಂತಗೊಳಿಸಿರುವ ವಚನಗಳು, ಶತಮಾನಗಳ ನಂತರವೂ ಪ್ರೇರಣೆ ನೀಡುತ್ತಿರುವ ಸ್ವರಗಳನ್ನು ಸಂರಕ್ಷಿಸುತ್ತವೆ.\nSculptures in Soap | ಸಾಬೂನಿನಲ್ಲಿ ಶಿಲ್ಪಗಳು\nA Legacy Preserved by N S Seshadri (1936-2009)|ಎನ್‌ ಎಸ್‌ ಶೇಷಾದ್ರಿ (1936-2009) ಅವರಿಂದ ಪರಂಪರೆಯ ಸಂರಕ್ಷಣೆ \nSecond Floor Foyer\nN S Seshadri (1936-2009) was an incredibly gifted artist whose legacy has been preserved through intricately carved soap sculptures. Self-taught, he created with passion and precision in equal measure. His daughter, Chinmai, has curated a selection of the 60-year-old sculptures in display of skill and devotion to craft.\nಅದ್ಭುತ ಸಹಜ ಪ್ರತಿಭೆಯ ಮೇರು ಕಲಾವಿದರಾದ ಎನ್‌ . ಎಸ್‌. ಶೇಷಾದ್ರಿ (1936-2009) ಅವರ ಕಲಾ ಪರಂಪರೆಯು ಸೂಕ್ಷ್ಮವಾಗಿ ಕೆತ್ತಲ್ಪಟ್ಟಿರುವ ಸಾಬೂನು ಶಿಲ್ಪಗಳಲ್ಲಿ ಜೀವಂತವಾಗಿ ಉಳಿದಿದೆ. ಸ್ವ-ಕಲಿಕೆಯಿಂದ ರೂಪುಗೊಂಡ ಒತ್ತಾಸೆಯೊಂದಿಗೆ ನಿಖರತೆಯ ಸಮಾನ ಸಂಯೋಜನೆ ಅವರ ಕಲೆಯ ವಿಶಿಷ್ಠತೆ. ಅವರ ಪುತ್ರಿ ಚಿನ್ಮಯಿ ಅವರು ಕೌಶಲ್ಯ ಹಾಗೂ ಕಲಾನಿಷ್ಠೆಯನ್ನು  ಬಿಂಬಿಸುವ ಆರು ದಶಕಗಳ ಕಲಾಕೃತಿಗಳನ್ನು ಆಯ್ದು ಸಂಗ್ರಹಿಸಿ ರಸಾಸ್ವಾದನೆಗೆ ಒದಗಿಸಿದ್ದಾರೆ. \n  \nFind the schedule for Day 1 here!\n  \nPresented by:\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/k2k25-day-2/",
    "keywords": [
      "Bangalore",
      "Books",
      "Culture",
      "Food",
      "Heritage",
      "Krishna to Kaveri",
      "Language",
      "Literature",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-day-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80566-1761849000-1761854400@bangaloreinternationalcentre.org",
    "name": "Bengaluru Bus Stories",
    "startDate": "2025-10-30T18:30:00+05:30",
    "endDate": "2025-10-30T20:00:00+05:30",
    "description": "Carrying the people and pulse of a city. \nBengaluru Bus Stories is a conversation on how public transport weaves lives together by connecting neighbourhoods, opportunities, and communities across the city. Drawing from EQUIMOB, an international research collaboration between the Institute for Social and Economic Change, Utrecht University, Bangalore Bus Prayaanikara Vedike, and SAMVADA, the discussion explores how buses shape daily life, build connections, and remain vital to the city’s social fabric. \nModerated by Dr. Ranjana Raghunathan of Vidyashilp University, the panel brings together researchers and activists reflecting on their work with commuters and policymakers, reimagining Bengaluru’s buses as true lifelines that are designed with care, inclusion, and dignity at the core. \nPlease note: The session will be bilingual in English and Kannada. \n",
    "url": "https://bangaloreinternationalcentre.org/event/bengaluru-bus-stories/",
    "keywords": [
      "Bangalore",
      "Books",
      "Cities",
      "Culture"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-38-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "80838-1761678000-1761683400@bangaloreinternationalcentre.org",
    "name": "European Treasures",
    "startDate": "2025-10-28T19:00:00+05:30",
    "endDate": "2025-10-28T20:30:00+05:30",
    "description": "The international duo formed by Norwegian soprano Elizaveta Agrafenina and French pianist Dimitri Malignan, established in 2019 in Amsterdam, will present a subtly chosen programme of splendid songs and works by the most celebrated European composers, including some audience favourites, as well as hidden gems by forgotten artists that they have been researching and uncovering for many years, as highlighted by their two recent album releases, “Elegies and Echoes” and “Le diable dans la nuit”, which received great critical acclaim. \n \nSupported by: \n    \n",
    "url": "https://bangaloreinternationalcentre.org/event/european-treasures/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "European Treasures"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-39-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80868-1761935400-1761940800@bangaloreinternationalcentre.org",
    "name": "Reinventing Purpose",
    "startDate": "2025-10-31T18:30:00+05:30",
    "endDate": "2025-10-31T20:00:00+05:30",
    "description": "What does it take to trade success for significance? \nReinventing Purpose: Transitioning from Corporate to Cause brings together professionals who have redefined their careers to create lasting impact. Anchored around Sumathy Krishnan’s book A Career Without an Expiry Date: Finding Work, Growth and Fulfilment in NGOs, the conversation explores what it means to move from profit to purpose; unlearning old definitions of success while finding new forms of meaning, challenge, and growth. \nThrough candid reflections and lived experience, the panel examines how skills honed in the corporate world can thrive in spaces that demand empathy, adaptability, and conviction. For those seeking to renew their relationship with work, this dialogue offers fresh perspectives, enthusiastic encouragement, and poignant reminders that fulfillment need not end where ambition begins. \n",
    "url": "https://bangaloreinternationalcentre.org/event/reinventing-purpose/",
    "keywords": [
      "B-Cause",
      "Books",
      "Nonfiction",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-90.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "81308-1761762600-1761768900@bangaloreinternationalcentre.org",
    "name": "In the Mood for Love",
    "startDate": "2025-10-29T18:30:00+05:30",
    "endDate": "2025-10-29T20:15:00+05:30",
    "description": "98 minutes | Chinese with English subtitles | Hong Kong | 2000 \nDirector: Wong Kar Wai\nStarring: Maggie Cheung Man Yuk, Tony Leung Chiu Wai, and others\nWritten by: Wong Kar-wai\nMusic: Shigeru Umebayashi & Michael Galasso \nHong Kong, 1962: Chow Mo-Wan (Tony Leung Chiu Wai) and Su Li-Zhen (Maggie Cheung Man Yuk) move into neighboring apartments on the same day. Their encounters are formal and polite—until a discovery about their spouses creates an intimate bond between them. \nAt once delicately mannered and visually extravagant, Wong Kar Wai’s In the Mood for Love is a masterful evocation of romantic longing and fleeting moments. With its aching soundtrack and exquisitely abstract cinematography by Christopher Doyle and Mark Lee Ping Bing, this film has been a major stylistic influence on the past two decades of cinema, and is a milestone in Wong’s redoubtable career. \nThis is the third film in our collaboration with MUBI. Once in two months we will bring a new film from the extensive MUBI collection to our beloved BIC audience! \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/in-the-mood-for-love/",
    "keywords": [
      "Film",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "In the Mood for Love"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-41-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "80121-1761850800-1761856200@bangaloreinternationalcentre.org",
    "name": "Travellers",
    "startDate": "2025-10-30T19:00:00+05:30",
    "endDate": "2025-10-30T20:30:00+05:30",
    "description": "What happens when sound stretches across time, memory, and place? \nAward-winning sarod musician and composer Soumik Datta breathes life into Travellers: a sonic journey that blends the evocative voice of the sarod with ambient soundscapes, spoken word, and Indian classical roots. Layered with field recordings and immersive textures, the performance moves fluidly between moments of stillness and pulse, carrying audiences across the invisible borders that divide lands, people, and memories. Each note unfolds a story, inviting reflection, connection, and wonder. \nPart of Soumik’s Melodies in Slow Motion Tour, the performance reaches concert halls, homes, heritage sites, and schools, touching communities often unheard, and reminding us how music bridges distance and difference. \nAn evening of sound that offers a rare chance to experience music in its fullest depth. \nTravellers is coproduced by Soumik Datta Arts, G5A In Residence & Arts Council England. \nIn collaboration with: \n \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/travellers/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Travellers"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-32-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80897-1762281000-1762286400@bangaloreinternationalcentre.org",
    "name": "What's The Film About?",
    "startDate": "2025-11-04T18:30:00+05:30",
    "endDate": "2025-11-04T20:00:00+05:30",
    "description": "17 minutes | English | 2024 | India \nWhat’s The Film About? follows Indian filmmaker Poorva Bhat during a camping weekend with her two children, as she tries to find the right way to talk about safe and unsafe touch. What unfolds is a tender and honest tug-of-war between a mother and her children, as they navigate discomfort, curiosity, and care while attempting to have a crucial conversation. \nPremiered at Visions du Réel, one of Europe’s leading documentary film festivals, the film has since travelled widely, screening at festivals including the BFI London Film Festival and IDFA, where it won the Best Youth Documentary (9–12) award. It also received a Special Mention at the European Children’s Film Festival and continues its journey across international and Indian festivals. \nCelebrated for its light-hearted yet thoughtful approach to a sensitive subject, What’s The Film About? opens up space for parents, educators, and caregivers to reflect on how such conversations can take place within families and classrooms. \nThe screening will be followed by a discussion and an audience Q&A, focusing on how adults can foster safer, more open dialogue with children on this important topic. \n",
    "url": "https://bangaloreinternationalcentre.org/event/whats-the-film-about/",
    "keywords": [
      "Education",
      "Film",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_wtfa_.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81247-1761676200-1761681600@bangaloreinternationalcentre.org",
    "name": "A Silent Crisis: Mental Health and Community Care in Times of Emergency",
    "startDate": "2025-10-28T18:30:00+05:30",
    "endDate": "2025-10-28T20:00:00+05:30",
    "description": "Crises and emergencies, whether natural disasters, conflicts, or displacements, can deeply affect the mental health of people and communities. Resonating with the World Mental Health Day theme of Mental Health in Humanitarian Emergencies, the panel discussion will draw from conversations in diverse fields of clinical psychology, psychiatry, psychiatric social work, and disaster response. In particular, it will dwell on the emotional and social impact of crises, such as wars, natural disasters, and displacement, on individuals, families, and communities. \nInequities in access to mental health services and the imperative to strengthen community-based, culturally sensitive models of care will also be addressed, focusing on pragmatic ways of addressing barriers to help-seeking through collective community action, mutual support, and inter-agency collaboration. Panelists will share real experiences and explore practical ways to build caring, connected, and prepared communities, where seeking and offering help becomes everyone’s responsibility. \nLastly, at a time when the world feels increasingly fragile and divided, the panelists will also ask what it means to stay human, stay compassionate, and stay emotionally steady amid uncertainty. \nThe discussion will be followed by a Q&A with the audience. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-silent-crisis-mental-health-and-community-care-in-times-of-emergency/",
    "keywords": [
      "Health & Wellness",
      "Public Health",
      "Science"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-40-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "80772-1761991200-1762030800@bangaloreinternationalcentre.org",
    "name": "Krishna to Kaveri | ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ",
    "startDate": "2025-11-01T10:00:00+05:30",
    "endDate": "2025-11-01T21:00:00+05:30",
    "description": "Winding and binding, Karnataka’s great rivers have always been more than glorious waterways. From Krishna to Kaveri, our rivers are carriers of culture, stories, and transformation. As they flow across varied landscapes, they shape and are shaped by the people, traditions, and communities they touch.\nKrishna to Kaveri is a two-day celebration that draws from this natural rhythm, exploring how Karnataka’s cultural life is constantly moving, adapting, and renewing itself. From classical roots to contemporary reinterpretations, this festival offers a vibrant weekend that speaks to a new generation. Expect immersive workshops, indulgent cuisines and impactful performances! \nWhether you’re a native Kannadiga or recently moved into Bangalore, this festival is for anyone who wants to connect more deeply with the cultural spirit of the region. Not as outsiders looking in, but as participants in a living, flowing cultural journey.\nLet the rivers lead. Let culture move. Let Karnataka unfold.\nಬಳಸುತ್ತಾ ಬೆಸೆಯುತ್ತಾ ಬೆಳೆಸುತ್ತಾ ಸಾಗುವ ಕರ್ನಾಟಕದ ನದಿಗಳು ವೈಭವದ ಜಲಹರಿವುಗಳು ಮಾತ್ರವಲ್ಲ. ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ ವ್ಯಾಪಿಸಿರುವ ನದಿಗಳು ಸಂಸ್ಖೃತಿಯ, ಕಥೆ-ಪುರಾಣಗಳ, ಪರಿವರ್ತನೆಯ ಚಲನಶೀಲ ವಾಹಕಗಳಾಗಿವೆ. ವೈವಿಧ್ಯಮಯ ಸುಂದರ ಭೂಪ್ರದೇಶಗಳ ನಡುವೆ ಮುನ್ನಡೆವ ಈ ನದಿಗಳು ಜನರನ್ನು, ಪರಂಪರೆಗಳನ್ನು, ಸಮುದಾಯಗಳನ್ನು ರೂಪಿಸುತ್ತಾ, ಪರ್ಯಾಯವಾಗಿ ರೂಪುಗೊಳ್ಳುತ್ತಾ ಸಾಗಿವೆ.\nಈ ಸ್ವಾಭಾವಿಕ ಹರಿವಿನ ಲಯದಿಂದ ಹೊಮ್ಮಿರುವ ಎರಡು ದಿನಗಳ ಉತ್ಸವವೆ ‘ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ ʼ. ಕರ್ನಾಟಕದ ಸಾಂಸ್ಕೃತಿಕ ಬದುಕಿನ ನಿರಂತರ ಚಲನೆಯ, ಹೊಂದಾಣಿಕೆಯ, ಪುನಶ್ಚೇತನದ ಶೋಧನೆ. ಈ ಉತ್ಸವವು ಅಭಿಜಾತ ಬೇರುಗಳಿಂದ ವರ್ತಮಾನದ ಮರುವ್ಯಾಖ್ಯಾನಗಳವರೆಗೆ ಹುರುಪಿನ ವಾರಾಂತ್ಯದಲ್ಲಿ ಹೊಸಪೀಳಿಗೆಗೆ ಒಳನೋಟಗಳನ್ನು ಒದಗಿಸಲಿದೆ. ತಲ್ಲೀನಗೊಳಿಸುವ ಕಾರ್ಯಾಗಾರಗಳು, ರುಚಿಕರ ಆಹಾರ, ಆಕರ್ಷಕ ಸಾಂಸ್ಕೃತಿಕ ಕಾರ್ಯಕ್ರಮಗಳನ್ನು ಈ ಹಬ್ಬದಲ್ಲಿ ನಿರೀಕ್ಷಿಸಬಹುದು.\nನೀವು ಮೂಲ ಕನ್ನಡಿಗರಾಗಿರಿ ಅಥವಾ ಇತ್ತೀಚೆಗಷ್ಟೆ ಹೊರಗಿನಿಂದ ಬೆಂಗಳೂರಿಗೆ ಬಂದಿರುವವರೇ ಆಗಿರಿ. ಈ ನೆಲದ ಸಾಂಸ್ಕೃತಿಕ ಚೇತನದೊಂದಿಗೆ ಆಳವಾಗಿ ಬೆರೆಯುವ ಅವಕಾಶವನ್ನು ಈ ಹಬ್ಬ ನಿಮಗೆ ಒದಗಿಸುತ್ತದೆ. ಇಲ್ಲಿನ ಕಾರ್ಯಕ್ರಮಗಳನ್ನು ನೀವು ಹೊರಗಿನವರಾಗಿ ನಿಂತು ನೋಡುವ ಪ್ರೇಕ್ಷಕರಾಗದೆ ಒಂದು ಜೀವಂತ, ಸಾಂಸ್ಕೃತಿಕ ಯಾನದ ಭಾಗವಾಗಲು ಬನ್ನಿರಿ.\nಮುನ್ನಡೆಸಲಿ ನದಿಗಳು. ಪ್ರವಹಿಸಲಿ ಸಂಸ್ಕೃತಿ. ಗೋಚರವಾಗಲಿ ಕರ್ನಾಟಕದ ಸಿರಿ ವೈಭವ!\nDay 1 Schedule\n10:00 AM – 10:50 AM: Inauguration | ಉದ್ಘಾಟನೆ\nBy Nagathihalli Chandrashekhar | ನಾಗತಿಹಳ್ಳಿ ಚಂದ್ರಶೇಖರ್‌ ಅವರಿಂದ\nM C Ramesh | ಎಂ ಸಿ ರಮೇಶ್‌ \nPooja Kunitha, Somana Kunitha, Flag Hoisting & the State Anthem | ಪೂಜಾ ಕುಣಿತ, ಸೋಮನ ಕುಣಿತ, ಧ್ವಜಾರೋಹಣ ಮತ್ತು ನಾಡಗೀತೆ\nSri Vinayaka Yuvakara Kala Balaga & Students of Suraaghavi Foundation | ಶ್ರೀ ವಿನಾಯಕ ಯುವಕರ ಕಲಾ ಬಲಗ & ಸುರಾಘವಿ ಫೌಂಡೇಷನ್‌ ವಿದ್ಯಾರ್ಥಿಗಳು\n\nExperience the vibrant ritual dances of Hale Mysuru with Pooja Kunitha and Somana Kunitha, performed by K. B. Swamy and team. Rooted in Hassan, Tumakuru, Mandya, and Bangalore Rural, these centuries-old traditions reflect devotion and community life. Pooja Kunitha, performed by the Kuruba community, offers towering, decorated structures to Goddess Shakti, while Somana Kunitha, with striking masks and movements, invokes guardian deities to bless villages. Together, they carry the history, geography, and spirit of Hale Mysuru. This performance, in celebration of Karnataka Rajyotsava, honors the living cultural traditions that continue to shape the soul of the state.\nಹಳೆ ಮೈಸೂರು ಭಾಗದ ಪೂಜಾ ಕುಣಿತ ಹಾಗೂ ಸೋಮನ ಕುಣಿತಗಳಂಥ ನೃತ್ಯದ ಆಚರಣೆಗಳನ್ನು ಜೀವಂತಗೊಳಿಸುವ ಕೆ. ಬಿ. ಸ್ವಾಮಿ ಮತ್ತು ತಂಡದವರ ಪ್ರದರ್ಶನವನ್ನು ನೋಡ ಬನ್ನಿ. ಹಾಸನ, ತುಮಕೂರು, ಮಂಡ್ಯ ಮತ್ತು ಬೆಂಗಳೂರು ಗ್ರಾಮಾಂತರ ಜಿಲ್ಲೆಗಳಲ್ಲಿ ನೆಲೆಗೊಂಡಿರುವ ಶತಮಾನಗಳ ಹಿಂದಿನ ಈ ಪರಂಪರೆಯು, ಭಕ್ತಿ ಮತ್ತು ಸಾಮುದಾಯಿಕ ಜೀವನವನ್ನು ಬಿಂಬಿಸುತ್ತದೆ. ಕುರುಬ ಸಮುದಾಯದ ಪೂಜಾ ಕುಣಿತವು ಶಕ್ತಿ ದೇವತೆಗೆ ಎತ್ತರದ ಅಲಂಕೃತ ತೊಟ್ಟಿಲುಗಳನ್ನು ಸಮರ್ಪಿಸಿದರೆ, ಸೋಮನ ಕುಣಿತವು ವಿಶಿಷ್ಟ ಮುಖವಾಡಗಳು ಮತ್ತು ಚುರುಕಾದ ಚಲನೆಗಳ ಮೂಲಕ ಗ್ರಾಮರಕ್ಷಕ ದೇವರನ್ನು ಆವಾಹಿಸುತ್ತದೆ. ಇವೆರಡೂ ನೃತ್ಯ ಶೈಲಿಗಳು ಹಳೆ ಮೈಸೂರಿನ ಇತಿಹಾಸ, ಭೌಗೋಳಿಕ ವೈಶಿಷ್ಟ್ಯ ಮತ್ತು ಮನೋಭಾವವನ್ನು ಮುನ್ನೆಲೆಗೆ ತರುತ್ತವೆ. ಕರ್ನಾಟಕ ರಾಜ್ಯೋತ್ಸವದ ಆಚರಣೆಯ ನೆಪದಲ್ಲಿ ಈ ಪ್ರದರ್ಶನವು ರಾಜ್ಯದ ಅಂತ:ಶಕ್ತಿಯನ್ನು ರೂಪಿಸುವ ನಮ್ಮ ಸಾಂಸ್ಕೃತಿಕ ಪರಂಪರೆಯನ್ನು ಜೀವಂತಗೊಳಿಸಿ ಗೌರವಿಸುತ್ತದೆ. \n11:00 AM – 12:30 PM: Morning Melodies | ಮುಂಜಾನೆಯ ರಾಗಗಳು\nA Hindustani Vocal Recital | ಹಿಂದೂಸ್ತಾನಿ ಗಾಯನ\nVinayak Torvi, Vyasamurthy Katti & Gurumurthy Vaidya | ವಿನಾಯಕ್ ತೊರವಿ, ವ್ಯಾಸಮೂರ್ತಿ ಕಟ್ಟಿ & ಗುರುಮೂರ್ತಿ ವೈದ್ಯ \nBegin your morning where melody meets meditation. This Hindustani classical recital brings together three exceptional artists—Pt. Vinayak Torvi, the distinguished vocalist from Dharwad’s revered lineage, whose voice bridges the traditions of Gwalior and Kirana gharanas; Shri. Vyasamurti Katti, a master harmonium player and vocalist known for his nuanced artistry; and Shri. Gurumurthy Vaidya, a tabla virtuoso whose rhythmic clarity completes the ensemble. An immersive morning of song and rhythm, where every note unfolds like dawn itself—gentle, awakening, and full of grace.\nಸ್ವರ ಮತ್ತು ಧ್ಯಾನದ ಸಂಗಮದಲ್ಲಿ ನಿಮ್ಮ ಬೆಳಗನ್ನು ಆರಂಭಿಸಿ. ಈ ಹಿಂದೂಸ್ತಾನಿ ಶಾಸ್ತ್ರೀಯ ಗಾಯನ ಕಾರ್ಯಕ್ರಮದಲ್ಲಿ ಮೂವರು ಅಪೂರ್ವ ಕಲಾವಿದರು ಒಂದೇ ವೇದಿಕೆಯನ್ನು ಹಂಚಿಕೊಳ್ಳತಿಲಿದ್ದಾರೆ — ಧಾರವಾಡದ ಗೌರವಾನ್ವಿತ ಸಂಗೀತ ಪರಂಪರೆಯ ಪ್ರಸಿದ್ಧ ಗಾಯಕರಾದ ಪಂಡಿತ ವಿನಾಯಕ ತೊರವಿ ಗ್ವಾಲಿಯರ್ ಹಾಗೂ ಕಿರಾನಾ ಘರಣಾಗಳನ್ನು ತಮ್ಮ ಕಂಠದಲ್ಲಿ ಮೇಳೈಸುವರು; ಸೂಕ್ಷ್ಮಾಭಿವ್ಯಕ್ತಿಯಲ್ಲಿಯೇ ಖ್ಯಾತರಾಗಿರುವ ಹಾರ್ಮೋನಿಯಂ ವಾದಕ ಹಾಗೂ ಗಾಯಕರಾದ ಶ್ರೀ ವ್ಯಾಸಮೂರ್ತಿ ಕಟ್ಟಿ ಮತ್ತು ಲಯದ ಸ್ಪಷ್ಟತೆಯಿಂದ ಹೆಸರಾಗಿರುವ ತಬಲಾ ವಾದಕ ಶ್ರೀ ಗುರುಮೂರ್ತಿ ವೈದ್ಯ. ಪ್ರತಿ ಸ್ವರವೂ ಪ್ರಭಾತದಂತೆ ನಿಧಾನವಾಗಿ ಅರಳಿ ಎಚ್ಚರಿಸುವ — ಮಧುರ ಮತ್ತು ಮಂಗಲಕರ ಸಂಗೀತಭರಿತ ಬೆಳಗ್ಗೆ ನಿಮ್ಮನ್ನು ಎದುರು ನೋಡುತ್ತಿದೆ.\n11:00 AM – 12:30 PM: The Great Story Hunt | ಶ್ರೇಷ್ಠ ಕಥೆಯ ಹುಡುಕಾಟ\nRivers, Rulers, Quilts, and Queens — A Treasure Trail through Karnataka’s Timeless Scenes | ನದಿಗಳು, ರಾಜ ಮಹಾರಾಜರು,ಹಾಸು- ಹೊದಿಕೆಗಳು, ರಾಣಿಯರು — ಕರ್ನಾಟಕದ ಸಮಯಾತೀತ ದೃಶ್ಯಗಳ ಸಂಪದ್ಭರಿತ ಹಾದಿ\nFor Ages 6+|6+ ವರ್ಷ ವಯಸ್ಸಿನ ಮಕ್ಕಳಿಗೆ\nSeema Karanth | ಸೀಮಾ ಕಾರಂತ್\nRSVP here\nWhat travels without tickets, flies without wings, and takes you places while you sit and listen? A story! Seema Karanth leads us into a world where riddles, rhythm, and laughter fuel adventure. This interactive storytelling session is filled with mysteries to solve, clues to chase, and characters to befriend. Children become part of the tale itself: playing, guessing, and imagining their way through adventure. Perfect for curious young explorers and their families to listen, laugh, and journey together!\nಟಿಕೆಟ್ ಕೇಳದೇ, ರೆಕ್ಕೆಗಳಿಲ್ಲದೇ ನಿಮ್ಮನ್ನು ಹೊಸ ಲೋಕಗಳಿಗೆ ಕೊಂಡೊಯ್ಯುವುದು ಯಾವುದು? ಕಥೆ! ಸೀಮಾ ಕಾರಂತ್ ನಮ್ಮನ್ನು ಒಗಟು, ಲಯ ಮತ್ತು ನಗುವಿನ ಲೋಕಕ್ಕೆ ಕರೆದುಕೊಂಡು ಹೋಗುತ್ತಾರೆ. ಪರಸ್ಪರ ಸಂವಾದದ ಮೂಲಕ ತೆರೆದುಕೊಳ್ಳುವ ಈ ಕಥೆಯ ಲೋಕ ರಹಸ್ಯವನ್ನು ಭೇದಿಸುತ್ತಾ, ಸುಳಿವುಗಳನ್ನು ಅರಸುತ್ತಾ, ಪಾತ್ರಗಳೊಂದಿಗೆ ಬೆಸೆಯುತ್ತಾ ಸಾಗುತ್ತದೆ. ಇಲ್ಲಿ ಮಕ್ಕಳು ಕೇವಲ ಕೇಳುವುದಲ್ಲ, ಕಥೆಯೇ ಆಗುತ್ತಾರೆ — ಊಹಿಸುತ್ತಾ ಆಡುತ್ತಾ, ಕುತೂಹಲದಿಂದ ಅನ್ವೇಷಿಸುತ್ತಾ ರೋಮಾಂಚನವನ್ನು ಅನುಭವಿಸುತ್ತಾರೆ.\nಕುತೂಹಲಭರಿತ ಪುಟ್ಟ ಸಾಹಸಿಗಳಿಗೂ, ಅವರ ಮನೆಯವರಿಗೂ ಆಲಿಸುತ್ತಾ, ನಗುತ್ತಾ, ಆಶ್ಚರ್ಯಪಡುತ್ತಾ ಸಾಗುವ ಸಿಹಿ ಸಂಭ್ರಮ!\n12:00 PM – 1:30 PM: Kannada Gottilla | ಕನ್ನಡ ಗೊತ್ತಿಲ್ಲ\nKannada 101: A Crash Course in Connection | ಕನ್ನಡ ೧೦೧: ಸಂವಹನದ ತ್ವರಿತ ಪಾಠಕ್ರಮ\nArpith Kumar | ಅರ್ಪಿತ್ ಕುಮಾರ್\nRSVP here\nLed by Arpith Kumar, Director of Kannada Gottilla, this beginner-friendly workshop makes picking up everyday Kannada simple, engaging, and fun. Through lively games, creative activities, and conversation practice, participants will learn basic phrases to navigate the city, connect with locals, and enjoy the language’s unique rhythm and charm. A warm introduction to Kannada for anyone eager to build confidence, spark curiosity, and feel a little more at home in Bengaluru.\nಕನ್ನಡ ಗೊತ್ತಿಲ್ಲ ಸಂಸ್ಥೆಯ ನಿರ್ದೇಶಕ ಅರ್ಪಿತ್ ಕುಮಾರ್ ಅವರ ನೇತೃತ್ವದಲ್ಲಿ ನಡೆಯುವ ಈ ಆರಂಭಿಕ-ಸ್ನೇಹಿ ಕಾರ್ಯಕ್ರಮ, ಪ್ರತಿದಿನ ಬಳಕೆಯಾಗುವ ಕನ್ನಡ ಕಲಿಯುವುದನ್ನು ಸುಲಭ, ಆಸಕ್ತಿದಾಯಕ ಮತ್ತು ರಂಜನೀಯವಾಗಿಸುತ್ತದೆ. ಚುರುಕು ಆಟಗಳು, ಸೃಜನಾತ್ಮಕ ಚಟುವಟಿಕೆಗಳು ಮತ್ತು ಸಂಭಾಷಣೆ ಅಭ್ಯಾಸಗಳ ಮೂಲಕ, ಭಾಗವಹಿಸುವವರು ನಗರದೊಳಗೆ ಸಂಚರಿಸಲು, ಸ್ಥಳೀಯರೊಂದಿಗೆ ಮಾತುಕತೆ ಆರಂಭಿಸಲು, ಮತ್ತು ಕನ್ನಡದ ಲಯ-ಸೊಬಗು ಅನುಭವಿಸಲು ಬೇಕಾದ ಮೂಲಭೂತ ವಾಕ್ಯಗಳನ್ನು ಕಲಿಯುತ್ತಾರೆ. ಸ್ವಲ್ಪ ವಿಶ್ವಾಸ, ಕುತೂಹಲ, ಮತ್ತು ಸ್ವಲ್ಪ “ಇದು ನನ್ನ ಮನೆ” ಎನ್ನುವ ಭಾವನೆ ಬೆಳೆಸಿಕೊಳ್ಳಲು ಬಯಸುವ ಎಲ್ಲರಿಗೂ ಹಿತವಾದ ಕನ್ನಡ ಪರಿಚಯವಾಗುತ್ತದೆ!\n2:00 PM – 3:30 PM: Sutta Mutta Gotta? | ಸುತ್ತ ಮುತ್ತ ಗೊತ್ತಾ? \nQuizzing All Things Karnataka and Kannada | ಕರ್ನಾಟಕ ಮತ್ತು ಕನ್ನಡದ ಎಲ್ಲ ವಿಷಯಗಳ ಕುರಿತ ಮನರಂಜನಾತ್ಮಕ ಪ್ರಶ್ನೋತ್ತರ ಸ್ಪರ್ಧೆ\nThejaswi Udupa | ತೇಜಸ್ವಿ ಉಡುಪ\nA 90 minute journey full of questions on interesting facts and stories from our state. The quiz is for teams of up to two people. There will be a written prelims, followed by a final round for the top teams. Hosted by Thejaswi Udupa, this is bound to be a fun-filled afternoon!\nನಮ್ಮ ರಾಜ್ಯದ ರೋಚಕ ಸಂಗತಿಗಳು ಮತ್ತು ಕಥೆಗಳೊಂದಿಗೆ 90 ನಿಮಿಷಗಳ ಪ್ರಶ್ನೋತ್ತರ ಪ್ರವಾಸ. ಎರಡು ಸದಸ್ಯರ ತಂಡಗಳು ಭಾಗವಹಿಸಬಹುದು. ಮೊದಲು ಬರಹ ರೂಪದ ಪ್ರಾಥಮಿಕ ಸುತ್ತು, ನಂತರ ಅಗ್ರ ತಂಡಗಳಿಗೆ ಅಂತಿಮ ಸುತ್ತು ಇರುತ್ತದೆ. ತೇಜಸ್ವಿ ಉಡುಪ ಅವರ ಆತಿಥ್ಯದಲ್ಲಿ ನಡೆಯುವ ಈ ಕ್ವಿಜ್‌ ಖಂಡಿತವಾಗಿಯೂ ಮೋಜುಮಸ್ತಿಯಿಂದ ಕೂಡಿದ ಮಧ್ಯಾಹ್ನವಾಗಲಿದೆ!\n3:00 PM – 4:00 PM: An Afternoon of Magic | ಮಧ್ಯಾಹ್ನದ ಮಾಯಾಲೋಕ \nA Wonder-Full Show for All Ages | ಎಲ್ಲ ವಯಸ್ಸಿನವರಿಗೆ ಬೆರಗಿನ ಪ್ರದರ್ಶನ\nInesh Shenoy and Ishaan Shenoy, Prahlad Acharya & Nakul Shenoy | ಇನೇಶ್ ಶೆಣೈ ಮತ್ತು ಇಶಾನ್ ಶೆಣೈ, ಪ್ರಹ್ಲಾದ್ ಆಚಾರ್ಯ & ನಕುಲ್ ಶೆಣೈ\nRSVP here\nExperience a world of laughter, mystery, and amazement with Bangalore’s beloved magical ensemble, Nakul Shenoy & Friends. This hour-long performance blends storytelling, comedy, mind-bending magic, and mesmerizing shadow play. Featuring the youthful energy of The Amazing iTwins and Prahlad Acharya’s spellbinding shadowgraphy from Speaking Shadows, the show enchants audiences of all ages. Whether discovering magic for the first time or a lifelong enthusiast, you’ll be transported to a realm where imagination rules and the impossible feels real—an unforgettable, joyous experience for the entire family.\nಬೆಂಗಳೂರಿನ ಜನಪ್ರಿಯ ಮಾಯಾಜಾಲದ ತಂಡ ನಕುಲ್ ಶೆಣೈ ಮತ್ತು ಸ್ನೇಹಿತರು ನಿಮ್ಮನ್ನು ನಗು, ರಹಸ್ಯ ಮತ್ತು ಆಶ್ಚರ್ಯಗಳ ಲೋಕಕ್ಕೆ ಕರೆದೊಯ್ಯುತಾರೆ. ಒಂದು ಗಂಟೆಯ ಈ ಕಾರ್ಯಕ್ರಮದಲ್ಲಿ ಕಥೆ, ಹಾಸ್ಯ, ಮನ ಮರುಳಾಗಿಸುವ ಮಾಯಾಜಾಲ ಮತ್ತು ಆಕರ್ಷಕ ಛಾಯಾ ಪ್ರದರ್ಶನ ಬೆರೆತಿದೆ.  ದಿ ಅಮೇಜಿಂಗ್ ಐಟ್ವಿನ್ಸ್‌ ಯುವ ಶಕ್ತಿ ಮತ್ತು ಪ್ರಹ್ಲಾದ್ ಆಚಾರ್ಯ ಅವರ ಸ್ಪೀಕಿಂಗ್ ಶಾಡೋಸ್ ನ ಛಾಯಾ ಪ್ರದರ್ಶನ ಕೌಶಲ್ಯದಿಂದ, ಈ ಪ್ರದರ್ಶನ ಎಲ್ಲ ವಯಸ್ಸಿನ ಪ್ರೇಕ್ಷಕರನ್ನು ರಂಜಿಸುತ್ತದೆ. ಮಾಯಾಜಾಲವನ್ನು ಮೊದಲ ಬಾರಿ ಕಂಡು ಹರ್ಷಿಸುವವರಾಗಿರಲಿ ಅಥವಾ ಜೀವನಪೂರ್ತಿ ಅಭಿಮಾನಿಗಳಾಗಿರಲಿ, ನೀವು ಸಂಪೂರ್ಣ ಕುಟುಂಬವಾಗಿ ಕಲ್ಪನೆಯ ಲೋಕದಲ್ಲಿ ನಿಂತು ಅಸಾಧ್ಯವನ್ನು ನಿಜವಾಗಿಯೂ ಅನುಭವಿಸುವ, ಅದ್ಭುತ ಸಂತೋಷದ ಕ್ಷಣಗಳನ್ನು ನಿಮ್ಮದಾಗಿಸಿಕೊಳ್ಳುವಿರಿ\n3:00 PM – 4:30 PM: Kannada Gottilla | ಕನ್ನಡ ಗೊತ್ತಿಲ್ಲ \nKannada 101: A Crash Course in Connection | ಕನ್ನಡ ೧೦೧: ಸಂವಹನದ ತ್ವರಿತ ಪಾಠಕ್ರಮ\nArpith Kumar | ಅರ್ಪಿತ್ ಕುಮಾರ್\nRSVP here\n\nLed by Arpith Kumar, Director of Kannada Gottilla, this beginner-friendly workshop makes picking up everyday Kannada simple, engaging, and fun. Through lively games, creative activities, and conversation practice, participants will learn basic phrases to navigate the city, connect with locals, and enjoy the language’s unique rhythm and charm. A warm introduction to Kannada for anyone eager to build confidence, spark curiosity, and feel a little more at home in Bengaluru.\nಕನ್ನಡ ಗೊತ್ತಿಲ್ಲ ಸಂಸ್ಥೆಯ ನಿರ್ದೇಶಕ ಅರ್ಪಿತ್ ಕುಮಾರ್ ಅವರ ನೇತೃತ್ವದಲ್ಲಿ ನಡೆಯುವ ಈ ಆರಂಭಿಕ-ಸ್ನೇಹಿ ಕಾರ್ಯಕ್ರಮ, ಪ್ರತಿದಿನ ಬಳಕೆಯಾಗುವ ಕನ್ನಡ ಕಲಿಯುವುದನ್ನು ಸುಲಭ, ಆಸಕ್ತಿದಾಯಕ ಮತ್ತು ರಂಜನೀಯವಾಗಿಸುತ್ತದೆ. ಚುರುಕು ಆಟಗಳು, ಸೃಜನಾತ್ಮಕ ಚಟುವಟಿಕೆಗಳು ಮತ್ತು ಸಂಭಾಷಣೆ ಅಭ್ಯಾಸಗಳ ಮೂಲಕ, ಭಾಗವಹಿಸುವವರು ನಗರದೊಳಗೆ ಸಂಚರಿಸಲು, ಸ್ಥಳೀಯರೊಂದಿಗೆ ಮಾತುಕತೆ ಆರಂಭಿಸಲು, ಮತ್ತು ಕನ್ನಡದ ಲಯ-ಸೊಬಗು ಅನುಭವಿಸಲು ಬೇಕಾದ ಮೂಲಭೂತ ವಾಕ್ಯಗಳನ್ನು ಕಲಿಯುತ್ತಾರೆ. ಸ್ವಲ್ಪ ವಿಶ್ವಾಸ, ಕುತೂಹಲ, ಮತ್ತು ಸ್ವಲ್ಪ “ಇದು ನನ್ನ ಮನೆ” ಎನ್ನುವ ಭಾವನೆ ಬೆಳೆಸಿಕೊಳ್ಳಲು ಬಯಸುವ ಎಲ್ಲರಿಗೂ ಹಿತವಾದ ಕನ್ನಡ ಪರಿಚಯವಾಗುತ್ತದೆ!\n\n\n4:00 PM – 5:30 PM: Beeso Haada – Songs of Labour | ಬೀಸೋ ಹಾಡ – ಶ್ರಮಿಕರ ಗೀತೆಗಳು\nFolk Songs from the Soil of North Karnataka | ಉತ್ತರ ಕರ್ನಾಟಕದ ನೆಲದಿಂದ ಹೊಮ್ಮಿದ ಜನಪದ ಗೀತೆಗಳು\nShilpa Mudbi Kothakota & Kalaburagi Kala Mandali | ಶಿಲ್ಪಾ ಮುಡ್ಬಿ ಕೊತಕೋಟ & ಕಲಬುರಗಿ ಕಲಾ ಮಂಡಲಿಯ ಕಲಾವಿದರು\nBeeso Haada is the collective embodiment of oral musical traditions of labour. These songs collected from different women from across North Karnataka speak of labour of daily life, labour of gender and of caste. Collected and curated meticulously over the last two years, these songs taught by the hereditary practitioners from Kuruba and Golla community, speaks of daily struggles, aspirations, dreams, spirituality and resilience.\nಬೀಸೋ ಹಾಡ – ಕಾರ್ಮಿಕರ ಮೌಖಿಕ ಸಂಗೀತ ಸಂಪ್ರದಾಯಗಳ ಒಂದು ಸಾಮೂಹಿಕ ರೂಪವಾಗಿದೆ. ಉತ್ತರ ಕರ್ನಾಟಕದ ವಿವಿಧ ಭಾಗಗಳ ಮಹಿಳೆಯರಿಂದ ಸಂಗ್ರಹಿಸಲಾದ ಈ ಹಾಡುಗಳು ದೈನಂದಿನ ಬದುಕಿನ ಬವಣೆ, ಲಿಂಗ ಮತ್ತು ಜಾತಿ ಸಂಬಂಧಿತ ಶ್ರಮದ ಕುರಿತದ್ದಾಗಿವೆ. ಕುರುಬ ಮತ್ತು ಗೊಲ್ಲ ಸಮುದಾಯಗಳ ಆಚರಣೆಗಳಲ್ಲಿ ನಿರತರಾದ ಜನ ತಲೆತಲಾಂತರಗಳಿಂದ ಈ ಹಾಡುಗಳನ್ನು ಕಲಿಸುತ್ತಾ ಬಂದಿದ್ದು, ಇವನ್ನು ಕಳೆದ ಎರಡು ವರ್ಷಗಳಲ್ಲಿ ನಿಖರವಾಗಿ ಸಂಗ್ರಹಿಸಿ ಶೇಖರಿಸಲಾಗಿದೆ. ಈ ಹಾಡುಗಳು ಜನರ ದಿನನಿತ್ಯದ ಹೋರಾಟಗಳು, ಆಕಾಂಕ್ಷೆಗಳು, ಕನಸುಗಳು, ಆಧ್ಯಾತ್ಮಿಕತೆ ಮತ್ತು ಪುನಶ್ಚೇತರಿಕೆಯಂಥ ಅಂಶಗಳತ್ತ ಕೇಂದ್ರೀಕೃತವಾಗಿವೆ.\n5:30 PM – 6:45 PM: Prathibimba – #13, Srimata, Sadhanakeri, Dharwad | ಪ್ರತಿಬಿಂಬ – #13, ಶ್ರೀಮಾತ, ಸಾಧನಕೇರಿ, ಧಾರವಾಡ\nA Multi-Media Tribute to Jnanpith Laureate Da Ra Bendre | ಜ್ಞಾನಪೀಠ ಪ್ರಶಸ್ತಿ ವಿಜೇತ ದ. ರಾ. ಬೇಂದ್ರೆ ಅವರ ಗೌರವಾರ್ಥ ಬಹು-ಮಾಧ್ಯಮ ಪ್ರದರ್ಶನ\nJanani Murali & Prathibha Ramaswamy | ಜನನಿ ಮುರಳಿ & ಪ್ರತಿಭಾ ರಾಮಸ್ವಾಮಿ\n\nThis performance is a poetic mirror of a man, his art, and the timeless questions he left behind. Da. Ra. Bendre was a poet, philosopher, and pioneer of the Navodaya movement. He remains one of Kannada literature’s most luminous voices. Awarded the Jnanpith in 1973 for Naaku Tanti, his poetry reflected life as he lived it: intimate, questioning, and endlessly evolving. Prathibimba captures the essence of Bendre’s journey: his joys, struggles, and transformation from youth to old age, from words to numbers. Drawing from Tagore and Aurobindo, he wove together nationalism, spirituality, and humanism into a vision that still stirs the soul.\nಈ ಪ್ರದರ್ಶನವು ಒಬ್ಬ ಕವಿ, ಆತನ ಕಲೆ, ಮತ್ತು ಆತ ಬಿಟ್ಟು ಹೋದ ಶಾಶ್ವತ ಪ್ರಶ್ನೆಗಳ ಕಾವ್ಯಮಯ ಪ್ರತಿಬಿಂಬವಾಗಿದೆ. ದ.ರಾ. ಬೆಂದ್ರೆ — ಒಬ್ಬ ಕವಿ, ತತ್ತ್ವಚಿಂತಕ ಮತ್ತು ನವೋದಯ ಚಳವಳಿಯ ಪ್ರವರ್ತಕ. ಅವರು ಇಂದಿಗೂ ಕನ್ನಡ ಸಾಹಿತ್ಯದ ಅತ್ಯಂತ ಧೀಮಂತ ಧ್ವನಿಗಳಲ್ಲಿ ಒಬ್ಬರು. 1973ರಲ್ಲಿ ನಾಕು ತಂತಿ ಕೃತಿಗೆ ಜ್ಞಾನಪೀಠ ಪ್ರಶಸ್ತಿ ಪಡೆದ ಬೆಂದ್ರೆಯವರ ಕಾವ್ಯ, ಬದುಕಿನಂತೆಯೇ ಆತ್ಮೀಯವಾಗಿ ಪ್ರಶ್ನಿಸುತ್ತಾ ನಿರಂತರವಾಗಿ ರೂಪಾಂತರಗೊಳ್ಳುವಂತಿತ್ತು. ಪ್ರತಿಬಿಂಬ ಬೆಂದ್ರೆಯವರ ಜೀವನದ ಸಾರವನ್ನು ಹಿಡಿದಿಡುತ್ತದೆ — ಅವರ ಹರ್ಷ, ಹೋರಾಟ, ಮತ್ತು ಯೌವನದಿಂದ ಮುಪ್ಪಿನವರೆಗಿನ ಸಂಘರ್ಷಗಳು; ಪದಗಳಿಂದ ಅಂಕೆಗಳವರೆಗೆ ಅವರ ಪಯಣ. ಟಾಗೋರ್ ಮತ್ತು ಅರವಿಂದರಿಂದ ಪ್ರೇರಣೆ ಪಡೆದ ಅವರು ರಾಷ್ಟ್ರಭಾವ, ಆಧ್ಯಾತ್ಮಿಕತೆ ಮತ್ತು ಮಾನವೀಯತೆಯನ್ನು ಒಂದೆಡೆ ಸೇರಿಸಿ, ಇಂದಿಗೂ ಮನಸ್ಸನ್ನು ತಟ್ಟುವ ದೃಷ್ಟಿಕೋನವನ್ನು ಹೆಣೆದರು.\n7:30 PM – 9:00 PM: 100 Years of Grooving! | ನೂರು ವರ್ಷಗಳ ಸಂಭ್ರಮ! \nTime Travel through a Century of Bengaluru’s Beats | ಬೆಂಗಳೂರಿನ ತಾಳಮೇಳಗಳ ಮೂಲಕ ನೂರು ವರ್ಷಗಳ‌ ಕಾಲಯಾನ\nBerty, Rajesh Radhakrishnan, Hari, Steve, Divya, Prithwin & Swami | ಬರ್ಟಿ, ರಾಜೇಶ್ ರಾಧಾಕೃಷ್ಣನ್, ಹರಿ, ಸ್ಟೀವ್, ದಿವ್ಯ, ಪೃಥ್ವಿನ್ & ಸ್ವಾಮಿ\nStep into a soundscape where history has rhythm and every decade hums a new tune. GROOVE BLR takes you on a rollicking ride through 100 years of Bengaluru’s music: from the regal echoes of colonial brass bands and veena virtuosos to disco fever, bhavageethe’s lyrical grace, and the punch of Kannada rap. Narrated by a sharp, quick-witted Quizmaster armed with stories, surprises, and city trivia, this concert blends live performance, storytelling, and laughter in one irresistible mix. Expect clever musical mashups, playful audience interactions, and a few surprises in between. As melodies shift from Gayana Samaja’s grandeur to the pulsing pubs of Church Street, you’ll hear the city’s journey through change, chaos, and creativity. A musical celebration that proves one thing: Bengaluru doesn’t just make music, it becomes music.\nಇತಿಹಾಸದ ಧ್ವನಿತರಂಗಗಳಲ್ಲಿ ಪ್ರತಿಯೊಂದು ದಶಕವೂ ಹೊಸ ನಾದವನ್ನು ಹುಟ್ಟಿಸುವ ಸಂಗೀತ ಲೋಕಕ್ಕೆ ಹೆಜ್ಜೆಯಿಡಿ. GROOVE BLR ನಿಮ್ಮನ್ನು ಬೆಂಗಳೂರಿನ ಶತಮಾನದ ಸಂಗೀತ ಪಯಣದಲ್ಲಿ ತೇಲಿಸಿಕೊಂಡು ಹೋಗುತ್ತದೆ: ಫಿರಂಗಿಯರ  ಬ್ರಾಸ್ ಬ್ಯಾಂಡ್‌ಗಳ ಭಾರೀ ಪ್ರತಿಧ್ವನಿ ಹಾಗೂ ನಮ್ಮ ಪುಣ್ಯಭೂಮಿಯ ಸುಮಧುರ ವೀಣೆಯಿಂದ  ಹಿಡಿದು ನವೀನಯುಗದ ಡಿಸ್ಕೋ, ಹೃದಯಸ್ಪರ್ಶಿ ಭಾವಗೀತೆಗಳು, ಕನ್ನಡದ ರಾಪ್‌  ಸಂಗೀತದವರೆಗೂ. ಚತುರ ಮತ್ತು ಸ್ವಾರಸ್ಯಪೂರ್ಣ ರಸಪ್ರಶ್ನೆ ನಿರೂಪಕನಿಂದ ನಿಮಗೆ ಹಲವು ರೋಚಕ ಕತೆಗಳು, ವಿಸ್ಮಯಗಳು, ನಗರದ ಹಲವು ಕುತೂಹಲಕಾರಿ ವಿಷಯಗಳು ತಿಳಿಯುತ್ತವೆ. ಜೊತೆಗೆ ಜೀವಂತ ಸಂಗೀತ, ಕಥೆಗಳು ಮತ್ತು ನಗೆಬುಗ್ಗೆ ನಿಮ್ಮನ್ನು ಯಕ್ಷಲೋಕಕ್ಕೆ ಕೊಂಡೊಯ್ಯುತ್ತದೆ. ಚತುರ ಸಂಗೀತ ಮಿಶ್ರಣಗಳು, ಪ್ರೇಕ್ಷಕರೊಡನೆ ಆಟದಂತಹ ಸಂವಹನಗಳು, ಮತ್ತು ಕೆಲ ಅಚ್ಚರಿಗಳನ್ನು ಈ ಪ್ರದರ್ಶನದಲ್ಲಿ ನಿರೀಕ್ಷಿಸಬಹುದು. ಗಾಯನ ಸಮಾಜದ ಗಂಭೀರತೆಯಿಂದ ಹಿಡಿದು ಚರ್ಚ್ ಸ್ಟ್ರೀಟ್‌ನ ಪಬ್‌ ಗಳ ತಾಳದವರೆಗೆ, ನಗರವು ಹಲವು ಬದಲಾವಣೆ, ಅಸ್ತವ್ಯಸ್ತತೆ, ಮತ್ತು ಸೃಜನಶೀಲತೆಯ ಮೂಲಕ ನಡೆಸಿದ ಪಯಣವನ್ನು ಕೇಳಬಹುದು. ಈ ಸಂಗೀತೋತ್ಸವ ಒಂದನ್ನಂತೂ ಸಾಬೀತು ಪಡಿಸುತ್ತದೆ: ಬೆಂಗಳೂರು ಕೇವಲ ಸಂಗೀತವನ್ನು ಸೃಷ್ಟಿಸುವುದಲ್ಲ, ಅದು ತಾನೇ ಸಂಗೀತವಾಗುತ್ತದೆ.\nAcross the Weekend | 11:00 AM – 7:00 PM\nExploring Karnataka Exhibition | ಕರ್ನಾಟಕ ಕುರಿತ ಪ್ರದರ್ಶನದೊಳಗೊಂದು ಸುತ್ತು\nMonuments from across the State by Rudragaud Indi | ರುದ್ರಗೌಡ ಇಂಡಿ ಅವರಿಂದ ರಾಜ್ಯದೆಲ್ಲೆಡೆಯ ಪ್ರದರ್ಶನ ಸ್ಮಾರಕಗಳು\nGround Floor Foyer\nJourney through Karnataka’s monuments and marvels—an ode to the state’s rich heritage, innovation, and timeless artistry captured through striking pieces from across the region.\nಕರ್ನಾಟಕದ ಸ್ಮಾರಕಗಳ ಮತ್ತು ಅದ್ಭುತಗಳ ಲೋಕದಲ್ಲಿ ಒಂದು ಸಂಚಾರ — ಈ ರಾಜ್ಯದ ಸಮೃದ್ಧ ಪರಂಪರೆ, ಹೊಸ ಆವಿಷ್ಕಾರ ಮನೋಭಾವ ಹಾಗೂ ಕಾಲಾತೀತ ಕಲಾಮೌಲ್ಯಗಳನ್ನು ಒಳಗೊಂಡ ಕಲಾಕೃತಿಗಳ ಮೂಲಕ ಸಂಭ್ರಮಿಸುವ ನಮನ.\nAata Aadu Bengaluru by Kavade | ಕವಡೆ ತಂಡದಿಂದ ಆಟ ಆಡು ಬೆಂಗಳೂರು\nLearn to Play Traditional Board Games with Family and Friends | ಮನೆ ಮಂದಿ ಮತ್ತು ಗೆಳೆಯರೊಂದಿಗೆ ಪಾರಂಪರಿಕ ಮಣೆಯಾಟಗಳನ್ನಾಡಲು ಕಲಿಯಿರಿ\nGround Floor Foyer\nRoll the dice, count your seeds, and rediscover joy! Traditional board games for all ages—where fun, family, and a touch of nostalgia meet.\nಪಾಸೆ ಎಸೆದು, ಅಕ್ಕಿ ಎಣಿಸಿ, ಹಳೆ ಖುಷಿಯನ್ನು ಮತ್ತೆ ಕಂಡುಹಿಡಿಯಿರಿ! ಎಲ್ಲಾ ವಯಸ್ಸಿನವರಿಗೂ ಸೂಕ್ತವಾದ ಈ ಪೌರಾಣಿಕ ಆಟಗಳಲ್ಲಿ ಸಂಭ್ರಮ, ಕುಟುಂಬ ಮತ್ತು ನೆನಪಿನ ಸಿಹಿತನ ಒಂದೇ ವೇದಿಕೆಯಲ್ಲಿ ಸೇರುತ್ತವೆ.\nArt Showcase by Art Park | ಆರ್ಟ್‌ ಪಾರ್ಕ್‌ ವತಿಯಿಂದ ಕಲಾ ಪ್ರದರ್ಶನ\nDisplay of Traditional Arts by Modern Artists | ಆಧುನಿಕ ಕಲಾವಿದರಿಂದ ಪಾರಂಪರಿಕ ಕಲಾ ಪ್ರದರ್ಶನ\nFirst Floor Foyer\nA vibrant display where young artists reinterpret Karnataka’s traditional art forms through contemporary eyes—bridging heritage and modernity in bold, creative strokes.\nಯುವ ಕಲಾವಿದರು ಕರ್ನಾಟಕದ ಪಾರಂಪರಿಕ ಕಲಾರೂಪಗಳನ್ನು ಆಧುನಿಕ ದೃಷ್ಟಿಯಿಂದ ಮರುಸ್ವರೂಪಗೊಳಿಸಿರುವ ಚೈತನ್ಯಭರಿತ ಪ್ರದರ್ಶನ — ಪಾರಂಪರ್ಯ ಮತ್ತು ನವೀನತೆಯ ಸೇತುವೆಯಂತೆ, ಕಲಾತ್ಮಕ ಹೊಳೆಯೊಳಗೆ ನಿಮಗೂ ಆಹ್ವಾನ.\nBook Nook by Atta Galata | ಆಟಾ ಗಲಾಟ ವತಿಯಿಂದ ಪುಸ್ತಕ ಮೂಲೆ\nRead. Revel. Rejoice. | ಓದಿ. ಸಂಭ್ರಮಿಸಿ. ಆನಂದಿಸಿ.\nHall 2\nFind your next Kannada favourite! A cozy corner to browse, read, and revel in stories from Karnataka’s literary landscape—perfect for readers of all ages.\nನಿಮ್ಮ ಮುಂದಿನ ನೆಚ್ಚಿನ ಕನ್ನಡ ಪುಸ್ತಕವನ್ನು ಇಲ್ಲಿ ಕಂಡುಹಿಡಿಯಿರಿ! ಕರ್ನಾಟಕದ ಸಾಹಿತ್ಯಲೋಕದ ಕಥೆಗಳಲ್ಲಿ ತಲೆಮರೆಸಿಕೊಳ್ಳಲು ಸೂಕ್ತವಾದ — ಎಲ್ಲಾ ವಯಸ್ಸಿನ ಓದುಗರಿಗೂ ಮನಸೂರೆಗೊಳ್ಳುವ ಹಿತಕರ ಪುಸ್ತಕ ಮೂಲೆ.\nKarnataka Wildlife in Light and Shadow\u2028| ನೆರಳು ಬೆಳಕಿನಲ್ಲಿ ಕರ್ನಾಟಕದ ವನ್ಯಜೀವಿ ಸಂಕುಲ\nCapturing Biodiversity by Arun Kumar Krishnaiah | ಅರುಣ್‌ ಕುಮಾರ್‌ ಕೃಷ್ಣಯ್ಯ ಅವರಿಂದ ಜೀವವೈವಿಧ್ಯದ ಬೆಡಗಿನ ಸೂರೆ\nGallery\nThrough Arun Kumar Krishnaiah’s lens, glimpse Karnataka’s wild heart—majestic, intimate, and alive in every play of light, shadow, and silence.\nಅರುಣ್ ಕುಮಾರ್ ಕೃಷ್ಣಯ್ಯ ಅವರ ಕ್ಯಾಮೆರಾ ಕಣ್ಣಿನ ಮೂಲಕ ಕರ್ನಾಟಕದ ಕಾಡಿನ ಮಿಡಿತವನ್ನು ಅನುಭವಿಸಿ — ಪ್ರತಿಯೊಂದು ಬೆಳಕು, ನೆರಳು ಮತ್ತು ಮೌನದಲ್ಲೂ ಜೀವಂತವಾಗಿರುವ ಗೌರವಪೂರ್ಣ, ಆಂತರಿಕ ಮತ್ತು ಚೇತನಭರಿತ ಪ್ರಕೃತಿಯ ರಹಸ್ಯ ಮುಖಗಳನ್ನು ನೋಡಬಹುದು.\nChasing Clues, Celebrating Culture | ಸುಳುಹುಗಳ ಬೆನ್ನು ಹತ್ತಿ, ಸಂಸ್ಕೃತಿಯ ವಿಜೃಂಭಣೆ\nA Scavenger Hunt through Karnataka! | ಕರ್ನಾಟಕದ ಉದ್ದಗಲಕ್ಕೆ ಒಂದು ಸಂಸ್ಕೃತಿ-ಶೋಧಕ ಬೇಟೆ!\nAcross the Building\nUnravel riddles, uncover stories, and race through Karnataka’s cultural heritage—an exciting scavenger hunt adventure for the whole family at BIC!\nಒಗಟುಗಳನ್ನು ಬಿಚ್ಚಿ, ಕಥೆಗಳನ್ನು ಪತ್ತೆಹಚ್ಚಿ, ಕರ್ನಾಟಕದ ಸಂಸ್ಕೃತಿಯ ಹಾದಿಯಲ್ಲಿ ಓಡಾಡಿ — ಕುಟುಂಬದ ಎಲ್ಲ ಸದಸ್ಯರಿಗೂ ರೋಚಕ ಅನುಭವ ಕೊಡುವ ಈ ಹುಡುಕಾಟ ಸಾಹಸಕ್ಕೆ BICನಲ್ಲಿ ಭಾಗಿಯಾಗಿ!\nWomen Vachana Poets of Karnataka by Azim Premji University | ಅಜೀಂ ಪ್ರೇಮ್‌ಜಿ ವಿಶ್ವವಿದ್ಯಾನಿಲಯದ ವತಿಯಿಂದ ಕರ್ನಾಟಕದ ವಚನಕಾರ್ತಿಯರು\nCataloguing the Wisdom of Life  | ಜೀವನ ವಿವೇಕದ ಸಂಗ್ರಹ\nSecond Floor Foyer\nDiscover the poetic soul of North Karnataka—vachanas brought to life through research, illustration, and design, preserving voices that continue to inspire centuries later.\nಉತ್ತರ ಕರ್ನಾಟಕದ ಕಾವ್ಯಾತ್ಮಕ ಆತ್ಮವನ್ನು ಅನ್ವೇಷಿಸಿ — ಸಂಶೋಧನೆ, ಚಿತ್ರಣ ಮತ್ತು ವಿನ್ಯಾಸಗಳ ಮೂಲಕ ಜೀವಂತಗೊಳಿಸಿರುವ ವಚನಗಳು, ಶತಮಾನಗಳ ನಂತರವೂ ಪ್ರೇರಣೆ ನೀಡುತ್ತಿರುವ ಸ್ವರಗಳನ್ನು ಸಂರಕ್ಷಿಸುತ್ತವೆ.\nSculptures in Soap | ಸಾಬೂನಿನಲ್ಲಿ ಶಿಲ್ಪಗಳು\nA Legacy Preserved | ಪರಂಪರೆಯ ಸಂರಕ್ಷಣೆ\nSecond Floor Foyer\nN S Seshadri (1936-2009) was an incredibly gifted artist whose legacy has been preserved through intricately carved soap sculptures. Self-taught, he created with passion and precision in equal measure. His daughter, Chinmai, has curated a selection of the 60-year-old sculptures in display of skill and devotion to craft.\nಅದ್ಭುತ ಸಹಜ ಪ್ರತಿಭೆಯ ಮೇರು ಕಲಾವಿದರಾದ ಎನ್‌ . ಎಸ್‌. ಶೇಷಾದ್ರಿ (1936-2009) ಅವರ ಕಲಾ ಪರಂಪರೆಯು ಸೂಕ್ಷ್ಮವಾಗಿ ಕೆತ್ತಲ್ಪಟ್ಟಿರುವ ಸಾಬೂನು ಶಿಲ್ಪಗಳಲ್ಲಿ ಜೀವಂತವಾಗಿ ಉಳಿದಿದೆ. ಸ್ವ-ಕಲಿಕೆಯಿಂದ ರೂಪುಗೊಂಡ ಒತ್ತಾಸೆಯೊಂದಿಗೆ ನಿಖರತೆಯ ಸಮಾನ ಸಂಯೋಜನೆ ಅವರ ಕಲೆಯ ವಿಶಿಷ್ಠತೆ. ಅವರ ಪುತ್ರಿ ಚಿನ್ಮಯಿ ಅವರು ಕೌಶಲ್ಯ ಹಾಗೂ ಕಲಾನಿಷ್ಠೆಯನ್ನು  ಬಿಂಬಿಸುವ ಆರು ದಶಕಗಳ ಕಲಾಕೃತಿಗಳನ್ನು ಆಯ್ದು ಸಂಗ್ರಹಿಸಿ ರಸಾಸ್ವಾದನೆಗೆ ಒದಗಿಸಿದ್ದಾರೆ. \n  \nFind the schedule for Day 2 here!\n  \nPresented by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/k2k25-day-1/",
    "keywords": [
      "Bangalore",
      "Books",
      "Culture",
      "Film",
      "Food",
      "Krishna to Kaveri",
      "Language",
      "Performing Arts",
      "Society",
      "Visual Arts",
      "Workshops",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-day-1.jpg"
  }
]