[
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "Vara Narada",
    "startDate": "2024-04-25T18:30:00+05:30",
    "endDate": "2024-04-25T20:15:00+05:30",
    "description": "Typically considered to be a mischief maker, the role of Narada has often been reduced to that of jest, featuring as a comic relief in mythological stories. However, there is far more depth to his character, as evident in Sanskrit and regional literature. \nHe is a guru, a well wisher and a soul that helps devotees in distress and more. His persona far surpasses the stereotypes that surround him, and this production by Madrasana aims to highlight that. Presented by Vinay Varanasi & Aditya Madhavan, Vara Narada pays homage to lesser known aspects of the bard through stories and music. The program aims to unravel the layers behind the character, while traversing through stories and supporting music. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/vara-narada/",
    "keywords": "Faith, Heritage, Music, Performing Arts",
    "inLanguage": "sa",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Vara Narada"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-437.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "The Ocean Connection",
    "startDate": "2024-04-22T18:30:00+05:30",
    "endDate": "2024-04-22T20:15:00+05:30",
    "description": "35 mins | Kannada, English with English Subtitles | India \nHonnavar, a coastal town mostly famous for pre-wedding shoots and great scenic routes, a community full of men and women connected to fishing, have been coming together to save the nesting grounds of the Schedule one species Olive Ridley Sea Turtles. The privatisation plans for the beach would lead to the nesting grounds being ruined thus the death of the next generation of sea turtles in the region. This is a heartwarming story of how humans bond with nature and also come together to protect it. \nIn 2010, the Karnataka government identified a site for a proposed port alongside an estuary of the Sharavathi River in the town of Honnavar in Uttara Kannada district. Since then, local residents of villages such as Tonka 1 and 2, which are located on this sandspit of land known as Kasarkod have been protesting against the construction of the proposed port. Fisherfolk inhabit these picturesque seaside villages whose beaches are also a crucial Olive Ridley turtle nesting site. The residents and environmentalists state that the port would destroy this crucial turtle nesting site in coastal Karnataka. The annual nesting patterns of the Olive Ridley turtles are closely followed by the local fishing community and a pooja is also conducted when the hatchlings head to the sea. \nLocals also contend that the port would destroy their livelihood as it would have an impact on fishing. As it is, the dry fishing industry which used the land now taken over by the port authorities, has already stopped functioning. Another concern cited by environmentalists is that the sandspit of land identified as the site of the proposed port is situated on an unstable piece of land that is prone to erosion which would make it unusable for a port. Activists also claim that the building of a port would also mean the laying of a four-lane road that passes through these villages which are a breach of Coastal Regulation Zone norms. The fisherfolk’s opposition to the port has also led to instances over the past few years when protestors have been arrested by the district authorities. While their protests so far have not been successful, villagers have vowed to continue their battle till all the legal routes have been exhausted. \nThe screening of the documentary will be followed by a panel discussion with the filmmaker, Vikas Badiger, Sandeep Hegde of the Honnavar Foundation and fisherman, Rajesh Govind Tandel, moderated by journalist, Vikhar Ahmad. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-ocean-connection/",
    "keywords": "Environment, Film, Sustainability, Wildlife",
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "The Ocean Connection"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-436.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Towards Digital Film Societies",
    "startDate": "2024-04-27T18:30:00+05:30",
    "endDate": "2024-04-27T20:00:00+05:30",
    "description": "Two years of Covid witnessed the world going digital in a big way. The analogue era’s cultural movements like film societies too underwent major changes. Many used digital platforms to see and discuss films in their quest towards building a better film culture. \nAfter starting as the only forum for savouring world film classics in 1940s Mumbai, today the film society movement is finding itself in the midst of a complete digital makeover after two decades of struggling with digital formats from VHS tapes to OTT. Will these changes help them achieve their original goal of developing a group of film connoisseurs and professionals who will carry on the mantle of meaningful films? To know the future one needs to understand the history and its dynamics in full measure. \nBased on the book Celluloid to Digital: India’s Film Society Movement by V K Cherian, this session will begin with a talk examining the future course of the Indian film society movement which nourished the ‘New Wave’ in Indian films from 1970 and has been an anchor for all the meaningful films in the country. It will be followed by a discussion with Babu Subramanian and a Q&A with the audience. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/towards-digital-film-societies/",
    "keywords": "Film, History, Media",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-431.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "Beyond the Red Nose",
    "startDate": "2024-04-28T11:00:00+05:30",
    "endDate": "2024-04-28T12:30:00+05:30",
    "description": "Clowning as an art form allows one to be their most vulnerable self with the freedom to express all kinds of emotions in a light, joyous way. It is both a therapeutic experience as well as a learning experience. Clowning uses strategies like honesty, simplicity, connection, respect and honour wrapped in humour and joy to help participants find their inner child. \nWhen applied in a healthcare system or any place where people are frustrated, anxious or experiencing shame and hopelessness, it becomes a very effective medium to express all kinds of emotions which are otherwise suppressed. It helps unlock a therapeutic effect not only for the people in such setups but also for the people who go in as clowns. \nThis session will involve lots of games, partner work, imagination, voice and body work. \nNote: Participants are requested to wear loose and comfortable clothing to the workshop as there will be moderately intense physical work. \nIn collaboration with:\n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/beyond-the-red-nose/",
    "keywords": "Health & Wellness, Performing Arts, Theatre, Workshops",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Beyond the Red Nose"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-440.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Karnataka: A Crucial Swing State",
    "startDate": "2024-04-23T18:30:00+05:30",
    "endDate": "2024-04-23T20:00:00+05:30",
    "description": "Karnataka elects 28 members to the Lok Sabha and is considered a crucial swing state (to borrow a term from American politics) in the forthcoming elections as the INDIA Alliance is hoping to make major gains here. But if history is any indicator, then the BJP has an advantage. \nIn the past four parliamentary elections since 2004, the BJP has managed to win more seats than the Congress. In the elections of 2004, 2009, 2014 and 2019, the BJP won 18, 19, 17 and 25 seats respectively. In the 2019 elections, the BJP, riding on a national wave that favoured the reelection of Prime Minister Narendra Modi, secured a staggering 51.7 percent of the vote share in Karnataka. The lone independent MP who was elected also subsequently extended her support to the BJP which means that the party now has 26 seats in Karnataka. While the electoral history of the past two decades favours the saffron party as Karnataka gets ready to vote in two phases on April 26 and May 7, the Indian National Congress is hoping to regain its past glory in Karnataka. The party which won a thumping majority in the Legislative Assembly elections last year is banking on two issues; its successful implementation of its five guarantees and the injustice done to the State in the devolution of funds from the Union government. \nThe panel that has been curated carefully will discuss whether Karnataka will follow the same pattern that it has set in place from the past 20 years of preferring the BJP or will it witness a change and provide a boost to the INDIA Alliance. The panel will also dwell on other salient themes such as why Karnataka remains an outlier in south India as far as support to the BJP is concerned and the significance of the BJP’s alliance with the Janata Dal (Secular). Leading up to the elections, both the main parties in the fray have witnessed factional wrangles accompanying the selection of candidates while they have also been accused of perpetuating dynastic politics. \nThis event is a part of BIC’s Election series. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/karnataka-a-crucial-swing-state/",
    "keywords": "Bangalore, Governance, Policy & Regulation, Politics",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-445.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "Yaadey",
    "startDate": "2024-04-21T17:30:00+05:30",
    "endDate": "2024-04-21T19:00:00+05:30",
    "description": "This event will pay tribute to Ustad Rashid Khan, an illustrious figure in Indian classical music, through Ragas. \nIn Hindustani classical music, a Raga represents an array of melodic structures with musical motifs. They can express different moods for different times of the day. \nIn this evening concert, the artists will present bandishes of different ragas from the Hindustani classical tradition. \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/yaadey/",
    "keywords": "Music, Performing Arts",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Yaadey"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-422.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Echoes of AI",
    "startDate": "2024-05-04T18:30:00+05:30",
    "endDate": "2024-05-04T20:00:00+05:30",
    "description": "On the surface, an Indian doctor, a British poet, an UberEats courier in Pittsburgh, and a Chinese activist in exile have nothing in common. But they are in fact linked by a profound common experience―unexpected encounters with artificial intelligence. In her debut book Code Dependent, shortlisted for the inaugural Women’s Prize for Non-fiction 2024, Madhumita Murgia shows how automated systems are reshaping our lives all over the world, from technology that marks children as future criminals, to an app that is helping to offer medical diagnoses to a remote tribal community. \nBy highlighting the voices of ordinary people in places far removed from the cozy enclave of Silicon Valley, Madhumita explores the impact of this often-exploitative technology on individuals, communities, and our wider society. \nVidushi Marda, a lawyer and researcher, specialises in examining the socio-legal ramifications of data-driven technologies. Her research centers on technology regulation, asymmetric power dynamics, and fundamental rights. Through her endeavors, she collaborates with governments, corporations, and technical communities to promote social justice. \nTogether, they will discuss and unpack how AI can strip away our collective and individual sense of agency, and shatter our illusion of free will. AI has already infiltrated our day-to-day, through language-generating chatbots like ChatGPT and social media. But it’s also affecting us in more insidious ways. It touches everything from our interpersonal relationships, to our kids’ education, work, finances, public services, and even our human rights. It is already changing what it means to be human, in ways large and small, and Madhumita and Vidushi reveal what could happen if we fail to reclaim our humanity. \nA Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/echoes-of-ai/",
    "keywords": "Books, Development, Nonfiction, Technology",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-438.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "Tara's Trio",
    "startDate": "2024-04-30T18:00:00+05:30",
    "endDate": "2024-04-30T19:30:00+05:30",
    "description": "English | 85 Mins | For Ages 5 to 13 Years \nTara is nine years old and lives with her parents. Little does she know that there are three other companions Andro (Technology), Wadeva (Boredom) and Imagenie (Imagination) who also live with her. These three love Tara very much and are constantly competing with each other to get her attention. Her Dad loves his gadgets and her Mom tries to keep everyone’s imagination alive. \nIt’s summer break and they are off to visit Nani. The rest of the play is about the crazy adventure they end up having. Their car breaks down near a forest. A con man ‘Baba Black Sheep Singh’ appears and offers to help. He hypnotizes the parents and starts to loot the car. At first Tara is scared but as things get more complicated, she realizes that she will have to do something. Turns out the three secret companions are more than happy to jump in. They help Tara to come up with an explosive plan to scare the baba and bring him to his knees. \nDirectors’ Note: \nEverything is fine in equal measure,\nFinding a balance is finding treasure,\nNothing is good or bad ifs all your perception,\nBut watch out beware don’t be fooled by deception \nWith everything in moderation,\nWe can be a happy nation,\nTechnology, Imagination,\nAnd even Boredom. \nThe play explores the basic idea and importance of technology, boredom imagination in daily life of a child. In big cities, there is a lack of space for children to be physically activity, most schools don’t even have a playground and parents are busy with their lives leaving them with no time for kids. This has led to children also being stuck in their rooms glued to plastic screens. Whatever happened to reading books, playing those make-believe games or finding inventive ways to pass the time? Apart from reaffirming the need to be imaginative, the play also tries to change our perception towards Boredom which is mostly seen as negative. \nCast & Crew \nAndro: Jeh Alexandar / Sukrit Mahajan\nWadeva: Kiyomi Mehta / Meghna Roy Chaudhary\nImagenie: Pragati Mishra / Shreya Sharma\nTara: Shristi Sharma / Niiya Kumar\nMamma: Deepa Panchal / Rashmi Khanna\nPapa: Ameet Bhuvan / Danesh Gopalkrishnan\nBaba Black Sheep Singh: Kaustav Sinha\nGPS Voice: Dilnaz Irani\nBig G Voice: Maneesh Verma\u2028\nDirection: Kalyani Hiwale & Akhshay Gandhi\nScript, Lyrics & Music: Asif Ali Beg\nStory: Kalyani Hiwale & Maneesh Verma\nMusic Producer: Kaizad Gherda\nCostumes: Sonal Kharade\nAssistant Director & Lights: Vishal\nSets & Props: Kapil Dev & Niranjan Jadhao\nStage Manager: Monika Gupta\nPublicity Design: Maneesh Verma\nManager: Anita Gandhi\nCreative Producer: Maneesh Verma \nOur Muses: Aadya Verma & Neev Gandhi \nIn collaboration with Collective Madness and Conservatory for Arts & Artists \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/taras-trio/",
    "keywords": "Performing Arts, Theatre",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Tara's Trio"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-441.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "Asamana Anasuya",
    "startDate": "2024-05-12T18:30:00+05:30",
    "endDate": "2024-05-12T20:30:00+05:30",
    "description": "92 Minutes 36 Seconds | English & Telugu with English Subtitles | 2023 \nAsamana Anasuya (Incomparable Anasuya), is a documentary directed by Seetha Ratnakar as a tribute to her mother Vinjamuri Anasuya Devi.  \nVinjamuri Anasuya Devi was a musical prodigy who started giving concerts at the age of 7. Her first gramophone recording, Ayyo Koyyoda at age 8, ignited her lifelong love affair with folk music. She was a trailblazer who introduced folk songs on a concert platform when she was 11. Encouraged by the overwhelming response she started giving full length folk concerts along with her sister, Vinjamuri Seetha Devi. Popularly known as the Vinjamuri Sisters, they became a phenomenon that took the music world by storm.  \nAnasuya started composing music for her uncle, Devulapalli Krishna Sastri when she was 9 and became a sought-after music composer. She was multi-talented and excelled in music of every genre but folk music remained her passion. She dedicated her life to popularising and propagating traditional and folk songs. She bequeathed an invaluable legacy to posterity by categorising her vast collection into 7 volumes and publishing them along with lyrics and music notations. At the age of 80, Anasuya became a writer and published 4 books including her autobiography Asamana Anasuya, at the age of 94.  \nThe film screening will be followed by a Q&A with the director. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/asamana-anasuya/",
    "keywords": "Biography, Film, Music",
    "inLanguage": "te",
    "workPresented": {
      "@type": "Movie",
      "name": "Asamana Anasuya"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-439.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "Romantic Ties — Liszt, Brahms, Sciortino",
    "startDate": "2024-04-24T19:00:00+05:30",
    "endDate": "2024-04-24T20:30:00+05:30",
    "description": "Award-winning Italian pianist Elia Cecino presents a programme that evokes the interactions of thought among composers and the web of similarities and quotations woven into their music. Meet the figures who inspired the works of the great nineteenth-century Romantic composers, Franz Liszt and Johannes Brahms.  \nElia Cecino will perform Liszt exploring the theme of love in the opera “Faust” by Charles Gounod, with the love duet between Faust and Margherita, and in the passionate verses of the Italian poet Francesco Petrarca. Alongside, in an experimental comparison, Cecino will premier in India the “New Petrarca Sonnet” (2022) by the contemporary composer Orazio Sciortino.  \nCecino will also play Brahms’ Variations Op. 9 paying homage to Clara and Robert Schumann, in a meditative atmosphere of memories and allusions. The grandiose Sonata Op. 1, reminiscent of Beethoven’s style, will close the concert with a sparkle. \n \n\nIn collaboration with: \n      \nSupported by: \n             \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/romantic-ties-liszt-brahms-sciortino/",
    "keywords": "Music, Performing Arts",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Romantic Ties — Liszt, Brahms, Sciortino"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-Romantic-Ties.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "ಪಂಚಮ ಪದ | Panchama Pada",
    "startDate": "2024-04-22T19:00:00+05:30",
    "endDate": "2024-04-22T20:30:00+05:30",
    "description": "Panchama was a magazine closely aligned with the Dalit Movement in Karnataka that gave voice to a generation of writers and journalists to document their contemporary moment including atrocities against Dalits. Using performance, the Jangama Collective revisits some of these writings and places them alongside songs, skits, pamphlets, and their own memories to think about where one should look for an embodied archive of Dalit resistance.\n\nThere will be a twenty minute post performance open forum with the performers and audience.\n\n\n\n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%aa%e0%b2%82%e0%b2%9a%e0%b2%ae-%e0%b2%aa%e0%b2%a6-panchama-pada/",
    "keywords": "Culture*, Society, Theatre",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-433.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Rise and Fall of the Vanderbilts",
    "startDate": "2024-06-11T18:30:00+05:30",
    "endDate": "2024-06-11T20:00:00+05:30",
    "description": "Once upon a time, there was a family whose very name connoted wealth. The Vanderbilts had a vast empire built on freight through steamboats and railroads. Over a few generations, the wealth-worth billions in today’s money-had been frittered away and the business itself faded as new options came up in the freight business. Their story remains an enduring example of what happens when business leaders fail to embrace the future and transform. \nBusiness transformation is a dynamic topic that is explored by authors R Gopalakrishnan and Hrishi Bhattacharyya in their book Embrace the Future. A key lesson in the success or failure of such transformations lies in harmonising the art and science of change – the emotional and the rational – and striking the right balance between them. Both in life and in business, a compelling narrative that inspires the organisation is essential for effecting transformation. Equally important is viewing transformation as an ongoing effort integrated into the work culture, rather than solely reacting to crises. \nTheir book resonates with anyone who has encountered change—something prevalent in today’s ever-evolving business landscape. R Gopalakrishnan and Hrishi Bhattacharyya underscore that companies unwilling to adapt are bound to fade away. The authors will share their insight on how it’s imperative to draw lessons from the past, navigate the present, and prepare for the future. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-rise-and-fall-of-the-vanderbilts/",
    "keywords": "Books, Business, Nonfiction",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-428.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Like the Date Palm",
    "startDate": "2024-04-28T11:30:00+05:30",
    "endDate": "2024-04-28T13:00:00+05:30",
    "description": "“Translation is a little like falling in love,” says Arvind Krishna Mehrotra. “It can be love at first sight, when you read a poet and have a desire to translate him immediately. Or he can come back to you decades later, your memory of him faded. When I started translating Rahim’s dohas, I had forgotten all about him, even who he was. It’s as if I’d never read him – though I had.” \nIn Search of Rahim is Mehrotra’s discovery of the man and his work through translation, history, and memory. In the process, he recovers parts of his own boyhood by going back to someone who died 400 years ago. \nThis event has Mehrotra in conversation with Jeet Thayil. Post the conversation the floor will be open for a Q&A with the audience. \nHeader Image: Akbar’s siege of “Brampore” (Burhanpur); from the last German edition of *Munster’s Cosmographia*, 1628 \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/like-the-date-palm/",
    "keywords": "Literature, Poetry",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-432.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "At the Theatres",
    "startDate": "2024-05-01T19:00:00+05:30",
    "endDate": "2024-05-01T20:30:00+05:30",
    "description": "IndoSoul is celebrating 12 years of creating soul-stirring melodies that have captivated hearts worldwide. Embracing the independent spirit of Bangalore, the upcoming event is tailored for the city’s Carnatic contemporary-loving audience. Having garnered a dedicated fan base over the years, IndoSoul’s showcase is designed to resonate with their preferences by featuring beloved fan favourites. \nBeyond the familiar tunes like Manavyala, Raghuvamsa etc, IndoSoul aims to amplify the vibrant and independent music spirit curating a unique experience that celebrates both the rich heritage of Carnatic music and its dynamic evolution into a global phenomenon. \nThis event holds special significance, not only marking a dozen years of their musical craftsmanship but also serving as an expression of gratitude towards the audience who have been a constant source of support. \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/at-the-theatres/",
    "keywords": "Music, Performing Arts",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "At the Theatres"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-443.jpg"
  }
]