[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "83062-1766338200-1766343600@bangaloreinternationalcentre.org",
    "name": "Why Doesn’t Patriarchy Die?",
    "startDate": "2025-12-21T17:30:00+05:30",
    "endDate": "2025-12-21T19:00:00+05:30",
    "description": "This conversation will shift your understanding of power, and of possibility. \nIn this session Rahila Gupta will examine how male dominance persists across radically different societies from theocracies to democracies, dictatorships to socialist states. Her co-authored book Planet Patriarchy asks what makes patriarchy so resilient, and where feminism is not just surviving but genuinely thriving. \nAt the heart of the conversation is a revelation: a little-known women’s revolution in Rojava, Northeast Syria. Here, women are building a bottom-up democracy rooted in multi-ethnic inclusivity and ecological sustainability. It’s a radical reimagining of power that challenges everything we think we know about governance and gender. \nConcluding with an audience Q&A, this session invites you to rethink power, resilience, and the possibilities of feminist futures, one where gender equality isn’t an afterthought but the foundation. \n",
    "url": "https://bangaloreinternationalcentre.org/event/why-doesnt-patriarchy-die/",
    "keywords": [
      "Books",
      "Gender",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-2-8.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "82888-1766188800-1766275199@bangaloreinternationalcentre.org",
    "name": "Carols in the City",
    "startDate": "2025-12-20T05:30:00+05:30",
    "endDate": "2025-12-21T05:30:00+05:30",
    "description": "It’s beginning to sound a lot like Christmas! \nTwo of the finest choirs in the country, The Bangalore Men and Cappella Bangalore, come together for an evening of festive cheer and choral splendour. Carols in the City offers a traditional Christmas concert with a few gentle twists: beloved classics, new pieces waiting to become favourites, and traditions gathered from places far beyond our own December skies. \nRocking jingle bells, shimmering harmonies, and the unmistakable sparkle of the season all find their way into this programme, performed with the richness and precision that have defined both ensembles. Joining them on stage is pianist Rebecca Thomas Colaco. The evening comes alive under the direction of conductor Jonas Olsson. \nA concert that brings the warmth of Christmas to the heart of the city: familiar, joyful, and touched with just the right amount of surprise. \nSupported by: \n  Contact \n",
    "url": "https://bangaloreinternationalcentre.org/event/carols-in-the-city-5/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Carols in the City"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-69-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "82879-1766169000-1766174400@bangaloreinternationalcentre.org",
    "name": "Many Ladders, Many Futures",
    "startDate": "2025-12-19T18:30:00+05:30",
    "endDate": "2025-12-19T20:00:00+05:30",
    "description": "A society fails not when it lacks talent, but when talent has nowhere to go. \nIn this lecture, Professor Anirudh Krishna invites us to reimagine opportunity not as luck or merit, but as something societies deliberately construct. Drawing on over a decade of global research across countries and contexts, this lecture asks an uncomfortable question: how much potential are we wasting when millions operate far below what they’re truly capable of? \nThrough stories of nations that have successfully built strong pathways to success, we’ll explore the architecture of progress: the schools, networks, policies, and cultural shifts that turn capacity into achievement. This isn’t your average abstract policy talk but rather a conversation to understand the structures that launch young people toward their dreams or leave them stranded. \nWhether you’re an educator, policymaker, parent, or simply someone who cares about untapped potential, this conversation will reshape how you think about development and the futures we’re building together! \nThis lecture is a part of Azim Premji University’s Public Lecture Series. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/many-ladders-many-futures/",
    "keywords": [
      "Business",
      "Development",
      "Management"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-70-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "82684-1766516400-1766523600@bangaloreinternationalcentre.org",
    "name": "Tales of Longing: Stories of Love and Restraint",
    "startDate": "2025-12-23T19:00:00+05:30",
    "endDate": "2025-12-23T21:00:00+05:30",
    "description": "Love unfolds in countless shades, and dance is its most eloquent witness! \nPallavi frames the journey with invocations to Shiva, the cosmic dancer whose eternal rhythm anchors all experience. Between these moments, a trio of evocative episodes unfolds: a heroine confiding in her friend about the king she longs for, a courtesan challenging her lover’s hollow assurances, and a wife embracing one final night with her husband before he departs for war. Each vignette reveals how love moves through vulnerability, desire, frustration, and devotion. \nThis performance features Raghuram Rajagopalan on vocals, Vinay Nagarajan on mridangam, Mathur R. Srinidhi on violin, and Sahana Sridhar leading the Nattuvangam. With a distinguished live ensemble supporting her, Pallavi offers an intimate exploration of love’s many textures.  \nAn evening that lingers like a feeling you recognise before you can name. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/tales-of-longing-stories-of-love-and-restraint/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-71-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "83258-1766314800-1766318400@bangaloreinternationalcentre.org",
    "name": "Glowbugs and Glowing Hearts",
    "startDate": "2025-12-21T11:00:00+05:30",
    "endDate": "2025-12-21T12:00:00+05:30",
    "description": "We can always get by with a little help from our friends! \nBasava, a young boy, discovers this for himself when a search for firewood in the forest turns into an unexpected journey shaped by the gentle magic of helping others. \nTo mark the 20th anniversary of Basava and the Dots of Fire, author Radhika Chadha will do a special reading of her much-beloved tale. First published by Tulika Books in 2005 and now in its seventh reprint, the book has become a steady favourite among parents, reviewers and young readers alike. Celebrated for its warm narrative of kindness and friendship, as well as illustrations that make every page feel like artwork, it continues to be recommended as a standout picture book two decades after its debut. \nJoin us for a joyful session that revisits a story whose sparks of wonder and empathy glow brightly long after it is read. \nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/glowbugs-and-glowing-hearts/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Children's Books"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-72-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "83253-1767553200-1767558600@bangaloreinternationalcentre.org",
    "name": "Things I Know to Be True",
    "startDate": "2026-01-04T19:00:00+05:30",
    "endDate": "2026-01-04T20:30:00+05:30",
    "description": "What happens when the story parents tell themselves begins to unravel? \nThings I Know to Be True opens inside a household that appears settled, successful, and certain of its own choices. The parents believe they have raised four responsible, self-sufficient children. Yet, as the family gathers and life quietly intervenes, that confidence begins to fracture. Each child stands at a turning point (some comic, some devastating) forcing the family to confront what growing up truly costs, and what letting go really means. \nWritten by Australian playwright Andrew Bovell and directed by veteran theatre-maker Feisal Alkazi, the play traces the intimate tremors beneath everyday life: marriages that settle into routine, careers that falter, identities that refuse to stay hidden, and parents learning (often painfully) that love cannot protect against every fall. With deeply universal themes, the play has resonated across continents, becoming one of the world’s most performed scripts in recent years. \nFamiliar lives, difficult choices, and the tender ache of watching those we love grow in unexpected ways. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/things-i-know-to-be-true/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Things I Know to Be True"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-106.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "83443-1767810600-1767817800@bangaloreinternationalcentre.org",
    "name": "Gail and Bharat",
    "startDate": "2026-01-07T18:30:00+05:30",
    "endDate": "2026-01-07T20:30:00+05:30",
    "description": "80 minutes | English & Marathi with English subtitles | India | 2025 \nScholarship and resistance bridged by love. \nA documentary that traces the shared journey of US-born Indian sociologist and Dalit rights activist Dr. Gail Omvedt and activist-intellectual Dr. Bharat Patankar, this film situates their personal story within the larger arc of India’s socio-political movements. Charting Omvedt’s path from America to western Maharashtra, her deep engagement with Dalit-Bahujan politics, and a life of thought and action shaped alongside Patankar, Gail & Bharat brings out the personal in the political. \nSet largely in Kasegaon, where the couple lived and worked for decades, the film foregrounds voices and struggles long ignored by mainstream media and academia. It reflects Omvedt’s seminal contributions to anti-caste studies and her role in building global intellectual conversations around Phule and Ambedkar, while also capturing Patankar’s grassroots leadership through movements for land, water, and dignity. Tender, political, and quietly moving, the documentary preserves the legacy of two organic intellectuals whose lives blurred the boundaries between scholarship, activism, and everyday care. \nThe screening will be followed by a conversation with filmmaker Somnath Waghmare, and subsequently a Q&A with the audience. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/gail-and-bharat/",
    "keywords": [
      "Film",
      "History",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "mr",
    "workPresented": {
      "@type": "Movie",
      "name": "Gail and Bharat"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_GB.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "83081-1766084400-1766089800@bangaloreinternationalcentre.org",
    "name": "Dual Margam 7",
    "startDate": "2025-12-18T19:00:00+05:30",
    "endDate": "2025-12-18T20:30:00+05:30",
    "description": "Two classical forms. Two systems of expression. \nOdissi emphasizes torso isolations, its musicality flowing through sculptural stances. Every line curves inward, contemplative and sensuous. Kuchipudi, shaped by dance-drama traditions, brings brisk footwork, elevation and theatrical precision. Its energy is kinetic, narrative-driven. \nThis Dual Margam reveals how regional lineage and performance tradition shape technique. Presented together, these forms show what makes each dance unique in how they occupy space, interpret rhythm and express meaning.  \nAn evening that showcases the extraordinary breadth of Indian performance traditions on a single stage. \nThe Dual Margam series curates two classical dance forms of India to highlight their similarities and differences. The solo performances honour traditional repertoire (the Margam), while the duet will juxtapose each unique form with another. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dual-margam-7/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_DM7.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "83015-1765998000-1766003400@bangaloreinternationalcentre.org",
    "name": "Love In The Time of Algorithms",
    "startDate": "2025-12-17T19:00:00+05:30",
    "endDate": "2025-12-17T20:30:00+05:30",
    "description": "Swipe right on a night of laughter, love and longing. \nCreated by The Self Centre, Love in the Time of Algorithms is a contemporary theatre production that unpacks today’s wild world of dating and relationships through seven slice-of-life vignettes. From first dates that feel like job interviews to friends surviving the battlefield of bios, this play brings new-age love to the centre stage. A brutally honest yet tender look at how technology has changed the way we search for connection, and how even today, we are all ultimately human. \nWhether you’re single, taken, situationship-ing, healing, or simply curious, you’ll leave feeling seen, entertained, and maybe even a little hopeful! \nAbout The Self Centre: \n\n\n\n\n\n\n\n\nThe Self Centre is a space dedicated to exploring the self and the dilemmas of our times through theatre. It creates and curates work that responds to the pulse of the community, offering room for reflection, dialogue, and transformation. Its approach, described as transformational theatre, is rooted in the belief that performance can shift not only perspectives, but also possibilities for how people live and relate to one another. \n\n\n\n\n\n\n\n\n \nSupported by: \n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/love-in-the-time-of-algorithms/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Love In The Time of Algorithms"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-70-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "82691-1766602800-1766608200@bangaloreinternationalcentre.org",
    "name": "Kaleidoscope",
    "startDate": "2025-12-24T19:00:00+05:30",
    "endDate": "2025-12-24T20:30:00+05:30",
    "description": "A tradition stays alive not by preservation alone, but by the courage to reimagine. \nThis concert pays homage to the Hindustani classical musicians of the 20th century: artists who honoured an ancient lineage while boldly reshaping it for a changing world. As India awakened to independence, they too evolved with it, expanding melodic possibilities, reimagining rhythm, and infusing contemporary thought into timeless ragas. Legends such as Pt. Dinkar Kaikini, Pt. Kumar Gandharva, Vid. Prabha Atre, Vid. Veena Sahasrabuddhe, Begum Akhtar, and Farida Khanum helped forge a modern, resonant Hindustani idiom whose influence endures today. \nMaahi and Neil revisit this rich inheritance through ragas like Yaman Kalyan, Bihag, Multani, and Bhairavi, alongside select semi-classical pieces. Both artistes will present vocal works. Maahi will be accompanied by Neil on the Appalachian dulcimer, while Neil’s performance will feature Aniket on classical electric guitar. Kaushik will provide the rhythmic accompaniment on tabla for both. \nAn evening to honour the musicians who made this music timeless. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/kaleidoscope/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Kaleidoscope"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_kaleidocope.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "83600-1767465000-1767470400@bangaloreinternationalcentre.org",
    "name": "Land of the Blackbuck: A Story of Hope and Resilience",
    "startDate": "2026-01-03T18:30:00+05:30",
    "endDate": "2026-01-03T20:00:00+05:30",
    "description": "23 minutes | English | 2025 | India \nWhen we decide what is worth protecting, who gets left behind? \nLand of the Blackbuck turns its gaze toward India’s grasslands: vast, open ecosystems long dismissed as “wastelands,” and quietly pushed to the margins of conservation thought. This documentary reveals the cost of this misnaming. Not only is the survival of species such as the blackbuck, caracal, and great Indian bustard at risk, but also a deeper understanding of how life persists in these seemingly spare terrains. \nMoving beyond wildlife portraiture, the film traces the intricate web of life sustained by grasslands, weaving together ecological science, lived knowledge, and cultural memory. Through voices of local communities, researchers, and conservationists, it challenges the hierarchy of what is deemed worthy of care, asking what happens when we fail to protect what is not glorified. \nThis film is a mark of the wider movement calling for attention, humility, and responsibility toward ecosystems that quietly sustain us all. \nThe screening is followed by a conversation with filmmaker Sumanth Kuduvalli and behavioural ecologist Kavita Isvaran, concluding with an audience Q&A. \n",
    "url": "https://bangaloreinternationalcentre.org/event/land-of-the-blackbuck-a-story-of-hope-and-resilience/",
    "keywords": [
      "Film",
      "Wildlife"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-75-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "83178-1766316600-1766322000@bangaloreinternationalcentre.org",
    "name": "Colours of Meera",
    "startDate": "2025-12-21T11:30:00+05:30",
    "endDate": "2025-12-21T13:00:00+05:30",
    "description": "A princess who walked away from the palace. A woman who defied family, society and expectations to sing her devotion. Meera’s voice rings through centuries, distinct and uncompromising. \nIn a canon dominated by male Bhakti and Sufi mystic poets, Meera carved her own path. Her songs speak of pure, love-filled devotion to Krishna, but they also explore complex yogic ideas that challenge our understanding of spiritual practice. She didn’t just worship: she wandered, questioned, and transformed herself into a yogini free from the expectations placed on the women of her time. \nThis musical session explores the many colours of Meera through folk songs from Rajasthan and beyond. Vipul Rikhi will trace how her voice differs from her male contemporaries, how her femininity shapes her devotion and how her rebellion becomes inseparable from her spirituality.  \nA chance to hear Meera as a radical figure who redefined what devotion could mean. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/colours-of-meera/",
    "keywords": [
      "Music",
      "Performing Arts",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Colours of Meera"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_CoM.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "83637-1767639600-1767645000@bangaloreinternationalcentre.org",
    "name": "Vishnu-Davis-Haleigh Project",
    "startDate": "2026-01-05T19:00:00+05:30",
    "endDate": "2026-01-05T20:30:00+05:30",
    "description": "Crossing genres and geographies, this performance is truly unique! \nThis collaboration began as a musical conversation across distance: between Appalachian folk traditions rooted in storytelling, the improvisational language of jazz, and the raga-based imagination of Indian classical music. Davis & Haleigh, a violin and acoustic guitar duo from Birmingham, Alabama, come together with Bengaluru-based Carnatic fusion artist Vishnu R to explore what happens when distinct musical lineages meet without hierarchy, and with curiosity leading the way. \nAt the heart of the performance is dialogue: between strings and rhythm, structure and spontaneity, memory and invention. Davis & Haleigh’s intricate interplay is woven into Vishnu’s explorations on the Navtar, his self-designed nine-string instrument that blends fretted, fretless, and harp-like textures. Fresh from a US tour, this India and Southeast Asia debut carries music shaped by travel, trust, and attentive listening. \nGenres blur, and geographies dissolve, as music takes on a new form. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/vishnu-davis-haleigh-project/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Vishnu-Davis-Haleigh Project"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_VDH.jpg"
  }
]