[
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69183-1737309600-1737315900@bangaloreinternationalcentre.org",
    "name": "Meeting of Jazz & the Raaga",
    "startDate": "2025-01-19T18:00:00+05:30",
    "endDate": "2025-01-19T19:45:00+05:30",
    "description": "Join us for an intimate performance which will take the audience through a journey of songs and original compositions blending both Indian Classical and Jazz influences. \nA Q&A session with the audience will follow. \nAbout MoonArra\nMoonArra has been collaborating with musicians globally for fifteen years now, ever since its first major collaboration at the Java Jazz Festival in Jakarta, Indonesia in 2009. From then on, MoonArra has worked with musicians in Europe – Austria, Sweden, Switzerland, Poland, Italy and Hungary. Africa –Tangiers Morocco and USA. \nThis year marks the 7th year of MoonArra’s collaboration with Phil Scarff, an exponent of both jazz and Hindustani Classical on the saxophone. This time MoonArra is recording an album of original songs written and composed by Madhuri Jagadeesh based on Indian Classical influences with arrangements by Jagadeesh M.R and creative inputs by Phil Scarff and Jataveda Banerjee. \n",
    "url": "https://bangaloreinternationalcentre.org/event/meeting-of-jazz-the-raaga/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Meeting of Jazz & the Raaga"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-60.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68537-1737570600-1737576000@bangaloreinternationalcentre.org",
    "name": "Out of the Middling Middle",
    "startDate": "2025-01-22T18:30:00+05:30",
    "endDate": "2025-01-22T20:00:00+05:30",
    "description": "Midlife is a phase when we find ourselves pulled in multiple directions—across work, home, health, friendships, and hobbies. \nIn this session, Ravi Venkatesan delves into themes from Deepak Jayaraman’s recent book, Play to Potential. The book offers a nuanced exploration of how to unlock human potential—not just professionally but holistically—by embracing life’s highs and lows. Drawing from his acclaimed Play to Potential podcast and his experiences as a coach, Deepak introduces the FLAVOUR framework, a practical guide to navigating the intricate interplay of family, aspirations, values, and relationships. \nDeepak emphasises that life is a team sport, with family serving as an essential support system. He argues that personal growth and achievement are deeply intertwined with our family contexts, a perspective often overlooked in self-help literature, particularly in cultures where family plays a central role. \nA key insight of the book is the recognition that life unfolds in seasons, shaped by transitions—some intentional, others unexpected. Using real-life examples and case studies, Deepak illustrates how navigating these transitions thoughtfully is vital to realising our potential. \nThis discussion will resonate with anyone in their 30s to 60s, offering valuable strategies to lead a multi-dimensional, purposeful life. \n",
    "url": "https://bangaloreinternationalcentre.org/event/out-of-the-middling-middle/",
    "keywords": [
      "Books",
      "Nonfiction",
      "Philosophy",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-691.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68942-1737225000-1737230400@bangaloreinternationalcentre.org",
    "name": "How We Used to Love",
    "startDate": "2025-01-18T18:30:00+05:30",
    "endDate": "2025-01-18T20:00:00+05:30",
    "description": "Being immune to the charms of poetry is a crime that is its own punishment, the Sanskritic tradition tells us. Join us as we discover the allure of Sanskrit and Prakrit love poetry and the travails of translating doe-eyes and elephant-thighs into English with Anusha Rao and Suhas Mahesh, co-translators of the verse anthology, How to Love in Sanskrit (HarperCollins 2024). \nHow to Love in Sanskrit is a poetic exploration of the maze of modern dating: flirting, daydreaming, yearning, and breaking up, through the eyes of Kalidasa, Bana, Vidya, and many other, often anonymous gifted poets. \nModerated by Radhika Chadha, the translators will discuss their inspiration for the book, their approach to translation, misconceptions about Sanskrit poetry, and the challenges of translating pre-modern poetry, drawing from both classic and forgotten texts to paint a picture of what love feels like in Sanskrit. The session will conclude with a reading of their favourite verses from the book. \n",
    "url": "https://bangaloreinternationalcentre.org/event/how-we-used-to-love/",
    "keywords": [
      "Books",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/POSTER_Thumbnail-copy-3-8.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68966-1737284400-1737289800@bangaloreinternationalcentre.org",
    "name": "Hello, Thirsty Crow!",
    "startDate": "2025-01-19T11:00:00+05:30",
    "endDate": "2025-01-19T12:30:00+05:30",
    "description": "Come watch a modern take on the classic Panchatantra Story, The Thirsty Crow – with a handmade puppet! \nIn a theatrical setting, the imagination goes on a ride with songs, edutainment and a moral for a lifetime. \nDiscover the magic of puppet-making as you dive into the creative process and learn how to bring your puppet to life! \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/hello-thirsty-crow/",
    "keywords": [
      "Theatre",
      "Visual Arts",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail1-2.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68620-1737657000-1737662400@bangaloreinternationalcentre.org",
    "name": "American Dream, Indian Style",
    "startDate": "2025-01-23T18:30:00+05:30",
    "endDate": "2025-01-23T20:00:00+05:30",
    "description": "Kamala Harris. Nikki Haley. Vivek Ramaswamy. Fareed Zakaria. It is virtually impossible to turn on CNN, read the Wall Street Journal, go to a hospital, attend a university, or browse a bookstore without encountering a sea of Indian names and faces. In her new book, Indian Genius: The Meteoric Rise of Indians in America, author and journalist Meenakshi Ahamed provides fascinating portraits of the Indian Americans at the forefront of the wave of Indian success stories. \nIn this session, Meenakshi draws from her book to provide us with fascinating portraits of a number of well-known figures who have excelled in their fields. Based on a series of interviews and full of fresh and surprising stories, the session will give readers unprecedented insight into the personal strengths that made these extraordinary individuals’ public achievements possible. \nThe talk will be followed by a discussion with Nirupama Rao, Ambassador & Former Foreign Secretary, GoI followed by an audience Q&A. \n",
    "url": "https://bangaloreinternationalcentre.org/event/american-dream-indian-style/",
    "keywords": [
      "Books",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-693.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68506-1736681400-1736686800@bangaloreinternationalcentre.org",
    "name": "Our Incredible Inheritance: India’s Plant Wealth",
    "startDate": "2025-01-12T11:30:00+05:30",
    "endDate": "2025-01-12T13:00:00+05:30",
    "description": "The lecture will explore efforts to engage the public in conserving India’s extraordinary plant diversity. This diversity forms the foundation of our diverse ecosystems, nourishes us, sustains our health, mitigates climate change, and offers spiritual, recreational, and other invaluable benefits. Vijay Thiruvady utilized botanical gardens like Lalbagh to showcase India’s plant wealth and inspire the public to contribute to safeguarding our natural heritage. Professor Bawa will highlight  ATREE’s recent, innovative initiatives aimed at connecting scientists, students, and the general public to the world of plants. These efforts could promote deeper interactions with nature and continue Vijay Thiruvady’s enduring legacy. \n \nWith this programme, the Bangalore International Centre remembers the contributions of our member Vijay Thiruvady in three landmark lectures that he gave at the BIC, on the “Greening of Bangalore” with Girish Karnad and Capt. Prabhala (2015), on “Botanical Illustrations” with Nirupa Rao (2019), and on “Why Lalbagh Matters” (2021). \nVijay Thiruvady was always interested in various aspects of nature and more specifically horticulture. Among the accounts of our city, his book Lalbagh – Sultans’ Garden to Public Park presents the most comprehensive history of Lalbagh written to date. Ranging across five centuries, it draws on various archives and on his own intimate knowledge of Lalbagh having conducted inspiring nature walks for over 18 years that were attended by over 15,000 walkers. In addition to the Green Heritage Walks in Lalbagh, he conducted Imperial Colonial Walks in Cubbon Park and Military Heritage Walks at the MEG&C, and participated in the various activities of Bangalore Environment Trust as a Trustee. These have included the publishing of notable books on Heritage Trees in and around Bangalore and on Devarakadus and Gundutopus in the vicinity of Bangalore. \nThiruvady spent his early years in Delhi. His academic interests were pursued at St. Stephen’s College, Delhi and School of Architecture, Ahmedabad. When in Delhi, he had exposure to the world of nature and environment through association with a number of distinguished people in the field and institutions. \nIn his later years, he gave talks on Bangalore, its environment and history at many institutions. A gifted raconteur, his encyclopedic knowledge of trees and of Bangalore’s history were conveyed through stories that kindled a love of nature and made his walks, lectures and books memorable, connecting with young and old from around the world, from experts in the field to school children. His passing in August 2023 was a profound loss to the city. \nVijay Thiruvady’s talk on Lalbagh at the BIC, which has been widely viewed as an introduction to the botanical garden and to Bangalore and its history, is available here. \nHis short essays on trees are available here. \nAn article about him in Frontline magazine is available here. \nImage Captions \nThumbnail and Poster: Impatiens species from the Himalaya \nHeader and Instastory: Rhododendron arboreum in the Himalaya  \nJoseph Hooker, the British botanist, on his plant collecting expedition in the Himalaya (1847-1851) gathered over twenty-five species of Rhododendron and wrote The Rhododendrons of Sikkim-Himalaya. He was also fascinated by the diversity of Impatiens (balsams or poor man’s orchids) there and wrote to Charles Darwin about this incredible diversity. More than 100 species have been added from India since Hooker’s account of Impatiens, and many remain to be discovered. \n  \nTea will be served at 11 am. \n",
    "url": "https://bangaloreinternationalcentre.org/event/our-incredible-inheritance-indias-plant-wealth/",
    "keywords": [
      "Environment",
      "In Memory",
      "Science"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-6_POSTER-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68347-1736247600-1736712000@bangaloreinternationalcentre.org",
    "name": "Architectures of Transition",
    "startDate": "2025-01-07T11:00:00+05:30",
    "endDate": "2025-01-12T20:00:00+05:30",
    "description": "Exhibition Walkthroughs\nWed, Jan 8 | 5pm – Walkthrough by Rahul Mehrotra\nThu, Jan 9 | 5pm – Walkthrough by Ela Singhal \nThe travelling exhibition displays the works of 41 emergent architecture practices in South Asia that have engaged in the making of architecture, landscape, and infrastructure in the public realm. The research offers insights into patronage, methodologies, emergent technologies, and construction techniques and also sheds light on how the humane and social aspects of architecture characterized by participatory frameworks are being approached by practitioners today. It attempts to highlight modes of engagement as well as transgressions and synergies between disparate cultures, ways of representation, and knowledge accumulation and production. The first edition of the exhibition was shown at the India International Centre, New Delhi in December 2023, followed by the first travel edition at the Alliance Francaise, Chennai in August 2024. \nThe exhibition is part of the research project – State of Architecture in South Asia, which aims to collectively ask, across South Asia, the question: Does Architecture matter in a state of transition? In the region, numerous transitions, and uncertainties, encompassing climate change, political transformations, and socio-economic shifts, manifest in a heightened form within the daily existence of its populace.  A project initiated by the Lakshmi Mittal and Family South Asia Institute, Harvard University  and the Architecture Foundation,  visit https://www.soasouthasia.com for more details on the project. \nThe Travelling exhibition is produced by Prakriti Foundation and the Architecture Foundation \nIn collaboration with: \n    \nSupported by: \n    \n",
    "url": "https://bangaloreinternationalcentre.org/event/architectures-of-transition/",
    "keywords": [
      "Architecture",
      "Sustainability",
      "Technology",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-688.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69006-1737284400-1737289800@bangaloreinternationalcentre.org",
    "name": "The Journey of the Veena",
    "startDate": "2025-01-19T11:00:00+05:30",
    "endDate": "2025-01-19T12:30:00+05:30",
    "description": "Ancient Sanskrit literature mentions the veena as the instrument used to accompany vedic chants, very much like the organ that was used in the Roman catholic church for the Gregorian chants. The earliest instruments used grass reeds and animal guts as strings for plucking and the joke is that the musicians still use “Grass”. As music developed from folk to classical, desi and Marg Sangeeth, as described in ancient texts like Natya Shastra of  Bharata Muni of the 3rd Century AD, and later Sarangadeva of the 11th Century, the sophistication of playing techniques has advanced. \nIn today’s musical presentation , the audience will witness the use of hybrid electronic veenas as a part of this sophistication and progress, without watering down the gravity and authenticity of the musical form as described in voluminous texts on Indian classical music. \nArtists: \nShanthi Rao and Neeraja Krishnamurthy :Veena\nK.N.Uma Maheshwari :Keyboard\nN.Vasudeva : Mridangam\nSubba Rao : Ghatam \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-journey-of-the-veena/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Journey of the Veena"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-58.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68925-1736679600-1736685000@bangaloreinternationalcentre.org",
    "name": "Stories at the Table",
    "startDate": "2025-01-12T11:00:00+05:30",
    "endDate": "2025-01-12T12:30:00+05:30",
    "description": "Start the new year by gathering around the table to celebrate the flavours that connect us. Food is more than nourishment; it’s a gateway to stories, traditions, and shared moments that shape our lives. This session invites families and individuals to reflect on the memories etched into their favourite dishes, explore the cultural and emotional significance of their dining tables, and celebrate the stories that make meals memorable. \nThrough playful activities and heartfelt storytelling, this session creates a space where participants of all ages can connect, laugh, and leave with a deeper appreciation for their shared culinary heritage. With reflections on the ingredients that make their family table unique, participants will take home a symbolic Recipe for Connection, reminding them of the bonds that nourish their lives long after the last bite. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/stories-at-the-table/",
    "keywords": [
      "Food",
      "Heritage",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail1-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "68935-1736965800-1736972100@bangaloreinternationalcentre.org",
    "name": "Project Tiger",
    "startDate": "2025-01-15T18:30:00+05:30",
    "endDate": "2025-01-15T20:15:00+05:30",
    "description": "2023 | 80 mins | English with subtitles \nLink to the trailer. \nOver half a century ago, India embarked on a pioneering journey to safeguard its tigers. Since then, the world has lost two-thirds of its wildlife, and India’s human population has surged to 1.4 billion. Yet, India’s tiger population has more than doubled, and the country is now home to approximately 70% of the world’s last wild tigers. \nHowever, the path to this extraordinary achievement has been far from straightforward. This film takes you into the backstage of India’s biggest and most ambitious wildlife conservation journey, narrating some untold stories that formed their legacy. But this is more than just a story of conservation. It’s a tale of hope, resilience, and the bond between nature and the Indians. \nThe film showcases how the project has evolved over five decades, highlighting not only the triumphs but also the setbacks, controversies, and compromises made along the way. With an in-depth look at the complexities of tiger conservation, right from political challenges to poaching pressures, you will gain a deeper understanding of the immense efforts required to protect this iconic species. The film also sheds light on the steps needed to ensure that tigers continue to roam freely in India’s forests for generations to come. \nThe screening will be followed by a Q&A session with the film’s producer, Kalyan Varma. \n",
    "url": "https://bangaloreinternationalcentre.org/event/project-tiger/",
    "keywords": [
      "Environment",
      "Film",
      "Wildlife"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Project Tiger"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-692.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68844-1736467200-1736553599@bangaloreinternationalcentre.org",
    "name": "342. Thriving with AI",
    "startDate": "2025-01-10T05:30:00+05:30",
    "endDate": "2025-01-11T05:30:00+05:30",
    "description": "Ravi Bapna and Anindya Ghose, in their new MIT Press book Thrive: Maximizing Well-being in the Age of AI take on the challenge of demystifying AI for the layperson using examples from everyday life. Their hope is that by giving citizens agency and understanding in shaping AI we can get the most out of this newest industrial revolution. \nJoin Ravi Bapna in conversation with Narayan Ramachandran as they chart their way through the ‘House of AI,’ a framework that provides a holistic perspective of the different pillars and layers of AI. They will discuss the role of generative AI versus traditional AI, what barriers companies face in adopting this technology, how we should think about the future of work and reskilling the workforce, and what an agentic future looks like where AI will augment human intelligence and capacity. \nIn this episode of BIC Talks, Ravi Bapna is in conversation with Narayan Ramachandran. This is an excerpt from a conversation that took place in the BIC premises in November 2024. \nSubscribe to the BIC Talks Podcast on your favorite podcast app!\nBIC Talks is available everywhere, including Apple Podcasts, Spotify, Google Podcasts, Castbox, Overcast, Audible, and Amazon Music. \n",
    "url": "https://bangaloreinternationalcentre.org/event/342-thriving-with-ai/",
    "keywords": [
      "Podcast",
      "Society",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-24.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68198-1736679600-1736685000@bangaloreinternationalcentre.org",
    "name": "Gandhi, the Philosopher",
    "startDate": "2025-01-12T11:00:00+05:30",
    "endDate": "2025-01-12T12:30:00+05:30",
    "description": "In Gandhi’s Integrity: Thinking Radically with Gandhi on Religion, Caste, Capital, Liberalism, Science, and Culture (forthcoming Columbia University Press), Akeel Bilgrami presents an account of the many aspects of Gandhi’s thought in a framework that integrates his resistance against imperialism with his critique of capitalist modernity, raising fundamental questions about how we should understand the relevance of these ideas for our own time and concerns. \nA panel discussion with Akeel Bilgrami (Author), Chandan Gowda (RK Hegde Chair Professor, ISEC) and Rajeev Kadambi (Associate Professor, OP Jindal Global University) moderated by Vishnupad (Dean, ESLA, SRM University, AP) will be followed by a Q&A session with the audience. \nIn collaboration with:\n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/gandhi-the-philosopher/",
    "keywords": [
      "Biography",
      "Books",
      "Philosophy"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_GP.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68988-1736620200-1736625600@bangaloreinternationalcentre.org",
    "name": "The Forum",
    "startDate": "2025-01-11T18:30:00+05:30",
    "endDate": "2025-01-11T20:00:00+05:30",
    "description": "The Constitution came into force on 26 January 1950. This session of The Forum asks, has the Constitution succeeded (so far)? \nEminent Senior Advocate Arvind Datar would say yes. In a recent talk celebrating the “Indian Constitution @ 75 Years”, he reminded us that most fledgling post-colonial states saw their experiments with democracy fail. By contrast, India’s “improbable democracy” survived the 20th Century, even in the face of existential threats. \nThen, how are we to make sense of India’s current backsliding on global democracy rankings? How are we to respond to those who tell us that our fundamental rights and democratic institutions are in decline? We might worry that the Constitution is no longer fit for purpose. Yet, equally, we might see the Constitution as the only thing standing between us and tyranny. In short, is the Constitution failing us? Or, are we failing the Constitution? \nIn this session, we will engage with these questions both by examining contemporary constitutional controversies and attempting to place them in the historical context of India’s founding. \nNo prior knowledge of constitutional law is required.  \nThis is the third of our sessions titled, The Forum, a series of engaging discussions held at the BIC Library. Our goal is to bring together individuals from all walks of life, ages 15 to 50, to discuss topics of importance in a setting that is both informed and informal. Whether you’re passionate about current events, social issues, or cultural topics, The Forum provides a platform for open dialogue and thoughtful exchange of ideas. Inspired by the ancient Roman forums, where citizens gathered to discuss and debate the issues of the day, these sessions aim to revive this tradition of community dialogue. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-forum-3/",
    "keywords": [
      "Governance",
      "Law",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-58.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69146-1737054000-1737059400@bangaloreinternationalcentre.org",
    "name": "Anant Prabha",
    "startDate": "2025-01-16T19:00:00+05:30",
    "endDate": "2025-01-16T20:30:00+05:30",
    "description": "Join us for an evening of music and memories, as we experience the rich legacy of the illustrious Dr. Prabha Atre, doyenne of the Kirana Gharana! \nAnant Prabha is a heartfelt homage to Swarayoginee, who excelled in various streams of music ranging from being an academician, researcher, composer, author, guru, and most importantly, a reformer. Atre was also a pioneer in popularising the Indian classical music in the West, giving her first performance abroad in 1969. \nJoin Padmini Rao, one of Prabhaji’s senior-most students, as she takes you on a journey, sharing personal experiences interspersed with musical interludes. A journey, through the Guru-Shishya landscape as it formed and evolved over the years. Get an inside glimpse into the world of Prabhaji’s approach to the fascinating process of musical creativity and development of the artistic temperament, which cemented her position as one of the foremost exponents in the world of Hindustani Classical Music. \nThis concert is held in remembrance of Dr. Prabha Atre, marking one year since her passing on January 13, 2024. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/anant-prabha/",
    "keywords": [
      "In Memory",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Anant Prabha"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-59.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68948-1736593200-1736598600@bangaloreinternationalcentre.org",
    "name": "The Art of the In-Between",
    "startDate": "2025-01-11T11:00:00+05:30",
    "endDate": "2025-01-11T12:30:00+05:30",
    "description": "Conflict at home, with neighbours, between communities. Conflicts about what the law means or should be.  Large collisions of power within and between institutions or nations. \nIn this session on mediation, Hiram Chodosh will present both a global and local perspective to mediation in India. He will discuss the virtues, capabilities, and skills that make mediation a powerful response to conflict. He will evaluate the value of mediation in practice, including in the USA and other parts of the globe, within courts, communities, legislative bodies, international relations, and the role of professional mediators and lawyers in this practice. \nSriram Panchu will present the perspective of the most senior mediation expert and leader in India. He will speak about the growth of mediation in India, its use in the court sector, commercial disputes, significant public disputes like the Ayodhya Babri Masjid – Ram Janambhoomi one, the Mediation Act 2023, the prospects for private mediation. He will also speak about the current foundations for mediation practice in India, the professional career paths, the role of centres and other programs that advance its targeted application in legal and other kinds of disputes. \nThereafter, Hiram Chodosh and Sriram Panchu will have a conversation reflecting on the roots of Indian mediation and its future prospects, including lessons from Indian mediation that the world can learn from and the crucial initiatives now needed to take mediation to the next level of impact and value for meaningful practice and careers. \nA Q&A session with the audience will follow. \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-art-of-the-in-between/",
    "keywords": [
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-57.jpg"
  }
]