[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84726-1769967000-1769972400@bangaloreinternationalcentre.org",
    "name": "Tree Tales: Stories from India’s Fruitful Landscapes",
    "startDate": "2026-02-01T17:30:00+05:30",
    "endDate": "2026-02-01T19:00:00+05:30",
    "description": "When we pick a fruit in the bazaar or slice one open at home, we rarely pause to think about it beyond its taste. Yet inside that familiar fruit lies an extraordinary story that was shaped by millions of years of evolution, intricate ecological partnerships, centuries of human history, and layers of culture, belief, and science. \nThe story of fruits and fruiting trees begins deep in evolutionary time. Fleshy fruits evolved as ingenious biological strategies, forming partnerships with animals such as birds, bats, insects, fish, and primates. By offering sweetness, colour, and aroma, fruiting plants persuaded animals to pollinate flowers and disperse seeds, allowing forests to regenerate and spread. Many fruits still carry the signatures of these ancient relationships, including partnerships with species that no longer exist. Even today, wild and domesticated fruit trees play a vital ecological role, sustaining wildlife and supporting human communities. \nIts not just forests, fruits even entered our myths, rituals, art, and language as powerful symbols of love, abundance, devotion, and prosperity. Mangoes, bananas, pomegranates, figs, and jamun trees appear in epics, festivals, temple carvings, poetry, songs, and everyday expressions. These cultural traces reveal that fruits did far more than nourish bodies. They shaped values, metaphors, memories, and ways of understanding the natural world. Fruits also travelled with people, quietly reshaping landscapes and diets. India is rich in the diversity of edible fruits and they are deeply connected to global exchange. Rulers and states invested in orchards and experimentation, treating horticulture as a serious pursuit tied to prestige, power, and knowledge. Fruit trees became markers of place, preserving geography and history in their names even as political borders shifted. During the last few centuries, botanical gardens, experimental farms, and public parks became testing grounds where fruit trees from across the world were introduced, studied, and distributed. These spaces reshaped what farmers grew and what people ate, linking plants to systems of governance, science, and economy. \nPerennial fruit trees offer hope in a warming world. They support biodiversity, store carbon, stabilise soils, and build ecological and social resilience. By weaving together evolution, ecology, culture, history, and climate, this talk attempts to show that fruit trees are not just sources of sweetness. The talk attempts to invite everyone to see the humble fruit tree not just as food, but as a living thread that binds India’s landscapes, livelihoods, and legends. \n  \nWith this programme, the Bangalore International Centre remembers the contributions of our member Vijay Thiruvady in three landmark lectures that he gave at the BIC, on the “Greening of Bangalore” with Girish Karnad and Capt. Prabhala (2015), on “Botanical Illustrations” with Nirupa Rao (2019), and on “Why Lalbagh Matters” (2021). \nAmong the accounts of our city, Vijay Thiruvady’s book, Lalbagh – Sultans’ Garden to Public Park, published by the Bangalore Environment Trust, presents the most comprehensive history of Lalbagh written to date. Ranging across five centuries, it presents a panoramic view from Kempegowda’s flower garden in 1537, through Haider and Tipu (1760 to 1799), to the East India Company years — Scottish army men and surgeons — and over a century by six Kew trained gardeners. The book is based on research from several archives, including Kew Gardens and the Royal Botanic Gardens Edinburgh, and of course on Vijay Thiruvady’s intimate knowledge of Lalbagh having conducted inspiring nature walks for over 18 years that were attended by over 15,000 walkers. \nVijay Thiruvady was always interested in various aspects of nature and more specifically horticulture. In addition to the Green Heritage Walks in Lalbagh, he conducted Imperial Colonial Walks in Cubbon Park and Military Heritage Walks at the MEG&C, and participated in the various activities of Bangalore Environment Trust as a Trustee. These have included the publishing of notable books on Heritage Trees in and around Bangalore and on Devarakadus and Gundutopus in the vicinity of Bangalore. \nThiruvady spent his early years in Delhi.  His academic interests were pursued at\nSt. Stephen’s College, Delhi and School of Architecture, Ahmedabad.  When in Delhi, he had exposure to the world of nature and environment through association with a number of distinguished people in the field and institutions. \nHe gave talks on Bangalore, its environment and history at many institutions, including the National Institute of Advanced Studies, Raman Research Institute, BIC, Bangalore Club, National Gallery of Modern Art, and Azim Premji University. A gifted raconteur, his encyclopedic knowledge of trees and of Bangalore’s history were conveyed through stories that kindled a love of nature and made his walks, lectures and books memorable, connecting with young and old from around the world, from experts in the field to school children. His passing in August 2023 is a profound loss to the city. \nVijay Thiruvady’s talk on Lalbagh at the BIC, which has been widely viewed as an introduction to the botanical garden and to Bangalore and its history, is available here. \nHis short essays on trees are available here. \nAn article about him in Frontline magazine is available here. \n  \nTea will be served at 5 pm. \n",
    "url": "https://bangaloreinternationalcentre.org/event/tree-tales-stories-from-indias-fruitful-landscapes/",
    "keywords": [
      "Environment",
      "Heritage",
      "In Memory",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-3-5.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84461-1771068600-1771074000@bangaloreinternationalcentre.org",
    "name": "Invisible Empire",
    "startDate": "2026-02-14T11:30:00+05:30",
    "endDate": "2026-02-14T13:00:00+05:30",
    "description": "You’ve received the call. The scam artist trying to get your information. Perhaps you fell for it, perhaps you knew better. In either case, it becomes a story to tell over coffee. \nBut who are the people on the other end of line? \nIn her new book, Scamlands, journalist Snidha Poonam explores the vast fraud economies stretching from small-town India to global scam hubs. Nuanced, detailed and above all, personal, Poonam reports on the many lives that run parallel to our own. Tracing the supply chains of fraud, she reveals an economy that’s both ruthlessly efficient and heartbreakingly human. \nIn this talk, she is joined by columnist Aakar Patel to explore the themes of the book. They will examine how scam economies thrive in the gaps of inequality, why trust is collapsing faster than we can rebuild it, and what it means when fraud becomes a viable career path for an entire generation. The session ends with an audience Q&A. \nThere are no easy answers, but you’ll know more when that unknown number calls again. \n  \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/invisible-empire/",
    "keywords": [
      "Books",
      "Law",
      "Media",
      "Nonfiction",
      "Policy & Regulation",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_IE.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84707-1770057000-1770062400@bangaloreinternationalcentre.org",
    "name": "Education in an Age of Polarisation",
    "startDate": "2026-02-02T18:30:00+05:30",
    "endDate": "2026-02-02T20:00:00+05:30",
    "description": "How do we teach children to hold difference without fracturing? \nAs worldviews polarize globally, education becomes critical terrain for cultivating resilience, communicating values, and building social connectedness among the youth of today. Professor Arniika Kuusisto, leading scholar of early childhood education at the University of Helsinki, presents empirical findings from Finland exploring this urgent challenge. \nThis talk examines educational approaches that equip children to navigate difference constructively. Rather than erasure, Kuusisto focuses on developing capacities for genuine engagement across divides. In increasingly pluralistic societies, the question extends beyond tolerance: how do we foster peer communities where diversity becomes source of strength rather than fragmentation? \nThis lecture is a part of Azim Premji University’s Public Lecture Series. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/education-in-an-age-of-polarisation/",
    "keywords": [
      "Education",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-4-14.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84352-1770229800-1770235200@bangaloreinternationalcentre.org",
    "name": "From Grievance to Vision",
    "startDate": "2026-02-04T18:30:00+05:30",
    "endDate": "2026-02-04T20:00:00+05:30",
    "description": "We have forgotten how to be citizens of our cities. \nWalk through any Indian metropolis and witness a peculiar contradiction: millions inhabit these spaces, yet relate to them only as consumers demanding services. Grievances fragment predictably: the affluent lobby for metro lines while informal settlements fight for sanitation. Each sees the city as a provider that has failed them specifically. \nThis transactional relationship reveals something deeper. Unlike villages steeped in cultural memory or monuments heavy with civilizational pride, the contemporary Indian city exists in our imagination as politically neutral backdrop; a space for commerce and commute, stripped of meaning beyond utility. Without empowered local governance in our collective memory, we cannot envision what urban citizenship might demand. \nThis talk outlines a strategy for civic activism that reimagines the city as living system, shaping who we become through daily encounters. It argues we must ask radical questions. Not merely what services we need, but what kind of city allows dignity, creativity, joy. What connections between citizens create genuine community? What relationship between citizen and state honors our full humanity? \nThe struggle for better governance is simultaneously a struggle to define what kind of people we wish to be—together. \n",
    "url": "https://bangaloreinternationalcentre.org/event/from-grievance-to-vision/",
    "keywords": [
      "Cities",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-2-9.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84994-1770316200-1770321600@bangaloreinternationalcentre.org",
    "name": "Blind Date with a Book",
    "startDate": "2026-02-05T18:30:00+05:30",
    "endDate": "2026-02-05T20:00:00+05:30",
    "description": "Wrap a beloved book. Swap with a stranger. Discover your next read. \nBlind Date with a Book is a literary leap of faith that often leads to the most wonderful discoveries. Bring along a treasured book wrapped in brown paper and ribbon, keeping the title and author delightfully mysterious. You’ll exchange it with another reader, offering them your perfect recommendation while receiving theirs in return. \nIn an intimate, cosy setting surrounded by fellow book-lovers, we’ll gather to share excerpts and ideas from books that have moved us, building a warm circle of readers at BIC. The evening culminates in a grand unveiling of our wrapped treasures, followed by time to browse our specially curated library collection and continue conversations over shared discoveries. \nWhether you’re a seasoned bibliophile or just beginning your literary journey, there’s a community waiting for you! \nPlease note: This is an interactive event designed for a small group of 20 people only. To share this experience widely, we invite those new to our book swap gatherings to join us this time. \nThis event is part of our Programmes at the Library series at BIC. \nWe’re reimagining the BIC Library as a warm, welcoming space for connection and exploration. Through thoughtfully curated sessions, we aim to engage the diverse interests and ages within our community. Our goal is to create an enriching environment for discovery, experimentation, and collaboration, beyond the books on our shelves! \nWe welcome your ideas and input. If you have ideas for events or activities that align with our vision, we’d be delighted to hear from you. Please reach out to us at library@bangaloreinternationalcentre.org \n",
    "url": "https://bangaloreinternationalcentre.org/event/blind-date-with-a-book-7/",
    "keywords": [
      "Books"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-6-10.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84700-1770550200-1770555600@bangaloreinternationalcentre.org",
    "name": "Art History Made Accessible",
    "startDate": "2026-02-08T11:30:00+05:30",
    "endDate": "2026-02-08T13:00:00+05:30",
    "description": "James Payne never set out to become a YouTube sensation. He simply wanted to make art history accessible, stumbling into fame with over a million subscribers along the way. But perhaps that’s precisely the point. \n“In a world of noise and distraction,” Payne says, “great art slows us down. It demands attention, reflection, and interpretation. It doesn’t exist to give us easy answers—but it does give us better questions.” \nIn this illustrated talk, Payne brings his signature storytelling and striking visuals to explore celebrated artworks not as distant masterpieces, but as creations shaped by real people, real pressures, real ambitions. Through visual analysis, historical context, and human stories, he reveals how art intersects with power, class, money, religion, politics, and everyday life. No academic jargon. No dense theory. Just essential questions: Why was this made? What did it mean then? Why does it matter now? \nThroughout the talk, Payne encourages and guides the audience to slow down and really look. Details often missed in galleries are brought into focus, helping viewers understand how artists guide the eye, create meaning, and communicate emotion. As much as it is about learning facts, the talk is about learning how to look. \nThis is art history as it should be: open, democratic, relevant. Payne will be signing copies of his book after the session. \n",
    "url": "https://bangaloreinternationalcentre.org/event/art-history-made-accessible/",
    "keywords": [
      "Books",
      "Media",
      "Nonfiction",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_AHMA.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "85165-1770663600-1770669000@bangaloreinternationalcentre.org",
    "name": "Johann Sebastian Bach's Goldberg Variations",
    "startDate": "2026-02-09T19:00:00+05:30",
    "endDate": "2026-02-09T20:30:00+05:30",
    "description": "This recital presents J.S. Bach’s Goldberg Variations, BWV 988, performed by pianist Eun Seong Hong. The programme invites the audience into an evening of focused listening and reflection, exploring how a single musical idea can unfold into a rich and expansive journey. Presented in India by Eun Seong Hong for the first time, this performance offers a space where structure, balance, and contemplation resonate naturally across cultures. \nThe Goldberg Variations form a small universe built with astonishing perfection: thirty variations framed by an opening and closing aria, all sustained by a single, unchanging bass line. Across its thirty-two movements, the work unfolds like a hidden architecture in time—at once rigorous and deeply expressive. For the performer, this music is not only a technical or structural challenge, but an inward journey, where each note embodies order, reflection, and a sense of profound balance. \n  \nImage Credit \nThumbnail and Poster: Johann Sebastian Bach (aged 61) in a portrait by Elias Gottlob Haussmann (1695-1774), the second version of his 1746 canvas, bequeathed to Bach-Archiv Leipzig by William H Scheide (Princeton, New Jersey). Bach is holding a copy of his six-part canon BWV 1076. \n  \nIn collaboration with: \n \nSupported by: \n    Contact \n",
    "url": "https://bangaloreinternationalcentre.org/event/johann-sebastian-bachs-goldberg-variations/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Johann Sebastian Bach's Goldberg Variations"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-Bach-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84671-1770145200-1770148800@bangaloreinternationalcentre.org",
    "name": "YĀTI - Moving Towards Light",
    "startDate": "2026-02-03T19:00:00+05:30",
    "endDate": "2026-02-03T20:00:00+05:30",
    "description": "Where ancient form dissolves into luminous freedom. \nThis Odissi work approaches the Margam as sacred passage of five stages tracing transformation from discipline to transcendence. Each movement becomes a threshold: technique awakening into spirit, storytelling deepening into personal truth, classical rigor flowering into individual voice. \nForm and fluidity merge, revealing the Margam as it was always meant to be; a living journey where the dancer’s inner landscape meets centuries of inherited wisdom. Structure liberates, offering a steady foundation from which authentic expression can soar. This is choreography as discovery: each gesture a step toward light, each phrase an invitation inward. \nWitness tradition transformed into revelation. \nCredits:\nLight Design: Amlan Chaudhuri\nSupporting Dancers: Joyita Pal, Agnisha Basak, Parama Samanta, Priyanka Roy, Minakshi Kundu, Audrija Roy & Paramita Samanta \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/yati-moving-towards-light/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_Y-MTL.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84972-1770143400-1770147900@bangaloreinternationalcentre.org",
    "name": "Neuroscience, Empathy, and Artificial Intelligence",
    "startDate": "2026-02-03T18:30:00+05:30",
    "endDate": "2026-02-03T19:45:00+05:30",
    "description": "What does it truly mean for a system to be empathic? \nAs artificial intelligence increasingly inhabits our daily environments, from workplace tools to conversational agents, this question has shifted from theoretical curiosity to practical necessity. \nIn this talk, Akila Kadambi will draw on cognitive and social neuroscience to unpack the neural mechanisms underlying empathy and social understanding. Connecting these insights to recent advances in artificial intelligence, including large language and multimodal models, she will highlight where current systems succeed, where they fall short, and what neuroscience can contribute to the design of more socially aligned AI. \nThe talk will be followed by a Q&A with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/neuroscience-empathy-and-artificial-intelligence/",
    "keywords": [
      "Science",
      "Society",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_NEAI.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "85088-1770402600-1770406200@bangaloreinternationalcentre.org",
    "name": "Maati Baani",
    "startDate": "2026-02-06T18:30:00+05:30",
    "endDate": "2026-02-06T19:30:00+05:30",
    "description": "From India’s hinterlands to global stages, their sound travels far and wide. \nMaati Baani, literally ‘the language of the earth’, fuses India’s rare folk traditions and Hindustani classical music with funk and blues. Founded by Hindustani vocalist Nirali Kartik and composer Kartik Shah, the band has collaborated with over 200 musicians from 30 countries. They champion folk musicians from India’s remote villages, featuring them in live sets that weave together Hindi, Gujarati, Sindhi, and Rajasthani voices. Traditional yet transcendent, Maati Baani makes India’s musical heritage accessible, aspirational, and alive. \nThis performance is part of the Tarasha Craft Exhibition 2026, a vibrant showcase celebrating India’s artisan traditions and the craftpreneurs transforming them into sustainable livelihoods. The exhibition features diverse crafts, interactive workshops, and live demonstrations highlighting the innovation, resilience, and creativity of artisans across India: masters building bridges between heritage and contemporary life. \nExperience the language of the earth, live. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/maati-baani/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "sd",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Maati Baani"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_MB.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "84979-1770566400-1770573600@bangaloreinternationalcentre.org",
    "name": "A Book for Our Library",
    "startDate": "2026-02-08T16:00:00+05:30",
    "endDate": "2026-02-08T18:00:00+05:30",
    "description": "Have you ever heard of a book with no ending? \nWe’re making one together, and it’s going straight into the BIC Children’s Library! \nThis Sunday we’re going to find out all about looking after books, about the strangest books ever made, and help us create a one of a kind book authored by everyone, including you! \nBonus: Bring a book that needs fixing and we’ll help you rescue it. All other materials provided. \nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \nIn collaboration with: \n \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-book-for-our-library/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Books",
      "Workshops",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_ABFOL.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84782-1771007400-1771012800@bangaloreinternationalcentre.org",
    "name": "Tell Me a Story about Our World",
    "startDate": "2026-02-13T18:30:00+05:30",
    "endDate": "2026-02-13T20:00:00+05:30",
    "description": "In Tell Me A Story About Our World, academic and translator Vanamala Viswanatha speaks to novelist Kavery Nambisan about the art of fiction and how she combines story-telling with a portrayal of the world in which the story is set. \nKavery‘s recent novel Rising Sons is as much about the Word as it is about the World. In telling the story of a single family from a small village in Karnataka, it implements language in its multilingual capacity, thus enabling the reader’s sensibility to percolate society at different levels. Thus, Kannada coexists comfortably within the English novel and enriches the reading experience, not with novelty but realism. The story begins in pre-independent India and while staying true to the arc of a family’s fortunes, it grapples with the complexities of caste and colonialism. It paints the landscape of rural and urban life of a bygone era, ending in the 1970s. \nThe session will conclude with a Q&A with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/tell-me-a-story-about-our-world/",
    "keywords": [
      "Books",
      "Fiction",
      "Language",
      "Literature",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-111.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "84332-1770570000-1770577200@bangaloreinternationalcentre.org",
    "name": "Menace",
    "startDate": "2026-02-08T17:00:00+05:30",
    "endDate": "2026-02-08T19:00:00+05:30",
    "description": "42 minutes |  English & Hindi with English subtitles | India | 2025 \nCompassion. Conflict. Culling. Care. \nMenace is a documentary that examines one of the most contested questions in contemporary Indian cities: how do we coexist with stray dogs? Set against recent judicial directions and everyday urban realities, the film moves beyond polarised debates to explore the moral, legal, and governance dimensions of the issue. Through voices from animal welfare practitioners, veterinarians, lawyers, municipal actors, adopters, and citizens, Menace traces the shift from historical practices of dog culling to the Animal Birth Control (ABC) framework, while questioning why humane policies often fail in implementation. \nThe screening will be followed by a moderated conversation bringing together perspectives from law, animal welfare, and civic practice. This programme invites audiences to engage with complexity, contradiction, and ethical choice: opening space for reflection on how cities negotiate care and safety without resorting to cruelty or neglect. \nThe screening will be followed by an interaction with the filmmaker. \n",
    "url": "https://bangaloreinternationalcentre.org/event/menace/",
    "keywords": [
      "Film",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "Menace"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-1-15.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "84735-1770402600-1770408000@bangaloreinternationalcentre.org",
    "name": "Celebrating the Interconnectedness and the Making of Cities",
    "startDate": "2026-02-06T18:30:00+05:30",
    "endDate": "2026-02-06T20:00:00+05:30",
    "description": "What if a simple strip of green could catalyse profound transformation? \nOur cities bear the scars of a fractured relationship with the natural world: ecosystems dismantled for private gain, communities pushed to the periphery, public space increasingly territorialised. We find ourselves inhabiting environments which, by design, deny the fundamental truth that human life remains inextricably woven into the larger fabric of nature. However, there exists a compelling pathway toward restoration, one that challenges the very hierarchies defining contemporary urbanism. \nThis talk explores linear parks as a democratic intervention in citymaking: longitudinal green corridors that transcend boundaries of caste, class, religion and geography, weaving through urban fabric to create equitable, accessible commons. Drawing upon a groundbreaking movement in Mumbai, PK Das and Harini Nagendra will examine both the promise and complexities of implementation—the successes, the shortcomings, and the lessons learned—inviting us to reimagine how strategic greening can advance social justice, spatial equity, and environmental regeneration simultaneously. \nThis evening promises a conversation that sparks new possibilities for building cities which honour our interdependence with each other and with the natural world. \nThis session is part of the Let’s Talk Climate Change Talk series. \nPresented by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/celebrating-the-interconnectedness-and-the-making-of-cities/",
    "keywords": [
      "Cities",
      "Environment",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_CTIATMOC.jpg"
  }
]