[
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "64874-1729447200-1729453500@bangaloreinternationalcentre.org",
    "name": "Mela Chiraagaa’n | ਮੇਲਾ ਚਿਰਾਗਾਂ | میلہ چراغاں",
    "startDate": "2024-10-20T18:00:00+05:30",
    "endDate": "2024-10-20T19:45:00+05:30",
    "description": "Mela Chiraagaa’n… \n…a MELA of Sufi kalaam, woven with music and narration \n…a MELA that brings Hindus, Sikhs and Muslims together to celebrate a poet from Punjab’s soil \n…a MELA that dissolves boundaries of gender, caste, class, religion \nThe earthy kalaam of 16th century Sufi faqeer Shah Hussain is an inseparable part of Punjab’s soil, its consciousness, its ‘khalqat’, the people of ‘Sanjha’ Punjab. Weaver, mystic, poet, Shah Hussain kept away from ‘peeri’, ‘meeri’, all kinds of high sounding titles, he lives in our hearts as ‘faqeer nimaana’ (the lowly faqeer). \nMela Chiraaga’an Urs is celebrated every year in remembrance of this poet faqeer Shah Hussain and his beloved disciple, a Hindu Brahmin boy Madho Lal, as they lie buried in their twin graves near Lahore. So inextricably connected, Shah Husain is also remembered as Madho Lal Hussain. 2024 marks Madho lal Hussain’s 436th Urs, his death anniversary, a celebration of the final union with the beloved divine ( ‘Urus’ in Arabic is a wedding) \nThis Mela, a confluence of his poetry, woven with music and narrative, is his journey as a Julaaha (weaver), a ‘malaamati’, as Faqeer Nimaana, the lowly faqeer. It celebrates Punjab’s common cultural landscape, the common poetry, the language, the voice, which remains one despite the border that separates us. \n",
    "url": "https://bangaloreinternationalcentre.org/event/mela-chiraagaan-%e0%a8%ae%e0%a9%87%e0%a8%b2%e0%a8%be-%e0%a8%9a%e0%a8%bf%e0%a8%b0%e0%a8%be%e0%a8%97%e0%a8%be%e0%a8%82-%d9%85%db%8c%d9%84%db%81-%da%86%d8%b1%d8%a7%d8%ba%d8%a7%da%ba/",
    "keywords": [
      "Culture",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Mela Chiraagaa’n | ਮੇਲਾ ਚਿਰਾਗਾਂ | میلہ چراغاں"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-43.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63911-1728039600-1728849600@bangaloreinternationalcentre.org",
    "name": "Karri-Djarrk-Durrkmirri (We-Together-Work)",
    "startDate": "2024-10-04T11:00:00+05:30",
    "endDate": "2024-10-13T20:00:00+05:30",
    "description": "Timings: 11 am to 8 pm\nExhibition on show until Sunday, 13 October \nWalkthroughs with the Artists:\nFriday, 4 October, 11:30 am\nSaturday, 5 October, 11:30 am \nBábbarra Women’s Centre, in collaboration with Tharangini Studio, presents a collection of woodblock textiles, supported by the Australian Government’s Centre for Australia-India Relations. “Karri-djarrk-durrkmirri,” meaning “we work together” in the Kuninjku language of West Arnhem Land, embodies the collaborative spirit of this exhibition, which blends heritage Indian textile traditions with culturally significant designs by Indigenous Australian women. \nBased in remote Maningrida, 500 km east of Darwin, Bábbarra Women’s Centre is dedicated to producing unique screen printed and Lino printed textiles that tell the stories of West Arnhem Land—its people, traditional foods and spiritual beings like yawkyawk (mermaids). Since its inception in 1987 as a women’s refuge, the Centre has supported women’s economic and social development. \nTharangini Studio, a women-owned woodblock printing studio, shares a commitment to craftsmanship and sustainability. Curators Prithi Pais and Anshu Arora have worked closely with director, Padmini Govind to interpret the complex design briefs of the Babbarra women and add their expertise in ethically sourced fabrics, natural dye and repeat patterns. \nKarri-djarrk-durrkmirri is an example of the beautiful artwork that can be created when Australia and India work together. Twenty-one unique textiles made from 77 individual woodblocks will be displayed. The woodblock designs were created by Bábbarra Women’s Centre artists over 20 years and reinterpreted into woodblocks by Tharangini Studio artisans. The fabric was produced under curatorial direction of Prithi Pais and Anshu Arora and Jessica Stalenberg in liaison with Bábbarra Women’s Centre. The exhibition also features embroidery by Porgai women artisans and two video works by Indian-Australian video artist and filmmaker Naina Sen with photographer Anahita Ananth. \nArtists: Deborah Wurrkidj, Jennifer Wurrkidj (dec), Janet Marawarr, Raylene Bonson, Susan Marawarr, Joy Garlbin, Helen Lanyinwanga (dec), Lucy Yarawanga, Nancy Gununwanga (dec), Carol Liyawanga,  Abigial Gurawiliwili Namundja, Ruth Bindiedbal, Susan Marawarr, Jay Jurrupula Rostron, Elizabeth Wullunmingu, Verity Bangarra and dilly bags by Maningrida Arts \nThe exhibition is open to all, at the BIC Gallery, from 4th October to 13th October 2024. Artist talks with visiting artists from Australia will be held on Friday, 4th October and Saturday, 5th October at 11:30am. \nThis marks Bábbarra’s second exhibition at BIC, following their successful Jarracharra (Dry Season Winds) tour across India in March 2023, supported by the Kolkata Consul-General. \nPresented by: \n \nImage credit: Artist Jennifer Wurrkidj (dec) and Janet Marawarr. Discharge print by Tharangini Studio \n",
    "url": "https://bangaloreinternationalcentre.org/event/karri-djarrk-durrkmirri-we-together-work/",
    "keywords": [
      "Textiles",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-597.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "63283-1729105200-1729110600@bangaloreinternationalcentre.org",
    "name": "आनंदओवरी | Anandowari",
    "startDate": "2024-10-16T19:00:00+05:30",
    "endDate": "2024-10-16T20:30:00+05:30",
    "description": "90 Minutes | Hindi (Tukaram abhangs will be sung in Marathi) | Ages 16 years + \nThis play is an adaptation of the seminal Marathi novel ‘Anandowari’ written by D.B. Mokashi in 1974. \nAnandowari (English translation: ‘The Verandah of Bliss’) looks at 17th-century saint poet Tukaram’s story through his younger brother Kanha’s perspective. Tukaram has gone missing again. This time, though, the hints seem ominous. We travel through those 3 days of Kanha’s frantic search for Tuka and his many realisations about his brother. \nIn reminiscing about Tukaram, Kanha tries to grapple with Tuka’s many identities: Tuka his brother, the son, the householder, the creative genius, a saint, a reformer, a rebel. \nThis act of reminiscence becomes an act of grappling with what and who he has lost, in the process giving us a great psychological insight into the events (personal, social and political) and impulses that shaped Tukaram’s consciousness and made him who he was: one of the most beloved Bhakti saint poets of Maharashtra, as tender as he was fierce, as compassionate as he was unforgivingly harsh, as much a reformist as he was a transcendentalist. \nOur adaptation focuses on the search that lies at the heart of the text: a devotee in search of God, a man in search of his brother, a writer in search of the poet Tukaram. \nCredits: \nOriginal Novel Anandowari by D.B Mokashi\nAdaptation and Direction: Gerish Khemani\nHindi Translation: Dr Jaya Dayal\nPerformed by: Varad Salvekar, Hrishabh Kanti\nBackground Score: Ruturaj Bhosle\nAbhang Composition: Keshav Kudale\nLight Design: Sachin Lele\nLights Operation: Prerana\nPoster and Creatives: Robin Patel \nDirector’s Note: \nWhat interested me personally was the question of the creative consciousness of the saint poet Tukaram, the source of his poetry, his metaphysical preoccupations, his social rebellion, his love for his beloved God Vitthal. I was interested in finding a device through which I could approach this text. And then it struck me: what would happen if the writer stepped into his own story? His character has found salvation, what about the writer? How will he? It is an investigation into that search… A devotee in search of God. A man in search of his brother. A writer in search of the poet Tukaram. \nThrough two texts – D. B Mokashi’s original Anandowari and my text where Tuka meets Vithal and Mokashi enters his own story – multiple confrontations are imagined. Confrontation between Mokashi (writer) and Kanha (character), confrontation between Tuka (devotee) and Vitthal (God). Creator and creation? One writer (Mokashi) searching for another (Tuka)? And then the question prevails: Who gives meaning to the other? Both depend on each other for meaning. For identity. Can there be a God without a devotee? Can there be a writer without her creation? Each validates the other. And each has the power to cancel each other out. \nBut then what if they exchange roles? Or what if this duality itself is the biggest illusion? And so these two texts came to be juxtaposed, hoping to interpenetrate and illuminate each other. \nOur adaptation of Anandowari reeks of tremendous longing for the absolute and the madness, pain of creative consciousness and its concomitant search for meaning embodied in the existential desperation of the protagonists. \nWith Support From \n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%86%e0%a4%a8%e0%a4%82%e0%a4%a6%e0%a4%93%e0%a4%b5%e0%a4%b0%e0%a5%80-anandowari/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "mr",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "आनंदओवरी | Anandowari"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-612.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64862-1729189800-1729195200@bangaloreinternationalcentre.org",
    "name": "Guardians of the River",
    "startDate": "2024-10-17T18:30:00+05:30",
    "endDate": "2024-10-17T20:00:00+05:30",
    "description": "Steven Moss, a British naturalist, once called the otter “the elusive movie-star”. The apex predator of river and stream ecosystems in India, the otter is a charismatic and reclusive mammal that has evolved over millennia to adapt brilliantly to its habitat. And yet, today, the three species of otters found in India are in a vulnerable spot, with declining habitat and increasing demand for water placing critical constraints on their continued survival. \nIn this talk, Gopakumar Menon will make a case for their protection and, thereby, the larger case for the preservation of their riparian habitat. \nThe talk will be followed by a panel discussion with conservationist Praneet Goteti and a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/guardians-of-the-river/",
    "keywords": [
      "Environment",
      "Sustainability",
      "Wildlife"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-622.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "63272-1728500400-1728504000@bangaloreinternationalcentre.org",
    "name": "நடபாவாடை | Nadapaavaadai",
    "startDate": "2024-10-09T19:00:00+05:30",
    "endDate": "2024-10-09T20:00:00+05:30",
    "description": "60 Minutes | Tamil | Suitable for all ages \nThe play “Nadapaavaadai” centers on a woman who is forced to conduct burial rites for her entire village after the passing of her family member, who previously performed these duties.  \nDue to social inequality and prevailing customs, women are rarely permitted to even enter the crematorium. The characters in the play question the lady’s access to the crematorium and her role in carrying out those rituals that are traditionally associated with men. \n The charismatic lady performs the rites by taking the center stage, with only men allowed to visit the crematorium. She leads the burial rites in full face of the public – which many would be reluctant to undertake or would not be allowed to do.   \n“Nadapaavaadai” attempts to initiate an engaging dialogue about her role in diverse social and cultural contexts and its implications. This play has evolved out of a close observation, followed by an extensive ethnographic fieldwork, engaging discussions, and participatory playmaking. \nDirector’s Note \nCredit List \nCast\nManik Subramanian\nArchana Selvaraj\nAbinaya Jothi\nDevi Devadoss\nTamilarasan \nMusicians\nSuren Sekaran\nSathya Sharath \nLight Design: Suthan \nStage Manager: Nethaji \nTechnical Assistant: Raagul \nDesign and Direction: Ramassamy S \nSupported By: The Perch Collective \nSpecial Thanks: Kumari Amma Rajiv Krishnan \nAbout the Velippadai Theatre Movement: \nVelippadai Theatre Movement was founded as a community initiative in 2013 to develop deep connection with the lives, sufferings and concerns of the self and others as well, and to inculcate a new awareness in the rural context of Pondicherry about both tradition and modernity. The 15 days Cultural Gathering cum Residential workshop on Theatre-Making and Theatre-Happening titled Cycle Yajna organised by the Movement in 2015 went on to instil a deeper interest for the village people of Kuruvinatham towards theatre while making them realise the rich performance varieties available within their culture and tradition. The Movement conducts theatre workshops, cultural gatherings, environment protection events and acting camps regularly by collaborating global expertise and local knowledge. \nWith Support from \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%ae%a8%e0%ae%9f%e0%ae%aa%e0%ae%be%e0%ae%b5%e0%ae%be%e0%ae%9f%e0%af%88-nadapaavaadai/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "நடபாவாடை | Nadapaavaadai"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-611.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "64794-1728414000-1728419400@bangaloreinternationalcentre.org",
    "name": "Chizai",
    "startDate": "2024-10-08T19:00:00+05:30",
    "endDate": "2024-10-08T20:30:00+05:30",
    "description": "Chizai is an Indian pop-rock band that started their musical journey in 2013 with Sultan Aftab Khan paving the way into the Delhi music circuit along with Chie Nishikori. The band has evolved over the years and now has 6 active musicians in the current lineup. \nTheir music can range from pop, rock to funk and soul. With the release of their last single S6 E01 and AWOL which have traces of alt. rock & flamenco-pop, the band has explored a completely new and fresh soundscape which seems to have delighted their audience lately. \nIn collaboration with: \n  \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/chizai/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Chizai"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-42.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "64809-1728932400-1728936000@bangaloreinternationalcentre.org",
    "name": "Puuluup",
    "startDate": "2024-10-14T19:00:00+05:30",
    "endDate": "2024-10-14T20:00:00+05:30",
    "description": "Puuluup, consisting of Ramo Teder (also known as Pastacas) and Marko Veisson, has captivated audiences worldwide with their innovative blend of traditional and modern music. Since their inception in 2014, they have performed across Estonia and in numerous countries, including Belgium, China, India, and the United States. Their music, a unique fusion of the Hiiu kannel (a two to four stringed bowed lyre from northern Europe) with electronic elements, has garnered significant acclaim, and they recently represented Estonia at the Eurovision Song Contest in 2024 and will be bringing their music to the acclaimed Jodhpur RIFF festival later this year. \nCrossing Hiiu kannel with electronics, Puuluup oscillates on the border of tradition and modern music styles, flirting with world music, underground and pop. Puuluup controls the vibrations of hiiu kannel’s strings through effect blocks and the looper and uses alternative playing techniques and sound generation options. Electronically amplified echoes, knocks, squeaks and scrapes are added to the soft hiss of Hiiu kannel. The music is at times dance-pulsating and at times cinematic and dark, creeping in and carried over from the chambers of the ancient Vormsi talharpists. It sounds like original creations impregnated with tradition, references to punk classics and romantic neo-zombie post-folk with educational content. \nIn collaboration with:\n \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/puuluup/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Puuluup"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-619.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64472-1728844200-1728849600@bangaloreinternationalcentre.org",
    "name": "A People's History of the Mughal Empire",
    "startDate": "2024-10-13T18:30:00+05:30",
    "endDate": "2024-10-13T20:00:00+05:30",
    "description": "Professor Satish Chandra was one of the first historians to shift our attention from the emperors of the Mughal Empire to its people. \nDrawing upon his works, this lecture highlights the contribution of common people in the formation of the empire. It does this by focusing on two groups that played important roles in the domain of warfare. Firstly, it investigates the vast numbers of mercenaries and armed peasants who served as foot-soldiers in the armies. They served as guards, swordsmen, gunners, and archers. Secondly, it studies the pioneers, carpenters, stone-cutters, boatmen, and other workers who toiled in the domain of military logistics. They built roads, constructed bridges, dug tunnels, and looked after the war-animals in the course of campaigns. It argues that the participation of vast numbers of common people in these two capacities was key to the functioning of the empire. This implies that the empire was not an elite project created only by emperors, noblemen, and courtiers. Rather, it was a broad-based political entity that rested on the work and involvement of vast sections of the South Asian population. \nAbout Prof. Satish Chandra \nProf. Satish Chandra (1922 – 2017) was a leading authority on Medieval Indian History. \nIn a career spanning nearly 40 years, Prof. Chandra taught history at Allahabad University, Aligarh Muslim University, Delhi University, Rajasthan University, and finally the Jawaharlal Nehru University (JNU), where along with S. Gopal, Bipin Chandra and Romila Thapar he co-founded the Centre for Historical Studies. \nIn between, from 1972 to 1980 he was first Vice Chairman and then the Chairman of the University Grants Commission. \nIn 1985, along with intellectuals like Prof. Nurul Hasan and marine biologist Dr. Zahoor Qasim, he founded the Society for Indian Ocean Studies which, among other activities, brings out the quarterly Journal for Indian Ocean Studies. \nSon of Sir Sita Ram, India’s first High Commissioner to Pakistan (1947-48), Prof. Chandra has, along with some other JNU historians, been said to have been a ‘left leaning historian’ who espoused the Marxist approach to history, and one whose early experiences helped bridge the intellectual gap in interpreting medieval Indian history and modern times. \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-peoples-history-of-the-mughal-empire/",
    "keywords": [
      "Culture",
      "History",
      "In Memory"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-614.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64601-1729418400-1729449000@bangaloreinternationalcentre.org",
    "name": "Cultural Intersections",
    "startDate": "2024-10-20T10:00:00+05:30",
    "endDate": "2024-10-20T18:30:00+05:30",
    "description": "Curated around the Ministry of Culture, Government of India’s targeted sectors, this full-day symposium brings together government representatives, industry professionals, scholars, corporate leaders, and creative practitioners to advance discussions, document insights and learnings, share best practices, and guide policy-making across India’s diverse culture and creative sectors. The two conferences ‘Beyond Tomorrow’ in Kochi and Cultural Continuum in Mumbai were well attended and concluded successfully. The Bengaluru symposium aims to further these conversations and will be followed by a gathering in New Delhi. \nSchedule \n10:00 am – 10:30 am | Registrations \n10:30 am – 10:45 am | Opening Performance – Natyasruti Children’s Music Ensemble | Featuring young talents aged 12 to 15, the Natyasruti Children’s Music Ensemble, will present a performance under the guidance of Sumitra Nitin. Many of these children have won prestigious music competitions, and some have even performed full solo concerts in prominent sabhas. The ensemble members are Aditi Cavale, Aniket Raja PK, Maanasi Gowthaman, Mithil Rao, Pratiksha B Deekshadar, Reethika Rajan, Saikrishna Rajsekar, Saanvi Prasanna, and Tanusri Balakrishnan. The invocation will include slokas and songs honoring the divine, with notable pieces like Sri Muddusvami Dikshithar’s Vatapi Ganapatim Bhajeham in the raga Hamsadhwani and Sri Purandaradasa’s Kannada Devarnama Indina Dinave. \n10:45 am – 10:50 am | Welcome Address by Vikram Bhatt \n10:50 am – 11:00 am | Context Setting by Sadhana Rao and Asad Lalljee \n11:00 am – 12:15 pm | Panel 1: Keynote | All collaborators – British Council, UNESCO, Ministry of Culture and representatives from the State Government share their insights with Sanjoy K. Roy, Managing Director, TeamWork Arts. \nLily Pandeya | Joint Secretary, Ministry of Culture, Government of India\nUma Mahadevan, IAS | Additional Chief Secretary, Department of Rural Development & Panchayat Raj and Development Commissioner, Government of Karnataka\nSalma K Fahim, IAS | Secretary, Department of Tourism, Government of Karnataka\nJunhi Han | Programme Specialist and Chief of Section – Culture, UNESCO, New Delhi\nSanjoy K Roy (Moderator) | Co-chair, FICCI Tourism & Culture Committee & MD, Teamwork Arts \n12:15 pm – 1:30 pm | Panel 2: Cultural Platforms and Public Spaces for the Creative Economy | How museums, performing arts centres, and cultural districts are key spaces for creativity – not only preserving history but also fostering artistic experimentation and collaboration, contributing to cultural tourism and local economies. \nPriyanka Mary Francis, IAS | Director, NGMA, Bengaluru\nArundhati Nag | Founder & Managing Trustee, Sanket Trust\nTanya Abraham | Founder, TAOS and Member, FICCI Tourism & Culture Committee\nBijoy Ramachandran | Architect & Partner, Hundredhands\nSanjeev Pasricha (Moderator) | Group CEO, CS Direkt & Member of FICCI Tourism & Culture Committee \n1:30 pm – 2:30 pm | BREAK \n2:30 pm – 2:45 pm | Sufi Kalaam from Punjab | A Performance by Radhika Sood Nayak, Neil Mukherjee & Vinayak Netke \n2:50 pm – 4:05 pm | Panel 3: The Arts, Science, and Economics of the Creative Economy | The symbiotic relationship between the arts, scientific advancements, and economic frameworks within the creative economy. By examining how these disciplines influence each other, the panelists will share insights into the power of creativity as a key driver of economic change and cultural influence. \nJahnavi Phalkey | Founding Director, Science Gallery Bengaluru\nShah Faesal | Deputy Secretary, Ministry of Culture, Government of India\nNeeraj Sharma | Managing Director and Media Industry Practice Lead (APAC), Accenture\nMeru Gokhale | Founder, Editrix.ai\nAsad Lalljee (Moderator) | SVP, Essar Group, CEO, Avid Learning, Curator, Royal Opera House, Mumbai, and Member, FICCI Culture & Tourism Committee \n4:05 pm – 4:30 pm | Tea/ Coffee \n4:30 pm – 5:50 pm | Panel 4: Arts Education: Shaping the Creative Leaders of Tomorrow | The future of arts education and how it must evolve to meet the needs of the creative economy by focusing on the skills required, such as digital literacy, entrepreneurship, and collaboration. \nJanaka Pushpanathan | Director South India, British Council\nVikram Bhat | Director, Bangalore International Center\nPuneeta Roy | Managing Trustee, The Yuva Ekta Foundation\nShilpa Vijaykrishnan | Head of Education & Outreach, MAP\nSadhana Rao (Moderator) | Co-founder, Art Links Learning and Member, FICCI Tourism & Culture Committee \n5:50 pm – 6:10 pm | Stories At The Loom | A Presentation by Pavithra Muddaya, Founder, Vimor | Hear stories of weavers, the custodians of a timeless textile legacy, who have clothed humanity for generations. Handlooms not only preserve cultural heritage but also uphold the dignity of livelihoods, offering sustainable economic success in harmony with both man and nature. \n6:10 pm – 6:20 pm | Vote of Thanks \nIn collaboration with: \n            \n",
    "url": "https://bangaloreinternationalcentre.org/event/cultural-intersections/",
    "keywords": [
      "Culture",
      "Economics",
      "Education",
      "Governance",
      "Performing Arts",
      "Policy & Regulation"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-618.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64916-1728585000-1728590400@bangaloreinternationalcentre.org",
    "name": "Work in Progress",
    "startDate": "2024-10-10T18:30:00+05:30",
    "endDate": "2024-10-10T20:00:00+05:30",
    "description": "For World Mental Health Day 2024, we’ve selected Geeli Pucchi, a short film from the anthology Ajeeb Daastaans, directed by Neeraj Ghaywan. The film delves into the complex intersection of caste, sexuality, and socio-cultural politics within the Indian workplace. \nWe will be viewing the episode prior to our discussion. \nJoin us for a thoughtful exploration of mental health and human connection through this remarkable performance. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/work-in-progress/",
    "keywords": [
      "Film",
      "Health & Wellness",
      "Media"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-621.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64667-1728237600-1728243000@bangaloreinternationalcentre.org",
    "name": "An Unequal Citizen?",
    "startDate": "2024-10-06T18:00:00+05:30",
    "endDate": "2024-10-06T19:30:00+05:30",
    "description": "In 2018, Rahul Bhatia left his job as an investigative reporter to understand the necessity of the Aadhaar project. But over time, as he explored its roots, questions about citizenship and belonging began to grow louder in public life, culminating in extreme violence in New Delhi. As this happened, he discovered that India’s technological identity project was linked to a cultural identity project over a century old. These investigations culminated in The Identity Project, a journey through the slow burn of Indian democracy, and a record that connects the past and present to offer the first thorough account of how cultural imperatives are guiding the country’s direction. He describes the religious, societal, and technological changes that have brought India to a point at which a nationalist mindset that challenges democracy and human rights is spreading fast, all in an effort to bind the multiethnic, multilingual, and multicultural country into a single identity. \nThrough a character-driven narrative informed by on the ground reporting, he investigates the history of disinformation in India, and looks at how justice works in the aftermath of riots. What emerges is a timely portrait of a country struggling to define its identity. \nEditor and journalist Prem Panicker will discuss the book with Rahul Bhatia. They will talk about the book’s journey, the process of reporting, and about finding the language to report on recent history. A Q&A session with the audience will follow. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/an-unequal-citizen/",
    "keywords": [
      "Governance",
      "Politics",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-616.jpg"
  }
]