[
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "66666-1733425200-1733430600@bangaloreinternationalcentre.org",
    "name": "The Descriptive Piano",
    "startDate": "2024-12-05T19:00:00+05:30",
    "endDate": "2024-12-05T20:30:00+05:30",
    "description": "This is a BIC Elsewhere event at Sabha: An Arts and Crafts Shaale \nSince its origins in the 18th century, the piano has been used by composers to describe places, events, and even to conjure up the sounds of other instruments, from solo violins to full symphony orchestras. In this introduced ‘conversational’ concert, Karl Lutchmayer will guide his audience through more than a century of piano music, exploring the endless versatility of the instrument in bringing real and imagined worlds to life. Along the way, he will play works by some of the most important piano composers, including Beethoven, Liszt and Debussy. \n \nThis is a BIC Elsewhere Event \nWhile the majority of our events find a home at our premises in Domlur, BIC Elsewhere represents our commitment to bringing conversations, arts, and culture directly to diverse audiences. Through this initiative, we collaborate with various venues, extending the reach of our events beyond our own space. These partnerships not only breathe life into our gatherings but also play a crucial role in cultivating an environment for the flourishing of arts and culture in the city. \nIn collaboration with: \n \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-descriptive-piano/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Descriptive Piano"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-661.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65954-1732905000-1732910400@bangaloreinternationalcentre.org",
    "name": "Running Across the Sahara",
    "startDate": "2024-11-29T18:30:00+05:30",
    "endDate": "2024-11-29T20:00:00+05:30",
    "description": "A 4th generation Indian Army Officer, an Extreme Endurance Athlete and an Ironman Triathlete, Col. Jangvir Lamba had to give up bodybuilding when he was diagnosed with bulging and herniated discs in his spinal cord in 2021. \nWhile most, may have given up after such an injury, Col Lamba trained himself to super fitness against all odds and participated in extreme endurance events at the international level. \nIn April 2024 he entered the Marathon Des Sables . Considered to be the toughest footrace on the planet, Marathon Des Sables is held in the Sahara Desert in Morocco in scorching temperature of over 50 degrees centigrade. With limited quantity of water every day and an open tent to sleep in – runners carry their own gear, sleeping bags, food, medical kit for the entire race, carrying a load of almost 14-15 kgs while running across the Sahara sands. \nIn this session, Col. Jangvir Lamba will share his story of overcoming a serious injury, fighting against all odds and completing some of the most extreme endurance events in the world. He will be in conversation with marathon runner, Sunil Chainani. A Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/running-across-the-sahara/",
    "keywords": [
      "Health & Wellness",
      "Sports"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-654.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65564-1732732200-1732737600@bangaloreinternationalcentre.org",
    "name": "Guiding Beyond the Trail",
    "startDate": "2024-11-27T18:30:00+05:30",
    "endDate": "2024-11-27T20:00:00+05:30",
    "description": "Join us for an engaging session that explores the crucial role of guides in shaping travel experiences, beyond the pages of Jennifer Nandi’s new book, No Half Measures. While her book recounts a remarkable journey through the Northeast with a single British tourist, this event will focus on the broader craft of guiding itself. \nThe discussion will delve into the skills and qualities that make an effective guide, from understanding clients’ needs to creating immersive and meaningful experiences. This session will cover the challenges and rewards of guiding in diverse landscapes, the power of embracing uncertainty, and the importance of cultivating a sense of wonder. \nJennifer Nandi’s talk will be followed by discussion with Priya Venkatesh and a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/guiding-beyond-the-trail/",
    "keywords": [
      "Books",
      "Culture",
      "Environment"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-4_POSTER-7.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "66898-1734028200-1734033600@bangaloreinternationalcentre.org",
    "name": "Universal Food Security",
    "startDate": "2024-12-12T18:30:00+05:30",
    "endDate": "2024-12-12T20:00:00+05:30",
    "description": "Imagine a world without hunger and malnutrition. What would it take to achieve a genuinely food-secure world—where every person gets to consume the right quantity and quality of food to live a healthy, active, and productive life? \nAchieving and sustaining such a future requires transforming how our food is grown, managed, distributed, and consumed. From production to consumption, our food systems must be more sustainable, halting environmental degradation, and even repairing the damage we have previously done. \nGlenn Denning’s Universal Food Security: How to End Hunger While Protecting the Planet presents a bold, evidence-based, practical guide to food systems transformation. He bridges the divisive worlds of science, policy, and practice. By synthesizing the most relevant literature, consulting the world’s foremost experts, and sharing personal insights gained over four decades, Denning lays out five priority areas for action and investment. \nBut in Universal Food Security, Denning goes beyond what needs to change. He goes on to tackle the challenges of implementation. Echoing the words of his mentor, the late Professor MS Swaminathan, Denning argues that we need the knowhow and the do-how to transform our food systems.  \nUniversal Food Security calls for a new generation of enlightened practitioner-leaders—acting on their own and with others, through institutions—to achieve a food-secure world. \nImage Captions:\nThumbnail, Poster and Header: Rice crops in Cambodia\nInstastory: Maize crops in Malawi \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/universal-food-security/",
    "keywords": [
      "Agriculture",
      "Food",
      "Policy & Regulation",
      "Science",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-663.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "66624-1733074200-1733086800@bangaloreinternationalcentre.org",
    "name": "Carols in the City",
    "startDate": "2024-12-01T17:30:00+05:30",
    "endDate": "2024-12-01T21:00:00+05:30",
    "description": "Come start Christmas with The Bangalore Men & Cappella Bangalore, two of the finest choirs in the country, as they present Carols in the City, a traditional Christmas concert with some twists, that will surely put you in a festive mood! \nRocking jingle bells, puddings and figs, snow and prancing – all of the ingredients to make dark December turn into sparkling Christmas. \n\n\nFeaturing: Cappella Bangalore, The Bangalore Men, Rebecca Thomas Colaco on the piano & several soloists, with conductor Jonas Olsson. \n\n\nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/carols-in-the-city-4/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Carols in the City"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-32.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "66471-1732993200-1732999500@bangaloreinternationalcentre.org",
    "name": "Dastan-e-Akhtari",
    "startDate": "2024-11-30T19:00:00+05:30",
    "endDate": "2024-11-30T20:45:00+05:30",
    "description": "\nLanguage: Hindustani (Hindi-Urdu Mix) \nAkhtari Bai Faizabadi, also known as Begum Akhtar was a unique singer of her time. In her unique voice and andaz, she produced such hauntingly sweet notes, coupled with her spontaneity, that the audience were immediately captivated. Beginning at the age of Seven, Begum Akhtar kept her audience spellbound for almost six decades. \nThis was  Begum Akhtar, the Singer; but her personal journey is equally captivating and inspiring. She was a brave, fiercely independent-minded person, who drew her life path herself amidst the struggles that life threw at her. At a time when the social and political landscape of the country was gradually changing, she set her own standards of life and arts, not withstanding the constraints of times and emerged as a stronger person and better singer by living upto those standards. \nWith all its highs and lows and awws and wows, Dastan-e-Akhtari is the story of the life of the legend of her time and beyond, Begum Akhtar. In this performance, the story of her life will be told by Kafeel Jafri – a Dastango (‘storyteller’ in Urdu), interspersed with rendition of her songs – Ghazals & Thumris by Yusra Naqvi, a trained Hindustani Classical Singer. \nSupported by: \n\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dastan-e-akhtari/",
    "keywords": [
      "Culture",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ur",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Dastan-e-Akhtari"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-31.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "66645-1732820400-1732824000@bangaloreinternationalcentre.org",
    "name": "2INDIAS",
    "startDate": "2024-11-28T19:00:00+05:30",
    "endDate": "2024-11-28T20:00:00+05:30",
    "description": "2 INDIAS is a music project blending two historical and diverse cultures from Spain and India – Western Classical and Hindustani Classical in a new avatar. \nPianist and Composer, Sahil Vasudeva, reimagines the works of legendary Spanish Composer, Isaac Albéniz with an Indian Classical Ensemble. He is accompanied by Suhel Saeed Khan on the sitar. Shanawaz Khan on the sarangi, Makrand Sanon on hybrid percussion and Akshay Dwivedi on the bass guitar. \nThe performance transcribes 150-year-old scores to Hindustani classical text to present an innovative and fresh interpretation of Spain’s Greatest Composer. \n2INDIAS has been developed by the Embassy of Spain in India, produced by Meta Arts and presented by range of cultural partners from across the country. \nIn collaboration with: \n      \n",
    "url": "https://bangaloreinternationalcentre.org/event/2indias/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "2INDIAS"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-662.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "66710-1732645800-1732651200@bangaloreinternationalcentre.org",
    "name": "Media Freedom: Past, Present and Future",
    "startDate": "2024-11-26T18:30:00+05:30",
    "endDate": "2024-11-26T20:00:00+05:30",
    "description": "\nThe media is a cornerstone of Indian democracy, often called the “fourth pillar” for its role in supporting constitutional values. Yet today, trust in the media is eroding amid technological upheaval, shifting revenue models, political polarization, and the powerful rise of social media and artificial intelligence. As these forces reshape how information flows, can the media still serve as a guardian of our constitutional ideals? And who, if anyone, will defend the independence and integrity of the media? \nThis session is the third in the series titled ‘We the People’ to celebrate 75 years of our Constitution. As part of this series, DAKSH, in collaboration with BIC, is organising a series of lectures and panel discussions on various aspects of the Constitution.\nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/media-freedom-past-present-and-future/",
    "keywords": [
      "Law",
      "Media",
      "Policy & Regulation"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-34.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "66636-1732734000-1732738500@bangaloreinternationalcentre.org",
    "name": "One-Man Band",
    "startDate": "2024-11-27T19:00:00+05:30",
    "endDate": "2024-11-27T20:15:00+05:30",
    "description": "Step into a world of sound where one musician becomes a full band! \nShashank Verma, known as the “One-Man Band Mask Guitarist”, brings his unique instrumental style to the stage, blending Finger-style, Percussive, and Experimental techniques into a single performance. He doesn’t just play the guitar—he transforms it into a multi-instrument experience, crafting and building his own custom instruments that go far beyond the typical strings. \nIn each performance, Shashank plays an astounding 8 to 10 instruments simultaneously, making them harmonize and blend seamlessly. His setup includes not only a Double Neck Guitar but also a combination of instruments like the Kalimba, Harmonica, Congo, Drum Kit, Shaker, and Stompbox. Each of his creations is a one-of-a-kind design that allows him to explore new sonic territories and push the boundaries of what a guitar can do. \nEvery note, rhythm, and beat is an invitation to experience music in a fresh, unexpected way, where traditional sounds meet creativity. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/one-man-band/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "One-Man Band"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-33.jpg"
  }
]