[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73412-1746297000-1746302400@bangaloreinternationalcentre.org",
    "name": "Chaturanga to Chess",
    "startDate": "2025-05-03T18:30:00+05:30",
    "endDate": "2025-05-03T20:00:00+05:30",
    "description": "Chess, often called the “game of kings,” has evolved from its ancient origins into a global symbol of strategic intellect and mental endurance. Believed to have originated in India around the 6th century as chaturanga, it spread through Persia and the Islamic world into Europe, transforming into the modern game we know today by the 15th century. \nThroughout history, chess has intersected with politics and culture—perhaps most famously during the Cold War, when the 1972 World Championship between American Bobby Fischer and Soviet Boris Spassky symbolized the ideological clash between East and West. The game became a subtle arena for geopolitical rivalry, with nations investing in elite training programs to assert intellectual dominance. \nIn recent decades, the rise of artificial intelligence has profoundly impacted the game. IBM’s Deep Blue defeating Garry Kasparov in 1997 marked a turning point, and today’s engines like Stockfish and AlphaZero have pushed human understanding of the game into new dimensions. These tools serve not just as opponents but as powerful training allies for modern grandmasters. \nAt the highest levels, chess is as much a mental sport as it is a strategic one. Elite players prepare rigorously—not only through deep study and memorization of opening theory but also with physical fitness, psychological resilience, and emotional regulation. In a world of rapid time controls and endless information, the modern chess player must be both a scholar and a warrior. \nChess today is more than a game—it’s a mirror of human progress, persistence, and the enduring power of the mind. \nThe session will see a panel discussion with Devaki Prasad, M S Thej Kumar, Aaravind Shastry, Manisha Mohithe and Vijay Mruthyunjaya. A Q&A session with the audience will follow. \n\n",
    "url": "https://bangaloreinternationalcentre.org/event/chaturanga-to-chess/",
    "keywords": [
      "Sports"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-824.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "73428-1746644400-1746648000@bangaloreinternationalcentre.org",
    "name": "Manthan",
    "startDate": "2025-05-07T19:00:00+05:30",
    "endDate": "2025-05-07T20:00:00+05:30",
    "description": "Manthan is a performance that brings together, for the first time, two ancient art forms from opposite corners of India—Kaavad storytelling from Rajasthan and Mohiniyattam dance from Kerala. Rooted in the myth of Samudra Manthan, the churning of the ocean, it unfolds as a series of seven symbolic ‘manthans’ or churnings, exploring what it means to be human—psychologically, emotionally, philosophically, and socially. \nThe performance emerges from a long process of research, exploration, and experimentation. It weaves original writing, choreography, and music into a layered structure of stories within stories, drawing on Indian mythology alongside imagined and contemporary experiences. Themes of existence, duality, and the paradoxes of life surface through metaphor, movement, and voice. \nMohiniyattam, known for its fluidity and depth, brings grace and quiet power to the performance, while the rarely-seen Kaavad Katha—supported by over six years of dedicated study—offers a rich narrative tradition that is both visual and oral. The Kaavad box opens and closes like a book, revealing worlds within, as the dancer and storyteller move in and out of each other’s rhythms. \nManthan holds space for the interplay of tradition and innovation, creating a performance that is reflective, immersive, and intimate. Rather than offering answers, it invites the audience into a shared space of reflection—where stories, images, and movement gently churn beneath the surface. The performance was first curated by Mayuri Upadhya and commissioned by Serendipity Arts Festival. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/manthan/",
    "keywords": [
      "Dance",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Manthan"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-823.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "73528-1746558000-1746563400@bangaloreinternationalcentre.org",
    "name": "Ecstasy",
    "startDate": "2025-05-06T19:00:00+05:30",
    "endDate": "2025-05-06T20:30:00+05:30",
    "description": "KJ Diliip, Ila Diliip, Sunaad Anoor, and Diptangshu Bhowmik form the core of Lakkshya’s debut Album, Ecstasy. Inspired by their European tour, which took them to countries like the Netherlands, Germany, and France, the Album reflects the deep musical exploration and cultural exchange that defined their journey and the amazing artists they met there. For the Album, these artists blend traditional Carnatic sounds with innovative contemporary influences, featuring artists such as Mohini Dey on “The Way Home” “Bhavani,” Achal Murthy on “Envy,” and BC Manjunath on the title track. The six-track album produced by Pramath Kiran is a sonic odyssey, where each track immerses the listener in a world of emotion, energy, and joy. From intensely stirring moments to vibrant, uplifting rhythms, Ecstasy invites deep exploration of its rich layers. It’s a celebration of raw, powerful emotions—both profound and playful—capturing the essence of connection, freedom, and the exhilaration of pure musical expression. With Ecstasy, Lakkshya offers a truly unforgettable journey for every listener. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/ecstasy/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Ecstasy"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-825.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73582-1745798400-1745884799@bangaloreinternationalcentre.org",
    "name": "357. Wild Fictions",
    "startDate": "2025-04-28T05:30:00+05:30",
    "endDate": "2025-04-29T05:30:00+05:30",
    "description": "Join us for an engaging conversation as Amitav Ghosh discusses Wild Fictions, a collection of his writings from the past twenty-five years, with Julia Wheeler. This expansive work explores the themes that have defined Ghosh’s literary journey: literature and language, climate change and the environment, human lives, travel, and discoveries. \nThrough topics ranging from the commodification of the clove to the rich diversity of Bengal’s mangrove forests and the radical fluidity of multilingualism, Wild Fictions offers a critique of imperial violence and the fictions we weave to navigate history. It is a call to sensitivity, empathy, and the urgent need to repair our relationship with volatile landscapes. \nWith his unique combination of moral passion, intellectual curiosity, and literary elegance, Amitav Ghosh invites us to see the world anew in this thought-provoking discussion. The session will be followed by a book signing with the author. \nIn collaboration with: \n     \nIn this episode of BIC Talks, Amitav Ghosh will be in conversation with Julia Wheeler .This is an excerpt from a conversation that took place in the BIC premises in January 2025. \nSubscribe to the BIC Talks Podcast on your favorite podcast app!\nBIC Talks is available everywhere, including Apple Podcasts, Spotify, Google Podcasts, Castbox, Overcast, Audible, and Amazon Music. \n",
    "url": "https://bangaloreinternationalcentre.org/event/357-wild-fictions/",
    "keywords": [
      "Books",
      "Literature",
      "Podcast",
      "Society",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-6-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "72095-1745776800-1745784000@bangaloreinternationalcentre.org",
    "name": "Rise of Sport in India",
    "startDate": "2025-04-27T18:00:00+05:30",
    "endDate": "2025-04-27T20:00:00+05:30",
    "description": "India’s sporting landscape has dramatically transformed over the past few decades. Traditionally dominated by cricket, the country has emerged as a powerhouse in multiple disciplines, including badminton, wrestling, boxing, and athletics. \nThe rise of leagues such as the Indian Premier League (IPL), Pro Kabaddi League, and Indian Super League (ISL) has played a crucial role in popularizing various sports and providing financial support to athletes. Additionally, India’s improved performance in global events like the Olympics, Commonwealth Games, and Asian Games has boosted national pride. Charu Sharma with his decades of experience leading RCB and even conceptualizing Kabbadi League will tell this story. \nThe Devatha Radhakrishna Memorial Lecture \nDevatha Radhakrishna was not only a visionary entrepreneur but a lifelong seeker—curious, resilient, and deeply reflective. From building a thriving silk and garment empire to exploring law, organic farming, and philosophy, he approached every pursuit with passion and purpose. Even in adversity, he found meaning, drawing strength from the wisdom of D.V. Gundappa and Tolstoy. To him, business, literature, and spirituality were not separate paths but part of a single journey. This memorial lecture honours a life lived with conviction, curiosity, and an unyielding spirit. \nPresented by: Sriram Devatha. \n",
    "url": "https://bangaloreinternationalcentre.org/event/rise-of-sport-in-india/",
    "keywords": [
      "In Memory",
      "Sports"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-2-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73275-1745946000-1745948700@bangaloreinternationalcentre.org",
    "name": "Stillness in Dance",
    "startDate": "2025-04-29T17:00:00+05:30",
    "endDate": "2025-04-29T17:45:00+05:30",
    "description": "How do you capture something as fluid and ephemeral as dance — a gesture, a rhythm, a moment in motion? In this talk, photographer Shalini Jain shares her approach to photographing performance, where timing, intuition, and emotion come together to create images that resonate beyond the frame. Drawing from her work with dancers and musicians, she explores how stillness can reflect movement, and how the camera becomes a quiet partner in the act of performance. Through images and reflection, Shalini offers a glimpse into the art of seeing rhythm and holding on to what might otherwise be lost in a blink. \nThis will be followed by a Q&A session with the audience. \nThis event is part of our International Dance Day celebrations Echoes of the Moving Body. \n",
    "url": "https://bangaloreinternationalcentre.org/event/stillness-in-dance/",
    "keywords": [
      "Photography"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-819.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73240-1745953200-1745959500@bangaloreinternationalcentre.org",
    "name": "Rhythms of the Divine",
    "startDate": "2025-04-29T19:00:00+05:30",
    "endDate": "2025-04-29T20:45:00+05:30",
    "description": "As a part of World Dance Day celebrations, this session will celebrate the rich tapestry of Indian classical dance by showcasing a curated blend of solo, duet, and group performances, each representing diverse classical traditions from across the country. \nHari Ho…Gati Meri\nA Solo by Gauri Diwakar \nHari Ho…Gati Meri (let my salvation be in the supreme) is a statement of “You”. It is a search for salvation, truth and for beauty.\nBased on the poetry of Sayyad Fazlul Hasan popularly known as Maulana Hasrat Mohani, the work revolves around the eternal resonance of Krishna’s flute.\nIs the melody emerging out of Krishna’s flute a message beckoning to eternal life or the fount of ever increasing knowledge?\nI search you else where, ignorant me! Waiting, waiting and letting life go by, while you reside within the deepest core of me. Let my senses be open to you, within me.\nI hear the flute, I see the melody, I feel the love! \nCredits :\nConcept & Research : Sanjay Nandan\nChoreography :  Aditi Mangaldas\nMusic composition, vocals & harmonium: Samiullah Khan \nNatya Samanwayam\nA Duet by Sujatha Nair and Gururaju \nOur Indian classical dances bear testimony to the national ethos of Unity in Diversity. Multiple forms, Single spirit. Here is an attempt to reaffirm this unique trait of our country, through the coming together of two of our popular classical dance styles; Kuchipudi & Mohiniyattam.  Adhering to the traditions and flavors of individual styles, blending seamlessly, an amalgamation of visual beauty and serenity is created. This segment showcases invocatory piece, a Marathi Nirupan which is abhinaya oriented and a Swathitirunal Kriti, a Nritta composition, Tillana. \nAnadi Ananta: The Seamless One\nA Group Performance by Minal Prabhu & Mudrika Foundation for Indian Performing Arts \nThis piece is inspired by Advaita Vedanta, where Brahman is the ultimate, singular truth and all other manifestations are mere illusions of that truth. Jagat Chaitanya- the beam of light, the Parabrahman, symbolizes the eternal cycle of creation and destruction—without beginning or end. Shiva’s cosmic dance embodies this rhythm of life, death and rebirth. Through the rhythm created by his movement, breath, damaru and the sweat that fell off his dancing body, he created the Pancha Bhootas, the five elements – Earth, Water, Fire, Wind, and Space, which form the foundation of existence. \nThe manifestation of these elements is the manifestation of Brahman itself. With this production, we bow to Parabrahman through the ethereal embodiment of the Pancha Bhootas. \nThis event is part of our International Dance Day celebrations Echoes of the Moving Body. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/rhythms-of-the-divine/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "mr",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-818.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73288-1745946000-1745959500@bangaloreinternationalcentre.org",
    "name": "Echoes of the Moving Body",
    "startDate": "2025-04-29T17:00:00+05:30",
    "endDate": "2025-04-29T20:45:00+05:30",
    "description": "“O body swayed to music, O brightening glance,How can we know the dancer from the dance?” — W.B. Yeats \nOn World Dance Day, we invite you into this dissolving space between dancer and dance—where form meets feeling, stillness meets motion, and art becomes lived experience. \nOur celebration this year unfolds across disciplines, perspectives, and rhythms. We begin by pausing—through the lens of photographer Shalini Jain—as she captures movement in stillness and the stories told in a dancer’s fleeting gesture. From this quiet contemplation, we shift into the immediacy of the body: A Meeting, a contemporary duet by Gayatri Shetty and Ronita Mukherjee, explores presence, dialogue, and connection through movement. \nAs the evening deepens, we journey into Rhythms of the Divine a confluence of Indian classical forms—Bharatanatyam, Kuchipudi, Mohiniyattam and Kathak—brought to life by Gauri Diwakar, Sujata Nair Sanjay, Gururaju, Minal Prabhu, and the Mudrika Foundation. Here, tradition is not static but ever evolving, and every step becomes a living archive. \nAcross these experiences, we celebrate dance not only as performance, but as conversation—between bodies, between time periods, between disciplines. Join us as we honor the infinite ways dance speaks, moves, and transforms. \nSchedule: \n5pm | Seminar Hall \nStillness in Dance \nA talk on Dance Photography by Shalini Jain \n6 pm | Gallery  \nA Meeting \nA Contemporary Dance Duet by Gayatri Shetty and Ronita Mukherjee \n7 pm |Auditorium \nRhythms of the Divine \nA solo, duet and group dance performance by Gauri Diwakar, Sujata Nair Sanjay, Gururaju, Minal Prabhu and Mudrika Foundation for Indian Performing Arts \n",
    "url": "https://bangaloreinternationalcentre.org/event/echos-of-the-moving-body/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-820.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73227-1745949600-1745952300@bangaloreinternationalcentre.org",
    "name": "A Meeting",
    "startDate": "2025-04-29T18:00:00+05:30",
    "endDate": "2025-04-29T18:45:00+05:30",
    "description": "A Meeting is embedded in the tumultuous emotional and physical dynamics between its two characters, highlighting the complexities of human connection and the emotional landscape of desire and disconnection. What connections are able to form if we simply allow and make space and stop? It evokes reflection on the meaning of love, the nature of relationships and the interplay between connection and solitude. The dancers will meet themselves from different timelines of their life and what happens to the present when the past and future meet. It is a love letter to all that once was and is.\nDancers will draw from their own lives to showcase the push and pull of relationships, emphasizing moments of intense connection, followed by periods of emotional and physical dissonance, reflecting their internal and external conflicts.\nAt a point in this world when our global unity and resistance is so essential, our daily human connections seem to be falling apart. This piece is a shared yearning and longing for each other, its one for hope, loss and desire for freedom. \nChoreography & Concept – Gayatri Shetty\nMovement Collaborator- Ronita Mookerji\nMusic – Riddhiman Dutta & Michael Wall \nThis event is part of our International Dance Day celebrations Echoes of the Moving Body. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-meeting/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-817.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "73404-1745769600-1745785800@bangaloreinternationalcentre.org",
    "name": "The Journey of Jazz",
    "startDate": "2025-04-27T16:00:00+05:30",
    "endDate": "2025-04-27T20:30:00+05:30",
    "description": "To celebrate International Jazz Day, the Bangalore International Centre (BIC) presents a day of events exploring jazz’s rich history, global influence, and contemporary expressions. Through a lecture, a listening session, and a live performance, we delve into jazz’s evolution from its roots in New Orleans to its resonance in diverse cultures worldwide. \nJazz: The Style, Structure, and the World Stage by Ramjee Chandran | Lecture | 4pm – 5:15pm \nJazz is admired for its complex harmonies, distinctive phrasing, and improvisational depth. But what gives it its unique identity? And why does it continue to resonate across generations and cultures? This lecture traces the journey of jazz from its roots in New Orleans and the swing era to the innovations of bebop and beyond—cool jazz, hard bop, and free jazz. It explores how each style reflects changing ideas in music and society, and how jazz evolved from popular entertainment to a sophisticated art form. Though born in America, jazz has travelled widely—from Brazilian bossa nova to India. While Latin jazz found global popularity, the question remains: can there ever be a true Indo-jazz fusion that honours both traditions? \nFrom New Orleans to New Delhi: How Jazz Got Its Passport Stamped by Abhijit Nath | Listening Room | 5:30pm – 6:45pm \nJazz, while being a quintessentially American form, has a short enough history that other cultures found ways to assimilate their own sounds into it. Starting from the early Latin jazz sounds of the 40s, jazz found its way to South America, through tango and bossa nova, to its classical harmony roots through the work of ECM records in the 1970s, to Africa through afrobeat and World Circuit records, and of course to the modal music of Asia through greats such as John McLaughlin, Dhafer Youssef and Tigran Hamasyan. Jazz takes on the garb of the music of its day, whether it be jazz rock fusion in the 1980s, samples heard on Kendrick Lamar records, or the unique electronic-influenced sound of Alfa Mist. \nTime Travels in Jazz: From Bop to Beyond by Diptangshu Bhowmik & Kiran Ponnaluri | Performance | 7pm – 8:30pm \nStep into an evening of rhythm, harmony, and stories as two dynamic voices from Bangalore’s contemporary music scene — Diptangshu and Kiran — take you on a journey through the evolving landscape of jazz. Tracing the arc of jazz from the bebop era to modern swing and straight-ahead explorations, this performance is more than a concert — it’s a conversation. Through their set, the duo will unravel how jazz has transformed across time, place, and genre, weaving in their own personal trajectories that led from London, Calcutta, and Bangalore to this moment on stage. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-journey-of-jazz/",
    "keywords": [
      "Culture",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Journey of Jazz"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-58.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73355-1746210600-1746216000@bangaloreinternationalcentre.org",
    "name": "Living with Many Loves",
    "startDate": "2025-05-02T18:30:00+05:30",
    "endDate": "2025-05-02T20:00:00+05:30",
    "description": "All Our Loves: Journeys with Polyamory in India is an eye-opening book on polyamory—the practice of being in love, with or without sexual intimacies with more than one person simultaneously, with the consent of all. For anyone who has ever dreamed of love, sex, and companionship beyond the limits of traditional monogamy, this groundbreaking exploration navigates the infinite possibilities that polyamory can offer within the complex realities in India. \nThe discussion on the book will revolve around dispelling myths about the practice and understanding the skills necessary to live a fulfilling and responsible polyamorous life. Arundhati will also shed light on negotiating jealousy, coping with breakups and honouring boundaries. As practicing polyamorists she and the discussants will share their experiences, struggles and joys and ways to define relationships on their own terms. \nIf you are polyamorous, have a partner who is, or are just curious – this conversation will open up ways to foster honest intimacy without guilt, fear or shame; find supportive partners and community; enable practices of safe sex, and much more. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/living-with-many-loves/",
    "keywords": [
      "Books",
      "Gender",
      "Nonfiction",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-816.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73435-1746037800-1746043200@bangaloreinternationalcentre.org",
    "name": "Farooq and I",
    "startDate": "2025-04-30T18:30:00+05:30",
    "endDate": "2025-04-30T20:00:00+05:30",
    "description": "When the powers that be in Delhi think of Farooq Abdullah, they think of former R&AW chief A.S. Dulat, too. The Abdullah–Dulat connection – unlikely, even dangerous – has shaped Kashmir’s history in ways that few understand. One was India’s top intelligence officer, the other its most defiant Kashmiri leader. They should have been enemies. Instead, they built a quiet, complicated alliance that has outlasted governments, betrayals and shadow wars. \nFrom the explosion of militancy in the 1990s to the hijacking of Air India’s IC-814 in 1999 and the abrogation of Article 370 in 2019, their story is inseparable from Kashmir’s most turbulent moments. In this book, for the first time, Dulat turns to the man behind the legend. What is Farooq like when the cameras are off? How did 370 alter his place in Kashmir’s future? What divides him from his son and heir, Omar? And as Kashmir remains contentious, what cards does he still have to play? \nThe Chief Minister and the Spy is a collection of secrets, encounters and untold stories – some whispered, some explosive. With wit, candour and an insider’s eye, Dulat reveals ‘Doctor Sahib’ (as Farooq is popularly known) as only he can. Compelling and deeply human, this book offers a rare glimpse into an unlikely relationship forged in the heat of one of India’s most complex conflicts. \nThe author will be in conversation with Karthik Venkatesh. A Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/farooq-and-i/",
    "keywords": [
      "Biography",
      "Books",
      "History",
      "Nonfiction",
      "Policy & Regulation",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-59.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "73376-1746892800-1746900000@bangaloreinternationalcentre.org",
    "name": "Paper. Play. Intuition.",
    "startDate": "2025-05-10T16:00:00+05:30",
    "endDate": "2025-05-10T18:00:00+05:30",
    "description": "Can paper play lead to intuition or vice versa? Images, textures are a pathway to explore deeper inner truths – experiences, memory and association between ideas. When one is exposed to random imagery- it triggers and leads one on a personal journey like never before. Through the tactile paper and the medium of collage, we will witness beautiful inner worlds expressed through images led by intuition.\n.\nA hands-on two hour workshop to mindfully tap into the world of paper and images, the chance and play of visuals, tread exciting journeys of compositions and celebrate creative expressions in full glory. Best suited for working professionals, students, individuals passionate about arts and design or life-learners – you will find yourself working your way through visuals and letting your thoughts come to life. \nWhat to expect:\n– A guided session on how to link your very own experiences to found images\n– Create collage based personalised artwork\n– Exploring various themes and ideas through visuals \nAll materials will be provided including books, magazines, papers, scissors and glue. \nNo prior art experience needed – just bring your presence and curiosity and get onto the journey of exploration and creativity. \nIn collaboration with: \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/paper-play-intuition/",
    "keywords": [
      "Design",
      "Visual Arts",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-1-4.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "73434-1746374400-1746381600@bangaloreinternationalcentre.org",
    "name": "Void and Verse",
    "startDate": "2025-05-04T16:00:00+05:30",
    "endDate": "2025-05-04T18:00:00+05:30",
    "description": "Join us at the BIC Library for a Blackout Poetry event where you’ll get to transform pages from your favourite books into original poems. \nBlackout poetry is a unique form of artistic expression that involves taking an existing text, often a page from a book, newspaper, or magazine, and selectively blacking out or “blacking over” certain words and phrases to create a new, cohesive, and visually striking piece of poetry. \nCome with a few pages of text from a book you like (or peruse our selection), grab your marker and get started! Participants are given a dedicated period to create their blackout poetry. During this, they flip through the pages of their choice, looking for words or phrases that resonate with them, and use markers to black out the remaining text. \nThe goal is to craft meaningful and visually engaging poems that personally resonates with you followed by a small sharing circle where you’ll get to read out your work! \n",
    "url": "https://bangaloreinternationalcentre.org/event/void-and-verse/",
    "keywords": [
      "Literature",
      "Poetry",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-61.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "73369-1746124200-1746129600@bangaloreinternationalcentre.org",
    "name": "Labouring Through Change",
    "startDate": "2025-05-01T18:30:00+05:30",
    "endDate": "2025-05-01T20:00:00+05:30",
    "description": "India’s labour laws have undergone a significant transformation — from colonial-era regulations to contemporary codes aimed at balancing worker rights with economic growth. This session traces the journey of labour legislation in India, examining the historical context, major reforms, and the recent shift to four consolidated labour codes. What have these changes meant for workers, employers, and the labour movement? And as the world of work evolves with technology and platform economies, what lies ahead for labour rights in India? \nJoin us for a timely conversation on the past, present, and future of labour protections in the country. \n",
    "url": "https://bangaloreinternationalcentre.org/event/labouring-through-change/",
    "keywords": [
      "History",
      "Law",
      "Policy & Regulation"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-822.jpg"
  }
]