[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81390-1763314200-1763319600@bangaloreinternationalcentre.org",
    "name": "Judge and Be Judged: Musings on the Top Court",
    "startDate": "2025-11-16T17:30:00+05:30",
    "endDate": "2025-11-16T19:00:00+05:30",
    "description": "As the Supreme Court of India completes seventy-five years, how do we understand its role in shaping the country’s institutions and democratic ideals? Has it remained a counter-majoritarian voice, and how has it navigated questions of accountability, transparency and constitutional promise? \nJoin us for a conversation that brings together former judges, lawyers and scholars to reflect on the Court’s evolving legacy, drawing from the book [In]complete Justice: The Supreme Court at 75. The discussion features Justice S. Muralidhar, Justice N. Santosh Hegde, Dr. Aditya Sondhi and Radhika Chitkara, as they explore the intersections of law, legitimacy and justice in contemporary India.\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/judge-and-be-judged/",
    "keywords": [
      "Law"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_JaBJ.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81344-1762887600-1762893000@bangaloreinternationalcentre.org",
    "name": "Damaru - Duality",
    "startDate": "2025-11-11T19:00:00+05:30",
    "endDate": "2025-11-11T20:30:00+05:30",
    "description": "The Damaru, as an instrument, manifests the flow of energy between Purusha and Prakriti through its very shape. In it is contained the origin of sound; sound that is the genesis of creation and movement. Conceptualized and choreographed by Vidhya Subramanian, the work brings together an ensemble of eight dancers – Vidhya Subramanian, Anu Bhaskararaman, Anisha Parameswaran, Archa Shajukumar, Manasa Vijaychander, Pranathi Ramadorai, Sandhya Venkiteshwaram and Subashree S. DAMARU highlights the dualities present within us as well as in the universe—sound and silence, stillness and movement, creation and dissolution, male and female, self and other, union and separation – in each of us exists the duality that the universe holds.  \nChoreographed and directed by Vidhya Subramanian, Damaru is Sparsha Dance Ensemble’s first ensemble work and has received excellent audience feedback. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/damaru-duality/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-44-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81800-1763292600-1763298000@bangaloreinternationalcentre.org",
    "name": "Material, Memory, and the Sacred",
    "startDate": "2025-11-16T11:30:00+05:30",
    "endDate": "2025-11-16T13:00:00+05:30",
    "description": "Born in Mali and raised in France, Aboubakar Fofana is a multidisciplinary artist and designer whose practice spans calligraphy, textiles, and natural dyes. Renowned for reinvigorating and redefining traditional West African indigo dyeing techniques, Fofana’s work is rooted in a deep spiritual belief that nature is divine — that by honoring this divinity, we begin to comprehend the vast and sacred interconnectedness of the universe. \nIn this conversation, Fofana will reflect on indigo and others as material and metaphor — a living medium through which memory, ecology, and spirituality converge. His process engages with the natural cycles of growth and decay, birth and transformation, positioning indigo not simply as pigment but as an agent of renewal. For Fofana, the act of making becomes a form of meditation, where touch, rhythm, and the alchemy of fermentation reveal a profound dialogue between human intention and the natural world. \nThe talk will also offer insight into his current work in Siby, Mali, where he is creating a community-based farm that places indigenous West African indigo at the heart of a holistic permaculture system of local food, medicine, and dye plants. This ambitious project embodies his commitment to cultural preservation, environmental stewardship, and the rebirth of fermented indigo dyeing in contemporary practice. \nMaterial, Memory, and the Sacred invites audiences to experience indigo as a spiritual practice, a bridge between craft and cosmology, where colour, earth, and devotion become inseparable. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/material-memory-and-the-sacred/",
    "keywords": [
      "Heritage",
      "Sustainability",
      "Textiles",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_MMS.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81291-1762801200-1762806600@bangaloreinternationalcentre.org",
    "name": "Tat Tvam Asi - Finding Thyself",
    "startDate": "2025-11-10T19:00:00+05:30",
    "endDate": "2025-11-10T20:30:00+05:30",
    "description": "Tat-Tvam Asi is a meditative dance production that explores the essence of surrender as a path to self-realisation, through the lives of Andal, Radha, and Chaitanya Mahaprabhu—each a yogi in their own right. Drawing from the Bhagavad Gita, where Krishna says, “As all surrender unto Me, I reward them accordingly, ” this work reflects the multiple ways one can find the divine: through devotion, knowledge, or selfless action. The production unfolds as a series of  vignettes—Andal’s karmic service, Radha’s longing rooted in bhakti, and Chaitanya Mahaprabhu’s ecstatic sankeertana—interwoven with Krishna ’s own voice as the sutradhar (narrator). From the chariot of Jagannatha in Puri to the quiet sanctum of a temple, the narrative reveals the beauty of total surrender, dissolving the ego in divine love. Blending classical dance traditions such as Bharatnatyam and Gaudiya Nritya with original music and poetic texts, Tat-Tvam Asi is a journey into Krishna Tattvam—the omnipresence of the divine within and around us. \nThe depth of this timeless message and wisdom (familiar to many Vedantic scholars and Indians) was explored by Neha through the many coloured hues of devotion (bhakti) found in ancient lores and cultures. Neha chose the beloved pastoral God Krishna as the focus of bhakti of the devotee. Neha’s approach to Tat Tvam Asi is episodic. Fragments from Andal, Radha and Chaitanya Mahaprabhu were revisited and evoked with compelling conviction through her intense abhinaya. Neha Mondal has conceptualized Tat-Tvam Asi after years of deep reflection on the nature of devotion and surrender. Her creative process involved studying scriptures, poetry, and the lives of Andal, Radha, and Chaitanya Mahaprabhu to understand their spiritual journeys. She collaborated closely with scholars, musicians, and writers to shape a narrative that is both intimate and universal. As a dancer rooted in tradition yet open to exploration, Neha wove together movement, music, and storytelling to evoke the transformative power of bhakti. This production is a culmination of her artistic introspection and spiritual inquiry, brought to life through dance. \nCredits \nConcept & Choreography: Neha Mondal \nScript: Smt. Priya Krishnadas\nLyrics: Dr. C.K. Jayanthi\nMusic: Shri Balakrishnan Karippalil\nCompilation & Recording: Biju James\nCostumes: Sandhya Raman\nVocals : Binu V Nair / Vasudha Gopal\nScript & Research : Smt. Priya Krishnadas\nSankirtana composition : Mrs. Mahua Mukherjee\nNattuvangam : Shri Balakrishnan Karippalil\nViolin – Easwar Ramakrishnan\nPercussions : Vedakrishnan / Sruthi Raj\nFlute : Sruthi Sagar\nVeenai : Anjani \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/tat-tvam-asi-finding-thyself/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_TTA.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "81613-1763058600-1763064000@bangaloreinternationalcentre.org",
    "name": "Shobane Pāḍa",
    "startDate": "2025-11-13T18:30:00+05:30",
    "endDate": "2025-11-13T20:00:00+05:30",
    "description": "Step into the lyrical world of Shobane Pāḍa, the tender, devotional songs that accompany the milestones of a woman’s life in Karnataka’s folk tradition. Sung during auspicious occasions such as marriage, childbirth, and festivals, these songs celebrate womanhood in all its beauty and grace, blending melody, poetry, and emotion into a timeless cultural expression. \nIn this edition of BIC Janapada, audiences will experience Shobane Pāḍa through two distinct regional lenses, from the soulful verses of Pattalamma Janapada Kala Sangha, led by Krishne Gowda from Mandya in Southern Karnataka, to the earthy, resonant tunes of GK Kala Vedika from North Karnataka. Together, they offer a rare glimpse into how different communities express shared emotions through diverse musical idioms and dialects. \nThrough live renditions and storytelling, the session explores the social and cultural significance of Shobane, how these songs serve as a collective blessing, a space for women to voice joy, longing, and devotion. The audience will be invited to experience the changing rhythms and tones that mark life’s transitions, from the playful to the profound. \nMore than just performance, this is a celebration of continuity ,of how music has always been a vessel for community, emotion, and identity in Karnataka’s living traditions. \nThis is the fifth performance of our series BIC Jaanapada. \nBIC Jaanapada is a bi-monthly (once in two months) series celebrating Karnataka’s folk traditions through the lens of regional identity and cultural preservation. Curated in collaboration with Tvarita Arts Collective India, the program combines scholarly discourse with live performances to explore the deep connections between geography and artistic expression. Through demonstrations, performances, and academic discussions, each session examines how landscape and local culture have shaped these distinct artistic practices. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/shobane-pa%e1%b8%8da/",
    "keywords": [
      "Culture",
      "Dance",
      "Music",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Shobane Pāḍa"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_SP.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81621-1763058600-1763064000@bangaloreinternationalcentre.org",
    "name": "Building India’s Swimming Dreams",
    "startDate": "2025-11-13T18:30:00+05:30",
    "endDate": "2025-11-13T20:00:00+05:30",
    "description": "India’s hosting of the 2030 Commonwealth Games, and desire to host the 2036 Olympic Games, coincides with Australia’s own ‘Green and Gold Decade’ including hosting the 2032 Olympic Games in Brisbane. And no sport is as golden for Australia as swimming. \nJoin leading Australian and Indian sporting figures to discuss: Where is India currently at in its swimming journey? How can Australia assist to build a stronger swimming culture in India, from the grassroots to the elite? And more broadly, how can Australia and India collaborate to foster elite sports talent? \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/building-indias-swimming-dreams/",
    "keywords": [
      "International Relations",
      "Sports"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-46-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81415-1762540200-1762545600@bangaloreinternationalcentre.org",
    "name": "Bureaucratic Better Halves",
    "startDate": "2025-11-07T18:30:00+05:30",
    "endDate": "2025-11-07T20:00:00+05:30",
    "description": "The Other Side of Diplomacy offers a rare glimpse into the untold stories of those who stand beside diplomacy: the spouses of foreign diplomats from India. Through essays that are poignant, humorous, and disarmingly personal, the anthology captures the emotional landscape of belonging everywhere and nowhere at once. \nIn this conversation, panellists reflect on cultural crossings, reinvention, and the art of finding home amid constant change: a journey as relatable as it is extraordinary. \n",
    "url": "https://bangaloreinternationalcentre.org/event/bureaucratic-better-halves/",
    "keywords": [
      "Books",
      "Defence & security",
      "International Relations",
      "Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-45-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "80961-1762686000-1762689600@bangaloreinternationalcentre.org",
    "name": "Tales From Far and Wide",
    "startDate": "2025-11-09T11:00:00+05:30",
    "endDate": "2025-11-09T12:00:00+05:30",
    "description": "Are you ready to open a treasure chest of tales?\n\nGeeta Ramanujam brings a trove of magical tales to life with her signature warmth and energy. From faraway lands to familiar places, her stories connect generations and fill hearts with laughter and wonder. Each story comes with a little secret: how she first heard it!  \nA joyful hour where words come alive and imaginations soar! \nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \nIn collaboration with:\n \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/tales-from-far-and-wide/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Children's Books",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-43-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81436-1762542000-1762545600@bangaloreinternationalcentre.org",
    "name": "Homecoming",
    "startDate": "2025-11-07T19:00:00+05:30",
    "endDate": "2025-11-07T20:00:00+05:30",
    "description": "Conversations around mental health often remain confined to whispers, held back by silence, stigma, and fear. Yet when lived experiences are shared, they open windows into understanding, empathy, and change. This session reflects on how personal storytelling can transform pain into purpose, inviting us to see resilience and healing in new, deeply human ways. \n\n\n\n\n\n\n\n\n\n\n\nFeaturing Neha Kirpal and Dr. Nandini Murali, co-authors of Homecoming: Mental Health Journeys of Resilience, Healing and Wholeness, Westland Books and the India Mental Health Alliance bring to you a discussion featuring seven participants, the two co-authors and five contributors, bringing together voices of women from across urban India navigating a wide spectrum of mental health conditions. Through their journeys, marked by courage, vulnerability, and renewal, they challenge the idea of brokenness and reimagine what it means to be whole.\n\n\n\n\n\nThe session will be followed by a Q&A session with the audience. \n\n\n\n\n\n\n\nPresented by: \n          \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/homecoming-2/",
    "keywords": [
      "Books",
      "Health & Wellness",
      "Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_HC-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81761-1762972200-1762977600@bangaloreinternationalcentre.org",
    "name": "Initiated Into the Wild",
    "startDate": "2025-11-12T18:30:00+05:30",
    "endDate": "2025-11-12T20:00:00+05:30",
    "description": "What happens when a child grows up beside a forest and lets the wild become his teacher? \nIn Initiated into the Wild, Ishan Shanavas, a 22-year-old bestselling author and environmental educator, traces his journey from rescuing snakes and frogs as a schoolboy in Rishi Valley to travelling across India in search of its vanishing creatures. Through stories of tigers, snakes, and mountains—from the rainforests of the Western Ghats to the high Himalayas—he reflects on what it means to grow up in a time of ecological loss, and how curiosity can become a bridge to empathy and conservation. \nThe evening will open with an introduction by Tara Kini, followed by a talk by Ishan Shanavas, who will share personal reflections from his book The Light of Wilder Things. A short film on Ishan’s journey of educating children about wildlife will then offer a glimpse into his world, setting the stage for a conversation between Ishan Shanavas and Darius Sunawala on wildlife, storytelling, and conservation. \nThe session will conclude with an open Q&A with the audience \n",
    "url": "https://bangaloreinternationalcentre.org/event/initiated-into-the-wild/",
    "keywords": [
      "Books",
      "Wildlife"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_IntW.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "81447-1763290800-1763296200@bangaloreinternationalcentre.org",
    "name": "Dancing on Walls",
    "startDate": "2025-11-16T11:00:00+05:30",
    "endDate": "2025-11-16T12:30:00+05:30",
    "description": "Works of art are good things to think about. They awaken our senses, invite interpretation, and spark curiosity. Join us in the library to discover how art can nurture observation, critical thinking, and inquiry. \nIn this session, we’ll dive into the world of Warli painting, an ancient tribal art tradition of Maharashtra. Its distinctive pictogram style is rich in detail yet easy to decode and connect with. \nChildren will look closely at a Warli painting, form thoughtful interpretations, and wonder about the stories it holds. They’ll also have an opportunity to tell their own stories using Warli motifs. \nCome, see, think, and wonder with us! \nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dancing-on-walls/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Workshops",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-47-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "81742-1763222400-1763231400@bangaloreinternationalcentre.org",
    "name": "Taboos at the Table",
    "startDate": "2025-11-15T16:00:00+05:30",
    "endDate": "2025-11-15T18:30:00+05:30",
    "description": "Who gets to eat what, how, and with whom? \nIn South Asia, purity and pollution have structured food taboos across caste and religion, while colonial impositions of Victorian table manners reshaped ideas of civility and hygiene. \nThis session explores caste-based dining exclusions, Ambedkar’s critique in Beef, Brahmins, and Broken Men, Islamic logics of fasting and pork prohibition, and the gendered burdens of cooking. We also connect to global veganism, examining its promises and blind spots in a South Asian context. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/taboos-at-the-table/",
    "keywords": [
      "Food",
      "Politics",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-48-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "81598-1763492400-1763497800@bangaloreinternationalcentre.org",
    "name": "Asymptomatic",
    "startDate": "2025-11-18T19:00:00+05:30",
    "endDate": "2025-11-18T20:30:00+05:30",
    "description": "\nHave you asked yourself “why me?” \nHave you found yourself sitting in a corner, looking at the stakes piled up against you, and felt them to be unnavigable, and more than that, just plain unfair? \nA solo performance, Asymptomatic, is a sharp and humorous take on the power systems that largely govern who will succeed and who will not. \nThe piece tells the story of an artist hungry for success and rebuffed at every turn. What happens to a person who needs to constantly prove themselves, prove their worth? \nSupported by: \n \n\n",
    "url": "https://bangaloreinternationalcentre.org/event/asymptomatic/",
    "keywords": [
      "Dance",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Asymptomatic"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_AS-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "81426-1762974000-1762980300@bangaloreinternationalcentre.org",
    "name": "Defending the Caveman",
    "startDate": "2025-11-12T19:00:00+05:30",
    "endDate": "2025-11-12T20:45:00+05:30",
    "description": "Language: English \nDefending the Caveman is a hilariously insightful one‑man comedy play centered around the ways men and women relate. After a swift exit from a house party our actor sees a vision and gets visited by the mysterious Caveman. \nIt has played in over 50 countries and won hearts worldwide for its playful, energetic storytelling. It has been praised for being both comedic, and tender; energetically playful, and informative. \nCredits:\nDirector : Heeba Shah\nExecutive Producer: Oskar Eiriksson\nGeneral Manager: Torfi Geir Simonarson\nProducer (India): Jiten Bhagat\nAssistant Producer, Assistant Director : Rohaan Unvala\nLight Designer: Yael Chrisna\nSound Designer: Varun Gupta\nArt Director/ Set Designer: Vivek Jadhav\nStage Manager : Sambhav Singh\nLight Operator and Projectionist: Romil Krishnani\nSound Operator: Sambhav Singh \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/defending-the-caveman/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Defending the Caveman"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_dtc.jpg"
  }
]