[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "66747-1733855400-1733860800@bangaloreinternationalcentre.org",
    "name": "Caste, Outcaste and Anticaste",
    "startDate": "2024-12-10T18:30:00+05:30",
    "endDate": "2024-12-10T20:00:00+05:30",
    "description": "\nThis talk will reflect on broad trends in the study of caste including debates and discussions drawing on poststructuralist, Marxist, and anthropological approaches which have tended to approach caste as a distinctive form of hierarchy and social distinction. This framing will help to illuminate the challenge of new approaches and intellectual formations, which center critical caste and Dalit studies, scholarship on anticaste thought, and studies of global caste. \nHow does a politics of the present inflect social transformations of caste, as well as the resistance to its inequities? What are the potentials and the perils to studying caste through global fields of power and comparison? How might we bridge institutional logics and disciplinary constraints in effecting novel forms of critique? \nA Q&A session will follow the talk. \n\n",
    "url": "https://bangaloreinternationalcentre.org/event/caste-outcaste-and-anticaste/",
    "keywords": [
      "History",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-39.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "67300-1733943600-1733947200@bangaloreinternationalcentre.org",
    "name": "Dante Beyond Borders",
    "startDate": "2024-12-11T19:00:00+05:30",
    "endDate": "2024-12-11T20:00:00+05:30",
    "description": "Dante Beyond Borders is an Italian Indian co-production born from the collaboration between Instabili Vaganti and Ahum Trust and inspired by the Divine Comedy of the great Italian Poet Dante Alighieri, on the occasion of his 700 years death’s anniversary. \nThe performance explores different artistic languages: experimental theatre, dance, cinema, video art and electronic music in order to bring the spectator into the otherworldly journey made by Dante. The sounds of Dante’s ancient Italian language meet the mudras and gestures of  the traditional Bharatanatyam dance, accompanied by the contemporary electronic soundscapes originally composed by the Oscar winning Italian musician Riccardo Nanni, around the leading suggestion of the Absence, an element that permeates Dante’s works. \nThe evocative physical actions of the performer Nicola Pianzola and the dance of Anuradha Venkataraman interact with the videos realised by the artists of the project through a remote collaboration developed during the lockdown. \nThe performance aims to explore the  numerous connections between Dante’s work and Indian culture, both from an iconographic, philosophical and theological point of view. \nDirection: Anna Dora Dorno\nDramaturgy: Anna Dora Dorno, Nicola Pianzola\nPerformers: Nicola Pianzola, Anuradha Venkataraman\nChoreography: Anuradha Venkataraman, Nicola Pianzola\nPerformance in video, original songs and voice over: Anna Dora Dorno, Nicola Pianzola, Anuradha Venkataraman\nOriginal music and sound design: Riccardo Nanni\nVideo creation: Anna Dora Dorno, Nicola Pianzola, Ashwin Iyer\nSet and Light design: Anna Dora Dorno\nProduction: Istituto Italiano di cultura in Mumbai, Instabili Vaganti, Ahum Trust\nSupporters: MIC Ministry of culture / Istituto Italiano di cultura in New Delhi \nIn collaboration with: \n      \n",
    "url": "https://bangaloreinternationalcentre.org/event/dante-beyond-borders/",
    "keywords": [
      "Dance",
      "Literature",
      "Performing Arts",
      "Pravaha",
      "Theatre",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Dante Beyond Borders"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-666.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "67441-1733769000-1733776200@bangaloreinternationalcentre.org",
    "name": "Inclusive Art",
    "startDate": "2024-12-09T18:30:00+05:30",
    "endDate": "2024-12-09T20:30:00+05:30",
    "description": "In this interactive and participatory talk by Alice Fox and Dr Hannah Macpherson, participants will be introduced to the underpinning ideals and philosophies of Inclusive Art, including the relational components to inclusive work, the philosophy of coming into being and the crucial emphasis on collaboration and creative listening. \nThe session will then address critics of such participatory practice and show how in art there is more than hope (or sweet dreams!), there are proven benefits (for culture, health and life). \nThe speakers suggest avoiding leaning into overly narrow identity-based work and instead embracing our commonalities—including all our diversity—through Inclusive Arts. This requires nuance. Reflecting on some of the journeys they have taken with the practice of Inclusive Arts in Asia, they will show how collaborative practices, first developed alongside neurodiverse people and people with learning disabilities, have become relevant to collaborating with a wide range of people. \nThe talk will then seek to answer the following provocations using some practical participatory activities: \n\nHow do we travel at the speed of trust using forms of Inclusive Arts practice?\nWhat’s next for Inclusive Art? How might we ‘come into being’ inclusively with each other, our art materials and the environment?\n\nThis talk will include experiential group activities suitable to all. Come prepared to participate. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/inclusive-art/",
    "keywords": [
      "Society",
      "Visual Arts",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-36.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "68031-1734633000-1734638400@bangaloreinternationalcentre.org",
    "name": "Portraits Of A Changing City",
    "startDate": "2024-12-19T18:30:00+05:30",
    "endDate": "2024-12-19T20:00:00+05:30",
    "description": "This session looks at an intimate reading of BANGALOREAN by five of its six creators. This compelling book captures the essence of Bangalore through the voices of its diverse people, offering a vivid tapestry of stories that reflect the city’s evolution. From a serene Pensioner’s Paradise to a thriving Silicon Valley of India, BANGALOREAN paints a portrait of a metropolis where tradition meets technology. Through intimate narratives and stunning visuals, the book celebrates the resilience, variety, and vibrancy of a city defined by its people \nThe speakers will take turns to introduce their role and their experience of this creative journey and would share some behind-the-scenes pictures. A Q&A session will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/portraits-of-a-changing-city/",
    "keywords": [
      "Bangalore",
      "Books",
      "Cities",
      "Photography",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-682.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "66666-1733425200-1733430600@bangaloreinternationalcentre.org",
    "name": "The Descriptive Piano",
    "startDate": "2024-12-05T19:00:00+05:30",
    "endDate": "2024-12-05T20:30:00+05:30",
    "description": "This is a BIC Elsewhere event at Sabha: An Arts and Crafts Shaale \nSince its origins in the 18th century, the piano has been used by composers to describe places, events, and even to conjure up the sounds of other instruments, from solo violins to full symphony orchestras. In this introduced ‘conversational’ concert, Karl Lutchmayer will guide his audience through more than a century of piano music, exploring the endless versatility of the instrument in bringing real and imagined worlds to life. Along the way, he will play works by some of the most important piano composers, including Beethoven, Liszt and Debussy. \n  \n \n  \nTea will be served at 6:30 pm. \nThis is a BIC Elsewhere Event \nWhile the majority of our events find a home at our premises in Domlur, BIC Elsewhere represents our commitment to bringing conversations, arts, and culture directly to diverse audiences. Through this initiative, we collaborate with various venues, extending the reach of our events beyond our own space. These partnerships not only breathe life into our gatherings but also play a crucial role in cultivating an environment for the flourishing of arts and culture in the city. \nIn collaboration with: \n \nSupported by:\n          \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-descriptive-piano/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Sabha: An Arts and Crafts Shaale, No.44/A, Kamaraj Rd, Bharati Nagar, Shivaji Nagar, Bengaluru, Karnataka, 560042, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Descriptive Piano"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-661.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67864-1735153200-1735158600@bangaloreinternationalcentre.org",
    "name": "Natranjali",
    "startDate": "2024-12-25T19:00:00+05:30",
    "endDate": "2024-12-25T20:30:00+05:30",
    "description": "Upahaar Dance Company, UK presents an evening of Bharatanatyam as an offering to Lord Nataraja, the dancing Lord. The margam is structured in a traditional format commencing with a pushpanjali offering prayers to the dancing Lord, followed by an Alarippu, Shadbam, Nrithyopaharam, Padam, Keerthanam and finally concluding with a Nrittangaharam. The artists are Shalini Shivashankar, Diya Ponsudhahar and Amiya Kumar.\n\nSupported by:\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/natranjali/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-680.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67971-1734260400-1734265800@bangaloreinternationalcentre.org",
    "name": "Putting the Story Back into History",
    "startDate": "2024-12-15T11:00:00+05:30",
    "endDate": "2024-12-15T12:30:00+05:30",
    "description": "A little over five hundred years ago, in a green valley surrounded by tall mountains, a Timurid prince named Babur was born. Babur’s tumultuous life led him to India, where he laid the foundations of what would become one of the wealthiest empires in the world. \nBabur’s descendants would reshape the cuisine, music, art and landscape of their new home, creating a vibrant, syncretic culture of intellectual curiosity and an openness to new influences. Yet, from its zenith in the seventeenth century, the empire would decline swiftly, and end in tragedy three hundred years after it began. \nWho were the men and women who peopled this empire? How did their choices influence the course of history? From Humayun, the emperor who looked to the stars for guidance, to Jahangir, the ever-curious traveller, to the tragic figure of Shah Alam II, this session will focus on the triumphs and tragedies of the Timurids, and why their stories still matter. \nA talk by the author will be followed by a discussion with Meera Iyer, INTACH and a Q&A session with the audience. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/putting-the-story-back-into-history/",
    "keywords": [
      "Culture",
      "Heritage",
      "History"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/POSTER_Thumbnail-copy-3-6.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67129-1734546600-1734552000@bangaloreinternationalcentre.org",
    "name": "Nilgiris- A Shared Wilderness",
    "startDate": "2024-12-18T18:30:00+05:30",
    "endDate": "2024-12-18T20:00:00+05:30",
    "description": "India | 2024 | English | 75 minutes \nLink here \nThis is the story of India’s first UNESCO Biosphere Reserve – the Nilgiris – one of Asia’s most intensively studied areas. A land of sacred peaks and secret creatures, lost in the mists of time, somewhere between folklore and magic. A land that has challenged conventional notions of wilderness and showcased nature’s remarkable ability to adapt and thrive in a new wilderness. This is the first feature-length documentary about this region that takes us on a journey of discovery and uncovers the many secrets that make this region so special. \nThis film was created as an educational project to foster awareness about the Nilgiris Biosphere Reserve and its enduring relationship with both people and nature.  \nSpeaking about the film, Rohini Nilekani, Chairperson of Rohini Nilekani Philanthropies and the Executive Producer of the film said, “With this film – Nilgiris—A Shared Wilderness, we hope to awaken people to the incredible beauty and biodiversity of this ancient and unique biosphere – the largest protected forest area in the country, now undergoing rapid change driven by human activity. If we wish to continue to conserve it, samaaj, sarkaar and bazaar will have to work in unison to nurture this ecosystem. The documentary is a call to action for everyone who feels connected to these sacred landscapes.” \nThe session will open with an introduction to the film by Rohini Nilekani followed by the screening of the film. \nPresented by\n ROHINI NILEKANI PHILANTHROPIES and FELIS FILMS \nA film by\nSandesh Kadur \nCinematography\nNakul Raj\nRobin Conz\nSameer Jain\nNikhil Virdi\nSandesh Kadur \nEdited by\nVarun Manavazhi\nPranav Narang\nRobin Conz \nNarrated by\nSusheela Raman \nMusic by\nSusheela Raman\nSam Mills\nNeel Adhikari \nAssociate Producers\nAdarsh N C\nRohan Mathias \nExecutive Producer\nRohini Nilekani \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/nilgiris-a-shared-wilderness/",
    "keywords": [
      "Film",
      "Wildlife"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-679.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "67098-1734894000-1734899400@bangaloreinternationalcentre.org",
    "name": "Our Eternal Musical Tale",
    "startDate": "2024-12-22T19:00:00+05:30",
    "endDate": "2024-12-22T20:30:00+05:30",
    "description": "\nAny musical piece has the power to teleport us to a certain moment or phase from our lifetimes. From being ecstatic to being in despair, from being confused to being determined, these musical pieces have the ability to take us through all those moments and phases from our lives instantly. \nThrough this concert, each person in the audience revisits the countless emotions they once experienced in their lifetimes through the life story of the fictional character named ‘Rachanachar’. The epic journey that this hero went through in his lifetime, and all the challenges he faced and conquered, will be revisited through all original instrumental compositions. \nEach instrumental composition takes us through a certain point in the hero’s life journey and his mindset during that phase. The inter-reflective storyline lets us step inside the shoes of Rachanachar, making us the hero of this eternal musical tale. \nSupported by: \n\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/our-eternal-musical-tale/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Our Eternal Musical Tale"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-668.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "67672-1734289200-1734296400@bangaloreinternationalcentre.org",
    "name": "Eventide",
    "startDate": "2024-12-15T19:00:00+05:30",
    "endDate": "2024-12-15T21:00:00+05:30",
    "description": "Padmabhushan Pandit Budhaditya Mukherjee presents an exquisite Hindustani instrumental concert on the Sitar as the finale event for the 9 day Pravāha festival, a part of the BLR Hubba. \nAs the evening gives way to night the musicians present a set of early evening to night ragas in an experience of Hindustani instrumental music at its very best. Time stands still as  lyrical expression and melodic beauty performed by one of the foremost Sitar artists of our times transports us to another realm. \nTabla artiste Soumen Nandy who has joined the Sitar Maestro on stage for the last 15 years on tabla is the perfect co artist in a chamber performance marked by subtle emotional and artistic interplay. \nJoin us for this extraordinary finale, a fitting celebration of the spirit of Pravāha. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/eventide/",
    "keywords": [
      "Music",
      "Performing Arts",
      "Pravaha"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Eventide"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTERS-4.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67579-1735065000-1735070400@bangaloreinternationalcentre.org",
    "name": "Nilgiris- A Shared Wilderness",
    "startDate": "2024-12-24T18:30:00+05:30",
    "endDate": "2024-12-24T20:00:00+05:30",
    "description": "India | 2024 | English | 75 minutes \nLink here \nThis is the story of India’s first UNESCO Biosphere Reserve – the Nilgiris – one of Asia’s most intensively studied areas. A land of sacred peaks and secret creatures, lost in the mists of time, somewhere between folklore and magic. A land that has challenged conventional notions of wilderness and showcased nature’s remarkable ability to adapt and thrive in a new wilderness. This is the first feature-length documentary about this region that takes us on a journey of discovery and uncovers the many secrets that make this region so special. \nThis film was created as an educational project to foster awareness about the Nilgiris Biosphere Reserve and its enduring relationship with both people and nature.  \nSpeaking about the film, Rohini Nilekani, Chairperson of Rohini Nilekani Philanthropies and the Executive Producer of the film said, “With this film – Nilgiris—A Shared Wilderness, we hope to awaken people to the incredible beauty and biodiversity of this ancient and unique biosphere – the largest protected forest area in the country, now undergoing rapid change driven by human activity. If we wish to continue to conserve it, samaaj, sarkaar and bazaar will have to work in unison to nurture this ecosystem. The documentary is a call to action for everyone who feels connected to these sacred landscapes.” \nPresented by\n ROHINI NILEKANI PHILANTHROPIES and FELIS FILMS \nA film by\nSandesh Kadur \nCinematography\nNakul Raj\nRobin Conz\nSameer Jain\nNikhil Virdi\nSandesh Kadur \nEdited by\nVarun Manavazhi\nPranav Narang\nRobin Conz \nNarrated by\nSusheela Raman \nMusic by\nSusheela Raman\nSam Mills\nNeel Adhikari \nAssociate Producers\nAdarsh N C\nRohan Mathias \nExecutive Producer\nRohini Nilekani \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/nilgiris-a-shared-wilderness2/",
    "keywords": [
      "Film",
      "Wildlife"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-678.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67359-1733569200-1734292800@bangaloreinternationalcentre.org",
    "name": "Eeksaurus Revealed: Behind the Animated Curtain",
    "startDate": "2024-12-07T11:00:00+05:30",
    "endDate": "2024-12-15T20:00:00+05:30",
    "description": "The first-ever exhibition of Studio Eeksaurus’s celebrated films and the creative process behind them! \nWalkthroughs with Suresh Eriyat\nSun, Dec 8 | 11am & 6pm\nMon – Fri, Dec 9 – 13 | 6pm \nBook Launch – PNK Panicker’s Ghost Stories\nSat, Dec 14 | 4pm\nQ&A with PNK Panicker, Book Signing and a screening of films inspired by his stories \nComic Making Workshop with Suresh Eriyat and Adithi Krishnadas\nSun, Dec 15 | 11am \nEstablished in 2009 by Suresh and Nilima Eriyat, Studio Eeksaurus is an internationally celebrated film production house based in Mumbai. Renowned for its design-driven approach with multi-disciplinary expertise and ground breaking animation, the studio boasts an astonishing array of global accolades, including Annecy, D&AD, Clio, Cannes Lions, and National Film Awards. \nThis week, Studio Eeksaurus presents its first-ever retrospective in India at the Bangalore International Centre. The exhibition features seven iconic films, including Fisherwoman and TukTuk, winner of the studio’s first National Award in 2015; the acclaimed clay animation film Tokri (2017 National Award); and Kandittund!, recipient of the Best Animation Film at the 69th National Awards last year. \nVisitors can enjoy exclusive curated walkthroughs and workshops led by the visionary storyteller Suresh Eriyat and his talented team. Don’t miss this unique opportunity to explore the artistry and innovation of India’s most celebrated animation studio. \nTeam\nSuresh Eriyat, Founder and Creative Director, Studio Eeksaurus\nNilima Eriyat, Founder and Executive Producer, Studio Eeksaurus\nOriole Henry, Exhibition Designer\nSusmita Mohanty + Siddharth Das, Founders + Curators, MAD Salon+Lab\nIn-house design team – Nijin Nazeem, Adithi Krishandas, Aman Gupta, Nishant Nandgaonkar, Shania Brenda Simons, Harsh Bhati\nLogistics and support – Satish Gautam, Kalpesh Palkar \nIn collaboration with: \n        \n",
    "url": "https://bangaloreinternationalcentre.org/event/eeksaurus-revealed-behind-the-animated-curtain/",
    "keywords": [
      "Pravaha",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-674.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "67604-1733770800-1733776200@bangaloreinternationalcentre.org",
    "name": "Sonic Tapestries with Modcult",
    "startDate": "2024-12-09T19:00:00+05:30",
    "endDate": "2024-12-09T20:30:00+05:30",
    "description": "Dive into a captivating fusion of broken beat rhythms, jazz textures, and neo-soul vibes in this unforgettable musical experience. This performance by Modcult weaves improvisation with pre-composed artistry, creating a dynamic tapestry of sound that celebrates rhythm, harmony, and innovation. \nWhether you’re a seasoned jazz enthusiast or exploring the allure of neo-soul, this eclectic blend promises to resonate with music lovers of all kinds. Immerse yourself in the vibrant energy of this live performance, where every note and beat invites you to move, groove, and lose yourself in the moment. \nHailing from Mumbai, MODCULT embodies the spirit of ‘Modern Music Culture’. Founded by bassist Avishek Dey, the band creates a genre-transcending soundscape blending modern jazz, soul, and contemporary styles. \nWith Avishek Dey on bass, Clement Rooney on piano, Shreya Bhattacharya on vocals, and Noah Cerejo on drums, the ensemble delivers soulful melodies, intricate harmonies, and electrifying improvisations. Their performances, marked by musical camaraderie and innovation, transport listeners on an emotive journey through original compositions and reimagined classics. \n",
    "url": "https://bangaloreinternationalcentre.org/event/sonic-tapestries-with-modcult/",
    "keywords": [
      "Music",
      "Performing Arts",
      "Pravaha"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sonic Tapestries with Modcult"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTERS-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67903-1736447400-1736454600@bangaloreinternationalcentre.org",
    "name": "And, Towards Happy Alleys",
    "startDate": "2025-01-09T18:30:00+05:30",
    "endDate": "2025-01-09T20:30:00+05:30",
    "description": "75 mins | Persian, English | 2023 | India, Iran \nFascinated by Iran’s film culture and the poetic works of the feminist poet Forough Farrokhzad, Indian filmmaker Sreemoyee Singh sets out in search of the protagonists of Iranian cinema. Her interactions over six years with filmmakers Jafar Panahi, Mohammad Shirvani and human rights activist Nasrin Sotudeh, among others, depict the precarious situation in which critics of the regime find themselves, including the constant threat of imprisonment and being banned from practicing their profession. With a keen eye for unusual situations, she poetically captures the effect of the Islamic Republic’s omnipresent censorship on the daily lives of Iranian women whose uncompromising struggle has put them at the forefront of the protests that are currently rocking the country. \nAnd, Towards Happy Alleys is a passionate declaration of love for the cinema and poetry of Iran which also provides a frank view of daily life, and bears witness to a fearless generation raising its voice and implacably demanding its civil liberties. \nInspired by Iranian cinema and the poetry of Forough Farrokhzad, a young director from India journeys to Tehran to witness how resistance becomes a daily act of survival in Iranian society. Despite stringent censorship of the Islamic Regime, she collects a series of eloquent and candid interviews with filmmaker Jafar Panahi, activists and Iranian women. Over six years, these conversations with the camera capture the simmering anxieties, fears, hopes and dreams of a nation on the brink of revolution. \nThe screening will be followed by Q&A with the audience. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/and-towards-happy-alleys/",
    "keywords": [
      "Film",
      "Language"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-681.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67264-1733598000-1733603400@bangaloreinternationalcentre.org",
    "name": "Abhipsaa — A Seeking",
    "startDate": "2024-12-07T19:00:00+05:30",
    "endDate": "2024-12-07T20:30:00+05:30",
    "description": "Abhipsaa — A Seeking charts a journey of discovery in physical, emotional, and spiritual realms. \nIn four choreographic works, Bijayini Satpathy expands the parameters of the formal and representational norms of the Odissi tradition through both narrative and non-narrative dances – reimagining classical Odissi forms through a personalised interpretation. \nCommissioned by Duke University and the Baryshnikov Arts Center, Abhipsaa — A Seeking, takes the audience on a profoundly personal journey. In collaboration with musicians, composers, lighting and theatrical designers, Satpathy’s performance is an otherworldly and transformative experience. A selection of the piece was presented virtually by the Baryshnikov Arts Center with introduction by Mikhail Baryshnikov and Mark Morris in February 2021 and the full piece had its world premiere performances at Duke University in December 2021. \nThis work was made possible with additional funding from the New England Foundation for the Arts’ National Dance Project, with lead funding from the Doris Duke Foundation and the Andrew W. Mellon Foundation. \n",
    "url": "https://bangaloreinternationalcentre.org/event/abhipsaa-a-seeking/",
    "keywords": [
      "Dance",
      "Performing Arts",
      "Pravaha"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-665.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "67336-1734116400-1734121800@bangaloreinternationalcentre.org",
    "name": "The Rite of Strings",
    "startDate": "2024-12-13T19:00:00+05:30",
    "endDate": "2024-12-13T20:30:00+05:30",
    "description": "This unique Indian Classical performance featuring a double neck guitar, tabla and kanjeera, bridges tradition and innovation creating a spellbinding tapestry of rhythm and melody. \nThe double-neck guitar, blending the versatility of modern string instruments with the evocative tones of Indian ragas, takes center stage. Its rich, resonant sound captures the nuances of classical compositions. Complementing this melodic brilliance is the tabla, whose intricate rhythms breathe life into every beat. With its dynamic range and precision, the tabla sets a pulsating foundation that elevates the musical experience. Adding a distinctive flavor to this trio is the kanjira, a small but powerful frame drum renowned for its versatility. Its sharp, expressive tones seamlessly blend with the other instruments, enriching the rhythmic dialogue with bursts of spontaneity and virtuosity. \nTogether, Anupam, Amit and Swami embark on a journey through soulful ragas, energetic talas, and spellbinding improvisations. This concert promises to captivate both connoisseurs of classical music and new listeners, celebrating the timeless beauty of Indian traditions through an innovative musical lens. \n\n\n\n\nThis performance will be held at our terrace amphitheater. Kindly bring or wear warm clothing for your comfort. \n\n\n\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/the-rite-of-strings/",
    "keywords": [
      "Music",
      "Performing Arts",
      "Pravaha"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Rite of Strings"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-675.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67374-1733569200-1733574600@bangaloreinternationalcentre.org",
    "name": "Stories Around Us, Storytelling Within Us",
    "startDate": "2024-12-07T11:00:00+05:30",
    "endDate": "2024-12-07T12:30:00+05:30",
    "description": "An hour with the master storyteller, featuring a showcase of films and visual narratives! \nWorld renowned animation film maker-director Suresh Eriyat, is the founder of Mumbai based film production house Studio Eeksaurus. A recipient of numerous international awards, Eriyat is a storyteller extraordinaire. In 2015, his film, Fateline, bagged the prestigious Annecy Cristal Award at the Annecy International Animated Film Festival, considered the Oscars for animators, the only one for India till date. \nIn his talk, Eriyat will share his storytelling magic. He will share snippets from his film repertoire, distil and discuss his five-step process – Listen/ Observe/ Record/ Mash-up/ Share! A Q&A with the audience will follow. \nIn collaboration with: \n         \n",
    "url": "https://bangaloreinternationalcentre.org/event/stories-around-us-storytelling-within-us/",
    "keywords": [
      "Pravaha",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-670.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "66898-1734028200-1734033600@bangaloreinternationalcentre.org",
    "name": "Universal Food Security",
    "startDate": "2024-12-12T18:30:00+05:30",
    "endDate": "2024-12-12T20:00:00+05:30",
    "description": "Imagine a world without hunger and malnutrition. What would it take to achieve a genuinely food-secure world—where every person gets to consume the right quantity and quality of food to live a healthy, active, and productive life? \nAchieving and sustaining such a future requires transforming how our food is grown, managed, distributed, and consumed. From production to consumption, our food systems must be more sustainable, halting environmental degradation, and even repairing the damage we have previously done. \nGlenn Denning’s Universal Food Security: How to End Hunger While Protecting the Planet presents a bold, evidence-based, practical guide to food systems transformation. He bridges the divisive worlds of science, policy, and practice. By synthesizing the most relevant literature, consulting the world’s foremost experts, and sharing personal insights gained over four decades, Denning lays out five priority areas for action and investment. \nBut in Universal Food Security, Denning goes beyond what needs to change. He goes on to tackle the challenges of implementation. Echoing the words of his mentor, the late Professor MS Swaminathan, Denning argues that we need the knowhow and the do-how to transform our food systems.  \nUniversal Food Security calls for a new generation of enlightened practitioner-leaders—acting on their own and with others, through institutions—to achieve a food-secure world. \nImage Captions:\nThumbnail, Poster and Header: Rice crops in Cambodia\nInstastory: Maize crops in Malawi \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/universal-food-security/",
    "keywords": [
      "Agriculture",
      "Food",
      "Policy & Regulation",
      "Science",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-663.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67472-1734114600-1734120000@bangaloreinternationalcentre.org",
    "name": "Solving Avian Mysteries",
    "startDate": "2024-12-13T18:30:00+05:30",
    "endDate": "2024-12-13T20:00:00+05:30",
    "description": "To find a rare bird is the ultimate dream of ornithologists and birdwatchers. But doing it requires a combination of skills including an understanding of habitats, animal behaviour and people skills as well as plain old good luck. But the ornithologists, naturalists and birdwatchers, who tracked down the most difficult to find birds of the Indian subcontinent, got lucky because they worked really hard at it. \nIn this session authors Shashank Dalvi and Anita Mani will be in conversation with contributors to the book ‘The Search for India’s Rarest Birds‘, Atul Jain, Radhika Raj and Aasheesh Pittie  who will be speaking about the challenges of species discovery and what makes a bird ‘rare’. In addition, the session will explore conservation issues and solutions to prevent such rare species from going over the brink, as well as future directions on where the next raft of discoveries could come from. \nIn collaboration with : \n          \n",
    "url": "https://bangaloreinternationalcentre.org/event/solving-avian-mysteries/",
    "keywords": [
      "Books",
      "Wildlife"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/POSTER_poster_Thumbnail-copy-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "67214-1732924800-1734307199@bangaloreinternationalcentre.org",
    "name": "BIC @ BLR Hubba",
    "startDate": "2024-11-30T05:30:00+05:30",
    "endDate": "2024-12-16T05:30:00+05:30",
    "description": "This winter, experience a 16-day celebration of Bengaluru’s vibrant cultural landscape as BLR Hubba returns from November 30 to December 15, 2024. The festival transforms the city into a living canvas, bringing together diverse expressions of performing and visual arts, literature, theatre, science, music, technology, and design. \nTrue to our BIC ELSEWHERE initiative, this year’s festival extends beyond traditional venues to bring arts and culture directly to the heart of our communities. Through strategic partnerships with venues across Bengaluru, we’re creating accessible cultural spaces that invite diverse audiences to engage with the arts in their own neighborhoods. \nFrom intimate theatre performances in community spaces to large-scale art installations, from literary discussions to cutting-edge technology showcases, BLR Hubba 2024 celebrates the multifaceted spirit of Bengaluru. Join us as we turn the city’s community spaces into vibrant hubs of cultural exchange and creative expression. \nDetails to the events can be found here. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/bic-blr-hubba/",
    "keywords": [
      "Bangalore",
      "Culture",
      "Dance",
      "Heritage",
      "Music",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "BIC @ BLR Hubba"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-667.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "67287-1733857200-1733862600@bangaloreinternationalcentre.org",
    "name": "Axiom Of Choice",
    "startDate": "2024-12-10T19:00:00+05:30",
    "endDate": "2024-12-10T20:30:00+05:30",
    "description": "An exploration of free will, war and mathematics; from the Simonyi Professor for the Public Understanding of Science at Oxford University, Marcus du Sautoy, comes a ground-breaking new play The Axiom of Choice! \nEminent mathematician Andre Weil is on a journey from France to India, Finland and beyond, to discover whether we really have free will or if all our choices are predetermined. Expect mathematics, movement but most of all the true story of how one man dodged death on more than one occasion. \nImprisoned in Rouen during the Second World War, Weil faces a choice that will determine his fate – but his decision just doesn’t make sense. Is life a mathematical theorem of logical strands? Because sometimes it just doesn’t add up. This is Marcus’ second work to be performed in India, following I is a Strange Loop. Most recently he has published his seventh book – Around the World in 80 Games, which has just been released in paperback. \nThis production of The Axiom of Choice has been generously supported by Ben Delo, also supported by Dangor Education, Stage One Bursary Scheme for New Producers & Charles and Lisa Simonyi Fund for Arts and Sciences. This tour has been supported by Rohan Murty. \nWritten & Co-directed by Marcus du Sautoy\nCo-Directed by Lu Descourtier\nDesigned by Bronwen Herdman\nLighting Design by Rachel Samply\nMovement Direction by Shane Shambhu\nProduced by Claire Gilbert Ltd\nSupported By Ben Delo, Dangor Education, stage One Bursary Scheme for New Producers & Charles and Lisa Simonyi Funds for Arts and Sciences.\nIndia Tour Partner: Literature Live! The Mumbai Litfest\nIndia Tour Presented By: QTP Entertainment Pvt Ltd\nExecutive Producer for QTP: Jinal Shah\nQTP Company Stage Manager: Nirlek Dhulla\nLight Operation: Adi Shastri \nIn collaboration with: \n         \n",
    "url": "https://bangaloreinternationalcentre.org/event/axiom-of-choice/",
    "keywords": [
      "Performing Arts",
      "Pravaha",
      "Science",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Axiom Of Choice"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-673.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67313-1734031800-1734035400@bangaloreinternationalcentre.org",
    "name": "That’s All Folks!",
    "startDate": "2024-12-12T19:30:00+05:30",
    "endDate": "2024-12-12T20:30:00+05:30",
    "description": "*This work contains scenes that explore mature themes. Viewer discretion is advised.* \nThe irreverent That’s All Folks!, premiered at the Equilibrio Festival 2024 and draws inspiration from cartoons. In a minimalist set, a quartet of international performers—Damiano Ottavio Bigi, Ching-Ying Chien, Issue Park, and Faith Prendergast—explore a work that blends dance, science, and myth. Inspired by the concept of the ‘event horizon,’ it delves into physical vertigo, the fall, and being drawn into a space where perspective shifts and everything changes depending on where we look. \nThis project continues the themes of Un Discreto Protagonista, expanding the conversation on choreographic writing and artistic composition. While the previous work focused on the universe’s origins and astronomical processes, this piece shifts to humanity’s relationship with the cosmos. \nWorking with a quartet of dancers, the team explored two distinct paths. The first centers on a “purely physical narrative,” using complex movement patterns to create a thematic structure that unfolds gradually. This investigation draws on ritual forms connected to founding myths and cosmology, balancing irrationality with control and chaos with logic to explore interconnected spatial and dimensional relationships. \nThe second path constructs four characters suspended in an undefined space—a non-time and non-place—where they encounter their unconscious and archetypal memories. Inspired by the event horizon concept, the characters search for a new beginning, questioning whether our world could have emerged from a previous universe, in a moment called “the bounce,” when space and time dissolved into a cloud of probabilities. \nThrough this journey, they question the nature of time, motion, and instability in a place where there is no fixed perspective. Our vulnerabilities and strengths are mixed as we teeter on the edge, learning more about ourselves. \nCreated by Damiano Ottavio Bigi & Alessandra Paoletti\nPerformers: Damiano Ottavio Bigi, Ching-Ying Chien, Issue Park, Faith Prendergast\nComposition and Sound Design: David Blouin\nMusic: David Blouin, Colin Stetson / Sarah Neufeld Duo, Gary ‘Oslide, Henry Purcell, Hank Williams\nLighting Design: Lucien Laborderie\nSet and Costumes: In collaboration with Tzela Christopoulou\nSet Construction: Marios Karaolis \nPlease note: Kindly arrive and be seated by 7:15pm. Entry to the auditorium will not be permitted after the performance begins at 7:30pm. \nIn collaboration with: \n           \n",
    "url": "https://bangaloreinternationalcentre.org/event/thats-all-folks/",
    "keywords": [
      "Dance",
      "Performing Arts",
      "Pravaha",
      "Science"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-676.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "67923-1733738400-1733745600@bangaloreinternationalcentre.org",
    "name": "The Making of Kathak",
    "startDate": "2024-12-09T10:00:00+05:30",
    "endDate": "2024-12-09T12:00:00+05:30",
    "description": "Experience the artistry of Urja Desai Thakore, acclaimed Kathak artist and Artistic Director of Pagrav Dance Company, in an exclusive masterclass at the BIC \nJoin Urja Desai Thakore, one of the UK’s foremost Kathak dancers and Artistic Director of Pagrav Dance Company, for an inspiring two-hour masterclass. Trained under the legendary Kumudini Lakhia at Kadamb and with academic credentials in Kathak and South Asian Dance, Urja blends traditional artistry with a modern sensibility, making her a celebrated performer, choreographer, and mentor. \nAs part of the company’s India tour, this workshop delves into the choreography of the award-winning production Kattam Katti, offering a unique opportunity to explore the creative process behind this celebrated work. Designed for professional dancers and advanced-level practitioners, the session will enhance your understanding of Kathak’s traditional and contemporary elements while providing valuable insights into nuanced storytelling and movement. \nDon’t miss this opportunity to elevate your craft and engage with Urja’s unique vision for Kathak. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-making-of-kathak/",
    "keywords": [
      "Dance",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/KK.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67412-1734202800-1734208200@bangaloreinternationalcentre.org",
    "name": "Palem",
    "startDate": "2024-12-14T19:00:00+05:30",
    "endDate": "2024-12-14T20:30:00+05:30",
    "description": "Immerse yourself in a mesmerizing showcase of traditional and contemporary performances, blending the vibrancy of live music and the charm of recorded melodies by Sangeet Natak Akademi Award winning Latasana Devi & Group. \nProgramme \nRaagmacha: A powerful opening act featuring two drummers setting the stage alive with pulsating rhythms. \nBasant Ras: A vibrant group performance set to recorded music, celebrating the joyous spirit of spring. \nThang Ta (Sword & Spear Dance): Witness the martial prowess of a group performing this traditional Manipuri art form, accompanied by live music. \nPung Cholom (Drum Dance): A captivating group performance blending acrobatics, rhythm, and live drumming. \nDevi Stuti: A soulful solo offering, paying homage to the divine feminine, set to recorded music. \nMarakata: A group performance portraying vibrant themes through intricate movements, supported by recorded music. \nCheitak Jagoi (Stick Dance): A lively solo act, showcasing the energy and agility of Manipuri tradition with live musical accompaniment. \nAbhisarika Nayika: A solo depiction of the classical archetype, capturing the emotions of a heroine awaiting her beloved, performed to recorded music. \nDhol Cholom: A group presentation of the traditional drum dance, exuding synchronized energy and live beats. \nPalem: Closing the evening with a dynamic group performance, telling stories through expressive movements and recorded music. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/palem/",
    "keywords": [
      "Dance",
      "Performing Arts",
      "Pravaha"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-677.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67891-1734460200-1734465600@bangaloreinternationalcentre.org",
    "name": "Things That Sing",
    "startDate": "2024-12-17T18:30:00+05:30",
    "endDate": "2024-12-17T20:00:00+05:30",
    "description": "Every joke, facial expression, song and stick of furniture we inherit from those we lived with and loved tells its own story. Of continuity, of pasts and the present. Writers A.T. Boyle and Shinie Antony, who put together the collection exObjects, The Art of Holding On, Letting Go (Om Books), delve into the micro histories and macro memories of things left behind. The eleven authors have re-envisaged people, places and things lost, but certainly not forgotten. \nJoin Vikram Sampath, whose late, beloved mother infused him with her love for classical music, Gajra Kottary, whose father Pandit Amarnath was a well-known Indian classical vocalist, and Shantanu Ray Chaudhuri, the editor of this volume, along with Boyle and Antony, as they talk about the hum and heart of belongings. \nThe discussion will be followed by a Q&A session with the audience. \nPresented by: \n \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/things-that-sing/",
    "keywords": [
      "Books",
      "Literature"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-41.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "67272-1733673600-1733688000@bangaloreinternationalcentre.org",
    "name": "Kattam Katti",
    "startDate": "2024-12-08T16:00:00+05:30",
    "endDate": "2024-12-08T20:00:00+05:30",
    "description": "Kattam Katti transports you to Uttarayan, the world-famous kite festival in Gujurat, North India, where millions of people from different cities, religions, and social classes come together to fly kites, marking the transition from winter into spring.  \nTapping into the competitive chaos, creativity, and colour of the event, the show brings to life the excitement of Uttarayan with lyricism, drama, and exquisite technique. It illustrates the highs and lows, loves and losses of the lives that are lived out among the festivities. Kite flying becomes a metaphor for the injustice of unevenly distributed privilege, in both the corporate world and society more generally.  \nChoreography: Urja Desai Thakore\nSet Design: Simon Daw\nLighting Design: Hector Murray\nDramaturgy: Lou Cope\nCostume Design: Urja Desai Thakore, Simon Daw, and Abha Desai Original Creative Producer: Nina Head\nCreative Producer: Lia Prentaki\nProduction Manager: Salvatore Scollo\nStage Manager: Ben Gray\nSound Engineer: Camilo Tirado\nLighting Technician: Chris Burr  \nSpecial thanks to Alap Desai, Chitra Sundaram, Michael Hulls, Parbati Chaudhry, Madhusoodanan Satchithannandan , Nina Head, and Eva Martinez  \nCommissioned by Sadler’s Wells Theatre, London. Funded by Arts Council England and Milton Keynes Council, with partners MK Gallery, Creative Folkestone, University of Bedfordshire, Akademi, SouthEast Dance, SAA Arts UK and GemArts. \n",
    "url": "https://bangaloreinternationalcentre.org/event/kattam-katti/",
    "keywords": [
      "Dance",
      "Performing Arts",
      "Pravaha"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-671.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "65511-1734375600-1734381000@bangaloreinternationalcentre.org",
    "name": "Sevens",
    "startDate": "2024-12-16T19:00:00+05:30",
    "endDate": "2024-12-16T20:30:00+05:30",
    "description": "Sevens is a triple bill of dance pieces, featuring Nina Rajarani as a performer, as well as\nfour Bharatanatyam and Kathak dancers and three musicians in ensemble work. Seven\nSnags, Seven Steps and Seven Sins explore the sacred and sinful significance of the\nnumber seven. \nSeven Snags \nThe choreographic equivalent of an obstacle race, this is a fast-paced rhythmic ensemble filled with exciting dynamics and laced with challenging cross-rhythms. This is an abstract display of the fun and frolics of youth, the flirtatious quality of interactions, the freedom and liberties one takes with choices, all inspired by the modern-day phenomena of speed dating and dating apps. \n  \nSeven Steps \nThis is a duet by dancer/choreographer Nina Rajarani MBE and vocalist/composer Y Yadavan, based on ‘saptapadi’, the most important rite of a Hindu marriage ceremony, where with each step, the couple make a promise to each other.  \nAlthough an age-old ritual dating back to Vedic times, the vows remain relevant for anyone entering a committed relationship.  \nSeven Sins \nThis piece is an abstract exploration of stereotyped concept of rights and wrongs , what it is like to live under the burden of the idea of sin. The behaviour we call ‘sinful’ is never simply that. Sins are the most profound expression of unmet needs. Representing an unfortunate response to difficulty and distress, Seven Sins considers that we are not evil at all, but in fact in all types of very human and difficult pain. \nThe piece evolves to evoke both the claustrophobic feeling of guilt that comes from living a life deemed sinful, untrue or unacceptable; and the dark places we are driven towards by a capitalistic consumerist society that simultaneously demands and condemns accumulation and wealth. \nBut the journey of the piece is one of acceptance as we learn to listen, not admonish or punish, a way to forgiveness.  \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sevens/",
    "keywords": [
      "Dance",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sevens"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-37.jpg"
  }
]