[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81390-1763314200-1763319600@bangaloreinternationalcentre.org",
    "name": "Judge and Be Judged: Musings on the Top Court",
    "startDate": "2025-11-16T17:30:00+05:30",
    "endDate": "2025-11-16T19:00:00+05:30",
    "description": "As the Supreme Court of India completes seventy-five years, how do we understand its role in shaping the country’s institutions and democratic ideals? Has it remained a counter-majoritarian voice, and how has it navigated questions of accountability, transparency and constitutional promise? \nJoin us for a conversation that brings together former judges, lawyers and scholars to reflect on the Court’s evolving legacy, drawing from the book [In]complete Justice: The Supreme Court at 75. The discussion features Justice S. Muralidhar, Justice N. Santosh Hegde, Dr. Aditya Sondhi and Radhika Chitkara, as they explore the intersections of law, legitimacy and justice in contemporary India.\n \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/judge-and-be-judged/",
    "keywords": [
      "Law"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_JaBJ.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "81849-1763895600-1763924400@bangaloreinternationalcentre.org",
    "name": "Feather Fest | Day 2",
    "startDate": "2025-11-23T11:00:00+05:30",
    "endDate": "2025-11-23T19:00:00+05:30",
    "description": "Schedule \n11am – 12:15pm | Birding Bytes (For Ages 6-10) | Library\nwith Niyatee Sharma (Kids Session)\nMeet the Architects of the natural world. Find out about the interesting and incredible ways in which birds around India build their nests in this interactive session with Niyatee Sharma, based on her book My Nest is the Best.\n \n2pm – 3pm | Film Screenings | Seminar Halls \nOn the Brink: Vultures is part of a film series focusing on Indian’s lesser-known species and threatened habitats, and the conservationists fighting to ensure their survival. This episode focuses on scientist Dr Vibhu Prakash’s efforts to bring vultures back.\n \nWings & Wetlands – a story of migration takes us on a journey along the wetlands of Karnataka, which provide refuge to local and migratory water-birds. It is produced by the Karnataka Forest Department as part of its outreach activity, for the state’s action plan on the Central Asian Flyway. \n3pm – 4:30pm | Chirp Challenge – Bird Song Imitation Competition (For Ages 11-16) | Seminar Halls\nwith Krishna Murthy, Garima Bhatia, Ashwin Viswanathan, Deepa Mohan and Guruprasad KR (Kids Session)\nDo you have an ear for nature’s music? Can you whistle like a magpie robin or call like a shikra? Step up to the challenge in this fun and interactive competition that celebrates the amazing variety of bird songs around us. This event is a celebration of attentive listening, keen observation, and the joy of mimicking the melodies of the wild. Whether you’re a budding birder, a talented mimic, or just someone who loves birds, this competition promises to be both challenging and full of laughter! Audience members are warmly invited to join in and enjoy the show. Come cheer, hoot and whistle for the young bird mimics and experience a symphony of nature’s finest sounds! \n4pm – 5pm | Why Don’t Birds Comb Their Hair? – Poetry Time With Birds and Rhyme (For Ages 6-10) | Library\nwith Suchi Govindarajan (Kids Session)\nSome birds have hair that sticks out in funny ways. What would you do if you had hair like that? Join us for an interactive reading of bird poetry, including the book – Why Don’t Birds Comb Their Hair? (Pratham Books). We will also learn a little more about birds, feathers and, yes, hairstyles. Join poet and nature-guide Suchi Govindarajan to read the original poems that went into the book. \n4:30pm – 5:30pm | Hot Cities, and Cold Birds – How Do Birds Survive in Changing Environments? (For Ages 14+) | Seminar Halls \nby Anusha Shankar (Talk & Presentation)\nBirds and animals constantly have to deal with their environment changing, while searching for food, managing their temperature, and finding safe places to sleep and take care of their young. In this session, Anusha will share her learnings on how birds manage their daily energy needs given these challenges to surviving in changing environments.\n \n5:30pm – 7pm | Documentary Screening – Every Little Thing | Seminar Halls\nEvery Little Thing (2025), directed by Sally Aitken, is a deeply moving documentary about Terry Masear, a Los Angeles wildlife rehabilitator who has dedicated her life to caring for injured and orphaned hummingbirds. The film blends stunning slow-motion cinematography of these fragile creatures with Terry’s own story of resilience and healing. The film is a moving exploration of compassion, resilience, and the extraordinary bond between humans and animals. The documentary has touched audiences worldwide, and now, for the very first time, it will be screened in India.\n \nAll Day\n \nBirdsong: Are we Listening? | First Floor Foyer\nBirds and their melodious songs have intrigued us for centuries. Why do birds sing? How do they learn these songs? Do they have tutors? How do they produce complex melodies? The Birdsong exhibit from the Indian Music Experience Museum explores the connection between music and the environment, through nature’s most talented singers- the songbirds. Explore the science of birdsong and create your own bird-inspired melodies! \nWings of Wonder | First Floor Foyer\nExplore the world of birds with award-winning photographs from young photographers, courtesy of Nature in Focus – India’s premier platform for storytelling through images. \nFlights of Imagination – An Art Exhibition | Second Floor Foyer\nYoung bird lovers from across the country take flight with creativity in this vibrant showcase of the best artworks selected from a national art competition. Featuring hand-made artworks by children aged 11–16, the exhibition celebrates the beauty and diversity of India’s birdlife through youthful eyes. \nMeasure your Wingspan | Second Floor Foyer\nWingspan is the distance from fingertip to fingertip with your arms stretched out – and it’s the same for birds! To find yours, stretch your arms in a T and compare to that of birds found around Bangalore. \nEarly Bird and Nature Conservation Foundation Stalls | Second Floor Foyer \nFind the schedule for Day 1 here! \nIn collaboration with:\n\n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/feather-fest-2/",
    "keywords": [
      "Wildlife",
      "Workshops",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-91.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "81827-1763809200-1763838000@bangaloreinternationalcentre.org",
    "name": "Feather Fest | Day 1",
    "startDate": "2025-11-22T11:00:00+05:30",
    "endDate": "2025-11-22T19:00:00+05:30",
    "description": "Schedule \n11am – 1pm | Birds, Books and Banter | Seminar Halls\nwith Bikram Grewal, Rohini Nilekani and Suhel Quader (Conversation)\nJoin the panellists as they chat about their shared obsession with birds. What’s so special about birds anyway? How do our conversants explain their passion to themselves and justify it to others? Were birds better in the good old days? What’s new (and new-fangled) in the world of birds and bird-watching? Join in to hear adventure stories, hot takes, birdy tidbits and more. \n11am – 1pm | Nature Explore – An Artist’s Sketchbook (For Ages 10-14) | Library, Amphitheatre\nwith Sangeetha Kadur and Shilpashree (Kids Session)\nNature has always been an incredible source of inspiration. Join us as we explore our surroundings and immerse ourselves in creating journal pages. Through this workshop, discover the art of seeing, sketching and note-taking. Learn the meticulous and fun ways of filling up your journal pages with interesting observations and nature stories. \nPlease Note: Participants are requested to carry their sketchbook, pencils and colours for this workshop. \n2pm – 4pm | Games Galore (For Ages 10-13) | Library\nby Early Bird (Kids Session)\nLearn about birds in this session of fun and games conducted by Early Bird. Test your memory as you match birds by habitat and food. Learn fun facts and calls of common birds around us. Discover how hard it is to be a bird, in the Bird Survivor and Life Cycle game.\n \n4pm – 5pm | Rishumu and the Tailor Bird Trouble (For Ages 6-10) | Library\nwith Saidevi Sanjeeviraja and Yashas Bharadwaj (Kids Session)\nThe session brings together storytelling by Saidevi Sanjeeviraja and a lively discussion with Naturalist Yashas Bharadwaj. The session will help children explore how birds live, what they eat, and what kind of gardens make them feel safe. Children end the session by designing their own bird-friendly garden! \n5pm – 5:30pm | Urban Jungle: A Bird’s Eye View | Amphitheatre\nby Avian and Reptile Rehabilitation Center (ARRC) (Performance)\nAs they take flight, our shared future unfolds in their untold stories. This 30-minute skit takes you through a day in the life of birds living in our cities. Told from a bird’s point of view, it highlights the everyday threats they face and how simple actions we can all take to make urban spaces safer for them. \nAll Day\n \nBirdsong: Are we Listening? | First Floor Foyer\nBirds and their melodious songs have intrigued us for centuries. Why do birds sing? How do they learn these songs? Do they have tutors? How do they produce complex melodies? The Birdsong exhibit from the Indian Music Experience Museum explores the connection between music and the environment, through nature’s most talented singers- the songbirds. Explore the science of birdsong and create your own bird-inspired melodies! \nWings of Wonder | First Floor Foyer\nExplore the world of birds with award-winning photographs from young photographers, courtesy of Nature in Focus – India’s premier platform for storytelling through images. \nFlights of Imagination – An Art Exhibition | Second Floor Foyer\nYoung bird lovers from across the country take flight with creativity in this vibrant showcase of the best artworks selected from a national art competition. Featuring hand-made artworks by children aged 11–16, the exhibition celebrates the beauty and diversity of India’s birdlife through youthful eyes. \nMeasure your Wingspan | Second Floor Foyer\nWingspan is the distance from fingertip to fingertip with your arms stretched out – and it’s the same for birds! To find yours, stretch your arms in a T and compare to that of birds found around Bangalore.\n \nEarly Bird and Nature Conservation Foundation Stalls | Second Floor Foyer \nFind the schedule for Day 2 here! \nIn collaboration with:\n  \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/feather-fest-day-1/",
    "keywords": [
      "Wildlife",
      "Workshops",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-1-13.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81800-1763292600-1763298000@bangaloreinternationalcentre.org",
    "name": "Material, Memory, and the Sacred",
    "startDate": "2025-11-16T11:30:00+05:30",
    "endDate": "2025-11-16T13:00:00+05:30",
    "description": "For Aboubakar Fofana, nature is not a resource, it is divine.  \nEvery leaf, every drop of water, every hue of indigo is a manifestation of the sacred. Born in Mali and raised in France, Fofana is a multidisciplinary artist and designer whose work in calligraphy, textiles, and natural dyes, is rooted in reverence for the natural world and its cycles of creation, decay, and renewal. \nIn this conversation, he reflects on indigo as both material and metaphor, a living substance that embodies memory, ecology, and spirituality. Through fermentation and rhythm, his practice becomes meditation: a dialogue between human intention and the intelligence of nature. He will also share insights from his work in Siby, Mali, where he is building a community-led indigo farm that integrates food, medicine, and dye plants into a holistic ecosystem. \nAn invitation to rediscover the sacred in the soil: where art, devotion, and the divine converge in living colour. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/material-memory-and-the-sacred/",
    "keywords": [
      "Heritage",
      "Sustainability",
      "Textiles",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_MMS.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "81598-1763492400-1763497800@bangaloreinternationalcentre.org",
    "name": "Asymptomatic",
    "startDate": "2025-11-18T19:00:00+05:30",
    "endDate": "2025-11-18T20:30:00+05:30",
    "description": "Have you ever asked yourself, “Why me?” Staring at the odds stacked against you, wondering why the world feels so unfair? \nAsymptomatic is a sharp, darkly funny solo performance that unpacks those moments of rejection. Blending comedy, tragedy, farce, dance, and stand-up, it follows an artist hungry for success, constantly rebuffed, and forever proving their worth.  \nWith biting humour and fearless honesty, Asymptomatic turns rejection into revelation, exposing the quiet, invisible power systems that decide who gets to rise and who’s left behind.  \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/asymptomatic/",
    "keywords": [
      "Dance",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Asymptomatic"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_AS-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "81929-1763901000-1763905500@bangaloreinternationalcentre.org",
    "name": "A Flaming Forest",
    "startDate": "2025-11-23T12:30:00+05:30",
    "endDate": "2025-11-23T13:45:00+05:30",
    "description": "49 min | Kannada with English Subtitles | Documentary | India \nBetween protection and possession lies the story of the Soliga and their burning forest. \nA Flaming Forest is a powerful documentary that captures the Soliga adivasis’ deep, ancestral bond with the forests of the Biligiri Rangaswamy Temple (BRT) Tiger Reserve—and the heartbreak of being displaced from them in the name of conservation. Through quiet observation and intimate storytelling, the film reveals both the loss and the resistance that arise when conservation excludes the very people who have lived in harmony with nature for generations. \nWinner of the Best Depiction of the Climate Emergency at Film Southasia 2024, A Flaming Forest has travelled through film festivals and universities worldwide, sparking urgent conversations on what true, inclusive conservation should look like. \nDirected by Salman Javeed, Satya Ambasta, and Vivek Sangwan, the film blends ethnography and cinema to ask: can we protect the forest without silencing its people? \nCredits\nProduction: Srishti Films\nExecutive Producer: Sanjay Barnela\nEditing and Sound Design: Salman Javeed\nCinematography: Sanjay Barnela, Salman Javeed, Vivek Sangwan\nDirector of Research: Nitin Rai\nResearch and Production: Anandi Mehra, Paromita Bathija, Satya Ambasta \nThis performance is part of the larger Coexistence Mela at BIC on Nov 22 and 23. You can find the complete program here. \nPresented by: \n     \n       \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-flaming-forest/",
    "keywords": [
      "Climate Change",
      "Environment",
      "Film",
      "Society",
      "Sustainability",
      "Wildlife"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "A Flaming Forest"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/ThumbnailA-Flaming-Forest.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "81447-1763290800-1763296200@bangaloreinternationalcentre.org",
    "name": "Dancing on Walls",
    "startDate": "2025-11-16T11:00:00+05:30",
    "endDate": "2025-11-16T12:30:00+05:30",
    "description": "Works of art are good things to think about. They awaken our senses, invite interpretation, and spark curiosity. Join us in the library to discover how art can nurture observation, critical thinking, and inquiry. \nIn this session, we’ll dive into the world of Warli painting, an ancient tribal art tradition of Maharashtra. Its distinctive pictogram style is rich in detail yet easy to decode and connect with. \nChildren will look closely at a Warli painting, form thoughtful interpretations, and wonder about the stories it holds. They’ll also have an opportunity to tell their own stories using Warli motifs. \nCome, see, think, and wonder with us! \nAround the World in 50 Sundays is a journey that begins, not with a ticket, but with opening a book. In a city like Bangalore where families are always in motion, the BIC Library hopes to offer stillness and a quiet, welcoming space for both parents and children where reading becomes a shared way of being and not a task. \nEvery Sunday, we open our doors to invite you into a library that listens; building a rhythm of return, a habit of joy and a new community bound not just by books, but by the weekly ritual of reading together. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dancing-on-walls/",
    "keywords": [
      "Around the World in 50 Sundays",
      "Workshops",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-47-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "79013-1764270000-1764275400@bangaloreinternationalcentre.org",
    "name": "Dual Margam 6",
    "startDate": "2025-11-27T19:00:00+05:30",
    "endDate": "2025-11-27T20:30:00+05:30",
    "description": "When movement whispers and stillness breathes, something enduring is set in motion. \nOn our next evening of Dual Margam, two distinct classical traditions return in dialogue – the lyrical subtlety of Manipuri from Manipur and the architectural elegance of Odissi from Odisha. \nManipuri, in its feminine form, is marked by circular motion, understated footwork, and an inward quietude that evokes devotion and tenderness. Odissi, by contrast, is shaped through defined stances and sculpted transitions, where each turn of the body becomes an offering of story and song. \nThis performance brings together two women dancers in the Odissi–Manipuri conversation, setting two vocabularies side by side: one fluid and veiled, the other precise and chiselled. \nThe second in a two-part Odissi–Manipuri dialogue, this evening unfolds through the feminine body, following last month’s exploration by two male dancers. \nThe Dual Margam series curates two classical dance forms of India to highlight their similarities and differences. The solo performances honour traditional repertoire (the Margam), while the duet will juxtapose each unique form with another. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dual-margam-6/",
    "keywords": [
      "Dance",
      "Heritage",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_DM6.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "81613-1763058600-1763064000@bangaloreinternationalcentre.org",
    "name": "Shobane Pāḍa",
    "startDate": "2025-11-13T18:30:00+05:30",
    "endDate": "2025-11-13T20:00:00+05:30",
    "description": "Shobane Pāḍa are the tender, devotional songs that mark the milestones of a woman’s life (marriage, childbirth, festivals) where melody becomes memory, and every note echoes love, laughter, and grace. Revealing how diverse voices and dialects carry the same heartfelt spirit, two vibrant ensembles bring these songs to life: Pattalamma Janapada Kala Sangha from Mandya and GK Kala Vedika from North Karnataka.  \nThrough live renditions and storytelling, the session explores the social and cultural significance of Shobane, how these songs serve as a collective blessing, a space for women to voice joy, longing, and devotion. The audience will be invited to experience the changing rhythms and tones that mark life’s transitions, from the playful to the profound. \nThe fifth presentation in the BIC Janapada series, this evening is a tribute to the music that has long held Karnataka’s communities together: in rhythm, reverence, and radiant joy. \nBIC Jaanapada is a bi-monthly (once in two months) series celebrating Karnataka’s folk traditions through the lens of regional identity and cultural preservation. Curated in collaboration with Tvarita Arts Collective India, the program combines scholarly discourse with live performances to explore the deep connections between geography and artistic expression. Through demonstrations, performances, and academic discussions, each session examines how landscape and local culture have shaped these distinct artistic practices. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/shobane-pa%e1%b8%8da/",
    "keywords": [
      "Culture",
      "Dance",
      "Music",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Shobane Pāḍa"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_SP.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81621-1763058600-1763064000@bangaloreinternationalcentre.org",
    "name": "Building India’s Swimming Dreams",
    "startDate": "2025-11-13T18:30:00+05:30",
    "endDate": "2025-11-13T20:00:00+05:30",
    "description": "Aspirations of excellence know no borders.  \nAs Australia, the world’s second-highest Olympic gold medalist nation in swimming, crowns its ‘Green and Gold Decade’ with the 2032 Brisbane Olympics, India is charting its own bold course: hosting the 2030 Commonwealth Games and setting its sights on the 2036 Olympics.  \nIn this timely conversation, leading Indian and Australian sports figures come together to explore swimming as a shared arena of potential and partnership. Where does India stand in its swimming journey today? How can Australia’s storied expertise help shape a stronger swimming culture here? And what might true collaboration between nations look like in nurturing the next generation of elite athletes? \nA dialogue on ambition, learning, and shared pursuit of excellence; where two nations meet at the deep end of possibility! \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/building-indias-swimming-dreams/",
    "keywords": [
      "International Relations",
      "Sports"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-46-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81726-1763836200-1763841600@bangaloreinternationalcentre.org",
    "name": "Worlds Within Worlds",
    "startDate": "2025-11-22T18:30:00+05:30",
    "endDate": "2025-11-22T20:00:00+05:30",
    "description": "Four poets from Bangalore come together for an evening of poetry in English and Hindi, exploring how language moves across geographies, experiences, and ways of seeing. Their poems reveal how words can hold multiple realities, opening up Worlds Within Worlds through translation, memory, and imagination. \nThe event will feature readings from Perennial: The Red River Book of 21st Century Hindi Poetry (Red River, 2025), edited by Sourav Roy and Tuhin Bhowal; So That You Know (HarperCollins, 2025) by Mani Rao; and The Book of Blue (Red River, 2024) by Atreyee Majumder. Together, these books offer distinct yet connected perspectives on how poetry continues to shape and question the world we inhabit. \nThe session will conclude with a conversation among the poets and an audience Q&A. \n",
    "url": "https://bangaloreinternationalcentre.org/event/worlds-within-worlds/",
    "keywords": [
      "Books",
      "Language",
      "Literature",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "hi",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-51-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "81636-1763665200-1763670600@bangaloreinternationalcentre.org",
    "name": "Raga Play",
    "startDate": "2025-11-20T19:00:00+05:30",
    "endDate": "2025-11-20T20:30:00+05:30",
    "description": "The evening unfolds as a journey between two emotional worlds: one introspective, the other unrestrained. \nSitarist Snehesh Nag, known for his soulful precision and fluid expressiveness, is joined by Shrivatsa Koulgi on tabla for a performance that explores the duality of Hindustani raga music. The “serious” raga invites quiet reflection, bound by structure and emotional gravity, while the “light” raga celebrates freedom by weaving playful turns, folk colours, and spontaneous joy. \nTogether, they create a conversation between depth and delight, discipline and abandon; a meeting point of heart and art. \nIn collaboration with:\n      \n",
    "url": "https://bangaloreinternationalcentre.org/event/raga-play/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Raga Play"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/RP-20-Thumbnail.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "81739-1763895600-1763901000@bangaloreinternationalcentre.org",
    "name": "Exploring the Speculative City",
    "startDate": "2025-11-23T11:00:00+05:30",
    "endDate": "2025-11-23T12:30:00+05:30",
    "description": "Over the past two decades, Bengaluru’s exploding real estate sector and massive infrastructure investments have led to land speculation targeting working-class neighborhoods and agricultural land for development. Chronicles of a Global City turns Bengaluru inside out to examine its “world-city” transformation that stimulated rapid urbanization and unbounded growth. Moving the spotlight away from the urban elites and the new middle class, the essays in the volume explore how people caught up in the whirlwinds of change in Bengaluru—from construction laborers, street vendors, domestic workers, and platform delivery workers to small-time property brokers, petty landlords, and local politicians—experience, struggle, aspire, invent, strive and speculate to make a livable city for themselves. \nGrounded in long-term ethnographic research, the volume introduces the idea of “speculative urbanism” to reveal the complex entanglements of finance, real estate, livelihoods, and ecology in Bengaluru’s unfolding futures. \nThe discussion features contributors to the volume and two discussants, followed by a Q&A with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/exploring-the-speculative-city/",
    "keywords": [
      "Bangalore",
      "Books",
      "Cities",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-92.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "81742-1763222400-1763231400@bangaloreinternationalcentre.org",
    "name": "Taboos at the Table",
    "startDate": "2025-11-15T16:00:00+05:30",
    "endDate": "2025-11-15T18:30:00+05:30",
    "description": "Who gets to eat what, how, and with whom? \nIn South Asia, food has never been just about sustenance, but rather about hierarchy, belonging, and belief. From caste-based taboos of purity and pollution to colonial notions of civility and hygiene, every meal tells a story of power and exclusion. \nThis session unpacks the politics of the plate: tracing Ambedkar’s critique in Beef, Brahmins, and Broken Men, the Islamic philosophies of fasting and prohibition, and the gendered labour that sustains domestic kitchens. It will also examine how global veganism intersects (and sometimes clashes) with South Asian histories of food, faith, and resistance. \nAn exploration of what it means to eat ethically, communally, and consciously in a world where the simple act of sharing food remains deeply political. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/taboos-at-the-table/",
    "keywords": [
      "Food",
      "Politics",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-48-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "81919-1763895600-1763899200@bangaloreinternationalcentre.org",
    "name": "\"Shhh… Listen!\"",
    "startDate": "2025-11-23T11:00:00+05:30",
    "endDate": "2025-11-23T12:00:00+05:30",
    "description": "Beneath the rhythm of drums and the sweep of dance, a quiet plea rises from the marshes, the reeds, and the frog king. \n\nShhh… Listen! is a powerful, multidisciplinary performance that gives voice to the voiceless: our vanishing wetlands, their unseen creatures, and the communities most affected by their loss. At its heart lies a tale of beauty and loss: a vibrant marshland silenced by pollution and bulldozers, yet still whispering a call to renewal. Through music, movement, and myth, Shhh… Listen! reminds us that the wetlands are not wastelands, but living, breathing worlds, waiting to be heard again. \nThrough Kattaikkuttu, Parai, Oyilattam, Oppari, and Bharatanatyam, performers from historically marginalised communities embody both the living pulse of nature and the pain of its erasure. Their art, rooted in resilience and reverence, becomes an act of remembrance and protest, linking ecological destruction with social injustice. \nAt once an ecological lament and a deeply human one, Shhh… Listen! bridges the fates of land and life. A poetic call to listen anew; to the whispers of the earth, the silenced voices of its keepers, and the music that still stirs beneath the mud and rain. \nCredits\nArtistic Director: Sangeeta Isvaran\nScript: Shrilakshmi Sridhar, Sangeeta Isvaran\nLyrics: Thilagavathi Palani\nPerformaned by: The Katradi Youth Dance Theatre \nThis performance is part of the larger Coexistence Mela at BIC on Nov 22 and 23. You can find the complete program here. \nPresented by: \n     \n       \n",
    "url": "https://bangaloreinternationalcentre.org/event/shhh-listen/",
    "keywords": [
      "Culture",
      "Dance",
      "Environment",
      "Heritage",
      "Music",
      "Performing Arts",
      "Sustainability",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "\"Shhh… Listen!\""
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-50-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "81976-1763578800-1763584200@bangaloreinternationalcentre.org",
    "name": "Sounds From the Library (#6)",
    "startDate": "2025-11-19T19:00:00+05:30",
    "endDate": "2025-11-19T20:30:00+05:30",
    "description": "Sounds From The Library returns for its sixth edition! \nAn intimate evening where conversation and performance intertwine in the cozy, listener-focused space of the BIC library. This hybrid series spotlights emerging voices from the Indian music scene, all past longlisted artists from the Toto Awards for Music. \nFrom the hills of Karbi Anglong, Assam, Chokamkuru Langneh brings his signature blend of alt-rock and indie-pop. Arjun C, from New Delhi, crafts guitar-led synth bops that meld 80s nu-disco, alt-R&B, and synth-pop into playful, heartfelt, and irresistibly groovy tunes. Tying it all together is Jishnu Dasgupta, bassist and manager of Swarathma. A storyteller and performer, Jishnu adds wit, warmth, and rhythm to this intimate evening of music and conversation. \nMore than a gig, Sounds From The Library invites audiences into the creative lives of the artists; offering insight into their inspirations, processes, and personal journeys. With music that moves and conversations that linger, this is a rare chance to experience live performance in its most thoughtful form. \n\nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sounds-from-the-library-6/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sounds From the Library (#6)"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-93.jpg"
  }
]