[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65520-1731090600-1731096000@bangaloreinternationalcentre.org",
    "name": "Kuvempu Turns 120",
    "startDate": "2024-11-08T18:30:00+05:30",
    "endDate": "2024-11-08T20:00:00+05:30",
    "description": "The text of Kuvempu’s epic Kannada novel, Malegalalli Madumagalu (1967), and the recent translation, Bride in the Hills by Vanamala Viswanatha (Penguin Random House, 2024), will be discussed by an eminent panel of scholars, writers and the translator. \nSet in 1893 in the Malnad region of the Western Ghats with its majestic Sahyadri ranges, dense forests, and river Tunga, Kuvempu’s Malegalalli Madumagalu (Bride in the Hills) describes the saga of not one young woman but many, of varied hues, who aspire for love and fulfilment in marriage, in a self-serving, male feudal order. An organic network of interrelated stories, the well-known Kannada writer Devanoora Mahadeva locates the novel in the epic tradition of the Mahabharata and Tolstoy’s War and Peace. This woman-centric text weaves together the touching plight of young couples in love, such as Gutti and Timmi, from a Dalit community living on the ghats; Aita and Pinchalu, migrant labourers from below the ghats, and Mukundayya and Chinnamma from the land-owning Shudra caste. Fired from within by their love – the most powerful agent of change – these young people seek a life of freedom and dignity, leading to the transformation of the larger community. Their heartening stories are juxtaposed against the travails of hapless Nagakka and scheming Venkatanna, sickly Deyi and brute Chinkra, and gullible Kaveri and lecherous Devayya. All of them are, in different ways, up against the repressive regimes of the decadent landlords, who manipulate traditional feudal practices as well as the modern apparatus of a colonial state.  \nTrue to its claim as an epic novel, Kuvempu’s text with its multiple narrative strands vividly enacts its mission statement in the epigraph: “Here, no one is important; no one is unimportant; nothing is insignificant!” Every sentient and insentient thing – the degenerate Chinkra, orphan Dharmu, Huliya the dog, Biri the cat, the evergreen forest, the Hulikal Peak – has a place and a purpose in this narrative. Imbued with an ecological consciousness, the novel offers a veritable biodiversity register of the Malnad region. Kuvempu presents a ‘view from below’, a subaltern perspective which also takes in the world of the wealthy and powerful. \nWinner of the first Sahitya Akademi award in 1955 and the Jnanpith in 1967, Kuvempu (Kuppali Venkatappa Puttappa 1904-1994) inaugurated the non-brahmin era in modern Kannada writing. Kuvempu’s versatile oeuvre includes a vast body of poetry, plays, novels, children’s writing, essays and an autobiography. While his poetic epic ‘Shri Ramayana Darshanam’ is a radical rewriting of the Valmiki epic drawing from the Jaina tradition, the two novels, The Kanur House (made into a film by Girish Karnad) and Bride in the Hills, are modern novels set in the late 19th and early 20th centuries. Inspired by Tolstoy’s expansive canvas and Tagore’s unique Indian ethos, this first significant Shudra writer and an iconic figure in Kannada culture, has sculpted an entirely regional epic novel in Bride in the Hills. \nImage Credits\nBook Cover: MS Murthy and Jay Gosney\nHeader: A Malnad Landscape, Photo courtesy Girish Kasaravalli\nPhoto of Amit Chaudhuri by Richard Lofthouse/University of Oxford \nIn collaboration with: Rashtrakavi Kuvempu Pratishthana, Kuppali (Devangi, Thirthahalli, Shivamogga) \n\n\n \n\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/kuvempu-turns-120/",
    "keywords": [
      "Books",
      "Culture",
      "Fiction",
      "Language",
      "Literature"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-4_POSTER-6.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65822-1731241800-1731244500@bangaloreinternationalcentre.org",
    "name": "ಕರ್ನಾಟಕದ ಅಡಿಗೆಗಳು | Cuisines of Karnataka",
    "startDate": "2024-11-10T12:30:00+05:30",
    "endDate": "2024-11-10T13:15:00+05:30",
    "description": "This presentation describes the diverse food culture of the state, as represented in its main cuisines of the regional, ethnic and religious communities in Karnataka. Some of the well-known cuisines are the Uttara Karnataka Cuisine, the Udupi Coastal Cuisine, Kodava Cuisine, Catholic Mangalorean Cuisine and Nawayathi Muslim Cuisine.  This does not preclude many other cuisines, which often overlap, having common geographies and food habits. \nಈ ಉಪನ್ಯಾಸವು ಕರ್ನಾಟಕದ ಪ್ರಾದೇಶಿಕ, ಜನಾಂಗೀಯ ಮತ್ತು ಧಾರ್ಮಿಕ ಸಮುದಾಯಗಳ ಮುಖ್ಯ ಪಾಕಪದ್ಧತಿಗಳಲ್ಲಿ ಪ್ರತಿಬಿಂಬಿತವಾಗುವ ರಾಜ್ಯದ ವೈವಿಧ್ಯಮಯ ಆಹಾರ ಸಂಸ್ಕೃತಿಯನ್ನು ವಿವರಿಸುತ್ತದೆ. ಸುಪ್ರಸಿದ್ಧ ಪಾಕಪದ್ಧತಿಗಳಲ್ಲಿ ಉತ್ತರ ಕರ್ನಾಟಕದ ಪಾಕಪದ್ಧತಿ, ಉಡುಪಿ ಕರಾವಳಿ ಪಾಕಪದ್ಧತಿ, ಕೊಡವ ಪಾಕಪದ್ಧತಿ, ಕ್ಯಾಥೊಲಿಕ್ ಮಂಗಳೂರು ಪಾಕಪದ್ಧತಿ ಮತ್ತು ನವಾಯತಿ ಮುಸ್ಲಿಂ ಪಾಕಪದ್ಧತಿಗಳು ಸೇರಿವೆ. ಆದರೆ ಇದು ಇತರ ಅನೇಕ ಪಾಕಪದ್ಧತಿಗಳನ್ನು ಹೊರತುಪಡಿಸುವುದಿಲ್ಲ, ಏಕೆಂದರೆ ಸಾಮಾನ್ಯ ಭೌಗೋಳಿಕ ಪ್ರದೇಶಗಳು ಮತ್ತು ಆಹಾರ ಪದ್ಧತಿಗಳನ್ನು ಹೊಂದಿರುವ ಕಾರಣ ಈ ಪಾಕಪದ್ಧತಿಗಳು ಹಲವು ಬಾರಿ ಒಂದಕ್ಕೊಂದು ಹೊಂದಿಕೊಳ್ಳುತ್ತವೆ. \nWith support from \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/karnatakada-adigegalu/",
    "keywords": [
      "Food",
      "Heritage",
      "Krishna to Kaveri"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-638.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "65599-1731196800-1731283199@bangaloreinternationalcentre.org",
    "name": "ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ | Krishna to Kaveri",
    "startDate": "2024-11-10T05:30:00+05:30",
    "endDate": "2024-11-11T05:30:00+05:30",
    "description": "ಕರ್ನಾಟಕವು ಹಲವು ವೈವಿಧ್ಯತೆಗಳ ನಾಡು. ಅದೇ ಅದರ ಅಸ್ಮಿತೆ. ಹಲವು ಸಂಸ್ಕೃತಿಗಳು ಮತ್ತು ಭಾಷೆಗಳೊಂದಿಗೆ ಜೀವ ಮಿಡಿಯುವ ಚಿತ್ರಚಿತ್ತಾರದ ನಮ್ಮ ವಿಶಾಲ ಕರ್ನಾಟಕದ ಸುತ್ತ ಪಯಣಿಸೋಣ ಬನ್ನಿ. ಕರ್ನಾಟಕದ ಉದ್ದಗಲಗಳಲ್ಲಿ ಅದರ ಭೂಭಾಗವನ್ನು, ಸಮುದಾಯಗಳನ್ನು ಮತ್ತು ಅನುಭವಗಳನ್ನು ತಮ್ಮ ಮಡಿಲೊಳಗಿಟ್ಟುಕೊಂಡ ಶಕ್ತಿಶಾಲಿ ನದಿಗಳಾದ ಕೃಷ್ಣೆ, ಕಾವೇರಿಯರಿಂದ ನಮ್ಮ ಉತ್ಸವವು ಪ್ರೇರಿತವಾಗಿದೆ. ಅಂತೆಯೇ “ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿಯವರೆಗೆ” ಎಂಬ ಈ ನಮ್ಮ ಪ್ರಸ್ತುತಿ. \nಕೃಷ್ಣೆ ಮತ್ತು ಕಾವೇರಿಯೆಂಬ ಎರಡು ನದಿಗಳು ಈ ರಾಜ್ಯದ ವಿವಿಧ ಭೂಭಾಗಗಳ ಉದ್ದಕ್ಕೂ ಹರಿಯುತ್ತಿರುವ ಹಾಗೆಯೇ ನಮ್ಮ ಹಬ್ಬವು ಕರ್ನಾಟಕದ ವಿವಿಧ ಸಂಸ್ಕೃತಿ ಮತ್ತು ಭಾಷೆಗಳೊಂದಿಗೆ ಕೊಂಡಿಯನ್ನು ಬೆಸೆಯುವ ಆಶಯವನ್ನು ಹೊಂದಿದೆ. ಈ ಜೀವದಾಯಿನಿ ನದಿಗಳು ವಿಸ್ತೃತ ಭೂಭಾಗ, ಸಮೃದ್ಧ ವೈವಿಧ್ಯತೆ ಮತ್ತು ಸಮನ್ವಯಿತ ಸ್ವರೂಪದ ಈ ರಾಜ್ಯಕ್ಕೆ ಒಂದು ಸಶಕ್ತ ರೂಪಕವಾಗಬಲ್ಲವು. \nಜೀವಜಾಲಕ್ಕೆ ಹೊಸಚೈತನ್ಯವನ್ನು ನೀಡುವ ಈ ಪವಿತ್ರ ನದಿಗಳನ್ನು ಮಾದರಿಯಾಗಿಸಿಕೊಂಡು ನಾವು ನಮ್ಮ ಈ ಹಬ್ಬವನ್ನು ಮರುಹುಟ್ಟು ಹಾಗೂ ಮರುಚೈತನ್ಯವೆಂಬ ಎರಡು ಪರಿಕಲ್ಪನೆಗಳ ಸುತ್ತ ಸಂಯೋಜಿಸಿದ್ದೇವೆ. ಈ ನೆಲದ ಸಾಂಪ್ರದಾಯಿಕ ಕಲಾ ಪ್ರಕಾರಗಳು, ಪದ್ಧತಿಗಳು, ಮತ್ತು ಆಚರಣೆಗಳು ಸಮಕಾಲೀನ ಸಂದರ್ಭದಲ್ಲಿ ಎಷ್ಟು ಮಹತ್ವವಾಗುತ್ತವೆ ಎನ್ನುವುದನ್ನು ತಿಳಿಯಪಡಿಸುತ್ತ ಈ ಎಲ್ಲವುಗಳಿಗೆ ಹೊಸಜೀವವನ್ನು ಕಲ್ಪಿಸುವ ಆಶಯ ನಮ್ಮದು.\nಸಂಸ್ಕೃತಿಗಳು ಒಂದರೊಳಗೊಂದು ಬೆರೆತು ಬೆಳೆಯುವ ನೆಲ ಕರ್ನಾಟಕ. ಅದರ ಅಸ್ಮಿತೆಯನ್ನು ರೂಪಿಸುವ ನದಿಗಳ ಹಾಗೆ. ರಾಜ್ಯದ ಈ ಮೂಲಗುಣಕ್ಕೆ ಚೈತನ್ಯವನ್ನು ತುಂಬುವ ಸಂಭ್ರಮಾಚರಣೆಯಲ್ಲಿ ನೀವೂ ಜೊತೆಯಾಗಿ. \nಅಜೀಂ ಪ್ರೇಮ್‌ಜಿ ವಿಶ್ವವಿದ್ಯಾಲಯವು ಬೆಂಗಳೂರು ಅಂತರರಾಷ್ಟ್ರೀಯ ಕೇಂದ್ರದ ಸಹಭಾಗಿತ್ವದಲ್ಲಿ ಈ ಹಬ್ಬವನ್ನು ಪ್ರಸ್ತುತಪಡಿಸುತ್ತಿದೆ. \nJourney through the heart of Karnataka as we explore the vibrant tapestry of cultures and languages that define this diverse state. Our festival, “Krishna to Kaveri,” draws inspiration from the mighty rivers that cradle Karnataka’s landscapes, communities, and experiences. \nJust as the Krishna and Kaveri rivers traverse geographies, our festival aims to bridge the myriad cultures and languages of Karnataka. These life-giving waters serve as a powerful metaphor for the state’s expansive terrain, rich diversity, and syncretic nature. \nTaking our cue from the rejuvenating powers of these sacred rivers, our event curation focuses on revival and revitalisation. We aim to breathe new life into traditional art forms, customs, and practices, ensuring their relevance in contemporary times. \nJoin us for two days of immersive experiences as we celebrate the essence of Karnataka – a land where cultures converge and flourish, much like the rivers that shape its identity. \nPresented by Azim Premji University in collaboration with Bangalore International Centre \nSchedule: \nFor Day 1 | Saturday, November 9, See Here \nDay 2 | Sunday, November 10 \n11:00 am | Auditorium \nAbhimanyu at War \nAn episode from the Mahabharata performed in Yakshagana by Gana Sabha Group, Udupi \n12:00 noon | Seminar Halls \nGrowing Together: Empowering Adolescents through Understanding and Inclusivity \nA lecture by child psychologist Prof. Malavika Kapur. \n12:30 pm | Library \nHidden Kitchens of Karnataka \nSession 1: Karnatakada Adigegalu \nThis presentation by author Geetha Rao describes the diverse food culture of the state, as represented in its main cuisines of the regional, ethnic and religious communities in Karnataka. Some of the well-known cuisines are the Uttara Karnataka Cuisine, the Udupi Coastal Cuisine, Kodava Cuisine, Catholic Mangalorean Cuisine and Nawayathi Muslim Cuisine.  This does not preclude many other cuisines, which often overlap, having common geographies and food habits. \nSession 2: The Art of Foraging \nArtist, Community builder and farmer Suresh Kumar provides an insight into foraging practices of communities on the outskirts of urban Bangalore. This workshop consists of a presentation followed by a demonstration of select recipes which participants can partake of. \n3:00 pm | Seminar Halls \nA Offering of Knowledge: Book Release \nLaunch of six Kannada books on Education enabled by Azim Premji University in collaboration with various publishing houses.    \nMadhava Peraje, Aravinda Chokkadi, and Ashok H.S. will talk about the books to be launched by Prof.O.L.Nagabhushanaswamy. \n3:30 pm | Library \nWorkshop on Kawand Quilt Making \nLed by Girija Siddhi, this workshop is an experience of Siddhi cultural heritage through patchwork quilting made from pieces of old cloth or worn-out clothing. \n4:00 pm | Auditorium \nMelodic Roots: Exploring Karnataka’s Carnatic Traditions \nBangalore musician Chitra Srikrishna presents an immersive journey through the rich tapestry of carnatic classical music in Karnataka, tracing its evolution from ancient times to the present day. The program showcases the musical compositions that have emerged from this culturally vibrant region, highlighting the contributions of legendary musicians and composers who have shaped the Carnatic tradition. \n5:30 pm | Seminar Halls \nEvolution of Kannada Consciousness and Jnanapith Awardees \nA panel explores the evolution of Kannada literary consciousness through the lens of Karnataka’s eight Jnanpith awardees. Scholars M S Asha Devi, Devu Pattar, and K Sathyanarayana, chaired by Prof. Basavaraja Kalgudi, discuss the significant contributions and lasting impact of these literary giants. The session examines how these laureates have shaped Kannada literature while reflecting the cultural and social consciousness of their times.” \n6:00 pm | Amphitheatre \nA Standup set by Sonu Venugopal \n7:30 pm | Auditorium \nKayaka \nA fusion concert by an ensemble comprising artists across genres, styles and language. Led by M D Pallavi and Bruce Lee Mani, Kayaka plays with powerful poetry and song from thousand-year Indian traditions, to bring them into\na contemporary frame. \nOngoing Throughout the Festival \n10:00 am to 8:00 pm \nExhibition | Through the Building \nKarnataka Vaibhava: Treasures & Turning Points \nIn collaboration with Shashidhar Adapa \nFood Festival | Terrace \nFlavour Fair \nAnchored by Coracle with Chef Tresa \nExperiential Interactions with Artisans | Ground Floor Foyer \nHand in Hand \nGuided by Master Artisans \n  \nಎರಡನೆಯ ದಿನ | ಭಾನುವಾರ, ನವೆಂಬರ್ 10 \nಬೆಳಗ್ಗೆ 11 ಗಂಟೆಗೆ | ಆಡಿಟೋರಿಯಂ \nಅಭಿಮನ್ಯು ಕಾಳಗ \nಮಹಾಭಾರತದ ಒಂದು ಪ್ರಸಂಗವನ್ನು ಯಕ್ಷಗಾನದ ಮೂಲಕ ಪ್ರಸ್ತುತಪಡಿಸಲಾಗುತ್ತದೆ. \nಮಧ್ಯಾಹ್ನ 12:00 ಗಂಟೆಗೆ | ಸೆಮಿನಾರ್ ಹಾಲ್ \nಜೊತೆಗೂಡಿ ಬೆಳೆಯುವುದು: ಹದಿಹರೆಯದವರನ್ನು ಅರ್ಥಮಾಡಿಕೊಂಡು ಸಬಲೀಕರಿಸುವುದು ಮತ್ತು\nಒಳಗೊಳ್ಳುವುದು \nಮಕ್ಕಳ ಮನೋವಿಜ್ಞಾನಿ ಪ್ರೊಫೆಸರ್ ಮಾಲವಿಕಾ ಕಪೂರ್‌ವರಿಂದ ಉಪನ್ಯಾಸ. \nಮಧ್ಯಾಹ್ನ 12:30 | ಲೈಬ್ರೆರಿ \nಮನೆ-ಮನೆಯ ರುಚಿಯ ರಹಸ್ಯಗಳು \nಕಾರ್ಯಕ್ರಮ ೧: ಕರ್ನಾಟಕದ ಅಡಿಗೆಗಳು \nಗೀತಾ ರಾವ್ ಅವರಿಂದ ಈ ಉಪನ್ಯಾಸವು ಕರ್ನಾಟಕದ ಪ್ರಾದೇಶಿಕ, ಜನಾಂಗೀಯ ಮತ್ತು ಧಾರ್ಮಿಕ ಸಮುದಾಯಗಳ ಮುಖ್ಯ ಪಾಕಪದ್ಧತಿಗಳಲ್ಲಿ ಪ್ರತಿಬಿಂಬಿತವಾಗುವ ರಾಜ್ಯದ ವೈವಿಧ್ಯಮಯ ಆಹಾರ ಸಂಸ್ಕೃತಿಯನ್ನು ವಿವರಿಸುತ್ತದೆ. ಸುಪ್ರಸಿದ್ಧ ಪಾಕಪದ್ಧತಿಗಳಲ್ಲಿ ಉತ್ತರ ಕರ್ನಾಟಕದ ಪಾಕಪದ್ಧತಿ, ಉಡುಪಿ ಕರಾವಳಿ ಪಾಕಪದ್ಧತಿ, ಕೊಡವ ಪಾಕಪದ್ಧತಿ, ಕ್ಯಾಥೊಲಿಕ್ ಮಂಗಳೂರು ಪಾಕಪದ್ಧತಿ ಮತ್ತು ನವಾಯತಿ ಮುಸ್ಲಿಂ ಪಾಕಪದ್ಧತಿಗಳು ಸೇರಿವೆ. \nಕಾರ್ಯಕ್ರಮ ೨: ಆಹಾರ ಸಂಗ್ರಹಣೆಯ ಕಲೆ \nಕಲಾವಿದರೂ ರೈತರೂ ಆಗಿರುವ ಸುರೇಶ್‌ಕುಮಾರ್ ಸಮುದಾಯ ಕಟ್ಟುವವರೂ ಹೌದು. ಬೆಂಗಳೂರಿನಲ್ಲಿ ನಗರಪ್ರದೇಶದ ಹೊರವಲಯದಲ್ಲಿ ಕಾಡು ಸೊಪ್ಪುಗಳಿಂದ ಅಡುಗೆ ಮಾಡುವ ಸಮುದಾಯಗಳ ಆಹಾರ ಪದ್ದತಿಗಳ ಬಗೆಗೆ ಈ ಕಾರ್ಯಾಗಾರದಲ್ಲಿ ಒಳನೋಟಗಳನ್ನು ಕೊಡುತ್ತಾರೆ. ಈ ಕಾರ್ಯಾಗಾರದಲ್ಲಿ ಅಂತಹ ಅಡುಗೆ ಪದ್ದತಿಯನ್ನು ಕುರಿತ ವಿವರಗಳ ಮಂಡನೆಯ ಜೊತೆಗೆ ಆಯ್ದ ಅಡುಗೆಗಳ ಪ್ರಾತ್ಯಕ್ಷಿಕೆಯೂ ಇರುತ್ತದೆ. ಆಸಕ್ತರು ಭಾಗವಹಿಸಬಹುದು. \nಮಧ್ಯಾಹ್ನ 3:00 ಗಂಟೆಗೆ | ಸೆಮಿನಾರ್ ಹಾಲ್ \nಪುಸ್ತಕ ಬಿಡುಗಡೆ \nಅಜೀಂ ಪ್ರೇಮ್‌ಜಿ ವಿಶ್ವವಿದ್ಯಾಲಯದ ಪ್ರಯತ್ನದೊಂದಿಗೆ ಪ್ರಕಟಗೊಂಡ ಕನ್ನಡದ ಕೆಲವು ಶೈಕ್ಷಣಿಕ ಪುಸ್ತಕಗಳ ಸಂಗ್ರಹವನ್ನು ಪ್ರೊಫೆಸರ್ ಓ.ಎಲ್.ನಾಗಭೂಷಣಸ್ವಾಮಿ ಬಿಡುಗಡೆ ಮಾಡುತ್ತಾರೆ. \nಮಧ್ಯಾಹ್ನ 3:30 | ಲೈಬ್ರೆರಿ\nಬಟ್ಟೆಯ ಕೌದಿ ಕಲೆಯ ಕಾರ್ಯಾಗಾರ \nಕೌದಿಯೆಂದರೆ ಹರಿದ ಅಥವಾ ಮಾಸಲಾದ ಬಟ್ಟೆಗಳ ತುಂಡುಗಳನ್ನು ಹೊಲಿದು ಮಾಡುವ ʼಕ್ವಿಲ್ಟ್.’ ಸಿದ್ದಿ ಸಾಂಸ್ಕೃತಿಕ ಪರಂಪರೆಯ ಭಾಗವಾದ ಈ ಕಲೆಯನ್ನು ಕುರಿತು ಒಂದು ಕಾರ್ಯಾಗಾರವನ್ನು ಗೀತಾ ಸಿದ್ದಿಯವರು ನಡೆಸಿಕೊಡುತ್ತಾರೆ. \nಸಂಜೆ 4:00 | ಆಡಿಟೋರಿಯಂ\nಗಾನ ಮಾಧುರ್ಯದ ಮೂಲ: ಕರ್ನಾಟಕದ ಕರ್ನಾಟಕಿ ಸಂಗೀತ ಪರಂಪರೆಯತ್ತ ಒಂದು ನೋಟ \nಬೆಂಗಳೂರಿನ ಗಾನಕಲಾವಿದೆ ಚಿತ್ರಾ ಶ್ರೀಕೃಷ್ಣರವರು ಕರ್ನಾಟಕ ಶಾಸ್ತ್ರೀಯ ಸಂಗೀತದ ಒಂದು ಸಮೃದ್ಧ ಪರಂಪರೆಯ ಪಯಣದಲ್ಲಿ ನಮ್ಮನ್ನು ತಲ್ಲೀನಗೊಳಿಸಲಿದ್ದಾರೆ. ಈ ಸಂಗೀತ ಪರಂಪರೆಯ ಹುಟ್ಟು ಮತ್ತು ಬೆಳವಣಿಗೆಯಿಂದ ಹಿಡಿದು ಇವತ್ತಿನ ಸ್ವರೂಪ, ಲಕ್ಷಣಗಳ ಬಗೆಗಿನ ಒಂದು ಸಮೃದ್ಧ\nಅನುಭವಕ್ಕೆ ಅವರು ಕರೆದೊಯ್ಯುತ್ತಾರೆ. ಸಾಂಸ್ಕೃತಿಕವಾಗಿ ಸಮೃದ್ಧವಾದ ಈ ರಾಜ್ಯದಲ್ಲಿ ಉದಯಿಸಿದ ರಾಗಗಳನ್ನು ಪರಿಚಯಿಸುವುದರ ಜೊತೆಗೆ ಕರ್ನಾಟಕ ಸಂಗೀತ ಪರಂಪರೆಯನ್ನು ಕಟ್ಟಿದ ಸುಪ್ರಸಿದ್ಧ ಗಾಯಕರು ಮತ್ತು ಸಂಗೀತಗಾರರ ಕೊಡುಗೆಗಳನ್ನು ಕುರಿತೂ ಮಾತನಾಡಲಿದ್ದಾರೆ. \nಸಂಜೆ 5:30 ಗಂಟೆಗೆ | ಸೆಮಿನಾರ್ ಹಾಲ್\nಕನ್ನಡ ಪ್ರಜ್ಞೆಯ ವಿಕಾಸ ಮತ್ತು ಜ್ಞಾನಪೀಠ ಪುರಸ್ಕೃತರು \nಈ ಗೋಷ್ಠಿಯಲ್ಲಿ ಕರ್ನಾಟಕದ ಎಂಟು ಜ್ಞಾನಪೀಠ ಪ್ರಶಸ್ತಿ ಪುರಸ್ಕೃತರ ದೃಷ್ಟಿಕೋನಗಳ ಮೂಲಕ ಕನ್ನಡ ಸಾಹಿತ್ಯ ಪ್ರಜ್ಞೆಯ ವಿಕಾಸವನ್ನು ಕುರಿತು ಸಾಹಿತಿಗಳು ಚರ್ಚಿಸಲಿದ್ದಾರೆ. ಕನ್ನಡ ಪ್ರಜ್ಞೆಯ ವಿಕಾಸಕ್ಕೆ ಮತ್ತು ತಮ್ಮ ಕಾಲದ ಸಾಂಸ್ಕೃತಿಕ ಮತ್ತು ಸಾಮಾಜಿಕ ಲೋಕದೃಷ್ಟಿಯನ್ನು ಬೆಳೆಸಲು ಕರ್ನಾಟಕದ ಜ್ಞಾನಪೀಠ ಪ್ರಶಸ್ತಿ ಪುರಸ್ಕೃತರು ನೀಡಿದ ಮಹತ್ವದ ಕೊಡುಗೆಗಳು ಮತ್ತು ಅವರ ವಿಚಾರಗಳಿಂದ ಆದ ಸುದೀರ್ಘ ಪರಿಣಾಮಗಳನ್ನು ಕುರಿತು ಪ್ರೊಫೆಸರ್ ಬಸವರಾಜ ಕಲ್ಗುಡಿಯವರ ಅಧ್ಯಕ್ಷತೆಯಲ್ಲಿ ಎಂ.ಎಸ್.ಆಶಾದೇವಿ, ದೇವು ಪತ್ತಾರ, ಎಚ್.ಎಲ್. ಪುಷ್ಪಾ, ಮತ್ತು ಕೆ.ಸತ್ಯನಾರಾಯಣ\nಚರ್ಚಿಸಲಿದ್ದಾರೆ. \nಸಂಜೆ 6:00 ಗಂಟೆಗೆ | ಆಂಪಿಥಿಯೇಟರ್ \nಸೋನು ವೇಣುಗೋಪಾಲ್ ಅವರಿಂದ ಸ್ಟ್ಯಾಂಡ್‌ಅಪ್ ಕಾಮೆಡಿ. \nಸಂಜೆ 7:30 ಗಂಟೆಗೆ | ಆಡಿಟೋರಿಯಂ\nಕಾಯಕ \nಎಂ.ಡಿ. ಪಲ್ಲವಿ ಮತ್ತು ಬ್ರೂಸ್‌ಲೀ ಮಣಿ ನೇತೃತ್ವದ ತಂಡವು ವಿವಿಧ ಪ್ರಕಾರಗಳು, ಶೈಲಿಗಳು ಮತ್ತು ಭಾಷೆಗಳ ಕಲಾವಿದರೊಂದಿಗೆ ಒಂದು ಫ್ಯೂಶನ್ ಸಂಗೀತ ಕಚೇರಿಯನ್ನು ನಡೆಸಿಕೊಡಲಿದೆ. ಭಾರತೀಯ ಪರಂಪರೆಯ ಸಾವಿರ ವರ್ಷಗಳ ಹಿಂದಿನ ಸಶಕ್ತ ಕಾವ್ಯ ಮತ್ತು ಹಾಡುಗಳನ್ನು ಸಮಕಾಲೀನ\nಚೌಕಟ್ಟಿಗೆ ಅಳವಡಿಸುವ ಪ್ರಯತ್ನವನ್ನು ಕಾಯಕ ಮಾಡಲಿದೆ. \nಎರಡು ದಿನಗಳೂ ನಡೆಯುವ ಕಾರ್ಯಕ್ರಮಗಳು:\nಬೆಳಗ್ಗೆ 10:00 ಗಂಟೆಯಿಂದ ರಾತ್ರಿ 8:00 ಗಂಟೆಯವರೆಗೆ\nಕಲಾ ಪ್ರದರ್ಶನ | ವಿವಿಧ ಅಂತಸ್ತುಗಳಲ್ಲಿ \nಕರ್ನಾಟಕ ವೈಭವ: ಹಿರಿಮೆಗಳು ಮತ್ತು ಸಂಧಿಕಾಲಗಳು\nಶಶಿಧರ ಅಡಪರವರ ಸಹಭಾಗಿತ್ವದಲ್ಲಿ \nಆಹಾರ ಮೇಳ (ಫುಡ್ ಫೆಸ್ಟಿವಲ್) | ಟೆರೇಸ್‌ನಲ್ಲಿ\nರುಚಿಗಳ ಜಾತ್ರೆ\nಚೆಫ್ ಟ್ರೆಸಾರವರ ಕೊರಾಕಲ್‌ನಿಂದ ಆಯೋಜನೆ. \nಕುಶಲಕರ್ಮಿಗಳೊಂದಿಗೆ ಮುಖಾಮುಖಿಯಾಗಿ ಅವರ ಅನುಭವಗಳನ್ನು ಕೇಳಿ ತಿಳಿಯಿರಿ | ನೆಲ ಅಂತಸ್ತಿನ ಪ್ರಾಂಗಣದಲ್ಲಿ\nಕರಕುಶಲತೆಯ ಕೈಪಿಡಿ\nಕುಶಲಕರ್ಮಿಗಳ ಮಾರ್ಗದರ್ಶನದಲ್ಲಿ \n  \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/krishna-2/",
    "keywords": [
      "Culture",
      "Krishna to Kaveri",
      "Language",
      "Music",
      "Performing Arts",
      "Theatre",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ | Krishna to Kaveri"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-5_POSTER.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65602-1731153600-1731258000@bangaloreinternationalcentre.org",
    "name": "ಶಿಬಿರಗಳು | Workshops at 'Krishna to Kaveri'",
    "startDate": "2024-11-09T12:00:00+05:30",
    "endDate": "2024-11-10T17:00:00+05:30",
    "description": "Day 1 \n12:00 noon | Library \nWorkshop on Chittara | ಚಿತ್ತಾರ ಕಲಾ ಕಾರ್ಯಾಗಾರ \nThe Chittara Mural artform, established by the Deevaru Community, is a traditional phenomenon that involves intricate stories and geometric patterns. These murals were traditionally painted on house walls during auspicious occasions, welcoming deities during festivals and ceremonies. Join artist Pavitra Mohan to learn the basics of this 500-year-old artform, its cultural significance, and engage with its practitioners. In collaboration with Center for Revival of Indigenous Art \nದೇವರು ಸಮುದಾಯದಿಂದ ಸ್ಥಾಪಿತವಾದ ಚಿತ್ತಾರ ಗೋಡೆ ಚಿತ್ರಕಲೆ ಸೂಕ್ಷ್ಮ ಕಥನಗಳು ಮತ್ತು ಜ್ಯಾಮಿತೀಯ ವಿನ್ಯಾಸಗಳನ್ನು ಒಳಗೊಂಡ ಸಾಂಪ್ರದಾಯಿಕ ಕಲೆ. ಹಬ್ಬ-ಹರಿದಿನಗಳಂತಹ ಶುಭ ಸಂದರ್ಭಗಳಲ್ಲಿ ದೇವರ ಆಗಮನಕ್ಕಾಗಿ ಮನೆಯ ಗೋಡೆಗಳ ಮೇಲೆ ಈ ಚಿತ್ರಗಳನ್ನು ಬರೆಯುತ್ತಿದ್ದರು. ೫೦೦ ವರ್ಷಗಳ ಇತಿಹಾಸ ಹೊಂದಿರುವ ಈ ಕಲೆಯ ಮೂಲಾಂಶಗಳನ್ನು, ಸಾಂಸ್ಕೃತಿಕ ಮಹತ್ವವನ್ನು ಕಲಾವಿದೆ ಪವಿತ್ರ ಮೋಹನ್ ಅವರೊಂದಿಗೆ ಕಲಿಯಿರಿ. ಸೆಂಟರ್ ಫಾರ್ ರಿವೈವಲ್ ಆಫ್ ಇಂಡಿಜಿನಸ್ ಆರ್ಟ್ ಸಹಯೋಗದಲ್ಲಿ \n \n  \n  \nDay 2 \nಆಹಾರ ಸಂಗ್ರಹಣೆಯ ಕಲೆ | The Art of Foraging \n1:20 pm – 3:00 pm \nIn his presentation “The Art of Foraging: A Living Heritage,” Suresh Kumar G explores the deep-rooted traditions of foraging in local communities, particularly focusing on the Sarjapur region. Through his research and community engagement, he documents how traditional knowledge of wild edibles has been passed down through generations, primarily by women elders. The presentation highlights the scientific basis behind seasonal foraging practices and their crucial role in maintaining biodiversity. Kumar emphasizes how urbanization threatens both the foraging grounds and this ancestral knowledge, while also discussing his “Sarjapur Curries” project, which works to preserve and document these practices for future generations. His work bridges traditional ecological knowledge with contemporary food security concerns, demonstrating the continued relevance of foraging practices in modern times. \nಜೀವಂತ ಪರಂಪರೆ ಎಂಬ ಉಪನ್ಯಾಸದಲ್ಲಿ ಸುರೇಶ್ ಕುಮಾರ್ ಜಿ ಅವರು ಸ್ಥಳೀಯ ಸಮುದಾಯಗಳ, ವಿಶೇಷವಾಗಿ ಸರ್ಜಾಪುರ ಪ್ರದೇಶದ ಆಹಾರ ಸಂಗ್ರಹಣೆಯ ಬೇರೂರಿದ ಸಂಪ್ರದಾಯಗಳನ್ನು ಅನ್ವೇಷಿಸುತ್ತಾರೆ. ಅವರ ಸಂಶೋಧನೆ ಮತ್ತು ಸಮುದಾಯ ಸಹಭಾಗಿತ್ವದ ಮೂಲಕ, ಕಾಡು ತಿನಿಸುಗಳ ಸಾಂಪ್ರದಾಯಿಕ ಜ್ಞಾನವು, ಮುಖ್ಯವಾಗಿ ಹಿರಿಯ ಮಹಿಳೆಯರ ಮೂಲಕ ಪೀಳಿಗೆಗಳಿಂದ ಪೀಳಿಗೆಗಳಿಗೆ ಹೇಗೆ ವರ್ಗಾವಣೆಯಾಗಿದೆ ಎಂಬುದನ್ನು ದಾಖಲಿಸುತ್ತಾರೆ. ಋತುಮಾನ ಆಧಾರಿತ ಆಹಾರ ಸಂಗ್ರಹಣೆಯ ಪದ್ಧತಿಗಳ ಹಿಂದಿನ ವೈಜ್ಞಾನಿಕ ಆಧಾರ ಮತ್ತು ಜೈವವೈವಿಧ್ಯತೆ ಕಾಪಾಡುವಲ್ಲಿ ಅವುಗಳ ಪ್ರಮುಖ ಪಾತ್ರವನ್ನು ಈ ಉಪನ್ಯಾಸ ಒತ್ತಿಹೇಳುತ್ತದೆ. ನಗರೀಕರಣವು ಆಹಾರ ಸಂಗ್ರಹಣೆಯ ಪ್ರದೇಶಗಳಿಗೆ ಮತ್ತು ಈ ಪೂರ್ವಿಕರ ಜ್ಞಾನಕ್ಕೆ ಒಡ್ಡುತ್ತಿರುವ ಅಪಾಯವನ್ನು ಕುಮಾರ್ ಪ್ರಸ್ತಾಪಿಸುತ್ತಾರೆ, ಜೊತೆಗೆ ಮುಂದಿನ ಪೀಳಿಗೆಗಾಗಿ ಈ ಪದ್ಧತಿಗಳನ್ನು ಸಂರಕ್ಷಿಸಿ ದಾಖಲಿಸುವ ತಮ್ಮ “ಸರ್ಜಾಪುರ ಕರಿಗಳು” ಯೋಜನೆಯ ಬಗ್ಗೆ ಚರ್ಚಿಸುತ್ತಾರೆ. ಅವರ ಕೆಲಸವು ಸಾಂಪ್ರದಾಯಿಕ ಪರಿಸರ ಜ್ಞಾನವನ್ನು ಸಮಕಾಲೀನ ಆಹಾರ ಭದ್ರತೆಯ ಕಾಳಜಿಗಳೊಂದಿಗೆ ಸೇತುವೆ ನಿರ್ಮಿಸುತ್ತದೆ, ಆಧುನಿಕ ಕಾಲದಲ್ಲಿ ಆಹಾರ ಸಂಗ್ರಹಣೆ ಪದ್ಧತಿಗಳ ನಿರಂತರ ಪ್ರಸ್ತುತತೆಯನ್ನು ತೋರಿಸುತ್ತದೆ. \n  \n3:30 pm | Library \nWorkshop on Kawand Quilt Making |ಕವಂದ್ ರಜಾಯಿ ತಯಾರಿಕೆಯ ಕಾರ್ಯಾಗಾರ \nLed by Girija Siddhi, this workshop is an experience of Siddhi cultural heritage through patchwork quilting made from pieces of old cloth or worn-out clothing. The traditional Kawand is a hand-stitched quilt, made from scrap fabric, including old saris. This style of quilt-making involves working from the outside into the centre. The size of the quilt is dictated by the size of the backing and batting, as it is appliqued and quilted at the same time. \nಗಿರಿಜಾ ಸಿದ್ಧಿ ಅವರ ಮಾರ್ಗದರ್ಶನದಲ್ಲಿ ನಡೆಯುವ ಈ ಕಾರ್ಯಾಗಾರವು ಹಳೆಯ ಬಟ್ಟೆಗಳ ತುಣುಕುಗಳಿಂದ ತಯಾರಿಸುವ ತುಂಡುಗಣ್ಣಿನ ರಜಾಯಿ ಮೂಲಕ ಸಿದ್ಧಿ ಸಂಸ್ಕೃತಿಯ ಪರಂಪರೆಯನ್ನು ಅನುಭವಿಸುವ ಅವಕಾಶ. ಸಾಂಪ್ರದಾಯಿಕ ಕವಂದ್ ಎಂಬುದು ಹಳೆಯ ಸೀರೆಗಳೂ ಸೇರಿದಂತೆ ಬಟ್ಟೆಯ ತುಣುಕುಗಳನ್ನು ಕೈಯಿಂದ ಹೊಲಿದು ಮಾಡುವ ರಜಾಯಿ. ಈ ರಜಾಯಿಯನ್ನು ಹೊರಗಿನಿಂದ ಒಳಗಿನ ಕಡೆಗೆ ಹೊಲಿಯುತ್ತಾ ಮಾಡಲಾಗುತ್ತದೆ. ಅಡಿಗಾಗಿ ಬಳಸುವ ಬಟ್ಟೆಯ ಗಾತ್ರವೇ ರಜಾಯಿಯ ಗಾತ್ರವನ್ನು ನಿರ್ಧರಿಸುತ್ತದೆ, ಏಕೆಂದರೆ ಅಲಂಕರಣೆ ಮತ್ತು ರಜಾಯಿ ಹೊಲಿಗೆ ಏಕಕಾಲದಲ್ಲಿ ನಡೆಯುತ್ತದೆ. \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%b6%e0%b2%bf%e0%b2%ac%e0%b2%bf%e0%b2%b0%e0%b2%97%e0%b2%b3%e0%b3%81-workshops-at-krishna-to-kaveri/",
    "keywords": [
      "Heritage",
      "History",
      "Krishna to Kaveri",
      "Language"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-644.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "65617-1731006000-1731011400@bangaloreinternationalcentre.org",
    "name": "Movement, Measure, and the Rains",
    "startDate": "2024-11-07T19:00:00+05:30",
    "endDate": "2024-11-07T20:30:00+05:30",
    "description": "In this concert, Amit Chaudhuri dwells on the style, mood and legacy of the Kunwar Shyam gharana. The compositions of the Kunwar Shyam gharana are mainly the work of the eponymous Kunwar Shyam (1850-1910) and of the extraordinary virtuoso in that lineage, Pandit Laxman Prasad Jaipurwale (1915-1977). Kunwar Shyam engendered a number of Malhars, testifying to an obsession with the rainy season. Laxman Prasad, one of the great khayal composers of the twentieth century, created slow khayals as well as a style in alap that constitute a form of meditative exploration; jod ragas (that is, new ragas that result from combining existing ragas); and fast bandishes and taranas whose jewelled intricacy embody movement, dance, and measure. Together, the compositions and their mood are characterised by a ‘balance of gravity and play’ (the phrase is from Amit Chaudhuri’s poem ‘Sweet Shop’). \nAmit Chaudhuri was the principal student in Hindustani classical music of Laxman Prasad’s son, Pandit Govind Prasad Jaipurwale (1944-88), himself an exceptional artist. Chaudhuri will perform some of the compositions handed down to him by his teacher and his family between 1978-88. He will also perform a new jod raga he created himself – again, in the spirit of conceptual play – called ‘Rammohan’, borrowing the ‘Ram’ from raga Ramkali and the ‘Mohan’ from raga Mohankauns. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/movement-measure-and-the-rains/",
    "keywords": [
      "Culture",
      "History",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Movement, Measure, and the Rains"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-25.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65548-1731254400-1731259800@bangaloreinternationalcentre.org",
    "name": "ಗಾನ ಮಾಧುರ್ಯದ ಮೂಲ | Melodic Roots",
    "startDate": "2024-11-10T16:00:00+05:30",
    "endDate": "2024-11-10T17:30:00+05:30",
    "description": "Bangalore musician Chitra Srikrishna presents an immersive journey through the rich tapestry of carnatic classical music in Karnataka, tracing its evolution from ancient times to the present day. The program showcases the musical compositions that have emerged from this culturally vibrant region, highlighting the contributions of legendary musicians and composers who have shaped the Carnatic tradition. \nThrough a carefully curated selection of songs interspersed with engaging narration and evocative visuals, the program provides context for audiences to gain insight into how carnatic music has become an integral part of Karnataka’s cultural identity. It also examines the interplay between classical traditions and folk elements. It demonstrates how this musical heritage continues to evolve while preserving its core essence. \nBy showcasing the depth and diversity of Karnataka’s Carnatic legacy, Melodic Roots aims to foster a deeper appreciation for the state’s musical heritage and its enduring impact on Indian classical music. Chitra Srikrishna (vocal & narration) will be accompanied by Viswajith Mattur (violin) and Phanindra Bhaskara (mridangam). \nಬೆಂಗಳೂರಿನ ಗಾಯಕಿ ಚಿತ್ರಾ ಶ್ರೀಕೃಷ್ಣ ಅವರು ಕರ್ಣಾಟಕ ಸಂಗೀತದ ಸಮೃದ್ಧ ಪರಂಪರೆಯ ಮೂಲಕ ಒಂದು ಆಳವಾದ ಪಯಣವನ್ನು ಪ್ರಸ್ತುತಪಡಿಸುತ್ತಾರೆ. ಪುರಾತನ ಕಾಲದಿಂದ ಇಂದಿನವರೆಗಿನ ಈ ಸಂಗೀತದ ವಿಕಾಸವನ್ನು ಅನ್ವೇಷಿಸುತ್ತಾರೆ. ಈ ಸಾಂಸ್ಕೃತಿಕ ಸಮೃದ್ಧ ಪ್ರದೇಶದಿಂದ ಹುಟ್ಟಿಬಂದ ಸಂಗೀತ ರಚನೆಗಳನ್ನು ಪ್ರಸ್ತುತಪಡಿಸುತ್ತಾ, ಕರ್ಣಾಟಕ ಸಂಗೀತ ಪರಂಪರೆಯನ್ನು ರೂಪಿಸಿದ ಅಜರಾಮರ ಸಂಗೀತಗಾರರು ಮತ್ತು ವಾಗ್ಗೇಯಕಾರರ ಕೊಡುಗೆಗಳನ್ನು ಬೆಳಕಿಗೆ ತರುತ್ತಾರೆ. \nಜಾಗೃತಿಮೂಡಿಸುವ ಕಥನ ಮತ್ತು ಭಾವಪೂರ್ಣ ದೃಶ್ಯಗಳೊಂದಿಗೆ ಸೂಕ್ತವಾಗಿ ಆಯ್ದ ಗೀತೆಗಳ ಮೂಲಕ, ಕರ್ಣಾಟಕ ಸಂಗೀತವು ಕರ್ನಾಟಕದ ಸಾಂಸ್ಕೃತಿಕ ಗುರುತಿನ ಅವಿಭಾಜ್ಯ ಅಂಗವಾಗಿ ಹೇಗೆ ಬೆಳೆದುಬಂದಿದೆ ಎಂಬುದನ್ನು ಪ್ರೇಕ್ಷಕರು ಅರ್ಥಮಾಡಿಕೊಳ್ಳಲು ಈ ಕಾರ್ಯಕ್ರಮವು ಸಂದರ್ಭವನ್ನು ಒದಗಿಸುತ್ತದೆ. ಶಾಸ್ತ್ರೀಯ ಪರಂಪರೆಗಳು ಮತ್ತು ಜಾನಪದ ಅಂಶಗಳ ನಡುವಿನ ಅನ್ಯೋನ್ಯತೆಯನ್ನೂ ಇದು ಪರಿಶೀಲಿಸುತ್ತದೆ. ಈ ಸಂಗೀತ ಪರಂಪರೆಯು ತನ್ನ ಮೂಲ ಸತ್ವವನ್ನು ಕಾಪಾಡಿಕೊಂಡು ಹೇಗೆ ವಿಕಾಸಗೊಳ್ಳುತ್ತಿದೆ ಎಂಬುದನ್ನು ತೋರಿಸುತ್ತದೆ. \nಕರ್ನಾಟಕದ ಕರ್ಣಾಟಕ ಸಂಗೀತ ಪರಂಪರೆಯ ಆಳ ಮತ್ತು ವೈವಿಧ್ಯತೆಯನ್ನು ಪ್ರದರ್ಶಿಸುವ ಮೂಲಕ, ‘ಮೆಲೊಡಿಕ್ ರೂಟ್ಸ್’ ರಾಜ್ಯದ ಸಂಗೀತ ಪರಂಪರೆ ಮತ್ತು ಭಾರತೀಯ ಶಾಸ್ತ್ರೀಯ ಸಂಗೀತದ ಮೇಲೆ ಅದರ ಶಾಶ್ವತ ಪ್ರಭಾವದ ಬಗ್ಗೆ ಆಳವಾದ ಅಭಿಮಾನವನ್ನು ಬೆಳೆಸುವ ಗುರಿಯನ್ನು ಹೊಂದಿದೆ. ಚಿತ್ರಾ ಶ್ರೀಕೃಷ್ಣ (ಗಾಯನ & ಕಥನ) ಅವರೊಂದಿಗೆ ವಿಶ್ವಜಿತ್ ಮತ್ತೂರು (ವಯೊಲಿನ್) ಮತ್ತು ಫಣೀಂದ್ರ ಭಾಸ್ಕರ (ಮೃದಂಗ) ಸಹಕರಿಸುತ್ತಾರೆ. \nWith support from \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/melodic-roots/",
    "keywords": [
      "Heritage",
      "Krishna to Kaveri",
      "Music"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-632.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65337-1730919600-1730925000@bangaloreinternationalcentre.org",
    "name": "Musings in Mohiniyattam",
    "startDate": "2024-11-06T19:00:00+05:30",
    "endDate": "2024-11-06T20:30:00+05:30",
    "description": "Vijayalakshmi will present a unique programme, comprising items that are both traditional and very innovative and singular. They will exemplify and underline the quintessential spirit and technique of Mohiniyattam and have been specially selected, to offer a pan-Indian experience of the dance form to the audience. Be it a “traditional’’ pan-Indian piece from the revered Jayadeva’s Gitagovinda, or a piece inspired by the traditional North Indian chaupai, or an excerpt from her Indo-American work called Rain, or from the soundtrack of Beyond Grace, a documentary feature film about her Guru-mother and her, by LA based film makers. \nHer diverse repertoire truly reflects her pan-Indian and global perspective towards Mohiniyattam, besides also highlighting the inherent richness of Mohiniyattam’s vocabulary, which lends itself with equal ease to both traditional and multicultural/world music. The presentation underlines the dance form’s immense versatility and the diverse multicultural influences that have shaped Vijayalakshmi, the artist and the person. Besides her own multi-dimensional forms of creative expression and her unique collaborations and inspirations both in India and abroad. \nThe session will conclude with a brief Q&A, moderated by Masoom Parmar, who is a Bangalore based artist, curator and arts manager. \nIn collaboration with: \n \n  \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/musings-in-mohiniyattam/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-24.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65935-1731240000-1731245400@bangaloreinternationalcentre.org",
    "name": "ಬೆಳೆಯೋಣ ಬೆರೆಯೋಣ | Growing Together",
    "startDate": "2024-11-10T12:00:00+05:30",
    "endDate": "2024-11-10T13:30:00+05:30",
    "description": "Adolescence is linked to puberty, a stage in which the adolescent becomes integrated with society of adults. This stage is accompanied by dramatic biological, intellectual, and psychological changes from 10–19 years. 40% of the Indian population belongs to this group. They may face problems individually or as a group. Individually, they need for privacy, family relationships, reflection on gender, and changes in circumstances. As a group, they face study problems, withdrawal, acting out, absenteeism, and problems with peers. \nFamily problems consist of discipline, relations with siblings, feelings of victimized, hypersensitivity, immediate rebellion against grown-ups, and lack of self-control. \nMental health problems consist of sexuality, normal or otherwise, gender identity, school dropout, drugs or alcohol, internet, and gaming addiction. In addition, they may have various disabilities. An intensive approach is needed to deal with them. Better awareness and education is required along with brain and psychological parameters. How to bring about well-being among the adolescents is and should be the leader in what we need to focus on. \nಹದಿಹರೆಯ: ಹದಿಹರೆಯವು, ಯುವಜನರ ವಯಸ್ಸಿನ ಗುಂಪಿನಲ್ಲಿ ಪ್ರಾಮುಖ್ಯತೆಯ ಒಂದು ವಿಶೇಷತೆಯಾಗಿದೆ. ಹದಿಹರೆಯವನ್ನು ಈಗ ವಿಶ್ವದಾದ್ಯಂತ ಗುರುತಿಸಲಾಗಿದೆ. ಈ ವಿಷಯವು ತರುಣರಲ್ಲಿ ಹಲವಾರು ದೈಹಿಕ, ಭಾವನಾತ್ಮಕ ಮತ್ತು ಮಾನಸಿಕ ಬದಲಾವಣೆಗಳನ್ನು ತರುತ್ತದೆ. ಇದು 10 – 19 ವರ್ಷಗಳ ನಡುವೆ ನಡೆಯುತ್ತದೆ. ಭಾರತದ 40% ಜನಸಂಖ್ಯೆಯು ಈ ವರ್ಗಕ್ಕೆ ಸೇರುತ್ತದೆ. ಈ ವಿಷಯದಲ್ಲಿ ಸಾಮಾಜಿಕ ಮಟ್ಟದಲ್ಲಿ ಅರ್ಥ ಮಾಡಿಕೊಳ್ಳಬೇಕಾದ ಯುವಜನರ ಸಮಸ್ಯೆಗಳನ್ನು ಎದುರಿಸುವ ಸಾಧ್ಯತೆಗಳಿರುತ್ತದೆ. ಏಕೆಂದರೆ ಅವಶ್ಯಕತೆ, ವೈಯಕ್ತಿಕ ಸಂಬಂಧಗಳು, ಆರ್ಥಿಕ ಸ್ಥಿತಿ, ತಂದೆತಾಯಿ ಭಾವನೆ ಮತ್ತು ಪರಿಸರ ಈ ನಡುವೆ ಬದಲಾವಣೆಗಳು ಇರುವ ಸಾಮಾಜಿಕ ಸಮಸ್ಯೆಗಳು. \nಒಂದು ವರ್ಗದಲ್ಲಿ ಯುವಜನರ ಕಲಿಕೆಯ ಸಂಬಂಧಿತ ಸಮಸ್ಯೆಗಳು, ನಡವಳಿಕೆಯ ಸಮಸ್ಯೆಗಳು, ಮಾನಸಿಕ ಸಮಸ್ಯೆಗಳು, ಲೈಂಗಿಕ ತಂದೆತಾಯಿ ಶುದ್ಧತೆ, ಸಾಮಾಜಿಕತೆಯಿಂದಿನ ಸಮಸ್ಯೆಗಳು ಇವುಗಳನ್ನು ಎದುರಿಸುತ್ತಾರೆ. \nಕುಟುಂಬದಲ್ಲಿನ ಸಮಸ್ಯೆಗಳಿಂದಾಗಿ, ಲೈಂಗಿಕತೆ, ಒಡನಾಟದಿಂದಾಗಿನ ಸಂಬಂಧ, ದುರುಪಯೋಗ ಎನ್ನುವ ಭಾವನೆ, ಅತಿಯಾದ ಸ್ವಾತಂತ್ರ್ಯಗಳಿಗಾಗಿ, ಅಪರಿಪಕ್ವತೆ, ದುಡುಕುವವರನ್ನು ಸ್ವೀಕರಿಸುವುದು ಮುಂತಾದ ಸಮಸ್ಯೆಗಳು ಇಲ್ಲದಿರುವುದು. \nಹದಿಹರೆಯದ ಸಮಯದ ಮಾನಸಿಕ ಸಮಸ್ಯೆಗಳು ಹಿಂಸಾತ್ಮಕತೆ (ಮಾನಸಿಕ ಅಥವಾ ಅಮಾನಸಿಕ), ಅವರ ಹಿಂಸಾತ್ಮಕ ಗುರುತು, ಲೈಂಗಿಕತೆ, ಮದ್ಯ – ಮಾದಕ ವಸ್ತು ಸೇವನ, ಇಂಟರ್ನೆಟ್ ಮುಂತಾದ ದುರ್ಬಳಕೆಯ ಚಟಗಳ ಇವುಗಳನ್ನು ಒಳಗೊಂಡಿರುತ್ತದೆ. ಇವುಗಳಿಂದಾಗಿ, ಇವರುಗಳು ಹಲವು ತರಹದ ಅಂಗವಿಕಲತೆಗಳನ್ನು ಕೂಡ ಹೊಂದಿರಬಹುದು. ಇವುಗಳನ್ನು ನಿರ್ವಹಿಸಲು ಒಂದು ಸಮೀಕ್ಷಾತ್ಮಕ ಅಧ್ಯಯನದ ಅವಶ್ಯಕತೆ ಇದೆ. ಆದರೆ, ಇವುಗಳಲ್ಲಿ ಕೆಲವು ಮುಂತಾದ ಮಾನಸಿಕ ಮುನ್ನಡೆಗಳಲ್ಲಿ ಕಣ್ಣು ಮುಂತಾದ ಸ್ಥಿತಿಯಲ್ಲಿ ಮಕ್ಕಳು ಹೆಚ್ಚು ಹೆಚ್ಚಾಗಿರುತ್ತಾರೆ. ನಾವು ಯುವಜನರಲ್ಲಿ ಸಮಗ್ರ ಆರೋಗ್ಯ ಸೇವೆಯನ್ನು ಮತ್ತು ಪರ್ಯಾಯ ಸೇವೆಯಿಂದ ಪ್ರತಿಸ್ಥಾಪಿಸುವ ಕ್ರಮವನ್ನು ಹೆಚ್ಚೀಕರಿಸುವ ಕಡೆಗೆ ಗಮನ ನೀಡಬೇಕು. \nWith Support from \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/growing-together/",
    "keywords": [
      "Health & Wellness",
      "Krishna to Kaveri",
      "Public Health",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTERs.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65826-1731259800-1731265200@bangaloreinternationalcentre.org",
    "name": "ಕನ್ನಡ ಪ್ರಜ್ಞೆಯ ವಿಕಾಸ ಮತ್ತು ಜ್ಞಾನಪೀಠ ಪುರಸ್ಕೃತರು | Evolution of Kannada Consciousness and Jnanapith Awardees",
    "startDate": "2024-11-10T17:30:00+05:30",
    "endDate": "2024-11-10T19:00:00+05:30",
    "description": "ಕರ್ನಾಟಕವು ಕನ್ನಡ ಭಾಷೆ-ಭಾಷಿಕರೇ ಪ್ರಧಾನವಾಗಿರುವ ರಾಜ್ಯ ಮಾತ್ರವಲ್ಲ.  ಶಿಕ್ಷಣ, ವಿಜ್ಞಾನ, ಅಭಿವೃದ್ಧಿ, ಸಾಮಾಜಿಕ ನ್ಯಾಯ – ಸೌಹಾರ್ದಗಳನ್ನು ಕುರಿತು ವಿಶಿಷ್ಟವಾದ ಮನೋಧರ್ಮ ಮತ್ತು ಪ್ರಜ್ಞೆಯನ್ನು ರೂಢಿಸಿಕೊಂಡಿರುವ ಭೂ ಪ್ರದೇಶ. ಹೀಗೆ ಈ ರಾಜ್ಯ ರೂಪುಗೊಳ್ಳುವಲ್ಲಿ ಈ ನೆಲದ ದಾರ್ಶನಿಕರು,  ಸಾಹಿತಿಗಳು, ವಿಜ್ಞಾನಿಗಳು, ಕುಶಲಕರ್ಮಿಗಳು , ಆಡಳಿತಗಾರರು, ತಮ್ಮದೇ ಆದ ಕೊಡುಗೆಗಳನ್ನು ನೀಡಿದ್ದಾರೆ. ಈ ಕೊಡುಗೆಗಳನ್ನು ಗುರುತಿಸಿ, ಸಮಕಾಲೀನ ಸಂದರ್ಭದಲ್ಲಿ ಅವರ ಚಿಂತನೆಗಳ ಮೌಲ್ಯವನ್ನು ಪರ್ಯಾಲೋಚಿಸುವ ಸಲುವಾಗಿ ಆರಂಭಿಕವಾಗಿ ಎಂಟು ಜ್ಞಾನಪೀಠ ಪ್ರಶಸ್ತಿ ವಿಜೇತರ ಕೊಡುಗೆ ಮತ್ತು ಅವರ ದೃಷ್ಟಿಕೋನಗಳನ್ನು ಕುರಿತು  ಚರ್ಚಿಸಿ ವಿಚಾರ ವಿಮರ್ಶೆಗೆ ಒಳಪಡೆಸಬೇಕೆನ್ನುವುದು ಈ ಗೋಷ್ಠಿಯ ಆಶಯ. ಈ ಗೋಷ್ಠಿಯಲ್ಲಿ ಭಾಗವಹಿಸುತ್ತಿರುವವರು ಲೇಖಕರು-ಚಿಂತಕರು ಕನ್ನಡದ  ಜ್ಞಾನಪೀಠ ಪ್ರಶಸ್ತಿ ವಿಜೇತ ಸಾಹಿತಿಗಳು ಕರ್ನಾಟಕವನ್ನು ಪರಿಕಲ್ಪಿಸಿಕೊಂಡ ಬಗೆ ಮತ್ತು ಅವರು ಕನ್ನಡ ಪ್ರಜ್ಞೆಯು ಮುಂದಿನ ದಿನಗಳಲ್ಲಿ ಹೇಗೆ ಕ್ರಿಯಾಶೀಲವಾಗಿರಬೇಕೆಂಬುದನ್ನು ಆಲೋಚಿಸಿದ್ದರು ಎನ್ನುವ ವಿಚಾರಗಳನ್ನು ಈ ಗೋಷ್ಠಿಯಲ್ಲಿ ಮುಂಡಿಸುತ್ತಾರೆ. \nKarnataka is not just a state belonging to the Kannada language and its speakers. It is a geographical domain that has assimilated its own unique perception of education, science, development, social justice and harmony. Many philosophers, literary figures, scientists, artisans and administrators from this land have given their own contributions in the process of building the state. The present session initiates and intends to reflect upon the perspectives of some of these eminent people. It intends to revisit eight Jnanpith recipients of Karnataka, identifies their contribution to the land of Karnataka, and hopes to discuss the relevance of their thoughts in the contemporary context.  Writers and thinkers who participate in the session present their thoughts regarding the way these Jnanpith recipients conceptualized Karnataka and the way they thought about revitalizing the spirit of the Kannada consciousness in future. \nWith support from \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/evolutionofkannada/",
    "keywords": [
      "Krishna to Kaveri",
      "Language",
      "Literature"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-641.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64974-1730917800-1730923200@bangaloreinternationalcentre.org",
    "name": "Thriving with AI",
    "startDate": "2024-11-06T18:30:00+05:30",
    "endDate": "2024-11-06T20:00:00+05:30",
    "description": "Ravi Bapna and Anindya Ghose, in their new MIT Press book Thrive: Maximizing Well-being in the Age of AI take on the challenge of demystifying AI for the layperson using examples from everyday life. Their hope is that by giving citizens agency and understanding in shaping AI we can get the most out of this newest industrial revolution. \nJoin Ravi Bapna in conversation with Narayan Ramachandran as they chart their way through the ‘House of AI,’ a framework that provides a holistic perspective of the different pillars and layers of AI. They will discuss the role of generative AI versus traditional AI, what barriers companies face in adopting this technology, how we should think about the future of work and reskilling the workforce, and what an agentic future looks like where AI will augment human intelligence and capacity. \nA Q & A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/thriving-with-ai/",
    "keywords": [
      "Society",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-626.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "65857-1731000600-1731004200@bangaloreinternationalcentre.org",
    "name": "Parai Aattam: Our Celebration, Our Protest",
    "startDate": "2024-11-07T17:30:00+05:30",
    "endDate": "2024-11-07T18:30:00+05:30",
    "description": "50 minutes | Tamil and English | Suitable for 5+ Years | Trigger Warning: High Intensity of Sound \nWhat does it mean to celebrate? What does it mean to protest? While standing the centre of Adavi’s world, where there is no right or wrong, where there are no rigid boundaries, no rules or conventions, the answer reveals itself: celebration is protest, and protest is celebration. \nCelebration and protest are not merely parts of life—they are life itself. Just as a heartbeat begins at birth and pulses until the end, Parai music lives alongside it. Even as the heart stops at death, the Parai continues to resonate. \nThrough Parai, we share the stories passed down across generations, recounting how this musical instrument evolved—from birth and rituals to caste, landscapes, and death—ultimately becoming a voice of liberation against oppression. We ask, who truly owns this music? \nParai’s essence is equality. There is no separation here; Parai belongs to everyone. Even the line between audience and performer dissolves. In this space, all are performers. We bring you this tool of equality.\nWe bring you the stories and songs of Parai as a shared performance. \nArtists: \nNaren, Veeramani, Rajasekar, Arputhan, Meghana, Jayapriya, Charun, Anush, Vanishree, Nandan, Ram \nWith Support from \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/parai-aattam-our-celebration-our-protest/",
    "keywords": [
      "Culture",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Parai Aattam: Our Celebration, Our Protest"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Untitled-design-10-7.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64979-1732042800-1732048200@bangaloreinternationalcentre.org",
    "name": "Akhyāt - Ākhyānā ",
    "startDate": "2024-11-19T19:00:00+05:30",
    "endDate": "2024-11-19T20:30:00+05:30",
    "description": "Words of inspiration from India’s first female teacher…  \nWritings of unabashed desire from the heart of Tamizh land…  \nQuestions of existentialism asked by Buddhist nuns…  \nProse that interrogates anthropocentrism… \nVerses that subvert gender roles and patriarchy…  \n…and more insight into the female perspective of desire, denouncement, faith and activism. Only this time, through poetry authored by women themselves! \nAkhyāt – Ākhyānā is an experiential exploration of rare multilingual poetry tactfully woven into a Bharatanatyam repertoire performed along with live musicians. This work stems from Divya’s diverse encounters with heart-wrenching poetic expressions of women from across timelines and geographies, in a quest to unearth narratives ‘by’, ‘for’ and ‘of’ women. \nCast:\nDance | Choreography | Script – Divya Ravi\nMusic composition | Vocals – Sharan Subramanian\nNattuvangam – DV Prasanna Kumar\nMridangam – Srihari Rangaswamy\nFlute – Vivek Krishna \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/akhyat-akhyana/",
    "keywords": [
      "Dance",
      "Performing Arts",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-629.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65909-1731168000-1731173400@bangaloreinternationalcentre.org",
    "name": "ಮಲೆನಾಡಿನ ಹುಲಿ, ಚಿರತೆಗಳ ಜಾಡಿನಲ್ಲಿ | Malenad: Bringing Big Cats Back from the Brink",
    "startDate": "2024-11-09T16:00:00+05:30",
    "endDate": "2024-11-09T17:30:00+05:30",
    "description": "Dr. Ullas Karanth began his story with his boyhood fascination with the spectacular “Tiger Culture” in Malenad, which led to his subsequent engagement of over six decades in scientifically understanding the ecology of big cats and working towards their recovery from the brink of extinction. During this journey, he pioneered several groundbreaking methodologies, including the application of chemical capture, radiotelemetry, and photographic-capture surveys of tigers and leopards. He also developed line transect and habitat occupancy sampling techniques for prey species. \nThroughout his career, Dr. Karanth actively engaged with government agencies and local communities to develop win-win solutions for wildlife recovery. He dedicated significant time to mentoring younger generations of passionate field conservationists, helping build the next wave of wildlife scientists in India. In his talks, he explores the societal framework that he believes is now necessary to balance nature protection with development. \nHis narrative represents not just a personal journey, but chronicles the evolution of scientific wildlife conservation in India, particularly in the Western Ghats. Dr. Karanth’s work has become foundational to modern tiger conservation methods, combining rigorous scientific methodology with practical conservation solutions. His emphasis on both scientific rigor and community engagement has set standards for wildlife conservation practices globally. \nಕರ್ನಾಟಕದ ಮಲೆನಾಡಿನ &#39;ಹುಲಿ ಸಂಸ್ಕೃತಿ&#39;ಯ ಬಗ್ಗೆ ನನಗೆ ಬಾಲ್ಯದಿಂದಲೇ ಇದ್ದ ಮೋಹ, ನಂತರ ನಾನು ದೊಡ್ಡ ಮಾರ್ಜಾಲಗಳ ಸಂಶೋಧನೆ ಹಾಗೂ ಸಂರಕ್ಷಣೆಯಲ್ಲಿ ಮಾಡಿದ ಕೆಲಸಗಳ ವಿವರಗಳನ್ನೂ ಇಲ್ಲಿ ನೀಡುತ್ತೆನೆ. ನಾನು ಹೇಗೆ ಸಂಶೋಧನೆಗಾಗಿ ಹುಲಿ ಚಿರತೆಗಳನ್ನು ಅರಿವಳಿಸಿ ಸೆರೆಹಿಡಿಯುವ ವಿಧಾನ, ಅವುಗಳ ಗಣತಿಗಾಗಿ ಕ್ಯಾಮೆರಾ ಟ್ರ್ಯಾಪ್ ಬಳಕೆ ಹಾಗೂ ಅವುಗಳ ಬಲಿಪ್ರಾಣಿಗಳ ಸಂಖ್ಯೆ ಮತ್ತು ವಿಸ್ತರಣೆ ತಿಳಿಯಲು ದೇಶದಲ್ಲಿ ಮೊದಲ ಬಾರಿಗೆ ರೂಪಿಸಿದ ವೈಜ್ಞಾನಿಕ ಕಾರ್ಯಕ್ರಮಗಳ ವಿವರಗಳೂ ಇಲ್ಲಿವೆ. ಸುಮಾರು ಅರುವತ್ತು ವರ್ಷಗಳ ಕಾಲ ನಾನು ಅರಣ್ಯ ಮತ್ತಿತರ ಸರಕಾರಿ ಇಲಾಖೆಗಳು, ಸರ್ಕಾರೇತರ ಸಂಸ್ಥೆಗಳೂ ಹಾಗೂ ಸ್ಥಳೀಯ ಜನಸಮುದಾಯಗಳ ಸಹಯೋಗದಲ್ಲಿ ನಡೆಸಿದ ವನ್ಯ ಸಂರಕ್ಷಣಾ ಕಾರ್ಯಗಳ ವಿವರಗಳೂ ಇಲ್ಲಿ ಸೇರಿವೆ. ಕೊನೆಗೆ ಇಂದಿನ ಕ್ಲಿಷ್ಟ ಪರಿಸ್ಥಿತಿಯಲ್ಲಿ ಹುಲಿ ಮತ್ತಿತರ ವನ್ಯ ಜೀವಿಗಳ ರಕ್ಷಣೆಯನ್ನೂ ಮಾನವ ಸಮಾಜದ ಪ್ರಗತಿ ಮಾತು ಅಭಿವ್ರದ್ಧಿ ಗಳನ್ನೂ ಆಧುನಿಕ ವಿಜ್ಞಾನ ಮತ್ತು ತಂತ್ರಜ್ಞಾನಗಳ ಬಳಕೆಯಿಂದ ಇನ್ನೂ ಹೆಚ್ಚು ಸಮರ್ಪಕವಾಗಿ ಮುಂದುರವರಿಸುವ ಬಗೆ\nಹೇಗೆಂದು ಕೆಲವು ಸಲಹೆಗಳನ್ನೂ ನಿಮ್ಮ ಮುಂದೆ ಇಡುತ್ತೇನೆ. \nWith support from \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/malenad/",
    "keywords": [
      "Environment",
      "Krishna to Kaveri",
      "Wildlife"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-637.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "65005-1731092400-1731097800@bangaloreinternationalcentre.org",
    "name": "The End",
    "startDate": "2024-11-08T19:00:00+05:30",
    "endDate": "2024-11-08T20:30:00+05:30",
    "description": "This is a BIC Elsewhere event at Shoonya – Centre for Art and Somatic Practices \n90 mins | English & Hindi\n \nA college romance slowly takes a turn for something complicated and traumatic. \nA young live-in couple begins to realize that maybe love isn’t all that you need\nto build a home with someone. \nDoubt, deceit, and the past come to haunt a marriage that is struggling to survive. \nAn anthology of 3 stories about 3 couples, ‘The End’ uses text, movement, music, and memory to understand what we look for in romance and relationships when the odds are stacked against us, when love starts making way for loss, and questions about desire and the need for control start popping up. How does one unlearn societal norms and expectations to build relationships that are authentic, nurturing, and filled with love still? \nWe meet these 3 couples near what they think is the end of their (love) stories. \nBut is it, really, The End? \nCredits: \nDesign & Direction: Nikhita Singh \nWriters: Nikhita Singh, Mitali Kalagi, Sambita De \nCast: Mitali Kalagi, Rituparna Sanyal, Kaustav Sinha, Aditya Kashyap \nMovement Director: Babusha Jain \nMusic: Hashparker (Harsh Choudhary) \nLyrics & Poetry: Madhumoy Satpathy \nAssistant Director: Rituparna Sanyal \nProduction Manager & Photographer: Divyansh Thada \nProduction Assistant: Sambita De \nCostume Design: Simran Jagdale \nSet Design: Nikhita Singh, Rituparna Sanyal, Vivek Jadhav \nLight Design: Nikhita Singh, Rahul Kumar \nPoster Design: Vighnesh Kharadkar, Debosmita Mazumdar \nSocial Media Design: Tanya Vaghela \nSocial Media Planning & Strategy: Divya Sundrani \nMarketing & Publicity: Dheeraj Dubey \nCreative Director for Visual Promos: Omkar Phatak \nOutreach & Brand Advocacy Partner: Centre for Contemporary Folklore \nSupported by Tamaasha Studio Foundation’s UsPaar Residency. \nThis is a BIC Elsewhere Event. \nWhile the majority of our events find a home at our premises in Domlur, BIC Elsewhere represents our commitment to bringing conversations, arts, and culture directly to diverse audiences. Through this initiative, we collaborate with various venues, extending the reach of our events beyond our own space. These partnerships not only breathe life into our gatherings but also play a crucial role in cultivating an environment for the flourishing of arts and culture in the city. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-end/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Shoonya – Center for Art and Somatic Practices, 4th Floor, B Block, Brahmananda Court, 37, Lal Bagh Main Rd, K.S. Garden, Raja Ram Mohanroy Extension, Sudhama Nagar, Bengaluru, Karnataka, 560027, India"
    },
    "inLanguage": "hi",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "The End"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-625.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "65453-1731160800-1731166200@bangaloreinternationalcentre.org",
    "name": "ಅದ್ಭುತ ರಾಮಾಯಣ | Adbhuta Ramayana",
    "startDate": "2024-11-09T14:00:00+05:30",
    "endDate": "2024-11-09T15:30:00+05:30",
    "description": "Kannada | 70 mins | Suitable for all ages \nಕನ್ನಡ | 70 ನಿಮಿಷಗಳು | ಎಲ್ಲಾ ವಯೋಮಾನದವರಿಗೂ ಸೂಕ್ತ \nಎಷ್ಟು ರಾಮಾಯಣಗಳು? ನೂರು, ಇನ್ನೂರು, ಮುನ್ನೂರು ಹೀಗೆ ಹಲವಾರು. ಬಹುಭಾಷಾ ವಿದ್ವಾಂಸ ಎ.ಕೆ. ರಾಮಾನುಜನ್, “ಮುನ್ನೂರು ರಾಮಾಯಣಗಳು: ಐದು ಉದಾಹರಣೆಗಳು ಮತ್ತು ಅನುವಾದದ ಬಗ್ಗೆ ಮೂರು ಯೋಚನೆಗಳು” ಎಂಬ ಲೇಖನವನ್ನು ಬರೆದಿದ್ದು, ಭಾರತ ಮತ್ತು ದಕ್ಷಿಣ ಏಷ್ಯಾದ ದೇಶಗಳಲ್ಲಿನ ಅನೇಕ ರಾಮಾಯಣಗಳ ಅಸ್ತಿತ್ವದ ಬಗ್ಗೆ ವಿದ್ವತ್ಪೂರ್ಣವಾಗಿ ವಿವರಿಸುತ್ತಾರೆ. ಈ ನಾಟಕವೂ ಅವುಗಳಲ್ಲಿ ಒಂದಾಗಿರಬಹುದು, ಮತ್ತು ಈ ಪ್ರದರ್ಶನವು ಈ ಲೇಖನದಿಂದ ಪ್ರೇರಿತವಾಗಿದೆ. \nವಾಲ್ಮೀಕಿ ರಾಮಾಯಣದುದ್ದಕ್ಕೂ, ಶ್ರೀ ರಾಮನು ಮುಖ್ಯ ಪಾತ್ರವಾಗಿ ಕೇಂದ್ರ ಸ್ಥಾನದಲ್ಲಿದ್ದಾನೆ. ಅನೇಕ ಜಾನಪದ ರಾಮಾಯಣಗಳು (ಚಿತ್ರಪಟ ರಾಮಾಯಣ, ರಾವಣ ಛಾಯ ಇತ್ಯಾದಿ) ಸೀತೆಯ ಕಥೆಯನ್ನು ಹೇಳುತ್ತವೆ. ಅವುಗಳಲ್ಲಿ ಅವಳು ಕೇಂದ್ರ ಸ್ಥಾನದಲ್ಲಿರುತ್ತಾಳೆ. ಅದ್ಭುತ ರಾಮಾಯಣದಲ್ಲಿ, ಸೀತೆಯೇ ನಾಯಕಿ. ಅವಳು ಕೇವಲ ಲಕ್ಷ್ಮೀ ದೇವಿಯ ಅವತಾರವಷ್ಟೇ ಅಲ್ಲ, ಪ್ರಕೃತಿ ಎಂದು ಕರೆಯಲ್ಪಡುವ ಸೃಷ್ಟಿಯ ಮೊದಲ ಶಕ್ತಿಯೂ ಆಗಿದ್ದಾಳೆ. ಸೀತೆಯೇ ಕಥೆಯ ಕೇಂದ್ರಬಿಂದು, ಮತ್ತು ಇದು ಸಾಂಪ್ರದಾಯಿಕವಾಗಿ ಪೋಷಿಸಲ್ಪಟ್ಟ ಮಹಿಳಾ ಶಕ್ತಿ, ಧೈರ್ಯ, ಶೌರ್ಯ, ಬಲ, ಸಾಮರ್ಥ್ಯ ಮತ್ತು ಸಾಧ್ಯತೆಗಳ ಶ್ರೇಷ್ಠತೆಯನ್ನು ಸ್ಥಾಪಿಸಲು ಪ್ರಯತ್ನಿಸುತ್ತದೆ. ಶ್ರೀ ರಾಮನು ತನ್ನ ಕಿರಿಯ ಸಹೋದರ ದಶಕಂಠ ರಾವಣನಿಗಿಂತ ಹತ್ತು ಪಟ್ಟು ಹೆಚ್ಚು ಶಕ್ತಿಶಾಲಿಯಾದ ಶತಕಂಠ ರಾವಣನನ್ನು ಸೋಲಿಸಲು ವಿಫಲನಾಗುತ್ತಾನೆ. ಸೀತೆ ಈ ಮಹಾ ರಾಕ್ಷಸನನ್ನು ಸೋಲಿಸಿ, ದುಷ್ಟ ರಾಕ್ಷಸರ ಧೈರ್ಯವನ್ನು ನಾಶಮಾಡಿ ಭೂಮಿಯಲ್ಲಿ ಶಾಂತಿ ನೆಲೆಸುವಂತೆ ಮಾಡುತ್ತಾಳೆ. \nಕಂದಗಲ್ ಹನುಮಂತ ರಾವ್ ಅವರ ಕಂಪನಿ ನಾಟಕದ ಆಧಾರದಲ್ಲಿ  \nನಿರ್ದೇಶನ: ರಜನಿ ಗರುಡ್  \nಗೊಂಬೆಯಾಟಕ್ಕೆ ರೂಪಿಸಿದವರು: ಪ್ರಕಾಶ್ ಗರುಡ್  \nಸಂಗೀತ: ರಾಘವ ಕಮ್ಮಾರ್  \nನಿರ್ಮಾಣ: ಗೊಂಬೆ ಮನೆ, ಧಾರವಾಡ \nಗೊಂಬೆ ಮನೆಯ ಕುರಿತು: \nಗೊಂಬೆ ಮನೆಯು ರಂಗಭೂಮಿ ಮತ್ತು ಗೊಂಬೆಯಾಟ ಎರಡರ ಅಭ್ಯಾಸ ಕೇಂದ್ರವಾಗಿದೆ. ರಂಗಭೂಮಿ ಕಲಾವಿದರಾದ ಡಾ. ಪ್ರಕಾಶ್ ಗರುಡ್ ಮತ್ತು ರಜನಿ ಗರುಡ್ ಅವರು 1996ರಲ್ಲಿ ಸ್ಥಾಪಿಸಿದ ಈ ಸಂಸ್ಥೆಯು ಕಳೆದ 25 ವರ್ಷಗಳಲ್ಲಿ ಸುಮಾರು 50 ನಾಟಕಗಳು ಮತ್ತು 15 ಗೊಂಬೆಯಾಟಗಳನ್ನು ನಿರ್ಮಿಸಿದೆ. ಧಾರವಾಡ ಮತ್ತು ರಾಜ್ಯದ ಇತರ ಭಾಗಗಳಲ್ಲಿ ಮಕ್ಕಳಿಗೆ ಮತ್ತು ಯುವ ಕಲಾವಿದರಿಗೆ ನಿಯಮಿತವಾಗಿ ರಂಗಭೂಮಿ ಮತ್ತು ಗೊಂಬೆಯಾಟದ ಕಾರ್ಯಾಗಾರಗಳನ್ನು ನಡೆಸುತ್ತದೆ. ಮುಖ್ಯ ತಂಡವು ಮೂಲತಃ ರಂಗಭೂಮಿಯಲ್ಲಿ ತರಬೇತಿ ಪಡೆದಿದೆ. \nಗೊಂಬೆ ಮನೆಯು ವಿವಿಧ ಸಂಸ್ಥೆಗಳ ಸಹಯೋಗದಲ್ಲಿ ಅನೇಕ ಯೋಜನೆಗಳನ್ನು ಕೈಗೊಂಡಿದೆ. ಇಂಡಿಯಾ ಫೌಂಡೇಶನ್ ಫಾರ್ ದಿ ಆರ್ಟ್ಸ್, ಬೆಂಗಳೂರು ಇವರ ಆರ್ಥಿಕ ನೆರವಿನೊಂದಿಗೆ, ವಿಶೇಷವಾಗಿ ಮಕ್ಕಳಿಗಾಗಿ ಸಮಕಾಲೀನ ಪ್ರೇಕ್ಷಕರಿಗಾಗಿ ಚರ್ಮದ ಗೊಂಬೆಯಾಟವನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸುವ ಕಲಾ ಯೋಜನೆಯಲ್ಲಿ ಸಹಭಾಗಿಯಾಗಿದೆ. ಸರ್ ರತನ್ ಟಾಟಾ ಟ್ರಸ್ಟ್, ಮುಂಬೈ ಇವರ ಸಹಯೋಗದಲ್ಲಿ ಪ್ರಾಥಮಿಕ ಶಾಲಾ ಮಕ್ಕಳಿಗಾಗಿ ಕಲಾ ಶಿಕ್ಷಣ ಯೋಜನೆಯನ್ನು ಕೈಗೊಂಡಿದೆ. ಜೊತೆಗೆ, ಸಂಗೀತ ನಾಟಕ ಅಕಾಡೆಮಿ, ನವದೆಹಲಿ ಆಯೋಜಿಸಿದ ಗೊಂಬೆಯಾಟ ಉತ್ಸವಗಳು ಮತ್ತು ತರಬೇತಿ ಕಾರ್ಯಕ್ರಮಗಳಲ್ಲಿ ಭಾಗವಹಿಸಿದೆ. ಕೇಂದ್ರ ಸಂಸ್ಕೃತಿ ಇಲಾಖೆ, ನವದೆಹಲಿ ಮತ್ತು ಕನ್ನಡ ಮತ್ತು ಸಂಸ್ಕೃತಿ ಇಲಾಖೆ, ಬೆಂಗಳೂರು ಇವರು ಅದರ ರಂಗಭೂಮಿ ಮತ್ತು ಗೊಂಬೆಯಾಟ ಪ್ರಯತ್ನಗಳಿಗೆ ಬೆಂಬಲ ನೀಡಿವೆ. \nಗೊಂಬೆ ಮನೆಯ ಗಮನಾರ್ಹ ಪ್ರಸ್ತುತಿಗಳಲ್ಲಿ ‘ಮಹಾಮಾಯಿ’, ‘ಅಂಜುಮಲ್ಲಿಗೆ’, ‘ಶಿವರಾತ್ರಿ’, ‘ಅಂಧಯುಗ’, ‘ಕಿಂಗ್ ಲಿಯರ್’ ಮತ್ತು ಮಕ್ಕಳ ನಾಟಕಗಳಾದ ‘ಪಂಜರ ಶಾಲೆ’, ‘ಪುಷ್ಪರಾಣಿ’, ಮತ್ತು ‘ಚಕ್ರವರ್ತಿಯ ಹೊಸ ಉಡುಪುಗಳು’ ಸೇರಿವೆ. ಗೊಂಬೆಯಾಟಗಳಲ್ಲಿ ‘ಗರ್ದಭ ಮನುಷ್ಯ ಪ್ರಹಸನ’, ‘ಹಕ್ಕಿ ಹಾಡು’, ‘ರೆಡ್ ಫ್ಲವರ್’, ‘ಆಕಟ ವಿಕಟ ವಿಲಕ್ಷಣ’, ‘ಪಾಪು ಬಾಪು’ ಮತ್ತು ‘ಅದ್ಭುತ ರಾಮಾಯಣ’ ಸೇರಿವೆ. \nಗೊಂಬೆ ಮನೆಯು ಭಾರತದಾದ್ಯಂತ ವಿವಿಧ ಉತ್ಸವಗಳು ಮತ್ತು ಕಾರ್ಯಕ್ರಮಗಳಲ್ಲಿ ಸಕ್ರಿಯವಾಗಿ ಭಾಗವಹಿಸಿದೆ. ಇವುಗಳಲ್ಲಿ ರಂಗಾಯಣ ಮೈಸೂರಿನ ಬಹುರೂಪಿ ಉತ್ಸವ (2007), ಧಾರವಾಡ ಉತ್ಸವ (2008), ನವದೆಹಲಿಯ ಐಎಫ್‌ಎ ಗೊಂಬೆಯಾಟ ಕಾರ್ಯಾಗಾರ (2007), ನವದೆಹಲಿ ಮತ್ತು ಲಕ್ನೋದ ಪುತುಲ್ ಯಾತ್ರ (2011), ತಿರುವನಂತಪುರದ ಅಭಿನಯ ರಂಗತಂಡ (2010), ಅಗರ್ತಲದ ಪುತುಲ್ ರಂಗ ಗಾಂಧಿ ಸಂಘ ಉತ್ಸವ (2018), ಮತ್ತು ರಾಷ್ಟ್ರೀಯ ನಾಟಕ ಶಾಲೆಯ ಬೆಂಗಳೂರು ಮತ್ತು ಮಂಗಳೂರಿನ ಮಳೆಬಿಲ್ಲು ಮಕ್ಕಳ ರಂಗೋತ್ಸವ (2011) ಸೇರಿವೆ. \nಇಂಡಿಯಾ ಫೌಂಡೇಶನ್ ಫಾರ್ ದಿ ಆರ್ಟ್ಸ್, ಬೆಂಗಳೂರು ಮತ್ತು ಗೋಯ್ಥೆ ಫೌಂಡೇಶನ್ ಬೆಂಗಳೂರು ಚಾಪ್ಟರ್‌ನ ಸಹಯೋಗದಲ್ಲಿ, ಗೊಂಬೆ ಮನೆಯು ಕರ್ನಾಟಕದ ಶಿಕ್ಷಕರಿಗಾಗಿ ಕಲಿ-ಕಲಿಸು ಕಲಾ ಶಿಕ್ಷಣ ಕಾರ್ಯಕ್ರಮದಡಿ 2012ರಲ್ಲಿ ಗೊಂಬೆಯಾಟ ಕಾರ್ಯಾಗಾರಗಳನ್ನು ಆಯೋಜಿಸಿತು. ನುನ್ಹೆಮ್ಸ್ & ಬೇಯರ್ಸ್ ಕಂಪನಿ ಮತ್ತು ಅಂತರರಾಷ್ಟ್ರೀಯ ಕಾರ್ಮಿಕ ಸಂಘಟನೆ, ಬೆಂಗಳೂರು ಇವರ ಸಹಯೋಗದಲ್ಲಿ ಬಾಲಕಾರ್ಮಿಕ ನಿರ್ಮೂಲನಾ ಕಾರ್ಯಕ್ರಮಕ್ಕಾಗಿ ಗೊಂಬೆಯಾಟವನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸಿತು. ಕಳೆದ 20 ವರ್ಷಗಳಲ್ಲಿ, ಗೊಂಬೆ ಮನೆಯು ಕರ್ನಾಟಕದ ಶಾಲೆಗಳಲ್ಲಿ ನಿಯಮಿತವಾಗಿ ಗೊಂಬೆಯಾಟ ಪ್ರದರ್ಶನಗಳು ಮತ್ತು ಕಾರ್ಯಾಗಾರಗಳನ್ನು ಆಯೋಜಿಸಿದೆ. ‘ಎ ಮ್ಯಾನ್ ಆಫ್ ಅನ್ ಆಸ್’, ‘ಬರ್ಡ್ಸ್ ಸಾಂಗ್’, ‘ಆಕಟ ವಿಕಟ ವಿಲಕ್ಷಣ’, ‘ರೆಡ್ ಫ್ಲವರ್’, ‘ಪಾಪು ಬಾಪು’, ಮತ್ತು ‘ಅಂಚೆ ಮನೆ’ ಮುಂತಾದ ಪ್ರಸ್ತುತಿಗಳಲ್ಲಿ ಸುಮಾರು 1000 ಪ್ರದರ್ಶನಗಳನ್ನು ಶಾಲೆಗಳು, ಕಾಲೇಜುಗಳು ಮತ್ತು ಸಾಂಸ್ಕೃತಿಕ ಸಂಸ್ಥೆಗಳಲ್ಲಿ ನೀಡಿದೆ. \nHow many Ramayanas? A hundred, two hundred, three hundred and so on. A.K. Ramanujan, a multilingual scholar, wrote an essay “Three Hundred Ramayanas: Five Examples and Three Thoughts on Translation” which scholarly narrates the existence of many Ramayanas in India and in South Asian countries. This play could be one amongst them, and this production is inspired by this essay. \nThroughout the Valmiki Ramayana, Sri Rama occupies the central stage as the main character. Many folk versions of Ramayanas (Chitrapata Ramayana, Ravana Chaya etc.) narrate the story of Sita. She occupies the centre stage. In Adbhuta Ramayana, Sita is the protagonist. She is not only a manifestation of Goddess Lakshmi but also the first force of creation known as Prakruti (Nature). Sita is the focus of the story rather than Rama, and it seeks to establish the greatness, courage, valour, strength, power, and potential of Womanhood which are traditionally so cherished. Sri Rama fails to subdue and vanquish Shatakhanta Ravana, who was ten times more powerful than his younger sibling Dashakhanta Ravana. Sita defeats this great demon and restores peace on earth by eliminating the courage of all evil-mongering demons representing vices and perversions. \nBased on Kandagal Hanamanta Rao’s Company Drama \nDirected by Rajani Garud\nAdapted for Puppetry by Prakash Garud\nMusic by Raghava Kammar\nProduced by Gombe Mane (Puppet House), Dharwad \nAbout Gombe Mane/Puppet House: \n \nPuppet House is a practicing centre for both theatre and puppetry. Founded in 1996 by Theatre Practitioners, Dr Prakash Garud and Rajani Garud, it has produced dramas and puppet plays for the last 25 years, with nearly 50 plays and 15 puppet plays to its credit. It regularly conducts theatre and puppetry workshops for children and young artists in Dharwad and other parts of the state. The core group is trained in theatre basically. \nPuppet House has undertaken several collaborative projects with the support of various organizations. It collaborated on an art project with the financial support of the India Foundation for the Arts, Bangalore, developing leather puppetry for contemporary audiences, particularly children. It also undertook an art education project for primary school children with support from the Sir Ratan Tata Trust, Mumbai. Additionally, it has participated in puppetry festivals and training programs organized by the Sangeet Natak Akademi, New Delhi. The Central Ministry of Culture Department, New Delhi and the Department of Kannada and Culture, Bengaluru have supported its theatre and puppetry endeavours. \nSome of Puppet House’s notable productions include plays like Mahamayi, Anjumallige, Shivaratri, Andhayug, King Lear, and children’s plays such as Panjara Shale, Pushparaani, and Emperor’s New Clothes. Its puppet plays comprise Gardhabha Manushya Prahasana, Hakki Haadu, Red Flower, Akata Vikata Vilakshana, Papu Bapu and Adbhuta Ramayana. \nPuppet House has actively participated in various festivals and events across India, including Bahurupi Festival Rangayana Mysuru (2007), Dharwad Utsav (2008), IFA Puppetry Workshop in New Delhi (2007), Putul Yatra in New Delhi and Lucknow (2011), Abhinaya Theatre Troupe in Thiruvananthapuram (2010), Putul Ranga Gandhi Sangha Festival in Agartala (2018), and Malebillu Children Theatre Festival by National School of Drama in Bengaluru and Mangaluru (2011). \nIn collaboration with the India Foundation for the Arts, Bengaluru and the Goethe Foundation Bengaluru Chapter, Puppet House organized the Kali-Kalisu Art education program for teachers in Karnataka, conducting Puppetry workshops in 2012. It also developed Puppetry for Child Labour Eradication programme in association with Nunhems & Bayers Company and the International Labour Organisation, Bengaluru. Over the last 20 years, Puppet House has regularly organised Puppet shows and workshops at schools in Karnataka, giving nearly 1000 shows in productions like A Man of an Ass, Bird’s Song, Akata Vikata Vilakshana, Red Flower, Papu Bapu, and Anche Mane in Schools, Colleges and cultural organisations. \nWith support from \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/adbhuta-ramayana-2/",
    "keywords": [
      "Krishna to Kaveri",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "ಅದ್ಭುತ ರಾಮಾಯಣ | Adbhuta Ramayana"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-633.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "66203-1731261600-1731265200@bangaloreinternationalcentre.org",
    "name": "ಸೋನು ವೇಣುಗೋಪಾಲ್ ಲೈವ್ | Sonu Venugopal Live",
    "startDate": "2024-11-10T18:00:00+05:30",
    "endDate": "2024-11-10T19:00:00+05:30",
    "description": "The most popular Kannada Comic is coming to BIC with a new hour of jokes after the release of her special “Punyakoti”. This new show is whackier, edgier, and more full of surprises than anything you’ve seen from her so far. \nWith support from: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sonu-venugopal-live/",
    "keywords": [
      "Culture",
      "Krishna to Kaveri",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-642.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65433-1731268800-1731272400@bangaloreinternationalcentre.org",
    "name": "ಕಾಯಕ | Kayaka",
    "startDate": "2024-11-10T20:00:00+05:30",
    "endDate": "2024-11-10T21:00:00+05:30",
    "description": "ಕಾಯಕ (ಕೆಲಸ) ಎಂಬುದು ಬೆಂಗಳೂರಿನ ಸಂಗೀತ ರಂಗದ ಪ್ರಮುಖ ಹೆಸರುಗಳನ್ನು ಒಳಗೊಂಡ ಒಂದು ಸಮೂಹವಾಗಿದ್ದು, ವಿವಿಧ ಶೈಲಿ, ಪ್ರಕಾರ ಮತ್ತು ಭಾಷೆಗಳನ್ನು ಒಳಗೊಂಡಿದೆ. ಎಂ.ಡಿ. ಪಲ್ಲವಿ ಮತ್ತು ಬ್ರೂಸ್ ಲೀ ಮಣಿ (ಥರ್ಮಲ್ ಆಂಡ್ ಎ ಕ್ವಾರ್ಟರ್‌ನಿಂದ) ನೇತೃತ್ವದಲ್ಲಿ, ಕಾಯಕ ಸಾವಿರ ವರ್ಷಗಳ ಭಾರತೀಯ ಪರಂಪರೆಯ ಶಕ್ತಿಯುತ ಕಾವ್ಯ ಮತ್ತು ಗೀತೆಗಳನ್ನು ಸಮಕಾಲೀನ ಚೌಕಟ್ಟಿಗೆ ತರುತ್ತದೆ. \nಜಾಗತಿಕ ಪ್ರಭಾವಗಳು ಭಾರತೀಯ ಶಾಸ್ತ್ರೀಯ ಮತ್ತು ಜಾನಪದ ರೂಪಗಳನ್ನು ಭೇಟಿಯಾಗುತ್ತವೆ; ಸಿಂಕೊಪೇಟೆಡ್ ಲಯಗಳು ಸಂಕೀರ್ಣತೆಯನ್ನು ತರುತ್ತವೆ – ಆದರೆ ಆತ್ಮದೊಂದಿಗೆ; ಮತ್ತು ತತ್‌ಕ್ಷಣದ ಅನ್ವೇಷಣೆಗಳು ಬಿಗಿಯಾದ ಸ್ವರರಚನೆಗಳೊಂದಿಗೆ ಸುಂದರವಾಗಿ ಹೊಂದಿಕೊಳ್ಳುತ್ತವೆ. \nಅದೇ ಕಾಯಕ. ಅದೇ ನಮ್ಮ ಕೆಲಸ. ನಮ್ಮ ಪ್ರೀತಿ. ಮತ್ತು ನಾವು ಅದನ್ನು ನಿಮ್ಮೊಂದಿಗೆ ಹಂಚಿಕೊಳ್ಳಲು ಬಯಸುತ್ತೇವೆ. \nKayaka (work) is an ensemble comprising pre-eminent names from Bangalore’s music scene, across genres, styles and language. Led by M D Pallavi and Bruce Lee Mani (from Thermal And A Quarter), Kayaka plays with powerful poetry and song from thousand-year Indian traditions, to bring them into a contemporary frame. Global influences meet Indian classical and folk forms; syncopated rhythms bring complexity – but with soul; and improvised explorations sit nicely with tight arrangements. That is Kayaka. That is our work. Our love. And we want to share it with you. \nWith support from:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%95%e0%b2%be%e0%b2%af%e0%b2%95-kayaka/",
    "keywords": [
      "Krishna to Kaveri",
      "Music"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-640.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65798-1731150000-1731155400@bangaloreinternationalcentre.org",
    "name": "ಸಂಗೀತ ಗಂಗಾ ಕಾವೇರಿ | Sangeeta Ganga Kaveri",
    "startDate": "2024-11-09T11:00:00+05:30",
    "endDate": "2024-11-09T12:30:00+05:30",
    "description": "India takes pride in its two classical music systems: Carnatic and Hindustani. Karnataka holds the unique distinction of being the only state to have produced stalwarts in both traditions. The cultural and historical foundations for this phenomenon are particularly fascinating. \nThe Wadiyars of Mysore, renowned patrons of music, maintained significant cultural exchanges with the royal court of Baroda. The reciprocal visits of court musicians between these kingdoms profoundly influenced the development of both musical streams in Karnataka. \nOver the centuries, all four major gharanas of Hindustani music have flourished in Karnataka. Indeed, the state’s contribution to classical music has been so significant that traditional scholars often look to Karnataka’s artists as exemplars of pure gayaki (vocal style). \nThis lecture-demonstration while exploring this remarkable musical heritage, aims to illuminate Karnataka’s extraordinary contribution to India’s classical music traditions.ಕರ್ನಾಟಕದ ಹಿಂದುಸ್ಥಾನಿ ಸಂಗೀತ ಪರಂಪರೆ: ವಿಚಾರ-ಪ್ರದರ್ಶನ ಗೋಷ್ಠಿ” \nಭಾರತವು ತನ್ನ ಎರಡು ಶಾಸ್ತ್ರೀಯ ಸಂಗೀತ ಪದ್ಧತಿಗಳಾದ ಕರ್ಣಾಟಕ ಸಂಗೀತ ಮತ್ತು ಹಿಂದುಸ್ಥಾನಿ ಸಂಗೀತದ ಬಗ್ಗೆ ಹೆಮ್ಮೆ ಪಡುತ್ತದೆ. \nಈ ಎರಡೂ ಪರಂಪರೆಗಳಲ್ಲಿ ದಿಗ್ಗಜರನ್ನು ನಿರ್ಮಿಸಿದ ಏಕೈಕ ರಾಜ್ಯವೆಂಬ ವಿಶಿಷ್ಟ ಗೌರವ ಕರ್ನಾಟಕಕ್ಕೆ ಸಲ್ಲುತ್ತದೆ. ಈ ವಿದ್ಯಮಾನದ ಸಾಂಸ್ಕೃತಿಕ ಮತ್ತು ಐತಿಹಾಸಿಕ ಬುನಾದಿಗಳು ವಿಶೇಷವಾಗಿ ಆಕರ್ಷಕವಾಗಿವೆ. \nಸಂಗೀತದ ಶ್ರೇಷ್ಠ ಪೋಷಕರಾಗಿದ್ದ ಮೈಸೂರಿನ ಒಡೆಯರು, ಬರೋಡ ರಾಜ ದರ್ಬಾರಿನೊಂದಿಗೆ ಗಣನೀಯ ಸಾಂಸ್ಕೃತಿಕ ವಿನಿಮಯವನ್ನು ಕಾಪಾಡಿಕೊಂಡಿದ್ದರು. ಈ ರಾಜ್ಯಗಳ ನಡುವಿನ ದರ್ಬಾರಿ ಸಂಗೀತಗಾರರ ಪರಸ್ಪರ ಭೇಟಿಗಳು ಕರ್ನಾಟಕದಲ್ಲಿ ಎರಡೂ ಸಂಗೀತ ಧಾರೆಗಳ ಬೆಳವಣಿಗೆಯ ಮೇಲೆ ಆಳವಾದ ಪ್ರಭಾವ ಬೀರಿವೆ. \nಶತಮಾನಗಳ ಕಾಲ, ಹಿಂದುಸ್ಥಾನಿ ಸಂಗೀತದ ನಾಲ್ಕು ಪ್ರಮುಖ ಘರಾನೆಗಳು ಕರ್ನಾಟಕದಲ್ಲಿ ಅರಳಿ ಬೆಳೆದಿವೆ. ನಿಜವಾಗಿಯೂ, ಶಾಸ್ತ್ರೀಯ ಸಂಗೀತಕ್ಕೆ ಕರ್ನಾಟಕದ ಕೊಡುಗೆ ಎಷ್ಟು ಗಮನಾರ್ಹವಾಗಿದೆ ಎಂದರೆ, ಸಾಂಪ್ರದಾಯಿಕ ವಿದ್ವಾಂಸರು ಶುದ್ಧ ಗಾಯಕಿ (ಗಾಯನ ಶೈಲಿ)ಗೆ ಕರ್ನಾಟಕದ ಕಲಾವಿದರನ್ನು ಮಾದರಿಯಾಗಿ ಪರಿಗಣಿಸುತ್ತಾರೆ. \nಈ ಉಪನ್ಯಾಸ-ಪ್ರದರ್ಶನವು ಈ ಅದ್ಭುತ ಸಂಗೀತ ಪರಂಪರೆಯನ್ನು ಅನ್ವೇಷಿಸುತ್ತಾ, ಭಾರತದ ಶಾಸ್ತ್ರೀಯ ಸಂಗೀತ ಪರಂಪರೆಗಳಿಗೆ ಕರ್ನಾಟಕದ ಅಸಾಧಾರಣ ಕೊಡುಗೆಯನ್ನು ಬೆಳಕಿಗೆ ತರಲು ಉದ್ದೇಶಿಸಿದೆ. \nWith support from \n \n\n",
    "url": "https://bangaloreinternationalcentre.org/event/sangeeta-ganga-kaveri/",
    "keywords": [
      "Krishna to Kaveri",
      "Music"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-634.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "65142-1731110400-1731196799@bangaloreinternationalcentre.org",
    "name": "ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ | Krishna to Kaveri",
    "startDate": "2024-11-09T05:30:00+05:30",
    "endDate": "2024-11-10T05:30:00+05:30",
    "description": "ಕರ್ನಾಟಕವು ಹಲವು ವೈವಿಧ್ಯತೆಗಳ ನಾಡು. ಅದೇ ಅದರ ಅಸ್ಮಿತೆ. ಹಲವು ಸಂಸ್ಕೃತಿಗಳು ಮತ್ತು ಭಾಷೆಗಳೊಂದಿಗೆ ಜೀವ ಮಿಡಿಯುವ ಚಿತ್ರಚಿತ್ತಾರದ ನಮ್ಮ ವಿಶಾಲ ಕರ್ನಾಟಕದ ಸುತ್ತ ಪಯಣಿಸೋಣ ಬನ್ನಿ. ಕರ್ನಾಟಕದ ಉದ್ದಗಲಗಳಲ್ಲಿ ಅದರ ಭೂಭಾಗವನ್ನು, ಸಮುದಾಯಗಳನ್ನು ಮತ್ತು ಅನುಭವಗಳನ್ನು ತಮ್ಮ ಮಡಿಲೊಳಗಿಟ್ಟುಕೊಂಡ ಶಕ್ತಿಶಾಲಿ ನದಿಗಳಾದ ಕೃಷ್ಣೆ, ಕಾವೇರಿಯರಿಂದ ನಮ್ಮ ಉತ್ಸವವು ಪ್ರೇರಿತವಾಗಿದೆ. ಅಂತೆಯೇ “ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿಯವರೆಗೆ” ಎಂಬ ಈ ನಮ್ಮ ಪ್ರಸ್ತುತಿ. \nಕೃಷ್ಣೆ ಮತ್ತು ಕಾವೇರಿಯೆಂಬ ಎರಡು ನದಿಗಳು ಈ ರಾಜ್ಯದ ವಿವಿಧ ಭೂಭಾಗಗಳ ಉದ್ದಕ್ಕೂ ಹರಿಯುತ್ತಿರುವ ಹಾಗೆಯೇ ನಮ್ಮ ಹಬ್ಬವು ಕರ್ನಾಟಕದ ವಿವಿಧ ಸಂಸ್ಕೃತಿ ಮತ್ತು ಭಾಷೆಗಳೊಂದಿಗೆ ಕೊಂಡಿಯನ್ನು ಬೆಸೆಯುವ ಆಶಯವನ್ನು ಹೊಂದಿದೆ. ಈ ಜೀವದಾಯಿನಿ ನದಿಗಳು ವಿಸ್ತೃತ ಭೂಭಾಗ,\nಸಮೃದ್ಧ ವೈವಿಧ್ಯತೆ ಮತ್ತು ಸಮನ್ವಯಿತ ಸ್ವರೂಪದ ಈ ರಾಜ್ಯಕ್ಕೆ ಒಂದು ಸಶಕ್ತ ರೂಪಕವಾಗಬಲ್ಲವು. \nಜೀವಜಾಲಕ್ಕೆ ಹೊಸಚೈತನ್ಯವನ್ನು ನೀಡುವ ಈ ಪವಿತ್ರ ನದಿಗಳನ್ನು ಮಾದರಿಯಾಗಿಸಿಕೊಂಡು ನಾವು ನಮ್ಮ ಈ ಹಬ್ಬವನ್ನು ಮರುಹುಟ್ಟು ಹಾಗೂ ಮರುಚೈತನ್ಯವೆಂಬ ಎರಡು ಪರಿಕಲ್ಪನೆಗಳ ಸುತ್ತ ಸಂಯೋಜಿಸಿದ್ದೇವೆ. ಈ ನೆಲದ ಸಾಂಪ್ರದಾಯಿಕ ಕಲಾ ಪ್ರಕಾರಗಳು, ಪದ್ಧತಿಗಳು, ಮತ್ತು ಆಚರಣೆಗಳು ಸಮಕಾಲೀನ ಸಂದರ್ಭದಲ್ಲಿ ಎಷ್ಟು ಮಹತ್ವವಾಗುತ್ತವೆ ಎನ್ನುವುದನ್ನು ತಿಳಿಯಪಡಿಸುತ್ತ ಈ ಎಲ್ಲವುಗಳಿಗೆ ಹೊಸಜೀವವನ್ನು ಕಲ್ಪಿಸುವ ಆಶಯ ನಮ್ಮದು. ಸಂಸ್ಕೃತಿಗಳು ಒಂದರೊಳಗೊಂದು ಬೆರೆತು ಬೆಳೆಯುವ ನೆಲ ಕರ್ನಾಟಕ. ಅದರ ಅಸ್ಮಿತೆಯನ್ನು ರೂಪಿಸುವ ನದಿಗಳ ಹಾಗೆ. ರಾಜ್ಯದ ಈ ಮೂಲಗುಣಕ್ಕೆ ಚೈತನ್ಯವನ್ನು ತುಂಬುವ ಸಂಭ್ರಮಾಚರಣೆಯಲ್ಲಿ ನೀವೂ ಜೊತೆಯಾಗಿ. \nಅಜೀಂ ಪ್ರೇಮ್‌ಜಿ ವಿಶ್ವವಿದ್ಯಾಲಯವು ಬೆಂಗಳೂರು ಅಂತರರಾಷ್ಟ್ರೀಯ ಕೇಂದ್ರದ ಸಹಭಾಗಿತ್ವದಲ್ಲಿ ಈ ಹಬ್ಬವನ್ನು ಪ್ರಸ್ತುತಪಡಿಸುತ್ತಿದೆ. \nJourney through the heart of Karnataka as we explore the vibrant tapestry of cultures and languages that define this diverse state. Our festival, “Krishna to Kaveri,” draws inspiration from the mighty rivers that cradle Karnataka’s landscapes, communities, and experiences. \nJust as the Krishna and Kaveri rivers traverse geographies, our festival aims to bridge the myriad cultures and languages of Karnataka. These life-giving waters serve as a powerful metaphor for the state’s expansive terrain, rich diversity, and syncretic nature. \nTaking our cue from the rejuvenating powers of these sacred rivers, our event curation focuses on revival and revitalisation. We aim to breathe new life into traditional art forms, customs, and practices, ensuring their relevance in contemporary times. \nJoin us for two days of immersive experiences as we celebrate the essence of Karnataka – a land where cultures converge and flourish, much like the rivers that shape its identity. \nPresented by Azim Premji University in collaboration with Bangalore International Centre \nSchedule: \nDay 1 | Saturday, November 9 \n10:00 am | Ground Floor Foyer \nWelcome: Procession of folk artistes and launch  \nT S Nagabharana and Dharanidevi Malagatti \n11:00 am | Auditorium \nSangeeta Ganga Kaveri  \nA lecture-demonstration by Dr. Nagarajrao Havaldar on the history and evolution of Hindustani music in Karnataka \n11:30 am | Seminar Halls \nUnited by Language \nThe Story of How Karnataka was Born with Prof. Rajendra Chenni and Vikhar Ahmed Sayeed \n12:00 noon | Library \nWorkshop on Chittara \nThe Chittara Mural artform, established by the Deevaru Community, is a traditional phenomenon that involves intricate stories and geometric patterns. Geetha Bhat will lead a workshop where participants can engage in learning the basics of the art form and interact with the artists while learning about its 500 year old history and cultural significance. \n12:30 pm | Amphitheatre \nDollu Kunitha \nA unique presentation of Karnataka’s traditional Dollu Kunitha by an all-women ensemble. This innovative interpretation reimagines the art form that originated as part of Lord Beerappa worship. \n2:00 pm | Auditorium \nAdbhuta Ramayana\nA Leather Shadow Puppet Performance by Gombe Mane, Dharwad \n3:00 pm | Library \nWorkshop on Kasuti \nA lecture demonstration on the intricate form of traditional folk embroidery originating in Dharwad round the 7th Century CE. It is one of India’s most famous handicrafts and is protected by the Geographical Indication (GI) tag. \n4:00 pm | Seminar Halls \nMalenad: Bringing Big Cats Back from the Brink \nA talk by Dr. Ullas Karanth on the necessary framework necessary to balance nature protection with development. \n4:30 pm | Amphitheatre \nRangageethe \nA sharing session of songs that have emerged from the ear of musical theatre in Karnataka over many decades. \n6:00 pm | Seminar Halls \nThe Champions Huddle \nYoung sportspersons, Dhinidhi Desinghu and Rakshitha Raju in conversation with Prajwal Hegde on the sporting future of Karnataka. \n6:15 pm | Auditorium \nSangamam Hubba \nSuhas Shivanna, Nayana Nagaraj, Ranga Charaka Team and Mysuru Puppet Theatre team will be presenting a 5 different folk artforms from Folk songs, Dances and Traditional pupppet show as a part of the 13th edition of Sangamam by SFPI. \nFor Day 2 | Sunday, November 10 Click Here \nOngoing Throughout the Festival \n10:00 am to 8:00 pm \nExhibition | Through the Building \nKarnataka Vaibhava: Treasures & Turning Points \nIn collaboration with Shashidhar Adapa \nFood Festival | Terrace \nFlavour Fair \nAnchored by Coracle with Chef Tresa \nExperiential Interactions with Artisans | Ground Floor Foyer \nHand in Hand \nGuided by Master Artisans \nಕಾರ್ಯಕ್ರಮಗಳ ವಿವರ \nಮೊದಲನೆಯ ದಿನ | ಶನಿವಾರ, ನವೆಂಬರ್ 9\nಬೆಳಗ್ಗೆ 10:00 ಗಂಟೆಗೆ | ನೆಲ ಅಂತಸ್ತಿನ ಪ್ರಾಂಗಣ (Ground Floor Foyer)\nಉದ್ಘಾಟನೆ \nಬೆಳಗ್ಗೆ 11.00 ಗಂಟೆಗೆ | ಆಡಿಟೋರಿಯಂ\nಸಂಗೀತ ಗಂಗಾ ಕಾವೇರಿ \nಕರ್ನಾಟಕದಲ್ಲಿ ಹಿಂದೂಸ್ತಾನಿ ಸಂಗೀತದ ಚರಿತ್ರೆ ಮತ್ತು ವಿಕಾಸವನ್ನು ಕುರಿತು ಡಾ.ನಾಗರಾಜರಾವ್\nಹವಾಲ್ದಾರ್‌ರವರಿಂದ ಉಪನ್ಯಾಸ – ಪ್ರಾತ್ಯಕ್ಷಿಕೆ \nಬೆಳಗ್ಗೆ 11:30 ಕ್ಕೆ | ಸೆಮಿನಾರ್ ಹಾಲ್ \nನುಡಿಯ ನಂಟಿನಿಂದ ಬೆಸೆದವರು \nನಮ್ಮ ನಾಡಿನ ಹುಟ್ಟು, ಕರ್ನಾಟಕದ ಐತಿಹಾಸಿಕ ನೆನಪುಗಳು ಪ್ರೊ. ರಾಜೇಂದ್ರ ಚೆನ್ನಿ & ವಿಖಾರ್ ಅಹ್ಮದ್ ಸಯೀದ್ ಅವರ ಸಂವಾದ \nಮಧ್ಯಾಹ್ನ 12:00 ಗಂಟೆಗೆ | ಲೈಬ್ರೆರಿ\nಚಿತ್ತಾರ ಕಾರ್ಯಾಗಾರ \nಚಿತ್ತಾರವೆಂಬ ಸಾಂಪ್ರದಾಯಿಕ ಕಲಾ ಪ್ರಕಾರವು ಕರ್ನಾಟಕದಲ್ಲಿ ದೀವರು ಸಮುದಾಯದಿಂದ ಆರಂಭಗೊಂಡಿದೆ. ಸಂಕೀರ್ಣ ಕತೆಗಳು ಮತ್ತು ಜ್ಯಾಮಿತಿಯ ವಿನ್ಯಾಸಗಳನ್ನೊಳಗೊಂಡ ಈ ಕಲೆಯನ್ನು ಗೋಡೆಗಳ ಮೇಲೆ ಚಿತ್ರಿಸಲಾಗುತ್ತದೆ. ಗೀತಾ ಭಟ್ ಈ ಕಲೆಯನ್ನು ಕುರಿತ ಕಾರ್ಯಾಗಾರವೊಂದನ್ನು ನಡೆಸಿಕೊಡುತ್ತಾರೆ. ಇದರಲ್ಲಿ ಪಾಲ್ಗೊಳ್ಳುವವರು ಈ ಕಲೆಯ ಮೂಲ ಕೌಶಲಗಳನ್ನು ಕಲಿಯುವುದರ ಜೊತೆಗೆ ಈ ಕಲೆಯನ್ನು ಬಲ್ಲ ಕಲಾವಿದರೊಂದಿಗೆ ಸಂವಾದ ನಡೆಸಬಹುದು ಮತ್ತು ಹಸೆ ಚಿತ್ತಾರದ 500 ವರ್ಷಗಳ ಚರಿತ್ರೆ ಹಾಗೂ ಅದರ ಸಾಂಸ್ಕೃತಿಕ ಮಹತ್ವವನ್ನು ಕುರಿತು ಅರಿಯಬಹುದು. \nಮಧ್ಯಾಹ್ನ 12:30 ಕ್ಕೆ | ಆಂಪಿಥಿಯೇಟರ್\nರಂಗಗೀತೆ\nರಂಗಗೀತೆಗಳ ಪ್ರಸ್ತುತಿ. ಕರ್ನಾಟಕದಲ್ಲಿ ಅನೇಕ ದಶಕಗಳಿಂದ ಬೆಳೆದು ಬಂದ ನಾಟಕ ಸಂಗೀತ ಪರಂಪರೆಯ ಒಂದು ಝಲಕ್ ಸಿಗುತ್ತದೆ. \nಮಧ್ಯಾಹ್ನ 2:00 ಗಂಟೆಗೆ | ಆಡಿಟೋರಿಯಂ\nಅದ್ಭುತ ರಾಮಾಯಣ\nಧಾರವಾಡದ ಗೊಂಬೆ ಮನೆ ತಂಡದವರಿಂದ ತೊಗಲು ಬೊಂಬೆಯಾಟ ಪ್ರದರ್ಶನ. \nಮಧ್ಯಾಹ್ನ 3:00 ಗಂಟೆಗೆ | ಲೈಬ್ರೆರಿ\nಕಸೂತಿ ಕಾರ್ಯಾಗಾರ\nಧಾರವಾಡದಲ್ಲಿ ಏಳನೆಯ ಶತಮಾನದ ಸುಮಾರಿಗೆ ಹುಟ್ಟಿಕೊಂಡ ಸಾಂಪ್ರದಾಯಿಕ ಜನಪದ ಶೈಲಿಯ ಕಸೂತಿ ಕಲೆ ಮತ್ತು ಅದರ ಸೂಕ್ಷ್ಮ ಕೌಶಲ್ಯಗಳನ್ನು ಕುರಿತು ಉಪನ್ಯಾಸ ಹಾಗೂ ಪ್ರಾತ್ಯಕ್ಷಿಕೆ. ಇದು ಭಾರತದ ಒಂದು ಪ್ರಸಿದ್ಧ ಕರಕುಶಲ ಪ್ರಕಾರವಾಗಿದೆ ಮತ್ತು ಇದಕ್ಕೆ GI ಟ್ಯಾಗ್ ಕೂಡ ಸಿಕ್ಕಿದೆ. \nಮಧ್ಯಾಹ್ನ 4:00 ಗಂಟೆಗೆ | ಸೆಮಿನಾರ್ ಹಾಲ್\nಮಲೆನಾಡಿನ ಹುಲಿ, ಚಿರತೆಗಳ ಜಾಡಿನಲ್ಲಿ \nಡಾ. ಉಲ್ಲಾಸ್ ಕಾರಂತ್ ಅವರಿಂದ ಪ್ರಕೃತಿ ಸಂರಕ್ಷಣೆ ಮತ್ತು ಅಭಿವೃದ್ಧಿಯ ನಡುವೆ ಸಮತೋಲನ ಸಾಧಿಸಲು ಅಗತ್ಯವಿರುವ ಚೌಕಟ್ಟಿನ ಕುರಿತು ಉಪನ್ಯಾಸ \nಸಂಜೆ 4:30 ಗಂಟೆಗೆ | ಆಂಪಿಥಿಯೇಟರ್\nಡೊಳ್ಳು ಕುಣಿತ\nಕರ್ನಾಟಕದ ಪಾರಂಪರಿಕ ಡೊಳ್ಳು ಕುಣಿತವನ್ನು ಮಹಿಳೆಯರ ತಂಡದಿಂದ ವಿಶಿಷ್ಟ ರೀತಿಯಲ್ಲಿ ಪ್ರಸ್ತುತಪಡಿಸಲಾಗುತ್ತಿದೆ. ಬೀರಪ್ಪ ದೇವರ ಆರಾಧನೆಯ ಭಾಗವಾಗಿ ರೂಪುಗೊಂಡ ಈ ಕಲೆಯ ಹೊಸ ಪ್ರಯೋಗ. \nಸಂಜೆ 6:00 ಗಂಟೆಗೆ | ಸೆಮಿನಾರ್ ಹಾಲ್ \nಚಾಂಪಿಯನ್‌ಗಳ ನಡುವೆ \nಯುವ ಕ್ರೀಡಾಪಟುಗಳು ಧಿನಿಧಿ ದೇಸಿಂಗು ಮತ್ತು ರಕ್ಷಿತಾ ರಾಜು ಪ್ರಜ್ವಲ್ ಹೆಗಡೆ ಅವರೊಂದಿಗೆ ಕರ್ನಾಟಕದ ಕ್ರೀಡಾ ಭವಿಷ್ಯದ ಕುರಿತು ಸಂವಾದ \nಸಂಜೆ 7:00 | ಆಡಿಟೋರಿಯಂ \nಸಂಗಮಂ ಹಬ್ಬ \nಸುಹಾಸ್ ಶಿವಣ್ಣ, ನಯನಾ ನಾಗರಾಜ್, ರಂಗ ಚರಕ ತಂಡ ಮತ್ತು ಮೈಸೂರು ಪಪ್ಪೆಟ್ ಥಿಯೇಟರ್ ತಂಡವು ಸಂಗಮಂ ಕಾರ್ಯಕ್ರಮದ 13ನೇ ಆವೃತ್ತಿಯ ಭಾಗವಾಗಿ ಜಾನಪದ ಗೀತೆಗಳು, ನೃತ್ಯಗಳು ಮತ್ತು ಸಾಂಪ್ರದಾಯಿಕ ಗೊಂಬೆಯಾಟವನ್ನೊಳಗೊಂಡ 5 ವಿಭಿನ್ನ ಜಾನಪದ ಕಲಾ ಪ್ರಕಾರಗಳನ್ನು ಪ್ರಸ್ತುತಪಡಿಸಲಿದ್ದಾರೆ. \nದಿನ 2 | ಭಾನುವಾರ, ನವೆಂಬರ್ 10ರ ಮಾಹಿತಿಗಾಗಿ ಇಲ್ಲಿ ಕ್ಲಿಕ್ ಮಾಡಿ \nಎರಡು ದಿನಗಳೂ ನಡೆಯುವ ಕಾರ್ಯಕ್ರಮಗಳು:\nಬೆಳಗ್ಗೆ 10:00 ಗಂಟೆಯಿಂದ ರಾತ್ರಿ 8:00 ಗಂಟೆಯವರೆಗೆ\nಕಲಾ ಪ್ರದರ್ಶನ | ವಿವಿಧ ಅಂತಸ್ತುಗಳಲ್ಲಿ \nಕರ್ನಾಟಕ ವೈಭವ: ಹಿರಿಮೆಗಳು ಮತ್ತು ಸಂಧಿಕಾಲಗಳು\nಶಶಿಧರ ಅಡಪರವರ ಸಹಭಾಗಿತ್ವದಲ್ಲಿ \nಆಹಾರ ಮೇಳ (ಫುಡ್ ಫೆಸ್ಟಿವಲ್) | ಟೆರೇಸ್‌ನಲ್ಲಿ\nರುಚಿಗಳ ಜಾತ್ರೆ\nಚೆಫ್ ಟ್ರೆಸಾರವರ ಕೊರಾಕಲ್‌ನಿಂದ ಆಯೋಜನೆ. \nಕುಶಲಕರ್ಮಿಗಳೊಂದಿಗೆ ಮುಖಾಮುಖಿಯಾಗಿ ಅವರ ಅನುಭವಗಳನ್ನು ಕೇಳಿ ತಿಳಿಯಿರಿ | ನೆಲ ಅಂತಸ್ತಿನ ಪ್ರಾಂಗಣದಲ್ಲಿ\nಕರಕುಶಲತೆಯ ಕೈಪಿಡಿ\nಕುಶಲಕರ್ಮಿಗಳ ಮಾರ್ಗದರ್ಶನದಲ್ಲಿ \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/krishna/",
    "keywords": [
      "Culture",
      "Krishna to Kaveri",
      "Language",
      "Music",
      "Performing Arts",
      "Theatre",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ | Krishna to Kaveri"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-6_POSTER-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65736-1731151800-1731157200@bangaloreinternationalcentre.org",
    "name": "ರಾಜ್ಯ ರೂಪುಗೊಂಡ ಬಗೆ | United by Language",
    "startDate": "2024-11-09T11:30:00+05:30",
    "endDate": "2024-11-09T13:00:00+05:30",
    "description": "The unification of Karnataka was a major cultural preoccupation for many decades. For writers of the time, the Kannada renaissance was an awakening to the sense of historical loss of a glorious Kannada Nadu and also to the sense of historical destiny. This galvanised a movement which lasted for many decades and ended in bringing together the Kannada-speaking people who had been scattered over 29 fragments. However, the complex story of the birth of Karnataka as a modern linguistic state cannot be analyzed without references to the contradictions of regional differences, caste and class and, the national politics of the time. More importantly, these contradictions still persist and need to be seen in the context of the vulnerability of linguistic subnationalism and its fragility. \nThe discussion will revolve around Rajendra Chenni’s book, State Matters: Kannada Subnationalism and State Formation, which analyzes the formation of a linguistic state and the inevitability of the contradictions arising from material and historical conditions. It examines the historical and political context which led to the emergence and acceptance of linguistic or regional identities during the freedom struggle, a struggle which ironically tried to subsume these identities into one master discourse of the nation. Traversing disciplinary boundaries, the book weaves complex disparate elements into the concept of linguistic subnationality. It underlines how linguistic subnationality is sustained against the push and pull of caste/class hegemony, national party-based politics and larger forces of development and globalization. \nWith support from \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/unitedbylanguage/",
    "keywords": [
      "History",
      "Krishna to Kaveri",
      "Language"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-635.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65888-1731250800-1731256200@bangaloreinternationalcentre.org",
    "name": "ಪುಸ್ತಕಗಳ ಲೋಕಾರ್ಪಣೆ | Book Release",
    "startDate": "2024-11-10T15:00:00+05:30",
    "endDate": "2024-11-10T16:30:00+05:30",
    "description": "ಅಜೀಂ ಪ್ರೇಮ್‌ಜಿ ವಿಶ್ವವಿದ್ಯಾಲಯವು ವಿವಿಧ ಪ್ರಕಾಶನ ಸಂಸ್ಥೆಗಳ ಸಹಯೋಗದಲ್ಲಿ ಶಿಕ್ಷಣಕ್ಕೆ ಸಂಬಂಧಿಸಿದ ಆರು ಮೌಲಿಕವಾದ ಪುಸ್ತಕಗಳನ್ನು ಲೋಕಾರ್ಪಣೆಗೊಳಿಸುತ್ತಿದೆ. ಭಾಷೆ ಮತ್ತು ಭಾಷಾ ಬೋಧನೆಗೆ ಸಂಬಂಧಿಸಿದ “ನುಡಿ ಕಲಿಸುವ ನೂರು ದಾರಿ” ಸಂಪುಟ ೩ ಮತ್ತು ೪ (ಸಹಯೋಗ: ಕನ್ನಡ ವಿಶ್ವವಿದ್ಯಾಲಯ, ಹಂಪಿ), ಮಗುವಿನ ಕಲಿಕೆಯನ್ನು ಕುರಿತ ಕಮಲ ವಿ. ಮುಕುಂದ ಅವರ “ಇವತ್ತು ಶಾಲೆಯಲ್ಲಿ ನೀನೇನು ಪ್ರಶ್ನೆ ಕೇಳಿದೆ?”- ೧ ಮತ್ತು ೨ ಕೈಪಿಡಿಗಳು (ಸಹಯೋಗ: ನವಕರ್ನಾಟಕ ಪಬ್ಲಿಕೇಷನ್ಸ್‌), ಮನೋವಿಜ್ಞಾನದ ಇತಿಹಾಸ ಮತ್ತು ಬೆಳವಣಿಗೆಯನ್ನು ಕುರಿತ ಇಂದಿರಾ ಜೈಪ್ರಕಾಶ್ ರವರ “ಮನೋವಿಜ್ಞಾನ – ಬೇರುಗಳು, ಶಾಖೆಗಳು” (ಸಹಯೋಗ: ವಂಶಿ ಪ್ರಕಾಶನ), ಹಾಗೂ ಸಮಾಜ ವಿಜ್ಞಾನ ಪಠ್ಯಪುಸ್ತಕಗಳ ರಚನೆ ಮತ್ತು ಬೋಧನೆಯನ್ನು ಕೇಂದ್ರೀಕರಿಸಿ ಅಲೆಕ್ಸ್‌ ಎಂ.ಜಾರ್ಜ್‌ ಮತ್ತು ಅಮನ್‌ ಮದಾನ್‌ ರಚಿಸಿರುವ “ಶಾಲೆಗಳಲ್ಲಿ ಸಮಾಜ ವಿಜ್ಞಾನದ ಬೋಧನೆ” (ಸಹಯೋಗ: ಅಮೂಲ್ಯ ಪುಸ್ತಕ) ಬಿಡುಗಡೆಗೊಳ್ಳುತ್ತಿರುವ ಪುಸ್ತಕಗಳು. ಪ್ರೊಫೆಸರ್ ಓ.ಎಲ್.ನಾಗಭೂಷಣಸ್ವಾಮಿಯವರ ಅಧ್ಯಕ್ಷತೆಯಲ್ಲಿ ಮಾಧವ  ಪೆರಾಜೆ, ಅರವಿಂದ ಚೊಕ್ಕಾಡಿ, ಮತ್ತು ಅಶೋಕ್‌ ಎಚ್.ಎಸ್. ಪುಸ್ತಕಗಳ ಬಗ್ಗೆ ಮಾತನಾಡಲಿದಾರೆ. \nAzim Premji University in collaboration with various publishing houses is releasing six books related to education. The books being released are: “Nudi Kalisuva Nooru Daari” Volumes 3 and 4 related to Language and Language Teaching (Collaboration: Kannada University, Hampi), Kamala V. Mukunda’s “What Did You Ask in School Today?” – Handbooks 1 and 2 on Child Learning (Collaboration: Navakarnataka Publications), “Psychology – Roots, Branches” by Indira Jaiprakash on the history and evolution of psychology (Collaboration: Vamshi Prakashana), and “Teaching Social Science in Schools” by Alex M. George and Amman Madan (Collaboration: Amulya Pustaka) focused on the creation and teaching of social science textbooks. \nMadhava Peraje, Aravinda Chokkadi, and Ashok H.S. will talk about the books, to be launched by Prof.O.L.Nagabhushanaswamy. \nWith support from \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/book-release/",
    "keywords": [
      "Books",
      "Education",
      "Krishna to Kaveri",
      "Language"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-48.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65792-1731236400-1731243600@bangaloreinternationalcentre.org",
    "name": "ಅಭಿಮನ್ಯು ಕಾಳಗ | Abhimanyu at War",
    "startDate": "2024-11-10T11:00:00+05:30",
    "endDate": "2024-11-10T13:00:00+05:30",
    "description": "The Gana Sourabha group will be performing Yakshagana Bayalata – Abhimanyu Kalaga, a prasanga chosen from the Mahabharata. The episode relates to Abhimanyu’s entry into the battle formation and eventual death. This popular prasanga is written by the poet Devidasa. The session will begin with an introduction to Yakshagana by Prof. Radhakrishna followed by the performance. \nAbhimanyu, the son of Arjuna, is the youngest warrior on the battlefield who was able to fight even with the eldest warrior of the Kauravas – Bhishma. After the death of Bhishma, the Kaurava king Duryodhana names Guru Drona the Commander-in-Chief and a fierce battle ensues. Drona forms a chakravyuha, an unbreakable circular formation of the army. At the time, Arjuna and Krishna were diverted in a fight with the demon kings, the Samshaptakas. All the important Pandava commanders including Bhima failed to break the chakravyuha and Abhimanyu volunteers himself to break the formation. He successfully enters the chakravyuha and devastates the enemy army, defeating Jayadratha who was in command at the entrance. To defeat and kill Abhimanyu, all the important Kaurava commanders led by Drona, Duryodhana and Karna encircle him, cut his hands from behind and kill him. It was one of the most unethical deeds done by these commanders which went against the accepted ethics of war. The actions of the commanders are questioned and debated. \nYakshagana, meaning celestial music, is a traditional Indian art form that combines dance, music, dialogue and characters donned with appropriate costumes who generally tell stories from the Ramayana and Mahabharata. Yakshagana, also called Bayalata, is performed in the open fields on an elevated platform and is dedicated to the stories of the Dashavatara, the ten incarnations of Vishnu. The performing troupe or Mela is called the Dashavatara Mela. It was patronized mainly by temples for their festivals and by rich patrons. \nThere are geographical and cultural variations in Yakshagana. The style performed in Dakshina Kannada and Kasaragodu is called Tenku Tittu, and in Uttara Kannada it is called Badagu Tittu. Generally both take the poetic form of the prasanga. However, the costumes are very different, and there are slight variations in the rendering of dance and music. In Tenku Tittu, the tala or accented beat of time measures of the chende drum is emphasized, as is the veera rasa (bravery) and footwork. In Badagu Tittu, the laya or repetitive rhythm of the maddale drum is given more importance, as is the shringara rasa (love), lasya (grace) and abhinaya (expression). This performance is in the Tenku Tittu\nstyle. \nThe Bhagavata, the lead singer, is the main Sutradhara – the poetic narrator and the director of the prasanga. He assigns the artists their respective roles and generally they are spontaneously cast on the spot. The delivery of dialogues is impromptu. \nThe Abhimanyu Kalaga prasanga has been chosen because it is an episode covering many aspects of the form, including several Yakshagana veshas or costumes and different dance steps appropriate to the types of characters. It exhibits Streevesha (a woman – Subhadra; generally in Yakshagana only men don the role of women characters), Rajavesha (a king – Karna, Kaurava and Jayadratha), Rakshasavesha (a demon – the Samshaptakas), Brahmanavesha (a Brahmin in this case in the role of a warrior – Drona) and Punduvesha (an exuberant young warrior – Abhimanyu). \nDespite all the changes in our fast moving, modern world with the internet and other technology, Yakshagana continues to remain relevant, and its importance and impact cannot be minimised. It has adapted to the rhythms of the modern world without altering its basic character. It has also crossed the borders of Karavali, the coastal region, and popularised itself all over India and in foreign lands with performances in the US, UK, Australia, Germany and elsewhere. \nಗಾನ ಸೌರಭ ತಂಡವು ಯಕ್ಷಗಾನ ಬಯಲಾಟ – ಅಭಿಮನ್ಯು ಕಳಗವನ್ನು ಪ್ರಸ್ತುತಪಡಿಸಲಿದೆ. ಮಹಾಭಾರತದಿಂದ ಆಯ್ದ ಈ ಪ್ರಸಂಗವು ಅಭಿಮನ್ಯುವಿನ ಯುದ್ಧ ಪ್ರವೇಶ ಮತ್ತು ಅಂತಿಮ ಮರಣವನ್ನು ನಿರೂಪಿಸುತ್ತದೆ. ಈ ಜನಪ್ರಿಯ ಪ್ರಸಂಗವನ್ನು ಕವಿ ದೇವಿದಾಸರು ರಚಿಸಿದ್ದಾರೆ. ಕಾರ್ಯಕ್ರಮವು ಪ್ರೊ. ರಾಧಾಕೃಷ್ಣ ಅವರ ಯಕ್ಷಗಾನ ಪರಿಚಯದೊಂದಿಗೆ ಆರಂಭವಾಗಿ, ನಂತರ ಪ್ರದರ್ಶನ ನಡೆಯಲಿದೆ. \nಅರ್ಜುನನ ಮಗನಾದ ಅಭಿಮನ್ಯು, ಯುದ್ಧಭೂಮಿಯ ಅತ್ಯಂತ ಕಿರಿಯ ಯೋಧ, ಕೌರವರ ಹಿರಿಯ ಯೋಧ ಭೀಷ್ಮರನ್ನೂ ಎದುರಿಸಬಲ್ಲವನಾಗಿದ್ದ. ಭೀಷ್ಮರ ಮರಣಾನಂತರ, ಕೌರವ ರಾಜ ದುರ್ಯೋಧನನು ಗುರು ದ್ರೋಣರನ್ನು ಸೇನಾಪತಿಯನ್ನಾಗಿ ನೇಮಿಸಿ, ಭೀಕರ ಯುದ್ಧ ನಡೆಯುತ್ತದೆ. ದ್ರೋಣರು ಭೇದಿಸಲಾಗದ ಚಕ್ರವ್ಯೂಹವೆಂಬ ಸೈನ್ಯ ರಚನೆ ಮಾಡುತ್ತಾರೆ. ಆ ಸಮಯದಲ್ಲಿ ಅರ್ಜುನ ಮತ್ತು ಕೃಷ್ಣರು ಸಮಶಪ್ತಕ ರಾಕ್ಷಸ ರಾಜರ ವಿರುದ್ಧ ಯುದ್ಧದಲ್ಲಿ ತೊಡಗಿರುತ್ತಾರೆ. ಭೀಮನೂ ಸೇರಿದಂತೆ ಎಲ್ಲ ಪ್ರಮುಖ ಪಾಂಡವ ಸೇನಾಪತಿಗಳು ಚಕ್ರವ್ಯೂಹವನ್ನು ಭೇದಿಸಲು ವಿಫಲರಾದಾಗ ಅಭಿಮನ್ಯು ಸ್ವಯಂಪ್ರೇರಿತನಾಗಿ ಮುಂದೆ ಬರುತ್ತಾನೆ. ಅವನು ಯಶಸ್ವಿಯಾಗಿ ವ್ಯೂಹ ಪ್ರವೇಶಿಸಿ, ಶತ್ರು ಸೈನ್ಯವನ್ನು ಧ್ವಂಸಗೊಳಿಸುತ್ತಾ, ದ್ವಾರಪಾಲಕನಾಗಿದ್ದ ಜಯದ್ರಥನನ್ನು ಸೋಲಿಸುತ್ತಾನೆ. ಅಭಿಮನ್ಯುವನ್ನು ಸೋಲಿಸಿ ಕೊಲ್ಲಲು, ದ್ರೋಣ, ದುರ್ಯೋಧನ ಮತ್ತು ಕರ್ಣರ ನೇತೃತ್ವದಲ್ಲಿ ಎಲ್ಲ ಪ್ರಮುಖ ಕೌರವ ಸೇನಾಪತಿಗಳು ಅವನನ್ನು ಸುತ್ತುವರೆದು, ಹಿಂದಿನಿಂದ ಅವನ ಕೈಗಳನ್ನು ಕಡಿದು ಕೊಲ್ಲುತ್ತಾರೆ. ಯುದ್ಧ ನೀತಿಗೆ ವಿರುದ್ಧವಾಗಿ ಈ ಸೇನಾಪತಿಗಳು ಮಾಡಿದ ಅತ್ಯಂತ ಅನೈತಿಕ ಕೃತ್ಯಗಳಲ್ಲಿ ಇದೂ ಒಂದು. ಸೇನಾಪತಿಗಳ ಈ ಕ್ರಿಯೆಗಳ ಬಗ್ಗೆ ಪ್ರಶ್ನೆ ಮತ್ತು ಚರ್ಚೆ ನಡೆಯುತ್ತದೆ. \nದಿವ್ಯ ಸಂಗೀತ ಎಂದರ್ಥ ಬರುವ ಯಕ್ಷಗಾನವು ನೃತ್ಯ, ಸಂಗೀತ, ಸಂವಾದ ಮತ್ತು ಸೂಕ್ತ ವೇಷಭೂಷಣಗಳೊಂದಿಗೆ ಸಾಮಾನ್ಯವಾಗಿ ರಾಮಾಯಣ ಮತ್ತು ಮಹಾಭಾರತದ ಕಥೆಗಳನ್ನು ಹೇಳುವ ಭಾರತೀಯ ಸಾಂಪ್ರದಾಯಿಕ ಕಲಾರೂಪ. ಬಯಲಾಟ ಎಂದೂ ಕರೆಯಲ್ಪಡುವ ಯಕ್ಷಗಾನವನ್ನು ತೆರೆದ ಮೈದಾನದಲ್ಲಿ ಎತ್ತರದ ವೇದಿಕೆಯ ಮೇಲೆ ಪ್ರದರ್ಶಿಸಲಾಗುತ್ತದೆ ಮತ್ತು ವಿಷ್ಣುವಿನ ಹತ್ತು ಅವತಾರಗಳಾದ ದಶಾವತಾರದ ಕಥೆಗಳಿಗೆ ಸಮರ್ಪಿತವಾಗಿದೆ. ಪ್ರದರ್ಶನ ತಂಡ ಅಥವಾ ಮೇಳವನ್ನು ದಶಾವತಾರ ಮೇಳ ಎಂದು ಕರೆಯಲಾಗುತ್ತದೆ. ಮುಖ್ಯವಾಗಿ ದೇವಾಲಯಗಳ ಉತ್ಸವಗಳಿಗಾಗಿ ಮತ್ತು ಶ್ರೀಮಂತ ಪೋಷಕರಿಂದ ಇದಕ್ಕೆ ಪ್ರೋತ್ಸಾಹ ದೊರೆಯಿತು. \nಯಕ್ಷಗಾನದಲ್ಲಿ ಭೌಗೋಳಿಕ ಮತ್ತು ಸಾಂಸ್ಕೃತಿಕ ವ್ಯತ್ಯಾಸಗಳಿವೆ. ದಕ್ಷಿಣ ಕನ್ನಡ ಮತ್ತು ಕಾಸರಗೋಡಿನಲ್ಲಿ ಪ್ರದರ್ಶಿಸುವ ಶೈಲಿಯನ್ನು ತೆಂಕು ತಿಟ್ಟು ಎಂದು, ಉತ್ತರ ಕನ್ನಡದಲ್ಲಿ ಬಡಗು ತಿಟ್ಟು ಎಂದು ಕರೆಯುತ್ತಾರೆ. ಸಾಮಾನ್ಯವಾಗಿ ಎರಡೂ ಪ್ರಸಂಗದ ಕಾವ್ಯ ರೂಪವನ್ನು ತೆಗೆದುಕೊಳ್ಳುತ್ತವೆ. ಆದರೆ, ವೇಷಭೂಷಣಗಳು ಬಹಳ ಭಿನ್ನವಾಗಿವೆ, ಮತ್ತು ನೃತ್ಯ ಹಾಗೂ ಸಂಗೀತದ ನಿರೂಪಣೆಯಲ್ಲಿ ಸ್ವಲ್ಪ ವ್ಯತ್ಯಾಸಗಳಿವೆ. ತೆಂಕು ತಿಟ್ಟಿನಲ್ಲಿ ಚೆಂಡೆಯ ತಾಳ ಅಥವಾ ಕಾಲಮಾನದ ಪ್ರಾಮುಖ್ಯತೆ, ವೀರ ರಸ ಮತ್ತು ಪಾದಚಲನೆಗೆ ಒತ್ತು ನೀಡಲಾಗುತ್ತದೆ. ಬಡಗು ತಿಟ್ಟಿನಲ್ಲಿ ಮದ್ದಳೆಯ ಲಯ ಅಥವಾ ಪುನರಾವರ್ತಿತ ರಿದಮ್‌ಗೆ ಹೆಚ್ಚಿನ ಪ್ರಾಮುಖ್ಯತೆ ನೀಡಲಾಗುತ್ತದೆ, ಹಾಗೆಯೇ ಶೃಂಗಾರ ರಸ, ಲಾಸ್ಯ (ಮಾರ್ದವ) ಮತ್ತು ಅಭಿನಯ (ಅಭಿವ್ಯಕ್ತಿ)ಗೆ ಪ್ರಾಮುಖ್ಯತೆ ಇರುತ್ತದೆ. ಈ ಪ್ರದರ್ಶನವು ತೆಂಕು ತಿಟ್ಟು ಶೈಲಿಯಲ್ಲಿದೆ. \nಮುಖ್ಯ ಗಾಯಕನಾದ ಭಾಗವತನು ಪ್ರಧಾನ ಸೂತ್ರಧಾರ – ಕಾವ್ಯ ನಿರೂಪಕ ಮತ್ತು ಪ್ರಸಂಗದ ನಿರ್ದೇಶಕನಾಗಿರುತ್ತಾನೆ. ಅವನು ಕಲಾವಿದರಿಗೆ ಅವರವರ ಪಾತ್ರಗಳನ್ನು ನೀಡುತ್ತಾನೆ ಮತ್ತು ಸಾಮಾನ್ಯವಾಗಿ ಇವು ತಕ್ಷಣದಲ್ಲಿಯೇ ನಿರ್ಧರಿಸಲ್ಪಡುತ್ತವೆ. ಸಂವಾದಗಳ ನಿರೂಪಣೆ ತಕ್ಷಣದ ಸ್ಫೂರ್ತಿಯಿಂದ ಮಾಡಲಾಗುತ್ತದೆ. \nಅಭಿಮನ್ಯು ಕಳಗ ಪ್ರಸಂಗವನ್ನು ಆಯ್ಕೆ ಮಾಡಲಾಗಿದೆ ಏಕೆಂದರೆ ಇದು ಹಲವಾರು ಯಕ್ಷಗಾನ ವೇಷಗಳು ಅಥವಾ ವೇಷಭೂಷಣಗಳು ಮತ್ತು ವಿವಿಧ ಪಾತ್ರಗಳಿಗೆ ಸೂಕ್ತವಾದ ವಿಭಿನ್ನ ನೃತ್ಯ ಚಲನೆಗಳನ್ನು ಒಳಗೊಂಡ ರೂಪಕದ ಅನೇಕ ಅಂಶಗಳನ್ನು ಒಳಗೊಂಡಿರುವ ಕಥಾಭಾಗ. ಇದು ಸ್ತ್ರೀವೇಷ (ಮಹಿಳೆ – ಸುಭದ್ರೆ; ಸಾಮಾನ್ಯವಾಗಿ ಯಕ್ಷಗಾನದಲ್ಲಿ ಪುರುಷರೇ ಮಹಿಳಾ ಪಾತ್ರಗಳನ್ನು ಮಾಡುತ್ತಾರೆ), ರಾಜವೇಷ (ರಾಜ – ಕರ್ಣ, ಕೌರವ ಮತ್ತು ಜಯದ್ರಥ), ರಾಕ್ಷಸವೇಷ (ರಾಕ್ಷಸ – ಸಮಶಪ್ತಕರು), ಬ್ರಾಹ್ಮಣವೇಷ (ಈ ಸಂದರ್ಭದಲ್ಲಿ ಯೋಧನ ಪಾತ್ರದಲ್ಲಿರುವ ಬ್ರಾಹ್ಮಣ – ದ್ರೋಣ) ಮತ್ತು ಪುಂಡುವೇಷ (ಉತ್ಸಾಹಭರಿತ ಯುವ ಯೋಧ – ಅಭಿಮನ್ಯು) ಗಳನ್ನು ಪ್ರದರ್ಶಿಸುತ್ತದೆ. \nಇಂಟರ್ನೆಟ್ ಮತ್ತು ಇತರ ತಂತ್ರಜ್ಞಾನಗಳೊಂದಿಗೆ ನಮ್ಮ ವೇಗವಾಗಿ ಚಲಿಸುವ ಆಧುನಿಕ ಜಗತ್ತಿನಲ್ಲಿನ ಎಲ್ಲ ಬದಲಾವಣೆಗಳ ಹೊರತಾಗಿಯೂ, ಯಕ್ಷಗಾನ ತನ್ನ ಪ್ರಸ್ತುತತೆಯನ್ನು ಉಳಿಸಿಕೊಂಡಿದೆ, ಮತ್ತು ಅದರ ಮಹತ್ವ ಹಾಗೂ ಪ್ರಭಾವವನ್ನು ಕಡಿಮೆ ಮಾಡಲಾಗುವುದಿಲ್ಲ. ಇದು ತನ್ನ ಮೂಲ ಸ್ವರೂಪವನ್ನು ಬದಲಾಯಿಸದೆ ಆಧುನಿಕ ಜಗತ್ತಿನ ಲಯಕ್ಕೆ ಹೊಂದಿಕೊಂಡಿದೆ. ಕರಾವಳಿ ಪ್ರದೇಶದ ಗಡಿಗಳನ್ನು ದಾಟಿ, ಭಾರತದಾದ್ಯಂತ ಮತ್ತು ಅಮೆರಿಕ, ಬ್ರಿಟನ್, ಆಸ್ಟ್ರೇಲಿಯಾ, ಜರ್ಮನಿ ಮತ್ತು ಇತರ ವಿದೇಶಗಳಲ್ಲಿ ಪ್ರದರ್ಶನಗಳನ್ನು ನೀಡುವ ಮೂಲಕ ತನ್ನನ್ನು ಜನಪ್ರಿಯಗೊಳಿಸಿಕೊಂಡಿದೆ. \nWith support from \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/abhimanyu-at-war/",
    "keywords": [
      "Culture",
      "Heritage",
      "Krishna to Kaveri",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-636.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65925-1731176100-1731181500@bangaloreinternationalcentre.org",
    "name": "ಸಂಗಮಂ ಹಬ್ಬ  | Sangamam Hubba by SFPI",
    "startDate": "2024-11-09T18:15:00+05:30",
    "endDate": "2024-11-09T19:45:00+05:30",
    "description": "This special edition of Sangamam pays tribute to Karnataka’s rich folk traditions and is dedicated to our vibrant folk arts with an unforgettable lineup of music, dance, and puppetry. \nThe evening will feature folk songs like Savdatti Yellamma from Northern Karnataka, Manteswamy Kathe from the South, and the soulful tunes of Shishunal Sharif. \nExperience the powerful energy of traditional dances, including Dollu Kunita, Kamsale, and Keelu Kudure, each narrating stories unique to Karnataka. \nAdding to the excitement, Mysuru Puppet Theatre will perform Narakasura Vadhe, an epic tale told through masterful puppetry that will captivate audiences of all ages. \nJoin us for an evening celebrating Karnataka’s folk artistry! \nIn collaboration with:\n \nWith support from:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sangamam-hubba-by-sfpi/",
    "keywords": [
      "Culture",
      "Dance",
      "Krishna to Kaveri",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-643.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "66124-1731175200-1731180600@bangaloreinternationalcentre.org",
    "name": "ಚಾಂಪಿಯನ್‌ಗಳ ಕೂಟ | The Champions' Huddle",
    "startDate": "2024-11-09T18:00:00+05:30",
    "endDate": "2024-11-09T19:30:00+05:30",
    "description": "Two extraordinary young athletes, Dhinidhi Desinghu and Rakshitha Raju, sit down with veteran sports journalist Prajwal Hegde to explore Karnataka’s sporting future. Dhinidhi, at just 13, is India’s youngest Olympic qualifier for Paris 2024 and a national swimming champion. Rakshitha, a para-athlete from Chikmagalur, is an Asian Para Games gold medalist who has overcome significant personal challenges. Join these inspiring young champions as they share their journeys, discuss the state of sports infrastructure, and envision the future of athletics in Karnataka. Through their fresh perspectives and Prajwal’s experienced lens, discover what it takes to nurture sporting talent in our state. Their conversation promises insights into the challenges, opportunities, and dreams that shape Karnataka’s sporting landscape. \nಪ್ರತಿಭಾನ್ವಿತ ಯುವ ಕ್ರೀಡಾಪಟುಗಳಾದ ಧಿನಿಧಿ ದೇಸಿಂಗು ಮತ್ತು ರಕ್ಷಿತಾ ರಾಜು ಅವರು ಹಿರಿಯ ಕ್ರೀಡಾ ಪತ್ರಕರ್ತೆ ಪ್ರಜ್ವಲ್ ಹೆಗಡೆ ಅವರೊಂದಿಗೆ ಕರ್ನಾಟಕದ ಕ್ರೀಡಾ ಭವಿಷ್ಯದ ಕುರಿತು ಮಾತನಾಡಲಿದ್ದಾರೆ. ಕೇವಲ ೧೩ ವರ್ಷದ ಧಿನಿಧಿ, ಪ್ಯಾರಿಸ್ ೨೦೨೪ ಒಲಿಂಪಿಕ್ಸ್‌ಗೆ ಅರ್ಹತೆ ಪಡೆದ ಭಾರತದ ಅತಿ ಕಿರಿಯ ಕ್ರೀಡಾಪಟು ಹಾಗೂ ರಾಷ್ಟ್ರೀಯ ಜಲತರಣ ಚಾಂಪಿಯನ್. ಚಿಕ್ಕಮಗಳೂರಿನ ಪ್ಯಾರಾ-ಅಥ್ಲೀಟ್ ರಕ್ಷಿತಾ, ಏಷ್ಯನ್ ಪ್ಯಾರಾ ಗೇಮ್ಸ್ ಚಿನ್ನದ ಪದಕ ವಿಜೇತೆ ಹಾಗೂ ಅನೇಕ ವೈಯಕ್ತಿಕ ಸವಾಲುಗಳನ್ನು ಮೀರಿ ಬೆಳೆದವರು. ಈ ಸ್ಫೂರ್ತಿದಾಯಕ ಯುವ ಚಾಂಪಿಯನ್‌ಗಳು ತಮ್ಮ ಪಯಣ, ಕ್ರೀಡಾ ಮೂಲಸೌಕರ್ಯಗಳ ಸ್ಥಿತಿಗತಿ ಮತ್ತು ಕರ್ನಾಟಕದ ಕ್ರೀಡಾ ಭವಿಷ್ಯದ ಬಗ್ಗೆ ಚರ್ಚಿಸಲಿದ್ದಾರೆ. ಯುವ ದೃಷ್ಟಿಕೋನ ಮತ್ತು ಪ್ರಜ್ವಲ್ ಅವರ ಅನುಭವದ ನೋಟದ ಮೂಲಕ, ನಮ್ಮ ರಾಜ್ಯದಲ್ಲಿ ಕ್ರೀಡಾ ಪ್ರತಿಭೆಗಳನ್ನು ಬೆಳೆಸುವ ಬಗ್ಗೆ ತಿಳಿಯಿರಿ. ಅವರ ಸಂವಾದವು ಕರ್ನಾಟಕದ ಕ್ರೀಡಾ ಕ್ಷೇತ್ರವನ್ನು ರೂಪಿಸುವ ಸವಾಲುಗಳು, ಅವಕಾಶಗಳು ಮತ್ತು ಕನಸುಗಳ ಕುರಿತು ಒಳನೋಟಗಳನ್ನು ನೀಡಲಿದೆ. \nWith support from:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-champions-huddle/",
    "keywords": [
      "Krishna to Kaveri",
      "Sports"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-639.jpg"
  }
]