[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "62931-1725130800-1725136200@bangaloreinternationalcentre.org",
    "name": "Nirvrithi",
    "startDate": "2024-08-31T19:00:00+05:30",
    "endDate": "2024-08-31T20:30:00+05:30",
    "description": "Nirvrithi is a state of inexplicable ecstasy. \nThrough the medium of Bharatanatyam, Shijith N Parvathy takes you on a journey in pursuit of this eternal bliss, the ultimate experience. In Bharatanatyam, the Margam is a path that unravels a seeking. Through this path the dancer attains Nirvrithi. \nThe concept of Satchitananda described in the central piece of the performance is what Shijith N Parvathy through their conceptual choreographic Margam takes you to experience. Nirvrithi is woven from manifested inner thoughts to stimulate the body, mind and soul. \nFor Shijith N Parvathy, Bharatanatyam is a spiritual recourse and Nirvrithi is their experience. \nThis is the fourth edition of the ‘All For Dance’ series presented by Kalavaahini in association with BIC curated by Malavika Sarukkai. The ‘All For Dance’ series is presented every quarter at BIC to spotlight some of the best of classical dance from across India. The series is supported by Tanishq and Taneira. The event is managed by Shreya Nagarajan Singh Arts Department Consultancy. \nIn collaboration with:\n \nSupported by:\n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/nirvrithi/",
    "keywords": [
      "Culture*",
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-571.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "62916-1724697000-1724702400@bangaloreinternationalcentre.org",
    "name": "Envisioning Viksit Bharat",
    "startDate": "2024-08-26T18:30:00+05:30",
    "endDate": "2024-08-26T20:00:00+05:30",
    "description": "Speaking from the Red Fort on August 15, 2024 at the start of his third term, Prime Minister Shri Narendra Modi, expressed confidence that India can and will become a developed society by 2047. \nIn this talk, Suman Bery, Vice Chairman, NITI Aayog will address the challenges of analysis over this long horizon and the reform agenda needed for India to succeed. A Q&A with the audience will follow. \nThis lecture is a part of Azim Premji University’s Public Lecture Series. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/envisioning-viksit-bharat/",
    "keywords": [
      "Development",
      "Economics",
      "Governance",
      "Policy & Regulation",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-567.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "62465-1724371200-1724630399@bangaloreinternationalcentre.org",
    "name": "Beyond Story",
    "startDate": "2024-08-23T05:30:00+05:30",
    "endDate": "2024-08-26T05:30:00+05:30",
    "description": "Friday | Aug 23 | 6:30 pm onwards\nSaturday | Aug 24 | 10:30 am onwards\nSunday | Aug 25 | 10:30 am onwards \nStories dominate our lives, whether in books, films, religion or politics. Ideas and thoughts seem to become palatable only when they are contained within stories with strong characters and tightly woven plots. Of late, even non-fiction filmmakers tend towards single-character narratives, with clearly defined three-act structures. \nBeyond Story explores an alternative – the essay film – over three days of interactive sessions with filmmakers and film scholars. \nSchedule: \n\n\n\n\nFriday | Aug 23\nSaturday | Aug 24\nSunday | Aug 25\n\n\n10:30 am\n\nScreening: \nNight and Fog\nby Alain Resnais\n1956 | 32 mins \nLa Jetée\nby Chris Marker\n1962 | 28 mins\nScreening: \nLooking for Horses \nby Stefan Pavlovic\n2021 | 88 mins\n\n\n12:15 pm\n\nTalk: \nDigital Afterlives of Films\nChloé Galibert-Laîné\nRitika Kaushik\nTalk: \nEat your Mother and Father\nYashaswini Raghunandan \n \n\n\n02:30pm\n\nTalk: \nThe making of an Essay Film – Impetus and Discovery\nSameera Jain\nTalk: \nNon-Narratives with Conceptual Extensions\nVasanthi Mariadass \n \n\n\n04:30 pm\n\nScreening: \nI Am Yet to See Delhi \nby Humaira Bilkis\n2014 | 19 mins \nJamnapaar\nby Abhinava Bhattacharyya\n2017 | 24 mins \nChadariya\nby Nimisha Srivastava\n2022 | 25 mins \n(Films from the Creative Documentary Course, SACAC, New Delhi)\\\nTalk: \nEssay Film and the Voice\nMathew Barrington \n  \n  \n  \n  \n  \n \n\n\n06:30 pm\nTalk: \nImage and Sound as Text\nAvijit Mukul Kishore \n  \n  \n  \n  \n \nScreening: \nTales from Planet Kolkata by Ruchir Joshi\n1993 | 38 mins\nFollowed by a discussion with the Director. \n  \n  \n \nScreening: \nNight and Fear (Raati O Bhaya) by Lipika Singh Darai\n2023 | 28 mins\nFollowed by Q&A with the Director. \nLetter From Your Far-off Country by Suneil Sanzgiri\n2020 | 17 mins \nGolden Jubilee by Suneil Sanzgiri\n2021 | 19 mins\n\n\n\nDay 1\n23 August | Friday \n6:30 pm\nImage and Sound as Text\nA Talk by Avijit Mukul Kishore\nFilm is a temporal art form that employs multiple registers of image, sound, music and memory to make meaning. This talk will feature in-depth analysis of short films and excerpts from longer essay films in different genres that include actuality, observational documentary, found-footage film and autobiography, to look at the complex ways in which film’s formal elements come together to create meaning while drawing on our lived experience. \nDay 2\n24 August | Saturday \n10:30 am\nScreening: Night and Fog\nAlain Resnais | 1956 | 32 mins\nThis poignant and harrowing documentary reflects on the horrors of Nazi concentration camps, blending historical footage with contemporary observations to evoke the stark reality of genocide and the importance of remembering its lessons. \nScreening: La Jetée\nChris Marker | 1962 | 28 mins\nIn a post-apocalyptic future, a man is sent back in time to explore the past and find a way to save humanity, but his journey leads him to an unexpected and haunting conclusion. This innovative sci-fi short film is told almost entirely through still photographs.\n \n12:15 pm\nDigital Afterlives of Films\nTalks by Chloé Galibert-Laîné and Ritika Kaushik\nChloé Galibert-Laîné: In this deeply personal video diary, a young researcher tries to make sense of her fascination for the film “The Pain of Others” by Penny Lane. A deep dive into the discomforting world of YouTube and online conspiracies, that challenges traditional notions of what documentary cinema is or should be.\nRitika Kaushik: Ritika Kaushik will consider the video essay as a form for examining the digital afterlives of films from the past. Kaushik’s talk will take us through her formal experiments with online and desktop interactions and how they can enliven archival and contemporary digital materials to bring out new configurations of film historiography. She will specifically discuss the ‘reaction video’ as an essayistic technique for creating an embodied and affective engagement with pre-existing audiovisual media. \n2:30 pm\nThe making of an Essay Film – Impetus and Discovery\nA Talk by Sameera Jain\nStemming from a practitioner’s perspective, the session looks at some recent short films and traces their journeys of making. We find that the form appears through a search for a relationship with image, sound, time, meaning and affect, a pursuit that is not governed by existing formulations, but by the creative processes in practice. The talk will attempt to unpack phases in these navigations and present how the cinema essay is ‘found’, reflecting on the openness, expanse, fluidity and inclusivity of the form. In addition, referencing contemporary and historical cinema, we explore facets of the essay film, walking through with some examples. \n4:30 pm\nScreening: Films from the Creative Documentary Course, SACAC, New Delhi\n• I Am Yet to See Delhi by Humaira Bilkis | 2014 | 19 mins\n• Jamnapaar by Abhinava Bhattacharyya | 2017 | 24 mins\n• Chadariya by Nimisha Srivastava | 2022 | 25 mins \n6:30 pm\nScreening: Tales from Planet Kolkata\nRuchir Joshi | 1993 | 38 mins\nTales from Planet Kolkata anticipates the period Calcutta was approaching in the early 90s: the wasteland of violent traffic, the orgy of rampant construction, the severing of old traditions, the rise of cynical politics, the strange, once again subservient relationship with the west. Seeing it today, it’s startling how much of it still resonates with the city Calcutta/Kolkata has become. Part fiction, part spoof, part essay, part documentary, the film weaves together disparate strands: a critique of Western media’s construction, from the 1960s to the 1990s; of Calcutta as ‘the black hole’ and ‘the worst place in the world’; an ‘elegy’ to Deepak Majumdar, one of  Calcutta’s great intellectual mavericks, a teacher and friend to Joshi and many others, who died while the film was being made; and the images and song of a patua – a traditional Bengali scroll-painter. \nThe screening of the film will be followed by a discussion with the director, Ruchir Joshi. A Q&A with the audience will follow. \nDay 3\n25 August | Sunday \n10:30 am\nScreening: Looking for Horses\nStefan Pavlovic | 2021 | 88 mins\nTravelling to Bosnia in search of his origins, filmmaker Stefan Pavlović meets a solitary fisherman. One man has language impairment, the other lost his hearing during the war. Camera in hand, the director films the onset of this improbable and profound friendship. \n12:15 pm\nEat your Mother and Father\nA Talk by Yashaswini Raghunandan\nIn this session we will look at how filmmakers weave in their families and themselves to expand the conversations around identity, alienation and political histories. Through the films ‘Looking for Horses’ by Stefan Pavlovic, ‘Will you look at me?’ by Shuli Huang and ‘A picture of you’ by Ajay Naronha, we will look at how the essay is constructed through the making of the film, revealing an intimate side of filmmaking. All three filmmakers use filmmaking as a method to ask difficult questions and to re-connect, allowing for some form of catharsis. \n2:30 pm\nEssay Film and the Voice\nA Talk by Matthew Barrington\nIn this session we explore the complexities of voice as both a narrative device and a vehicle for personal expression, as we examine its transformative power in shaping cinematic discourse. From subjective introspection to objective analysis, we unpack how the voice navigates the intricate intersections of truth, perspective, and interpretation within the essay film landscape. The voice as subjective – departing from a dominant, authoritative narrator. \n4:30 pm\nNon-Narratives with Conceptual Extensions\nA Talk by Vasanthi Mariadass\nVisual essays are noted for non-narrative style. A re-editing to re-narrate stories untold or less told. I engage with works by Ursula Biemann, and Harun Farocki, to examine their theoretical insertions through the visual form.  I would not just call them visual essays but an unfolding of visual theory.  Images collide or they are quietly juxtaposed, despite the events and topics coming from different spaces, times, and seemingly unrelated topics/images, hence refreshing found images and concepts. Conceptual works by Biemann relate to Environmental concerns and Farocki’s concept examines an already established idea such as the enlightenment but rethinks and retells other not-so-visible concepts such as perfection and precision that silently negotiate the development of scientific and technological production. \n6:30 pm\nScreening: Night and Fear (Raati O Bhaya)\nLipika Singh Darai | 2023 | 28 mins\nThe residuals of recorded material generated by the filmmaker over a decade of filmmaking practice, with the passing of time, have acquired new meaning. With a range of experiences – from a local witch hunt to a meeting with a stunning waterfall – the past, the present, the fear and the intuitive self, have found shelter in the characters and spaces from the world captured through image and sound which have aged just enough to correlate and run a parallel narrative. Having a twofold interior, Night and Fear is a personal essay addressed to the filmmaker’s late grand aunt, but also a reflection on the impact of making films – on the filmmaker herself and the society. \nThe screening of the film will be followed by Q&A with the Director. \nScreening: Letter From Your Far-Off Country\nSuneil Sanzgiri | 2020 | 18 mins\nShot with 16mm film stock that expired in 2002—the same year as the state-sponsored anti-Muslim genocide in Gujarat—and filmed amid the anti-CAA protests in Delhi, the filmmaker traces lines and lineages of ancestral memory, poetry, history, songs, and ruins from his birth in 1989. \nScreening: Golden Jubilee\nSuneil Sanzgiri | 2021 | 19 mins\nWhat is liberation when so much has already been taken? Who has come for more? ‘Golden Jubilee’, takes as its starting point scenes of the filmmaker’s father navigating a virtual rendering of their ancestral home in Goa, India, created using the same technologies of surveillance that mining companies use to map locations for iron ore in the region. A tool for extraction and exploitation becomes a method for preservation. The father, sparked by a memory of an encounter as a child, inhabits the voice of a spirit known locally as Devchar, whose task is to protect the workers, farmers, and the once communal lands of Goa. Protection from what the filmmaker asks. \nIn collaboration with: \n          \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/beyond-story/",
    "keywords": [
      "Film",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "bn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-41.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63086-1724869800-1724875200@bangaloreinternationalcentre.org",
    "name": "Carving a Legacy",
    "startDate": "2024-08-28T18:30:00+05:30",
    "endDate": "2024-08-28T20:00:00+05:30",
    "description": "The 12th-13th century Hoysala temples of Belur, Halebidu, and Somanathapura were recently recognised as UNESCO World Heritage. They are known for their stunning architecture and sculpture. This talk will explore some of their unique aspects, the rigorous process of UNESCO nomination for World Heritage status, and the outstanding values of these stunning temples that ultimately secured their coveted World Heritage status. \nPresented by the International Music and Arts Society \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/carving-a-legacy/",
    "keywords": [
      "Culture*",
      "Heritage",
      "History",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-581.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "62879-1724371200-1724716799@bangaloreinternationalcentre.org",
    "name": "Abu’s World",
    "startDate": "2024-08-23T05:30:00+05:30",
    "endDate": "2024-08-27T05:30:00+05:30",
    "description": "Exhibition Opening: Friday, 23 August 6:30 pm\nTimings: 10 am to 8 pm\nExhibition on show until Monday, 26 August \nWalkthroughs with the Curator:\nFriday 23 August, 6:45 pm\nSaturday, 24 August, 11:30 am and 6:00 pm\nSunday, 25 August, 3:00 pm and 6:00 pm\nMonday, 26 August, 6:30 pm \nPanel Discussion: Sunday, 25 August, 11:00 am \nIt has been almost 22 years since Abu Abraham’s acerbic pen was laid to rest in his home state of Kerala. But the magnificent oeuvre of this renowned Thiruvalla-born cartoonist, artist, journalist, and author will endure.  \nIn his nearly six-decade career, from the late 1940s to the early 2000s, with some of the leading publications in India and England, Abu captured the zeitgeist of those turbulent times in his prodigious output that comprised political cartoons, illustrations for newspaper columns, caricatures, comic strips, impressionist sketches, travel drawings, portraits, and even an animation film titled No Arks. \nOn display are cartoons, sketches, and notebooks, including some that have never been seen in public before. These works also chronicle his extensive travels all over the world, his presence at momentous events, and his meetings with the famous personalities of those times. Abu’s career peaked in the 1970s after he returned to India from England. From his vantage point in the national capital, he was able to dissect major events like the Bangladesh War and the Emergency with his biting wit that never shied away from speaking truth to power. Not surprisingly, Prime Minister Indira Gandhi, who was at the centre of most political developments, figured prominently in his cartoons, as did the national and regional leaders who were in opposition to her, including those from her own party. \nThis centenary exhibition provides a glimpse into Abu’s large body of work, evoking his versatility as an artist and the spirit with which he lived his life. True to the ethos of political satire, he does not spare anyone! The exhibition has travelled to Kochi and Kolkata and will go to New Delhi after this show in Bangalore. Don’t miss it! \nOn Sunday, August 25, 2024 at 11 am, as part of the exhibition “Abu’s World,” there will be a panel discussion featuring cartoonists, journalists, and a historian. They will explore the impact and significance of Abu Abraham’s work in their respective fields and its relevance in contemporary times. \nThis exhibition was supported by the Kerala Lalithakala Akademi. \n(Text courtesy: Ayisha and Janaki Abraham, Mario Rodriguez, Siddharth Shivakumar, Prateeti Punja Ballal) \n",
    "url": "https://bangaloreinternationalcentre.org/event/abus-world/",
    "keywords": [
      "History",
      "In Memory",
      "Politics",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-563.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "62670-1724871600-1724878800@bangaloreinternationalcentre.org",
    "name": "Jod | In Resonance",
    "startDate": "2024-08-28T19:00:00+05:30",
    "endDate": "2024-08-28T21:00:00+05:30",
    "description": "Join us for an evening of traditional Hindustani music, featuring a duet performance showcasing the rich interplay between voice and flute. \nVocalist Anirudh Aithal will be accompanied by flautist Sadaj Godkhindi, combining melodies with intricate rhythms. Vignesh Bhagavat on harmonium will provide supportive textures, while Roopak Kallurkar on tabla will bring dynamic rhythmic patterns. \nIn collaboration with:\n \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/jod-in-resonance/",
    "keywords": [
      "Culture*",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Jod | In Resonance"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-569.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "62978-1724958000-1724963400@bangaloreinternationalcentre.org",
    "name": "Rhythms of the Desert",
    "startDate": "2024-08-29T19:00:00+05:30",
    "endDate": "2024-08-29T20:30:00+05:30",
    "description": "Manganiars of Rajasthan are a hereditary community of professional musicians from the villages of Barmer, Jodhpur, and Jaisalmer in the desert areas of Western Rajasthan. The Manganiars and the Langas have a vast repertoire of folk music integral to their way of life and social systems. Their music, which has been preserved and passed down through generations, acts as a medium of information and storytelling, much like the postcards in your exhibition. \nThe Manganiars’ music has survived for decades thanks to the traditional Jajmani (patronage) system, which supports their art form and livelihood. Their music has continued to survive for decades mainly because of the Jajmani (patronage) system, which is fundamental to their art form as well as the source of traditional livelihood. These traditional patrons have been supporting the economy of the communities of Langa and Manganiyar musicians for generations. \nAn eight-member team led by Sardar Khan Langa & Sawai Khan Manganiyar will present traditional folk music of Rajasthan along with Kalbeliya song & dance. Sardar Khan is a senior Langa guru, a very knowledgeable person of Barnawa Jageer, and has traveled worldwide to present traditional folk music. Sawai is a young Khartal player of Barna Jaisalmer who has collaborated with various world music maestros. The other members of the team consist of Deu Khan in vocals, Sikander Khan in Sindhi Sarangi & Algoza, and Samder Khan in Dholak. This music group will be accompanied by a three-member Kalbelia team including two dancers and one musician. \nIn collaboration with: \n      \n",
    "url": "https://bangaloreinternationalcentre.org/event/rhythms-of-the-desert/",
    "keywords": [
      "Culture*",
      "Dance",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "sd",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Rhythms of the Desert"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-2_POSTERS.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "62806-1724499000-1724504400@bangaloreinternationalcentre.org",
    "name": "Deeper Vulnerabilities of India’s Democracy",
    "startDate": "2024-08-24T11:30:00+05:30",
    "endDate": "2024-08-24T13:00:00+05:30",
    "description": "Democracy, representing the will of the people, is the least imperfect form of government in the present day world.  Yet even this will of the people can’t  remain unfettered, for without constitutional limits,  democracy is often distorted. What then are the challenges to India’s constitutional democracy? This lecture will speak of the multiple obstacles to Constitutional Democracy but will focus on deep rooted, long standing mental and social habits that prevent the smooth functioning of constitutional democracy in India. \nThis lecture is the first in the series titled ‘We the People’ to celebrate 75 years of our Constitution. As part of this series, DAKSH, in collaboration with BIC, are organising a series of lectures and panel discussions on various aspects of the Constitution. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/deeper-vulnerabilities-of-indias-democracy/",
    "keywords": [
      "Governance",
      "Law",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-580.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "62887-1724583600-1724590800@bangaloreinternationalcentre.org",
    "name": "Not Just a Laughing Matter!",
    "startDate": "2024-08-25T11:00:00+05:30",
    "endDate": "2024-08-25T13:00:00+05:30",
    "description": "Abu Abraham’s career as a cartoonist, columnist and artist spanned over 50 years, from the late 1940s to the early 2000s, during which his work appeared in a range of newspapers and magazines in India and the UK. Throughout this period of significant political change and upheaval, he critically responded to the political landscape, producing a rich and complex oeuvre that reflects these shifts.  \nThe ongoing centenary exhibition, “Abu’s World,” brings together, for the first time, the breadth of Abu Abraham’s work as a cartoonist and journalist across six decades. Through Abu’s political cartoons, drawings, caricatures, and writings from the late 1940s until his passing in 2002, viewers can journey through a lively political history of India and the world. \nAs part of the exhibition, this panel discussion features cartoonists, journalists, and a historian. They will explore the impact and significance of Abu Abraham’s work in their respective fields and its relevance in contemporary times. \n",
    "url": "https://bangaloreinternationalcentre.org/event/not-just-a-laughing-matter/",
    "keywords": [
      "History",
      "In Memory",
      "Politics",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-564.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63029-1725042600-1725048000@bangaloreinternationalcentre.org",
    "name": "Inside India’s Red Corridor",
    "startDate": "2024-08-30T18:30:00+05:30",
    "endDate": "2024-08-30T20:00:00+05:30",
    "description": "The Red Corridor remains one of the most complex and challenging areas in India, marred by Naxal-State conflict, that has been shaping the lives of its residents for over half a century. In the years of reporting from the conflict zone of Bastar, journalist Ashutosh Bhardwaj pieced together The Death Script: Dreams and Delusions in Naxal Country. \nIn this session, Ashutosh will shed light on his experience in the conflict zone – reporting on the Maoist, the state atrocities, the plight of the Adivasis caught in the civil war and what it means to live through and write about these experiences as a journalist and a bilingual writer. He will talk about deviating from the traditional form of journalistic writing into more creative ones and the crossroads where these forms converge and diverge. The talk will also offer insights into the status of the Hindi media, its role in shaping the Hindi belt polity, and the urgent need to focus on and invest in this media section. \nAshutosh Bhardwaj will be in conversation with Kannada author Vasudhendra followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/inside-indias-red-corridor/",
    "keywords": [
      "Books",
      "Governance",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_poster.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "62136-1724353200-1724356800@bangaloreinternationalcentre.org",
    "name": "Ambient Improvisations",
    "startDate": "2024-08-22T19:00:00+05:30",
    "endDate": "2024-08-22T20:00:00+05:30",
    "description": "Join us for an intimate evening of contemporary jazz and ambient music featuring Tarun Balani, a seasoned jazz drummer and composer from India, and guitarist Siddharth Gautam. \nThe duo will reinterpret selections from Balani’s albums, Dharma and The Shape of Things to Come, while also introducing elements from his upcoming release. The performance will weave together ambient textures and improvisational techniques, offering a fresh take on Balani’s original compositions. \nThe set aims to create an immersive experience through the fusion of jazz and ambient soundscapes, highlighting the duo’s collaborative approach to music-making. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/ambient-improvisations/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Ambient Improvisations"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-39.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "62220-1724785200-1724789700@bangaloreinternationalcentre.org",
    "name": "Khooni Vaisakhi",
    "startDate": "2024-08-27T19:00:00+05:30",
    "endDate": "2024-08-27T20:15:00+05:30",
    "description": "105 years ago, on April 13, 1919, British troops, under the command of General Reginald Dyer, opened fire on a crowd of unarmed Indians who had assembled in Jallianwala Bagh in Punjab. Over a thousand people were killed and wounded during the massacre but 22-year old Nanak Singh miraculously survived and wrote Khooni Vaisakhi, a searing ballad with twenty-four poems providing a remarkable chronological account of events during the first fortnight of April 1919. \nFormer Ambassador Navdeep Suri, the grandson of the legendary Punjabi poet Nanak Singh, along with songwriter and musician Harpreet, will perform pieces from their musical album based on Nanak Singh’s Khooni Vaisakhi. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/khooni-vaisakhi/",
    "keywords": [
      "History",
      "Poetry",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "pa",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-552.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "62957-1725044400-1725049800@bangaloreinternationalcentre.org",
    "name": "Tango Ports",
    "startDate": "2024-08-30T19:00:00+05:30",
    "endDate": "2024-08-30T20:30:00+05:30",
    "description": "Puertos de Tango (Tango Ports) aims to revisit lesser-known themes of great Uruguayan authors, thus keeping wonderful compositions alive. The project includes a special tribute to Astor Piazzolla and the great Uruguayan poet Horacio Ferrer, evoking much of their creative duo and reinterpreting part of their repertoire inspired by the artists’ homeland, Uruguay. In this kind of cosmopolitan tango without temporal and spatial boundaries, some versions in Italian and French are included, justified in the words of Ramón Pelinski (Argentine ethnomusicologist and composer) who describes tango as a “global metaphor”: a tango with infinite possibilities, capable of imagining and travelling to other worlds, without fear that “its entire life is yesterday, holding it in its past.” \nNatalia Bolani seeks her own interpretation from her perspective as an actor, resignifying and valuing the chosen texts through contemporary sounds, mainly appealing to the sound of the piano and the bandoneón, instruments with strong organic and referential connotations in Rio de la Plata culture. \nThe project intends to attract new audiences to this genre, as well as to offer a repertoire not usually enjoyed by those more familiar with the music. Its raison d’être is, ultimately, the encounter with the emotions, a meeting where interpretive and sonorous power intermingle in the same waters, in a kind of cathartic ritual through artistic creation. \nPresented by the Embassy of Uruguay and MLC Estates LLP \n  \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/tango-ports/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Tango Ports"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTERS.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "62998-1725120000-1725123600@bangaloreinternationalcentre.org",
    "name": "The Story of Kalbelia",
    "startDate": "2024-08-31T16:00:00+05:30",
    "endDate": "2024-08-31T17:00:00+05:30",
    "description": "Kalbelia, a vibrant and mesmerizing traditional dance form from Rajasthan, India, is inscribed on UNESCO’s 2003 Representative List of the Intangible Cultural Heritage of Humanity. This workshop offers participants a unique opportunity to immerse themselves in the rich cultural heritage of the Kalbelia community, which is closely linked to the Navnaths and believed to have gypsy origins. The name “Kalbelia” itself reflects the community’s historical connection to snake charming, with “kal” meaning snake and “belia” meaning friendship. \nParticipants will explore the striking features of Kalbelia dance, known for its swirling movements and colorful costumes, which have made it one of the most captivating dance forms in India. The session will be led by renowned Kalbelia dancers, Kavita Kalbelia and Kanchan Kalbelia, from Chopasani, Jodhpur—a village famous for its Kalbelia performers. They will be accompanied by Govardhan Nath on the dafli and other musicians on the dholak and pungi. \nThe session begins with an introduction to Kalbelia’s rich heritage, followed by a film screening that showcases the traditions and lifestyle of the Kalbelia community. After the film screening, the artists will present a short live performance, showcasing the energetic and captivating Kalbelia dance. This performance will highlight the intricate movements and rhythmic patterns that are the hallmark of Kalbelia. The session culminates in an interactive session where participants can learn Kalbelia dance steps and songs directly from the artists, providing a truly hands-on and memorable experience. \nIn collaboration with: \n      \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-story-of-kalbelia/",
    "keywords": [
      "Culture*",
      "Dance",
      "Performing Arts",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-2_POSTER-16.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "62820-1724439600-1724445900@bangaloreinternationalcentre.org",
    "name": "ಬಾಬ್ ಮಾರ್ಲಿ ಫ್ರಮ್ ಕೋಡಿಹಳ್ಳಿ  | Bob Marley from Kodihalli",
    "startDate": "2024-08-23T19:00:00+05:30",
    "endDate": "2024-08-23T20:45:00+05:30",
    "description": "Kannada | 105 minutes | Suitable for 8+ years \n‘ಗುರುತು’ ಅನ್ನುವುದು ಕೆಲವರಿಗೆ ಹೆಮ್ಮೆಯಾದರೆ, ಕೆಲವರಿಗದು ಅಸಹ್ಯ, ಹಿಂಸೆ, ಜೀವನದ್ದುದ್ದಕ್ಕೂ ಹೊತ್ತು ತಿರುಗಬೇಕಾದ ಹೆಣಭಾರದ ಚಾಕರಿ. ಹಲವು ಬಾರಿ ‘ಉಳಿವಿಗಾಗಿ’ ಗುರುತುಗಳನ್ನು ಮುಚ್ಚಿಡುತ್ತಾ ಸಾಗುವುದೇ’ ಬದುಕು’ ಅನ್ನಿಸಿಕೊಂಡು ಹರಿಯುತ್ತಾ ಹಗುರಾಗುವುದು ಸಾಗದ ದಾರಿಯಾಗಿ ಕಂಡು ದಣಿವಾಗುತ್ತದೆ. ದಣಿವಾಗುತ್ತದೆ ಎಂಬ ಕಾರಣಕ್ಕೆ ಹಾರಾಡುವ ಬಯಕೆಯನ್ನು ಬಿಡುವಂತೆಯೂ ಇರುವುದಿಲ್ಲ. ಕತ್ತಲ ದಾರಿಯಲ್ಲಿ ಮಿಂಚುಹುಳುಗಳಿಗಾಗಿ ಜೀವ ಆತುಕೊಳ್ಳಬೇಕಾಗುತ್ತದೆ. ಆಗ ಕತ್ತಲೊಂದು ಸಂಭ್ರಮ ಬೆಳಕೊಂದು ಸಂಭ್ರಮ. ಹೀಗೆ ಗುರುತಿನ ಸುತ್ತ ಇರುವ ಹಲವು ಸಂಕೀರ್ಣ ವೀರೋಧಭಾಸಗಳನ್ನು ಎದುರುಗೊಳ್ಳುವ ಕಥನಗಳ ಗೊಂಚಲು’ ಬಾಬ್ ಮಾರ್ಲಿ ಫ್ರಮ್ ಕೋಡಿಹಳ್ಳಿ’. ಇಲ್ಲಿ‘ಬಾಬಾ ಸಾಹೇಬ್ ಅಂಬೇಡ್ಕರ್ ಅವರ ‘Waiting for a Visa’ ಒಂದು ರೂಪಕವಾಗಿ ಕಂಡು ಅವರು ನಿಜಕ್ಕೂ ಪ್ರವೇಶ ಕೇಳುತ್ತಿರುವುದು ಎಲ್ಲಿಗೆ? ಅನ್ನುವ ಪ್ರಶ್ನೆ ಮುಖ್ಯವಾಗುತ್ತದೆ. \nಪಠ್ಯ ಆಕರ: ಎನ್.ಕೆ ಹನುಮಂತಯ್ಯ, ಚಂದ್ರಶೇಖರ್ ಕೆ\nರಚನೆ, ವಿನ್ಯಾಸ, ನಿರ್ದೇಶನ: ಲಕ್ಷ್ಮಣ್. ಕೆ.ಪಿ\nಡ್ರಮಟರ್ಗಿ: ವಿ. ಎಲ್. ನರಸಿಂಹಮೂರ್ತಿ\nಪ್ರದರ್ಶನ ಪಠ್ಯ ವಿನ್ಯಾಸ, ನಟನೆ: ಮರಿಯಮ್ಮ ಚೂಡಿ, ಚಂದ್ರಶೇಖರ್ ಕೆ, ಶ್ವೇತಾರಾಣಿ ಹೆಚ್ ಕೆ, ಭರತ್ ಡಿಂಗ್ರಿ\nಬೆಳಕು: ಮಂಜು ನಾರಾಯಣ್, \nA play on the concealment of caste and identity. The play is set in an urban context. Three characters trying to make a living in Bangalore are forced to leave their house because of their identities. An intimate conversation happens between those three as it is the last night that they are staying there, which reveals the depths of their inner selves to each other. \n\n\n\nFor some, ‘identity’ is a source of pride, while for others, it’s a source of disgust, violence, and a lifelong burden to carry. Many times, ‘survival’ seems to involve concealing one’s identities, flowing and lightening oneself, only to find that the path doesn’t lead anywhere, leading to exhaustion. Yet, exhaustion isn’t reason enough to give up the desire to soar. In the dark path, one must cling to life for the fireflies. Then, darkness becomes a celebration, light becomes a celebration. \nBob Marley from Kodihalli is a collection of narratives that confront the many complex paradoxes surrounding identity. Here, Dr. B.R. Ambedkar’s ‘Waiting for a Visa’ becomes a metaphor, raising the crucial question: where is he really seeking admission? \nThis play explores the intricacies of identity, the struggles of concealment for survival, and the persistent hope symbolized by fireflies in darkness. It uses Ambedkar’s work as a central theme to question the nature of acceptance and inclusion in society. \n\n\n\n\n\n\n\n\n\n\nTextual Inspiration: N K Hanumanthaiah, Chandrashekara K\nWriting, Design and Direction: Lakshman KP\nDramaturgy: VL Narasimhamurthy\nPerformance text design and Acting: Mariyamma Chudi, Chandrashekar K, Shwetha Rani HK, Bharath Dingri\nLighting Design: Manju Narayan\nLights Execution: Sachin\nProduced by Nirdigantha\nA Jangama Collective Offering \n  \n                        \n  \nSupported by \n \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%ac%e0%b2%be%e0%b2%ac%e0%b3%8d-%e0%b2%ae%e0%b2%be%e0%b2%b0%e0%b3%8d%e0%b2%b2%e0%b2%bf-%e0%b2%ab%e0%b3%8d%e0%b2%b0%e0%b2%ae%e0%b3%8d-%e0%b2%95%e0%b3%8b%e0%b2%a1%e0%b2%bf%e0%b2%b9%e0%b2%b3/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "ಬಾಬ್ ಮಾರ್ಲಿ ಫ್ರಮ್ ಕೋಡಿಹಳ್ಳಿ  | Bob Marley from Kodihalli"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-562.jpg"
  }
]