[
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Open Source, Open Knowledge",
    "startDate": "2024-06-15T10:00:00+05:30",
    "endDate": "2024-06-15T13:00:00+05:30",
    "description": "This event is a 3-hour seminar on intellectual property in India, hosted by Professor Lawrence Liang and Carl Malamud of the Servants of Knowledge Initiative. \nThis seminar is aimed at people who spend time on Access to Knowledge, Free and Open Software, and other civic technologies. \nOpen source software, and Creative Commons licensing emerged as an important challenge to the dominant narrative of copyright law. The framework of open knowledge has played a pivotal role in democratizing information, fostering collaboration, and empowering creators and users alike. However, in the last two decades, we have also witnessed their limitations, especially when it comes to addressing the question of infrastructure. Physical libraries are a good example of how the limitations of physical goods and severely constrained infrastructures still serve as a impediment to access to knowledge. \nIn the domain of library infrastructure, one particularly noteworthy innovation is the digitization of books, a process that transforms physical texts into accessible digital assets. Book scanning, as a cornerstone of digital library infrastructure, offers a compelling case study in navigating the intricate landscape of copyright exceptions and controlled lending. At its core, book scanning epitomizes the transformative power of technology in democratizing access to knowledge. By digitizing print collections, libraries can transcend physical constraints, reaching those who traditionally do not have access and ensuring the preservation of knowledge for future generations. However, the process of digitization raises complex legal considerations, particularly in relation to copyright law. \nIn many jurisdictions, copyright exceptions and limitations provide a legal framework for libraries to digitize and make available certain works without seeking explicit permission from rights holders. These exceptions often encompass activities such as preservation, research, and access for individuals with print disabilities. However, the scope and applicability of these exceptions vary widely across jurisdictions, posing challenges for libraries seeking to navigate a patchwork of legal regimes. \nIn this workshop, we focus on copyright law in India and contend that the design of exceptions and limitations in India are particularly facilitative of access. Using case studies such as the Delhi University photocopy case, the Sci-Hub case and the Hatchette case on Controlled digital lending, we will probe questions of how copyright in India can be used to facilitate the creation of infrastructures of knowledge. Using our experience at servants of knowledge, of scanning large libraries, we propose a framework that brings together open source activists, book collectors, librarians, students, researchers and authors under a common platform “Public library of India”, designed to imagine digital infrastructure for 21st century India. \nFor further reading: \n\nLiang and Malamud, Controlled Lending by Public Libraries Under Indian Law, https://archive.org/details/Controlled.Lending.India/Controlled.Lending.20230505.pamphlet/\nMalamud, Gyan Satyagraha, Remarks Delivered at Kannada University, https://archive.org/details/kannada.university.20240415/02-kannada.university.20240415/\nLiang and Gupta, The Public Library Movement in India, https://archive.org/details/public.library.movement.india\n\nPresented by: \n \n  \n",
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/open-source-open-knowledge/",
    "keywords": "Books, Education, Law, Technology, Workshops",
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-13_POSTER.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Art as Activism",
    "startDate": "2024-06-16T11:30:00+05:30",
    "endDate": "2024-06-16T13:00:00+05:30",
    "description": "This discussion is set in the context of the recent ruling from the Karnataka High Court that limits public protests in Bangalore to a designated space within one park in the city, that too subject to police approval. It aims to explore how art can serve as an alternative medium for voicing dissent and fueling public discourse. \nThe panel will discuss the ramifications of the Court’s ruling and its impact on communities, and talk about art as a potent tool for social change. Through their experiences, the panelists will demonstrate how art can amplify voices, provoke thought, and catalyze change even amidst growing restrictions on dissent. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/art-as-activism/",
    "keywords": "Bangalore, Cities, Politics, Society, Visual Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-495.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "A Ballet Soirée",
    "startDate": "2024-06-25T19:00:00+05:30",
    "endDate": "2024-06-25T20:15:00+05:30",
    "description": "The National Youth Ballet company will present an evening of repertoire that is curated with excerpts from classical and modern ballets. Among the varied selection are pieces from timeless ballets like The Nutcracker, Paquita, La Bayadere, and Swan Lake. \nFrom the wintry escapade of the Waltz of the Snowflakes, the charm of the tambourine in La Esmeralda to the gripping Ankle Scarf Dance from La Bayadere, the pieces will be weaved together to transcend the audience into a land of ethereal artistry. The soirée aims to offer insights into the multifaceted realms of ballet while delving into its nuanced expression. \nIn collaboration with: \n \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/a-ballet-soiree/",
    "keywords": "Dance, Performing Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-486.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "ಕಣಿವೆಯ ಹಾಡು | Kaniveya Haadu",
    "startDate": "2024-06-12T19:00:00+05:30",
    "endDate": "2024-06-12T20:30:00+05:30",
    "description": "Kannada | 70 minutes | Ages 8+ \nಮೂಲತಃ ದಕ್ಷಿಣ ಆಫ್ರಿಕಾ ನೆಲದ ಕತೆಯಿದು. ಆದರೆ ಎಲ್ಲ ಶ್ರೇಷ್ಠ ಕೃತಿಗಿರುವಂತೆಯೇ ಈ ಕತೆಗೂ ದೇಶ, ಕಾಲ ಮೀರಿದ ಪ್ರಸ್ತುತಿಯ ಅಪಾರ ಸಾಧ್ಯತೆ ಇದೆ. ಅಂತಹ ಪ್ರಯತ್ನವಿದು. ಕಣಿವೆಯ ಹಾಡು ಕಣಿವೆ ದಾಟುವ, ಕಣಿವೆಯೊಳಗಿನ ಬದುಕು ತನ್ನ ಹಾಡು ಮುಂದುವರಿಸುವ ಸಂಘರ್ಷದ ಕತೆ ಇದು. \nತಮ್ಮದೇ ನೆಲದಲ್ಲಿ ಪರಕೀಯರಾಗುತ್ತ, ಗುಲಾಮರಾಗುತ್ತ ಹೋಗುತ್ತಿರುವ ಮೂಲನಿವಾಸಿಗಳ ಬದುಕನ್ನೂ, ಪುಟ್ಟ ಬೀಜಗಳು ದೊಡ್ಡದಾಗಿ ಕಾಯಿ ಬಿಡುವ ನೆಲದ ಪವಾಡಗಳನ್ನೂ, ಸಾಕಷ್ಟು ಅಪಾಯಗಳಿದ್ದರೂ ಬಿಡುಗಡೆಯ ಕನಸನ್ನು ಬಿತ್ತುವ ನಗರಗಳನ್ನೂ ಒಟ್ಟಾಗಿ ಇಡುವ ನಾಟಕವು ಈ ಎಲ್ಲಬಗೆಯ ಚರ್ಚೆಗಳನ್ನೂ ಸಮತೂಕದಲ್ಲಿರಿಸುತ್ತಿದೆ ಬದುಕನ್ನು ಕಪ್ಪು ಬಿಳುಪು ಆಗಿ ನೋಡದಂತೆ, ತಾತ್ವಿಕವಾಗಿ ಬದುಕನ್ನು ನೋಡುವಂತೆ ನಮ್ಮನ್ನು ಸಿದ್ಧಗೊಳಿಸುತ್ತದೆ. ಪ್ರಸ್ತುತ ನಾಟಕದಲ್ಲಿ ನಾಟಕಕಾರನ ಪಾತ್ರ ಹಾಗೂ ಅಜ್ಜ ಬಕ್ಸ್ನ ಪಾತ್ರ ಎರಡನ್ನೂ ಒಬ್ಬರೇ ನಿರ್ವಹಿಸಬೇಕು ಎಂದು ಒತ್ತಾಯಿಸುವ ಲೇಖಕ, ಈ ಮೂಲಕ ಯಾವುದೋ ಒಂದು ವಾದದ ಕಡೆ, ಭಾವುಕವಾಗಿ ಒಂದೆಡೆ ವಾಲದೇ ಇರುವಂತೆ ನಮ್ಮನ್ನು ನಿರ್ದೇಶಿಸುತ್ತಾನೆ. \nಕಣಿವೆಯ ಹಾಡು ಹೀಗೆ… ನಮ್ಮ ಎದೆಗಳಲ್ಲಿ ಮಾತ್ರವಲ್ಲ, ಬುದ್ಧಿಯಲ್ಲೂ ರಿಂಗುಣಿಸುವುದು ಹೀಗೆ: \nದಕ್ಷಿಣ ಆಫ್ರಿಕದ ಇತಿಹಾಸ ಮತ್ತು ವರ್ತಮಾನದ ಬಗ್ಗೆ ನನ್ನಲ್ಲಿ ಅಸಾಧ್ಯ  ನೋವಿದೆ, ಸಿಟ್ಟಿದೆ. ಆದರೆ ನನ್ನ ಬರವಣಿಗೆಯ ಶಕ್ತಿ ಪ್ರೀತಿ ಮಾತ್ರ. ನಾನು ನನಗಿರುವ ಸಿಟ್ಟಿನ ಕಾರಣಗಳನ್ನು ಪ್ರೀತಿಗೆ ಹೇಳಿದ್ದೇನೆ. ಅದು ಕೃತಿ ರಚಿಸುತ್ತದೆ – ಅತೋಲ್ ಫ್ಯೂಗಾರ್ಡ್. \nರಂಗ ಸಾಂಗತ್ಯ:\nರಚನೆ: ಅತೊಲ್ ಫ್ಯೂಗಾರ್ಡ್\nಕನ್ನಡಕ್ಕೆ: ಡಾ. ಮೀರಾ ಮೂರ್ತಿ\nಸಂಗೀತ: ಅನುಷ್ ಶೆಟ್ಟಿ ಮತ್ತು ಮುನ್ನ ಮೈಸೂರು\nಸಂಗೀತ ನಿರ್ವಹಣೆ: ಚೇತನ್ ಸಿಂಗಾನಲ್ಲೂರು\nಬೆಳಕಿನ ನಿರ್ವಹಣೆ: ವಿನಯ್ ಗಣೇಶ್ ಮೈಸೂರು\nನೇಪಥ್ಯ ಸಹಾಯ: ಇಂದೂಧರ ಎಸ್. ರಾಜ್ ರಾಮನಗರ/ ಶಶಿ ಕುಮಾರ್ ಮೈಸೂರು\nನಟನ ನಿರ್ಮಾತೃ: ಮಂಡ್ಯ ರಮೇಶ್\nಅಭಿನಯ: ಮೇಘ ಸಮೀರ ಮತ್ತು ದಿಶಾ ರಮೇಶ್\nವಿನ್ಯಾಸ, ನಿರ್ದೇಶನ: ಡಾ. ಶ್ರೀಪಾದ ಭಟ್ \nThis is a story of South Africa. But like all the great works, this play has a possibility. of presentation beyond space and time. This production is such an attempt to transpose beyond all the boundaries. The ‘song’ of the valley crosses the valley, the life inside the valley continues its song. the play unveils this conflict. \nThe play showcases and tries balance the lives of the aborigines who are alienated and enslaved in their own land, the miracles of the land where small seeds grow into big fruit, and the cities that sow the dream of liberation despite the many dangers. The play makes us not to see life in black and white, but to see it through logical and rational vision. Here, the playwright insists that the character of playwright and of Grandpa Bucks should be played by the same actor, thereby directing us not to emotionally lean to any one side of the conflict. \nThis is how the song of the valley resounds; not only in our hearts, but also in our minds:\nI am incredibly hurt and angry about South Africa’s history and present. But love is the only energy I’ve ever used as a writer. I’ve never written out of anger, although anger has informed love. – Athol Fugard. \nCast and Crew:\nPlaywright: Athol Fugard\nTranslation: Dr. Meera Moorthy\nMusic: Anush Shetty and Munna Mysore\nMusic accompany: Chethan Singanallur\nLighting: Vinay Ganesh, Mysore\nPainting: H. K. Vishwanath\nPerformers: Megha Sameer and Disha Ramesh\nDesign and direction: Dr. Shripad Bhat \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%95%e0%b2%a3%e0%b2%bf%e0%b2%b5%e0%b3%86%e0%b2%af-%e0%b2%b9%e0%b2%be%e0%b2%a1%e0%b3%81-kaniveya-haadu/",
    "keywords": "Performing Arts, Theatre",
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "ಕಣಿವೆಯ ಹಾಡು | Kaniveya Haadu"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-491.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Future of Great Nicobar",
    "startDate": "2024-06-12T18:30:00+05:30",
    "endDate": "2024-06-12T20:00:00+05:30",
    "description": "In The Great Nicobar Betrayal, Pankaj Sekhsaria, one of the best known chroniclers of contemporary issues in the Andaman and Nicobar Islands, has compiled a set of articles written by various experts across publications that examine the proposed project from every angle—environmental, geological, impact on local communities, law, due process, and ecology. \nThese pieces together shed light on the magnitude of the disaster that will be unleashed on this pristine place if the project comes through. The book is a warning and a catalogue of the manmade catastrophe that lurks on the horizon, one that will destroy more than the tsunami of December 2004 ever did. \nIn this session, Pankaj Sekhsaria is in conversation with Prof. Lawrence Surendra and Vaishna Roy. A Q&A with the audience will follow. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-future-of-great-nicobar/",
    "keywords": "Books, Cities, Climate Change, Development, Environment, Nonfiction, Sustainability",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-30.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Mad and Divine",
    "startDate": "2024-06-14T19:00:00+05:30",
    "endDate": "2024-06-14T20:30:00+05:30",
    "description": "An insight into the life and teachings of Janabai, 13th Century and Lalded, 14th Century. Both were women mystic poets who went through tremendous hardships before they were recognised for their spiritual awakenings. They crossed barriers of social norms to fearlessly express their love for the Supreme. \nThey were different in approach but MAD and DIVINE. Janabai was a Vaishnavait while Lalded was a Shaivaite. Janabai believed in the form while Lalded believed in the formless. Janabai took the path of devotion while Lalded took the path of tantra. \nMad and Divine was first commissioned by Dr. Anita Ratnam for the Natya Darshan at Kartik Fine Arts Chennai, in 2011. \nChoreographed and presented by Rama Vaidyanathan\nMusic for Janabai | Sudha Raghuraman\nMusic for Lalded | Dr. S Vasudevan with creative inputs by Sudha Raghuraman\nVocal | Sudha Raghuraman\nNattuvangam | Dr S Vasudevan\nMridangam | Sumod Sreedharan\nFlute | G Raghuraman\nValuable inputs in the storytelling technique from Rajika Puri \nIn collaboration with:\n \nSupported by:\n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/mad-and-divine/",
    "keywords": "Dance, Faith, Performing Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-493.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "Pine Cone",
    "startDate": "2024-06-13T18:30:00+05:30",
    "endDate": "2024-06-13T20:45:00+05:30",
    "description": "2023 | 95 minutes | Hindi with English Subtitles | India \nJoin us for a special Pride Month film screening of Pine Cone a moving and insightful film by director Onir. This multi-layered love story follows a gay man’s journey through love, loss, and desire, navigating the complexities of life and relationships. \nThe screening of the film will be followed by a conversation with the director and an audience Q&A. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/pine-cone/",
    "keywords": "Film, Gender, Society",
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "Pine Cone"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-492.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "INHERITAGE",
    "startDate": "2024-06-14T00:00:00+00:00",
    "endDate": "2024-06-17T00:00:00+00:00",
    "description": "Exhibition Opening: Friday, 14 June, 11:00 am \nTimings:\nFriday, 14 June | 11:00 am – 8:00 pm\nSaturday, 15 June | 11:00 am – 5:00 pm\nSunday, 16 June | 11:00 am – 8:00 pm \nPerformance:\nSaturday, 15 June | 7:00 pm \nINHERITAGE, conceived and created by choreographer Preethi Athreya, is a performance installation that traces a relationship with objects inherited, passed on or lost. Through a choreographic lens, it looks at objects that speak to a cultural and colonial heritage, embodying critical questions of our attachment to ‘belongings’, to the idea of ‘belonging’ and to place. \nThe installation presents a personal collection of thirteen objects inherited, owned, acquired or lost to bring out a history of their transactions beyond ownership, origin and identity. How can the act of looking, touching or holding these objects be a way to ‘read’ them? The objects are displayed as photographic images. Scan the QR codes on each image to listen to an account of their journeys. These writings, in turn, find their way into the body in a dance film that accompanies the images. Interrupting this assembly of image, sound and film is periodical live movement that punctuates the tableau. \nPerformance: ‘how are things …?’\nSaturday, 15 June | 7:00 pm\n \n‘how are things …?’ is a 50 minute solo performance within the context of the performance installation INHERITAGE by choreographer Preethi Athreya. Through a development of text, movement and sound, Preethi presents a personal ‘archaeology’ of objects inherited, passed on or lost. By tracing the journey of things into our lives, she asks  – can we make an anatomical, speculative fiction of objects? Can we trace ‘her-stories’ (and not totalising and reductive ‘his’tories) of objects found not in the museum, but in our family homes, that have written us into being …?  \nINHERITAGE was produced by the CHARCOAL platform for collaboration with support from Prakriti Foundation and the Alliance Française of Madras. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/inheritage/",
    "keywords": "Dance, Visual Arts",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-494.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Great Flap of 1942",
    "startDate": "2024-06-10T18:30:00+05:30",
    "endDate": "2024-06-10T20:00:00+05:30",
    "description": "The Great Flap of 1942 is a narrative history of a neglected and scarcely known period—between December 1941 and mid-1942—when all of India was caught in a state of panic. This was largely a result of the British administration’s mistaken belief that Japan was on the verge of launching a full-fledged invasion. It was a time when the Raj became unduly alarmed, when the tongue of rumour wagged wildly about Japanese prowess and British weakness and when there was a huge and largely unmapped exodus (of Indians and Europeans) from both sides of the coastline to ‘safer’ inland regions. This book demonstrates, quite astonishingly, that the Raj cynically encouraged the exodus and contributed to the repeated cycles of rumour, panic and flight. It also reveals how the shadow of the Japanese threat influenced the course of nationalist politics, altered British attitudes towards India and charted the course towards Independence. \nThe title ‘The Great Flap of 1942’ refers to an expression used by British bureaucrats in India that traces a broad narrative arc, starting with the Japanese attacks in South-East Asia. The assault on Malaya, the conquest of Singapore, the bombing and eventual occupation of Burma, and the Japanese Navy’s foray into the Indian Ocean are examined in the light of the tremendous impact they had on India. \nThe author of the book, Mukund Padmanabhan, will be in conversation with Historian & Columnist, V Sriram. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-great-flap-of-1942/",
    "keywords": "Books, Defence & security, History, Nonfiction",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-485.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "\"I Eat God, I Drink God\"",
    "startDate": "2024-06-13T18:30:00+05:30",
    "endDate": "2024-06-13T20:00:00+05:30",
    "description": "Wild Women: Seekers, Protagonists and Goddesses in Sacred Indian Poetry [Penguin India, 2024], edited by poet and seeker Arundhathi Subramaniam, is a new anthology of compelling women mystics in Indian literature. \nThese poems are the cries of women who refused, quietly, and sometimes not so quietly, to be bullied into submission. Women who surrendered not to the authority of the world, but to the authority of the spirit. Women whose voices have far too often been sanitized by the grand narratives of religion and sidelined by rationalist versions of history. \nThe names of Mirabai, Akka Mahadevi, and Andal, are known to many. But there are innumerable others. And little is known of the urgency of their words, of their feral sensuality, of their relentless questioning of the custodians of gender and faith. It is time to re-fang them, to tune into their brazenness and heartbreaking longing. Not just for their sake, but for ours. \nThis conversation with Arundhathi Subramaniam, interspersed by readings of translations by Mani Rao, Vanamala Viswanatha and Ahalya Ballal, will explore some fascinating and unforgettable women. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/i-eat-god-i-drink-god/",
    "keywords": "Books, Gender, Literature, Poetry",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-2_POSTER-10.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "Sitar Saga",
    "startDate": "2024-06-09T11:30:00+05:30",
    "endDate": "2024-06-09T13:00:00+05:30",
    "description": "Sitar Saga traces the profound musical journey of three generations of sitar masters, each contributing to the rich legacy of the Etawah Gharana. From the compositions and musical ideas in traditional ragas that laid the foundation, through the mid-century innovations, to the contemporary interpretations that define today’s sound, this concert tries to capture the essence of the sitar as it is today. \nFeaturing Siddharth Garud on sitar, a student of the Etawah Gharana, and joined by Roopak Kallurkar on tabla, this concert will be a deep dive into the essence of Indian classical music. This demonstrative performance will reflect the evolution of the Gharana’s music style. \nThis concert will feature morning ragas that honour the past, present, and future of sitar music within the Etawah Gharana, celebrating the beauty and spirit of the sitar. \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/sitar-saga/",
    "keywords": "Music, Performing Arts",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sitar Saga"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_selected_POSTER.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Ocean of Wetness",
    "startDate": "2024-06-15T18:30:00+05:30",
    "endDate": "2024-06-15T19:45:00+05:30",
    "description": "We live in an all-consuming wetness that is everywhere in the air, earth, seas, flora and fauna. It precipitates, evaporates, storms, seeps, soaks, transpires, osmotes, condenses. We exist in this ‘Ocean’ as wet stuff ourselves, our wetness necessary to our existence. However, we are not educated to inhabit this Ocean. We are rather educated to inhabit an Earth with a surface of land served by water confined to a place behind a line. This surfaced Earth, we suggest, is the outcome of a design project intent on making an object that benefits a few at the cost of the many, an object that serves science, civilization and cities, but also colonization and systemic oppression. Today, this Earth is in trouble from climate change, threatened (and violated) by the water it has sought to enslave. It faces sea level rise, floods, increasingly frequent, violent and unpredictable storm events, and the melting of ice caps. To us, these are not problems to solve; they are calls to review a design project that has proved unjust, unwise and disastrous. Does an Ocean of Wetness offer an alternative? \nJoin us as Prof. Dilip da Cunha lays out an alternative to interpret ‘landscapes’ as a gradient of wetness over the binary of ‘land’ and ‘water’. This talk will be followed by a Q&A session with the audience. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/ocean-of-wetness/",
    "keywords": "Climate Change, Environment, Science, Sustainability",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-44.png"
  },
  {
    "@context": "http://schema.org",
    "@type": "MusicEvent",
    "name": "Kārunya Sindhu | Ocean of Mercy",
    "startDate": "2024-06-15T19:00:00+05:30",
    "endDate": "2024-06-15T20:30:00+05:30",
    "description": "Karuna or Kārunya is one of the navarasā-s (nine emotions) of the Indian cultural pantheon, embodying the highest form of unconditional compassion and mercy. \nSince time immemorial, poets, saints, composers and bhakta-s (devotees) have performed sādhana (ardent practice of any pursuit) with a yearning for divine Karuna. When Narayana Bhattathiri wrote the magnum opus Narayaneeyam in the 16th century, he said, “Oh Krishna, oh Kārunya Sindhu! May your feet, where all the liberated souls reside, always rest in my heart. Oh, ocean of compassion, destroy all my sorrows and confer an abundant flow of Supreme Bliss”. In the 19th Century, Patnam Subramania Iyer composed a Kriti pleading Lord Venkatesha to forgive all his sins and bestow abundant Kripa (mercy) with no further delay. Even when we make a prayer today, it is only natural for us to seek the Lord’s Karuna. It is also this very unconditional empathy that we have for one another that makes the world a beautiful place. \nThis concert through the evocative literature and music of composers like Tyagaraja, Patnam Subramania Iyer, the Dāsā-s and others, hopes to invoke this Ocean of Mercy, this Kārunya Sindhu. \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/karunya-sindhu-ocean-of-mercy/",
    "keywords": "Music, Performing Arts",
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Kārunya Sindhu | Ocean of Mercy"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-_POSTER-1.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Rise and Fall of the Vanderbilts",
    "startDate": "2024-06-11T18:30:00+05:30",
    "endDate": "2024-06-11T20:00:00+05:30",
    "description": "Once upon a time, there was a family whose very name connoted wealth. The Vanderbilts had a vast empire built on freight through steamboats and railroads. Over a few generations, the wealth-worth billions in today’s money-had been frittered away and the business itself faded as new options came up in the freight business. Their story remains an enduring example of what happens when business leaders fail to embrace the future and transform. \nBusiness transformation is a dynamic topic that is explored by authors R Gopalakrishnan and Hrishi Bhattacharyya in their book Embrace the Future. A key lesson in the success or failure of such transformations lies in harmonising the art and science of change – the emotional and the rational – and striking the right balance between them. Both in life and in business, a compelling narrative that inspires the organisation is essential for effecting transformation. Equally important is viewing transformation as an ongoing effort integrated into the work culture, rather than solely reacting to crises. \nTheir book resonates with anyone who has encountered change—something prevalent in today’s ever-evolving business landscape. R Gopalakrishnan and Hrishi Bhattacharyya underscore that companies unwilling to adapt are bound to fade away. The authors will share their insight on how it’s imperative to draw lessons from the past, navigate the present, and prepare for the future. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-rise-and-fall-of-the-vanderbilts/",
    "keywords": "Books, Business, Nonfiction",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-428.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Just Hiss",
    "startDate": "2024-06-23T11:00:00+05:30",
    "endDate": "2024-06-23T12:00:00+05:30",
    "description": "50 minutes | English and Kannada  \nJust Hiss is a compelling adaptation of the short folk story titled A Serpent’s Predicament. Just Hiss is an ode to coexistence, following the transformative journey of a snake to choose love over hate. As the play navigates the complex dynamics between the snake, the forest denizens, and the villagers of Rasbharpur, it skillfully tackles the universal themes of unity and understanding. The resonant narrative serves as a reminder of the profound impact that choices, particularly those rooted in love and compassion, can have on fostering harmony in a world shared by diverse beings. \nDirector’s note: \nJust Hiss is not just a play; it is a whimsical journey crafted especially for children, featuring endearing animal characters. At its heart, it unfolds an analogical tale, resonant with the pressing message of our times—understanding the limitations of one’s perspective and the imperative need to embrace and accommodate others. \nConceived with meticulous care and having undergone several work-in-progress phases, this play is a testament to the idea that assumptions should yield to genuine inquiry. It serves as a reminder to care enough to ask, fostering the spirit of coming together and progressing impactfully. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/just-hiss/",
    "keywords": "Theatre, Wildlife, Young BIC",
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-487.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "India’s Defence and Security Imperatives",
    "startDate": "2024-06-18T18:30:00+05:30",
    "endDate": "2024-06-18T20:00:00+05:30",
    "description": "In an increasingly complex and dynamic world of Geo-Politics & Geo-Economics, safeguarding India’s national interests involves multifaceted challenges and strategic considerations in the context of the nation’s defence & security. Ambassador Sujan Chinoy, India’s leading defence & security expert will through his talk give an overview and provide a comprehensive understanding of this scenario. \nThis talk will help understand India’s position in the global geopolitical landscape, including regional power dynamics, strategic partnerships, emerging threats and internal and external security challenges, such as terrorism, insurgency, cyber threats, and border tensions. He will also touch upon emerging defence technology and innovation, assessing military capabilities and fostering defence indigenisation in the Indian context. \nThe talk will be followed by a moderated Q&A with the audience. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/indias-defence-and-security-imperatives/",
    "keywords": "Defence & security, International Relations, Politics",
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_pOSTER.jpg"
  }
]