[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69776-1739296800-1739304000@bangaloreinternationalcentre.org",
    "name": "On Rain-Fed Small Farmers",
    "startDate": "2025-02-11T18:00:00+05:30",
    "endDate": "2025-02-11T20:00:00+05:30",
    "description": "40 minutes | Kannada \nThe documentary Sakalarigu Samruddhi chronicles the empowering journey of small and marginal farmers adopting sustainable agriculture practices, overcoming cycles of crop loss, debt, and environmental degradation. \nThe documentary showcases the transformative power of organic farming, water and soil conservation, and collective action in improving small farmers’ livelihoods, highlighting traditional practices like mixed cropping and agroforestry to build resilience against weather fluctuations, pests, and diseases. \nThe contribution of small-scale rain-fed farmers is pivotal in creating a sustainable organic food system. Through innovative practices and commitment to environmental stewardship, these farmers set a precedent for future agricultural endeavors, enhancing food security, promoting biodiversity, and fostering community resilience. Their efforts pave the way for a more sustainable and equitable food production model. \nThe film screening will be followed by a panel discussion and Q&A with the audience. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/on-rain-fed-small-farmers/",
    "keywords": [
      "Environment",
      "Film",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-33.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69767-1738782000-1738787400@bangaloreinternationalcentre.org",
    "name": "Traversing Sonic Terrain",
    "startDate": "2025-02-05T19:00:00+05:30",
    "endDate": "2025-02-05T20:30:00+05:30",
    "description": "Nishad Pandey (guitar) and Aman Mahajan (piano) perform and delve into the creation of the abstract, contemporary, and often improvised music, that defines their signature style as Tinctures. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/traversing-sonic-terrain/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Traversing Sonic Terrain"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-704.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69513-1738868400-1738873800@bangaloreinternationalcentre.org",
    "name": "Electric Raagas",
    "startDate": "2025-02-06T19:00:00+05:30",
    "endDate": "2025-02-06T20:30:00+05:30",
    "description": "Alec Goldfarb, known for his innovations in Hindustani Classical Music, brings his unique approach to the BIC in an evening of evocative and boundary-defying performance. Blending the rich tradition of Indian ragas with the expressive versatility of the electric guitar, Alec reimagines the art of classical music, creating a soundscape that is both timeless and contemporary. Drawing on his Jazz and Western Classical backgrounds, the Alap, Jor, Jhalla presentation is augmented by lush harmonies and textures. \nThis is a rare opportunity to experience the intersection of tradition and modernity, where Alec Goldfarb’s innovative artistry invites audiences into a transformative musical journey. He will be accompanied by Ajinkya Galande on tabla. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/electric-raagas/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Electric Raagas"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-706.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "63762-1740769200-1740772800@bangaloreinternationalcentre.org",
    "name": "The Earthquake",
    "startDate": "2025-02-28T19:00:00+05:30",
    "endDate": "2025-02-28T20:00:00+05:30",
    "description": "\n54 minutes | English, Hindi, Kannada | Suitable for 13+ Years\nTrigger Warnings: Themes of Loneliness \n\n\n\n\nDo you ever feel alone, even when surrounded by people? Do you crave connection, even when it cracks a little? \nMira and Sameer meet every week, their meeting as familiar as the apple they share. They speak. Someone leaves. They do this again. And again. Mira goes on a boat ride. Sameer stays in a bubble. There is silence. And again. Mira and Sameer are friends… Yet, their unspoken words scream louder than their conversations. \nThis is a story of cycles. Of coming together, drifting apart, and all the spaces in between. \nWhat happens when we finally face our truth? Maybe we hear a strange noise… \nThis is an adaptation of “Bhūmikampa – Das Erdbeben” which received funding for International Cultural Projects from The Department of Arts and Culture of the City of Munich \n\n\nFrom the Playwrights (Samragni Dasgupta and Marvin Krause):\nTwo young artists from India and Germany meet on a farm in Bengaluru as part of an exchange program. They get to know each other and realise that cultural differences are just one aspect of human connection. They come together to develop something together. But what?The idea for this collaboration started with a conversation about loneliness. Above all, how loneliness is a common factor for young people in all countries. From loneliness to the intricacies of human relationships, two people began an intensive writing process to explore the many facets of human connection.\n\nFrom the Director:\n“Mira and Sameer find themselves on a bench, surrounded by unspoken words. ‘The Earthquake’ delves into the essence of human relationships—our connections, routines, distances, and all the spaces in between. It asks us what it means to be truly seen or heard. What happens when we finally face the unspoken truths in our interpersonal relationships?”\n\n\n  \nCredits: \nPlaywrights: Marvin Krause and Samragni Dasgupta\nDirector: Samragni Dasgupta \nCast: \nMira: Yamuna Kali\nSameer: Naman Roy \nThe Earthquake received the Internationaler Kulturprojekte Grant 2023 from the Landeshauptstadt München Kulturreferat (City of Munich). \nProduced by     \n\nWith Support from \n\n \n\n",
    "url": "https://bangaloreinternationalcentre.org/event/the-earthquake/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "The Earthquake"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-599.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69693-1738695600-1738701000@bangaloreinternationalcentre.org",
    "name": "A Classical Western Music Piano & Violin Duo",
    "startDate": "2025-02-04T19:00:00+05:30",
    "endDate": "2025-02-04T20:30:00+05:30",
    "description": "Join us for an enchanting evening featuring the extraordinary talents of Neville (pianist) and Sophia Schrader (violinist), as they present a program of Mozart, Fauré, Ravel, and Claude Bolling. \n \nPresented by: \n \nSupported by \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-classical-western-music-piano-violin-duo/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "A Classical Western Music Piano & Violin Duo"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-701.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "69469-1738868400-1738873800@bangaloreinternationalcentre.org",
    "name": "Yogi Mattu Bhogi",
    "startDate": "2025-02-06T19:00:00+05:30",
    "endDate": "2025-02-06T20:30:00+05:30",
    "description": "90 Minutes | Kannada  \nYogi Mattu Bhogi is a free adaptation of the 7th-century play, Bhagavadajjukam (Sanskrit, ‘bhagavat’ – hermit; ‘ajjuka’ – harlot), also known in English as The Ascetic and The Courtesan. One of the oldest surviving plays in Sanskrit literature, it is a fine example of a ‘prahasana’, or farce. Layered in witty exchanges about dharma, it is centered around the transmigration of souls between the two titular characters leading to confusion and chaos for the supporting characters who have no answer to the absurdity of it all. \nThrough this retelling in Kannada, Mahesh Dattani, plays around with the idea of gender: its expression, perception, spectrum and the exploration of what one truly is with a confrontation of stereotypes using humour and catharsis. Infused with Yakshagana, the play comes alive when the classic Sanskrit text and the physicality of theatre gels seamlessly with the traditional dance theatre form from coastal Karnataka. \nCredits:\nAdaptation and Direction: Mahesh Dattani\nKannada Translation: Vishvajith Madhavamurthy\nYakshagana Choreography: Guru Bannanje Sanjeev Suvarna\nMusic Composition: Poornima Bhojraj\nSet Design: Mahesh Dattani\nLight Design: Trisha Shetty, Bhavya Bharadwaj, Pallavi Kodagu\nLights Execution: Trisha Shetty, Bhavya Bharadwaj\nCostume Design: Shruti Bangera\nMusic: Amrit P\nProduction Manager: Venumadhav Bhat\n(Initial) Poster Design: Gopalkrishna Bhat\n(Initial) Poster Artwork: Shruti Bangera\nAssistant Directors: Trisha Shetty and Kritika Verma\nProduction Assistants: Atharv Mishra and Amrutha \nAbout Punaha Theatre:\nPunaha, a theatre company based in Udupi, is dedicated to the art of storytelling through the transformative power of performance. ‘Punaha’, is derived from the Kannada (Σನಃ), Hindi (पुनः) and Sanskrit word, meaning “repeat,” or “to do it again”. They are a group of professional theatre artists, academicians, and working professionals who love theatre, and the idea of repetition and riyaaz involved in it. ‘Punaha’ symbolizes their commitment to revisit and reimagine classic narratives while exploring contemporary themes that resonate with today’s audience. It also is the idea of us as humans trying, failing but definitely starting again, starting Punaha. Among their ongoing productions are Girish Karnad’s Agni Aur Barkha (translated into Hindi by Ram Gopal Bajaj) and Harold Pinter’s The Caretaker. Agni Aur Barkha was previously adapted to the stage in Kannada as Agni Mattu Male. Yogi Mattu Bhogi is our fourth production overall in collaboration with Sahitya Akademi awardee, Mahesh Dattani. Punaha hopes to create a thriving theatre culture in the small coastal city of Udupi, develop their plays thriftily and tour them to other cities, big and small. Reflecting the multilinguistic atmosphere of the city, their intention is to not be bound by the constraints of a single language, producing plays primarily in English, Hindi, and Kannada. \nIn collaboration with: \n \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/yogi-mattu-bhogi/",
    "keywords": [
      "Literature",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Yogi Mattu Bhogi"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-703.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70059-1738953000-1738958400@bangaloreinternationalcentre.org",
    "name": "The Land of The Red River & Blue Hills",
    "startDate": "2025-02-07T18:30:00+05:30",
    "endDate": "2025-02-07T20:00:00+05:30",
    "description": "Crucial battles of World War II fought in India’s northeast; followed soon after by India’s Independence and Partition; had a critical impact on the making of modern Assam. In the three decades following 1947, the state of Assam underwent massive political turmoil, geographical instability, and social and demographic upheaval, among others. Later, the truncated state suffered widespread unrest as various groups believed their cultural identity and political leverage were under threat. New social energies and political forces were unleashed and came to the fore. \nThis session draws from Arupjyoti Saikia’s The Quest for Modern Assam: A History, 1942-2000 exploring the interconnected layers of political, environmental, economic, and cultural processes that shaped the development of Assam since the 1940s.  Arupjyoti Saikia will be in conversation with historian Anjum Hasan deliberating on the  questions which played a key role in the making of modern Assam and also that of the Republic of India. \nA Q&A session with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-land-of-the-red-river-blue-hills/",
    "keywords": [
      "Culture",
      "History",
      "Politics",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-711.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "69836-1739989800-1739997000@bangaloreinternationalcentre.org",
    "name": "Agents of Happiness",
    "startDate": "2025-02-19T18:30:00+05:30",
    "endDate": "2025-02-19T20:30:00+05:30",
    "description": "2024 | 90 minutes | Nepali and Dzongkha with English subtitles | Bhutan/Hungary \nCan you measure happiness? The country of Bhutan invented Gross National Happiness to do just that, and Amber is one of the agents who travels door to door to meet people and see how they feel. However, he hasn’t gotten around to measuring his own happiness level. Still living with his mother at the age of 40, he’s nevertheless a hopeless romantic who dreams of finding love. But as one of the Nepali minorities who were deprived of their citizenship, Amber isn’t the most eligible bachelor. We embark with Amber on his bittersweet journey to encounter Bhutanese from all walks of life. At the end of the road, we are reminded of the fragility and beauty of our own happiness. No matter where we live. \nFollowing the screening, Director, Arun Bhattarai will participate in the discussion with Usha Rao, followed by a Q&A session with the audience. \nProducers: Arun Bhattarai, Máté Vince, Noémi Veronika Szakonyi \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/agents-of-happiness/",
    "keywords": [
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ne",
    "workPresented": {
      "@type": "Movie",
      "name": "Agents of Happiness"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-34.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "69842-1738494000-1738503000@bangaloreinternationalcentre.org",
    "name": "ಕನ್ನೇಶ್ವರ ರಾಮ | Kanneshwara Rama",
    "startDate": "2025-02-02T11:00:00+05:30",
    "endDate": "2025-02-02T13:30:00+05:30",
    "description": "\nKannada with (English Subtitles) | 1977 |118 minutes  \nThrough the untamed wilderness of Karnataka, an ordinary villager transforms into a defiant outlaw, having dared to confront British colonial oppression. He leads his band of rebels in their fight for justice and their people’s freedom. \nThis month’s film featured in our informal film club is ಕನ್ನೇಶ್ವರ ರಾಮ | Kanneshwara Rama (1977) \nBased on S. K. Nadig’s novel “Kannayya Rama,” the 1977 Kannada political film “Kanneshwara Rama” was directed by M. S. Sathyu as his second feature after “Garm Hava.” The film premiered at the International Film Festival of India and achieved both critical and commercial success during its 1989 theatrical release, completing a 100-day run. The film features an ensemble cast including Anant Nag, Shabana Azmi (in her Kannada debut), and Amol Palekar. \nSet in 1920s India, the story follows Kanneshwara Rama, a defiant peasant who becomes a legendary outlaw after confronting local injustice. After a prison stint where he encounters Gandhi’s followers, he joins and eventually leads a group of bandits, becoming a Robin Hood-like figure who aids the poor and challenges feudal authority. His journey is complicated by his relationship with Malli, a former bandit’s mistress, and his growing ambition to establish his own principality. \nThe film, which was later screened at the 2017 Bengaluru International Film Festival, explores themes of rebellion, justice, and loyalty against the backdrop of India’s independence movement. Through Rama’s transformation from peasant to folk hero, it examines the complex relationship between individual leadership and collective causes. \nDirection & Production \n\nDirector: M. S. Sathyu\nProduction Company: Sharadha Movie Productions\nProducers: Moola Brothers\n\nWriting \n\nBased on the novel by: S. K. Nadig\nScreenplay: S. K. Nadig\n\nCast \n\nAnant Nag as Kanneshwara Rama\nShabana Azmi as Malli\nAmol Palekar as Dacoit Chenneera\nB. V. Karanth as Junja\nShimoga Venkatesh as Narayanappa\nC. R. Simha as Police officer at Jail\nTom Alter as British Police officer\n\nVoice dubbed by C.R. Simha\n\n\n\nTechnical \n\nCinematography: Ishan Arya, Ashok Gunjal\nEditing: S. Chakravarthy\nMusic: B. V. Karanth\nLyrics: N. Kulkarni\n\nAbout B•Cinematic \n\nCalling all cinephiles! BIC is thrilled to present B•Cinematic, an initiative dedicated to celebrating the most essential, impactful, and artistically significant cinematic works from across the state and the country. \nAt B•Cinematic, our mission is to curate and share those remarkable films that is a must-watch (or re-watch) experience for every passionate cinema lover. From groundbreaking classics to under-appreciated gems, our carefully curated selection will take you on an unparalleled (pun not intended) cinematic journey through the ages. \nThrough curated screenings, insightful discussions, and engaging analyses from distinguished cinematic voices, we aim to not only watch these films together but to truly appreciate their craftsmanship, cultural impact, and intellectual depth. Our vibrant community of film aficionados will collectively rediscover Indian cinema’s most stunning and enduring masterpieces. \nSo join us on this quest to experience the films that have defined and redefined the art form. Don’t miss out on crossing these essential works off your bucket list. Because to truly live, you must first watch the films that make life worth living. \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%95%e0%b2%a8%e0%b3%8d%e0%b2%a8%e0%b3%87%e0%b2%b6%e0%b3%8d%e0%b2%b5%e0%b2%b0-%e0%b2%b0%e0%b2%be%e0%b2%ae-kanneshwara-rama/",
    "keywords": [
      "Film",
      "History",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "ಕನ್ನೇಶ್ವರ ರಾಮ | Kanneshwara Rama"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-707.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "69580-1739386800-1739395800@bangaloreinternationalcentre.org",
    "name": "Agni Aur Barkha",
    "startDate": "2025-02-12T19:00:00+05:30",
    "endDate": "2025-02-12T21:30:00+05:30",
    "description": "140 minutes | English | Ages 16+ \nAgni Mattu Male (1994) was written by Girish Karnad in Kannada and later translated to Hindi as Agni Aur Barkha (1996) by Ram Gopal Bajaj and to English as The Fire and The Rain (1997) by Karnad himself. Among the most complex works of Karnad, it is based on the myth of Yavakri from the ancient Indian epic Mahabharata, and is an innovative reimagining of the epic’s characters and events a retelling of a lesser-known episode from the epic in which the Khandava forest is burned down by Agni, the fire god, with the help of Arjuna and Krishna to provide a sacrificial alter. \nKarnad combines multiple myths to explore contemporary social, cultural, political, and psychological issues. Symbolism and allegories add to the depth of its narrative, making it a thought-provoking yet visually stunning experience. Known for its play-within-the-play method to depict the deception of brothers against brothers and fratricide and its timeless themes, the play continues to remain a significant work in the field of Indian theater and has been performed in multiple languages and at numerous theatre festivals. \nDirector – Abhinav Grover\nLights – Trisha Shetty\nSound – Amrit\nCostumes, Make up & Set Design -Shruti Bangera\nAssistant Director – Trisha Shetty \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/agni-aur-barkha/",
    "keywords": [
      "Mythology",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "Agni Aur Barkha"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-712.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70001-1739559600-1739564100@bangaloreinternationalcentre.org",
    "name": "Spiralling into Desire",
    "startDate": "2025-02-14T19:00:00+05:30",
    "endDate": "2025-02-14T20:15:00+05:30",
    "description": "60 mins | English \nSpiralling into Desire traces a woman’s descent into her deep body to access and retrieve her true autonomy. \nThe sharing draws parallels from the first epic poem The Descent of Innana and is set at the intersection of the arts, psychology and spirituality. \nInspired by artist’s practice of authentic movement and natural dreamwork, the performance builds on both – the creative process and the witnessing process, as it explores the question, ‘How do we hold desire in our bodies?’ \nCredits:\nConcept, Research & Performance: Brinda Jacob-Janvrin\nDramaturgy: Diya Naidu\nSound: Deepthi Bhaskar\nVideo Art: Zero Rules\nDirection: Roohi Dixit\nCinematography: Preetha Jayaraman\nEditor & Music Supervisor: Ziba Bhagwagar\nOutside Eye & Ear: Vinod Susheela\nDesign (Costume & Set): Swathi Shetty\nDesign (Video Art & Projection): Sourav Bhahmachari\nPublicity Design & Execution: Monica Gangoly\nProduction: Tia Ann \nPhase 1 of this project was supported by:\nVinod Ravindran (Voice Coach)\nPriyabrat Panigrahi (Movement Coach) \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/spiralling-into-desire/",
    "keywords": [
      "Dance",
      "Performing Arts",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-713.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69353-1738407600-1738413000@bangaloreinternationalcentre.org",
    "name": "The Grandeur of Gwalior",
    "startDate": "2025-02-01T11:00:00+05:30",
    "endDate": "2025-02-01T12:30:00+05:30",
    "description": "Gwalior – A Land Where Even a Child’s Cry Finds Tune \nExperience the grandeur of Gwalior, the cradle of Hindustani vocal music, where the echoes of enchanting ragas have resonated through time. Celebrating the legacy of the Gwalior Gharana, the evening promises a mesmerizing journey through a repertoire of compositions in its distinctive style. \nImmerse yourself in the rich tapestry of khayal, khayalnuma, tappa, tap-tarana, bandish ki thumri, bol-banaav ki thumri, and ashtapadi, each capturing the essence of this unparalleled tradition. The performance will be interwoven with anecdotes, stories of legendary masters, and rare compositions passed down through generations, showcasing the journey of this music from the courts of kings to the embrace of the common folk. \nRuturaj Kolpe, a disciple of Vidushi Dr. Meeta Pandit, will present this morning concert in an intimate baithak setting, accompanied by Shantanu Deshmukh on the tabla and Vighnesh Bhagwat on the harmonium. This is an invitation to step into a time warp, where the echoes of a bygone era and the majesty of Gwalior’s musical heritage come alive. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-grandeur-of-gwalior/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Grandeur of Gwalior"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-31.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69856-1738407600-1738519200@bangaloreinternationalcentre.org",
    "name": "Sci560 Film Festival",
    "startDate": "2025-02-01T11:00:00+05:30",
    "endDate": "2025-02-02T18:00:00+05:30",
    "description": "Explore Bengaluru’s scientific, cultural, and urban heritage through the lens of cinema at the Sci560 Film Festival, organised in collaboration with Science Gallery Bengaluru! \nThis two-day event features a lineup of thought-provoking films, including Down the Drain by Nitya Misra and In Search of Gold by Basav Biradar, each followed by insightful discussions with the filmmakers and experts. The festival highlights stories of the city, its environmental challenges, and its historical legacy, offering a unique perspective on Bengaluru’s multifaceted identity. \nEnd each day with engaging activities, including a Bengaluru-themed quiz and a virtual scavenger hunt to test your curiosity and knowledge. This festival is part of Sci560: Science in the City, an ongoing exhibition exploring the city’s history through a military-industrial-academic lens. Don’t miss this cinematic journey celebrating the spirit of Bengaluru! \nFestival Schedule: Download the full schedule here. \nDay 1 | 1 Feb | Saturday | 11:00 am – 6:00 pm \n11:00 am – 11:05 am: Opening remarks \n11:05 am – 11:27 am: Down the Drain\nDocu-fiction | English and Kannada | India | Nitya Misra\nThis is a documentary-fiction film about Bangalore’s sewage, told from the perspective of a woman who accidentally flushes a watch down the toilet. In tracing the journey that the watch takes from the toilet, the woman gets glimpses into the pipes and people that make up the sewage system in the city, and observes the system as well as its parts through conversations with different people. \n11:27 am – 12:00 pm: Discussion with Nitya Misra and Veena Srinivasan \n12:00 pm – 12:05 pm: Introduction by Usha Rao and Gautam Sonti \n12:05 pm – 1:32 pm: Our Metropolis\nDocumentary | English, Kannada, Tamil, Telugu, Hindi | India | Gautam Sonti and Usha Rao\nBangalore is being refashioned as a ‘world-class’ metropolis. Livelihoods and homes make way for flyovers, glitzy malls and a shiny Metro. Threatened with a violent transformation of their city, residents confront the authorities.  Beneath the State’s ideal of a ‘global city’ lurks the intent to clear a pasture for big business. \n1:32 pm – 2:15 pm: Break \n2:15 pm – 2:18 pm: A Stroke of Genius\nDocumentary Short | English | Vishnu Tenkalya\nIn a city that is constantly being gentrified because of its shape-shifting landscape, it is rare to find art that captures Bengaluru in its prime. Through the playful medium of watercolour illustrations, each painting by Paul Fernandes takes us through a mesmerising journey of what it meant to be living in Bangalore in the 70s and 80s. \n2:18 pm – 2:23 pm: HeadbangerLore\nDocumentary Short | English | Devadri Bhattacharya and Shrivathsa Srikanth\nBangalore’s heavy metal scene emerged in the late ’80s, growing through the ’90s with bands like Kryptos and Millennium. Larger venues, bigger audiences, and international acts followed. The pandemic disrupted live music, but as venues reopen, a new chapter begins. This film explores the city’s metal legacy through artist interviews and performance footage. \n2:23 pm – 2:28 pm: Madiwalas of Bangalore\nDocumentary Short | English and Kannada | Rehaan Diaz\nMadiwala, meaning washerman in Kannada, was home to Bangalore’s dhobi community. While dhobi ghats still exist across the city, modernization is slow, and many struggle to sustain themselves as hotels and hospitals adopt in-house laundries. This film, focused on the Ashok Nagar dhobi ghat, explores their challenges—long hours, health risks, and environmental impact—through an interview with a washerman. \n2:28 pm – 2:33 pm: Letter by Letter\nDocumentary Short | English | Pooja Saxena\nAward-winning typeface and graphic designer, Pooja Saxena, has been chronicling street lettering from different cities and towns of India for over a decade. In Letter by Letter, she shines a spotlight on public lettering and typography in Bengaluru’s M.G. Road, and paints a rich picture of this often ignored facet of our urban spaces. \n2:33 pm – 2:38 pm: Reviving Legends\nDocumentary Short | Kannada | Sharan G C\nReviving Legends is a short film that focuses on the life and work of expert craftspeople who maintain and restore the iconic vintage motorcycle, providing viewers an insight into the world of two Jawa Motorcycle mechanics in Bengaluru. The documentary pays homage to the unsung heroes who work tirelessly to preserve these priceless artefacts and the enduring history of Jawa motorcycles. \n2:38 pm – 2:42 pm: Tale of Two Wheels\nDocumentary Short | English and Kannada | Jayavartheni Krishnakumar, Namrata Narendra and Suraj Devaraj\nDespite Bengaluru’s cyclist-unfriendly infrastructure, cycling thrives—for livelihood, commute, and leisure. Citizens and organizations promote it through car-free Sundays and cyclathons. This film explores how cycling shapes identity, community, and aspirations in the city. \n2:42 pm – 3:16 pm: A Family in Bangalore \nDocumentary | English | India | Paul Zills\nA Family in Bangalore captures the bustling environment at Hindustan Aeronautics Limited (HAL), where workers like Krishnan are central to the creation of the Hindustan Trainer 2 aircraft. Watch as precision lathes and giant presses methodically shape each part of India’s first domestically designed aircraft. The grainy, black-and-white footage reveals the factory’s busy assembly hangar and the HT2’s preparation for its test flight. This film highlights the factory’s crucial role in India’s aerospace journey.  \n3:16 pm – 5:26 pm: Pushpaka Vimana\nFeature | NA | India | Singeetam Srinivasa Rao\nThe film, which has no dialogue, stars Kamal Haasan leading an ensemble cast that includes Samir Khakhar, Tinu Anand, K. S. Ramesh, Amala, Farida Jalal, Pratap Potan, Lokanath, P. L. Narayana and Ramya. It revolves around an unemployed graduate who encounters a drunk rich man unconscious and takes over his lifestyle after keeping him prisoner. \n5:30 pm – 6 pm: Bengaluru Snap Hunt \n\nDay 2 | 2 Feb | Sunday | 11:00 am – 6:00 pm \n11:00 am – 11:36 am: Tracing the Arc\nDocumentary | English | India | Pankaj Bhutalia\nThe Great Arc was a phenomenal achievement of applied science in British India between 1802 and 1843. It was an attempt to measure the curvature of the earth’s surface under the guise of cartographic and military necessity. The film attempts to recreate the stupendous effort and look at some of its implications. \n11:36 am – 11:45 am: Anatomy + Humanities: The Animated Life of SL Bhatia\nDocumentary Short | Kannada | India | Meera K\nA short documentary on physiologist SL Bhatia who insisted that medicine needs humanities. The film reimagines Bhatia’s life through archival photographs, museum objects and experimental animation via microscope. \n11:45 am – 11:50 pm: Introduction by Gautam Sonti and Carol Upadhya \n11:50 am – 12:18 pm: Fun @ Sun\nDocumentary | English | India | Gautam Sonti and Carol Upadhya\nAround the turn of the century, India’s software outsourcing industry became a global hub, with engineers as key ‘knowledge workers.’ The Coding Culture film series (2004-05) captures Bangalore’s tech scene, work culture, and people. Fun @ Sun explores life in a U.S. multinational, while July Boys highlights early venture-funded startups. \n12:18 pm – 12:23 pm: Introduction by Gautam Sonti and Carol Upadhya \n12:23 pm – 12:49 pm: July Boys\nDocumentary | English | India | Gautam Sonti and Carol Upadhya\nAround the turn of the century, India’s software outsourcing industry became a global hub, with engineers as key ‘knowledge workers.’ The Coding Culture film series (2004-05) captures Bangalore’s tech scene, work culture, and people. Fun @ Sun explores life in a U.S. multinational, while July Boys highlights early venture-funded startups. \n12:49 pm – 1:15 pm: Discussion with Gautam Sonti and Carol Upadhya \n1:15 pm – 2:00 pm: Break \n2:00 pm – 2:34 pm: In Search of Gold\nDocumentary | Tamil and English | India | Basav Biradar\nSet in the once thriving colonial gold mining township of Kolar Gold Fields (KGF), In Search Of Gold attempts to weave together the different lived and remembered histories of people who built this highly profitable enterprise. Against the background of the grim imagery of the now defunct mining operations, the film brings together narratives of collective socio-political struggles of the past, nostalgia for lost privileges and communities, and the anxiety of an uncertain future, of a fragmented society. \n2:34 pm – 3:00 pm: Discussion with Basav Biradar, Nirmal Raj and Palahalli Vishwanath \n3:00 pm – 3:05 pm: Babasaheb in Bangalore\nExperimental short | English and Kannada | India | Mahishaa\nBengaluru reflects Dr. B.R. Ambedkar’s enduring legacy through statues that symbolize assertion for marginalized communities. Unlike government-funded monuments, these are built by the people, embodying his philosophy of Educate, Agitate, and Organise. More than idols, they stand for resistance, empowerment, and the ongoing pursuit of equality. \n3:05 pm – 3:07 pm: Kaathu Mela Kuppai Keezha\nExperimental short | Kannada | India | Group4\nExperimental Short film about the garbage disposal problems in Bangalore and how the different people of the city are affected by it, view it. \n3:07 pm – 3:24 pm: Presence\nDocumentary short | English, Hindi and Kannada | India | Ekta Mittal and Yashaswini Raghunandan\nStories of Ghosts as narrated by workers employed to construct the city of Bangalore. \n3:24 pm – 4:00 pm: Distance\nDocumentary | English, Hindi and Kannada | India | Ekta Mittal and Yashaswini Raghunandan\nStories of love as narrated by workers who the Bangalore Metro Rail Corporation employs to transform the city of Bangalore. \n4:00 pm – 4:40 pm: Above the Din of Sewing Machines\nDocumentary | Kannada | India | Surabhi Sharma\nBangalore, that much-hyped ‘Silicon Valley’ of India, is also home to a large garment industry that, until 2001, earned more foreign exchange from exporting cloth than the more glamorous trade in Information Technology! This film documents the exploitative work conditions of women workers in the garment industry in Bangalore. This Industry is largely geared towards exporting to big Brands in the West. And yet, the workers toil with extremely low wages and in an atmosphere of fear and intimidation. \n4:40 pm – 5:00 pm: Break \n5:00 pm – 6:00 pm: Bengaluru Quiz: How Well Do You Know the City? \n\nInteractive Installations | 1 & 2 Feb | Sat & Sun | 11:00 am – 6:00 pm \nStick-er-alli Bengaluru: Mark your Bengaluru! Add stickers to a giant city map to highlight your most frequented areas and spots. \nHale Bengaluru, Fresh Memories: Share your oldest Bengaluru memory on a post-it and stick it to our wall of nostalgia! \nCity Soundscapes: Capture Bengaluru in 10 seconds! Record and upload your city’s sounds to create an audio collage. Listen to how our city sounds! \nTime Capsule: Bengaluru 2025: Leave a little piece of 2025 behind! Add notes, photos, or objects to our time capsule for future Bengalureans. \nIn collaboration with: \n \nScience Gallery Bengaluru (SGB) is a not-for-profit public institution for research-based engagement targeted at young adults working at the intersection of the human, natural, and social sciences, and engineering, art, and design. SGB’s public engagement model moves beyond participation, and towards proactive involvement through ever-changing research festivals anchored by interdisciplinary exhibitions, programmes, and public events consisting of research-based engagements led by artists and scholars from diverse backgrounds. SGB is established with the founding support of the Government of Karnataka and three academic partners—Indian Institute of Science, National Centre for Biological Sciences, and Srishti Institute of Art, Design and Technology. \n",
    "url": "https://bangaloreinternationalcentre.org/event/sci560-film-festival/",
    "keywords": [
      "Bangalore",
      "Cities",
      "Culture",
      "Film",
      "Heritage",
      "History",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "te",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-708.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69906-1739298600-1739305800@bangaloreinternationalcentre.org",
    "name": "Unravelling A Kingly Genius",
    "startDate": "2025-02-11T18:30:00+05:30",
    "endDate": "2025-02-11T20:30:00+05:30",
    "description": "A symphony of brilliance, HH Jaya Chamaraja Wadiyar, the 25th and last Maharaja of Mysore, transcended the throne. More than a king, he was a polymath, his reign a testament to the harmonious blend of administrative acumen and artistic fervor. His love for music transcended borders, encompassing both the rich tradition of Carnatic music and the elegance of Western classical. \nCrowned amidst the tempestuous winds of change, he navigated turbulent times with a visionary’s zeal. He upheld the legacy of Mysore with an unwavering dignity, his reign a beacon of honor and integrity. When the dawn of Indian Independence broke, he gracefully relinquished his crown, a statesman who paved the path for the unification of princely states into the nascent nation. \nHis humility, a rare jewel in the crown of royalty, remains an enduring testament to his character. Though time may have dimmed the spotlight, the echoes of his extraordinary life and the profound impact of his reign continue to reverberate through the heart of Mysore, where he forever remains a beloved, though tragically unsung, hero. \nThe session will start with a 10 minutes film about HH Jaya Chamaraja Wadiyar, created by MAYA Films. This will be followed by a talk by Dr. Sudhamani in Kannada. Dr. Deepti Navaratna will deliver a talk on the musical genius of the Maharaja in English. A discussion between Dr. Sudhamani, Dr. Deepti and Maya Chandra will follow. The session will end with a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/unravelling-a-kingly-genius/",
    "keywords": [
      "Heritage",
      "History",
      "In Memory"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-710.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "69716-1739646000-1739651400@bangaloreinternationalcentre.org",
    "name": "All We Imagine as Khayal",
    "startDate": "2025-02-15T19:00:00+05:30",
    "endDate": "2025-02-15T20:30:00+05:30",
    "description": "Hindustani (North Indian Classical) Music is a 2,000 year-old tradition that has thrived despite the onslaught of invasions and uprisings – while constantly evolving into new forms. ‘Khayal’, meaning ‘Imagination’, is the art of improvising and elevating content, with the classical compositions as a core. \nAshwin, Abhay and Gaurav will take you on a time-lapsed journey to and through Hindustani music in its various forms, while pulling back the curtain and providing context through the imagery of this timeless tradition. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/all-we-imagine-as-khayal/",
    "keywords": [
      "Heritage",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "All We Imagine as Khayal"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-702.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69881-1739039400-1739044800@bangaloreinternationalcentre.org",
    "name": "Unveiling Islamabad",
    "startDate": "2025-02-08T18:30:00+05:30",
    "endDate": "2025-02-08T20:00:00+05:30",
    "description": "From 1997 to 2000, Ruchi Ghanashyam and her husband traversed the labyrinthine corridors of Islamabad, bearing witness to seismic events that shook the region to its core. From the thunderous echoes of the India-Pakistan nuclear tests to the harrowing shadows of the Kargil conflict, their tale unfolds against the backdrop of geopolitical upheaval. As the first Indian woman diplomat stationed in Islamabad, Ghanashyam unveils the intricacies of cross-border relationships and the relentless drumbeat of history as witnessed through the prism of political upheavals in her book, A Woman in Islamabad 1997-2000.\n\n\nIn a riveting twist, A.R. Ghanashyam, the author’s husband, unveils his first-hand account of the tense moments preceding the Indian Airlines flight IC 814 hijacking, offering a gripping glimpse into the heart of crisis management. \n\nYet, amidst the tumult, Ambassador Ghanashyam’s narrative delves deeper, unravelling gender dynamics in a society steeped in tradition and inviting us to contemplate not just the challenges facing Pakistan but also the boundless potential for change and understanding. This session delves deeper into their experiences, exposing the layers of tradition that shape societal norms, offering a compelling examination of the challenges and opportunities inherent in the region’s sociopolitical landscape.\n\nIn this session, Ruchi Ghanashyam and A.R. Ghanashyam will be in conversation with Latha Reddy. A Q&A session with the audience will follow.\n",
    "url": "https://bangaloreinternationalcentre.org/event/unveiling-islamabad/",
    "keywords": [
      "Books",
      "Governance",
      "Heritage",
      "International Relations",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-709.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "69739-1739903400-1739908800@bangaloreinternationalcentre.org",
    "name": "Exploring the Temples of the Deccan",
    "startDate": "2025-02-18T18:30:00+05:30",
    "endDate": "2025-02-18T20:00:00+05:30",
    "description": "Of all regions of India, the Deccan has the most diverse architectural traditions, nowhere better shown than in the variety of stone temples sponsored under a succession of dynasties which ruled peninsular India over some 700 years. To illustrate this unique diversity, Michell explores religious monuments at lesser-known sites. He begins with Early Chalukya temples overlooking the Tungabhadra river at Alampur, and ends with the imposing Kakatiya monument at the out of the way village of Palampet, both in Telangana. In between, he discusses the Nolamaba period shrines at Nandi and Shravana Belgola, and those of the Later Chalukyas at Sudi, Kuruvatti and Lakkundi, all in Karnataka. He concludes with the little visited Hoysala period shrines at Belavadi, Mosale and Agraha Bachhahalli. \nThe lecture will be followed by a Q&A Session with the audience. \nImage credit – Surendra Kumar \nIn collaboration with:\n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/exploring-the-temples-of-the-deccan/",
    "keywords": [
      "Architecture",
      "Design",
      "Faith",
      "Heritage",
      "History"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-705.jpg"
  }
]