[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70741-1741285800-1741291200@bangaloreinternationalcentre.org",
    "name": "From Pax Americana to Pax Mysteriana",
    "startDate": "2025-03-06T18:30:00+05:30",
    "endDate": "2025-03-06T20:00:00+05:30",
    "description": "The object of this lecture is to analyze the world order that was put in place at the end of World War II, examine how it has unfolded in terms of experience since then, and highlight some important manifestations of its multiple crises, to discuss possible future scenarios for 2050. In doing so, it asks four questions and seeks to provide answers. \nAre we witnessing the beginnings of a transformative change in the world order? Are we at the cusp of an emerging bi-polar world order, with the United States and China as the two superpowers? Are we moving towards a multi-polar world, in which there will be another 8-10 countries that are also key players? Are we going to live with a fluid situation and a de facto continuation of Pax Americana? \nThe lecture will be followed by a Q&A with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/from-pax-americana-to-pax-mysteriana/",
    "keywords": [
      "Governance",
      "International Relations",
      "Policy & Regulation",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-725.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "63762-1740769200-1740772800@bangaloreinternationalcentre.org",
    "name": "The Earthquake",
    "startDate": "2025-02-28T19:00:00+05:30",
    "endDate": "2025-02-28T20:00:00+05:30",
    "description": "\n54 minutes | English, Hindi, Kannada | Suitable for 13+ Years\nTrigger Warnings: Themes of Loneliness \n\n\n\n\nDo you ever feel alone, even when surrounded by people? Do you crave connection, even when it cracks a little? \nMira and Sameer meet every week, their meeting as familiar as the apple they share. They speak. Someone leaves. They do this again. And again. Mira goes on a boat ride. Sameer stays in a bubble. There is silence. And again. Mira and Sameer are friends… Yet, their unspoken words scream louder than their conversations. \nThis is a story of cycles. Of coming together, drifting apart, and all the spaces in between. \nWhat happens when we finally face our truth? Maybe we hear a strange noise… \nThis is an adaptation of “Bhūmikampa – Das Erdbeben” which received funding for International Cultural Projects from The Department of Arts and Culture of the City of Munich \n\n\nFrom the Playwrights (Samragni Dasgupta and Marvin Krause):\nTwo young artists from India and Germany meet on a farm in Bengaluru as part of an exchange program. They get to know each other and realise that cultural differences are just one aspect of human connection. They come together to develop something together. But what?The idea for this collaboration started with a conversation about loneliness. Above all, how loneliness is a common factor for young people in all countries. From loneliness to the intricacies of human relationships, two people began an intensive writing process to explore the many facets of human connection.\n\nFrom the Director:\n“Mira and Sameer find themselves surrounded by unspoken words. ‘The Earthquake’ delves into the essence of human relationships—our connections, routines, distances, and all the spaces in between. It asks us what it means to be truly seen or heard. What happens when we finally face the unspoken truths in our interpersonal relationships?”\n\n\n  \nCredits: \nPlaywrights: Marvin Krause and Samragni Dasgupta\nDirector: Shania Mathew \nCast: \nMira: Samragni Dasgupta\nSameer: Naman Roy \nThe Earthquake received the Internationaler Kulturprojekte Grant 2023 from the Landeshauptstadt München Kulturreferat (City of Munich). \nProduced by     \n\nWith Support from \n\n \n\n",
    "url": "https://bangaloreinternationalcentre.org/event/the-earthquake/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "The Earthquake"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-599.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70841-1741543200-1741550400@bangaloreinternationalcentre.org",
    "name": "Smriti Pravah 2025",
    "startDate": "2025-03-09T18:00:00+05:30",
    "endDate": "2025-03-09T20:00:00+05:30",
    "description": "When Rukmini Devi Arundale founded Kalakshetra in 1936, she did not intend to create a new style of Bharatnatyam. Yet, the Kalakshetra bani emerged—a new approach that distinguished itself from the traditional ‘sadir’ style. Rukmini Devi’s choreography blended classical purity with innovative storytelling, giving rise to a new school of Bharatanatyam that balanced tradition with modern sensibilities. \nOver two decades ago, Kalakshetra alumna Swagata Sen Pillai began curating Smriti Pravah in memory of Rukmini Devi, celebrating her legacy on her birth anniversary and bringing together Kalakshetra students worldwide to honor their guru. After Swagata’s untimely passing due to COVID, her friends and seniors from Kalakshetra, Tripti Bhupen and Archita Mehta, have continued this tradition. \nIn 2025, on Rukmini Devi’s 121st anniversary, Archita Mehta’s NrityaSadhana Centre for Bharatanatyam and Indian Folk Dances, and Tripti Bhupen’s Samarpan School of Performing Arts take a journey into her creative world, where she preserved Bharatanatyam’s traditions while innovating within its structure. \nThe performance will be in two parts: the first will highlight pieces from the margam choreographed by Rukmini Devi’s direct disciples, while the second will explore her timeless dance dramas. \nThis year’s performers include Kalakshetra alumni Archita Mehta, Tripti Bhupen, Gayatri Krishnaveni Lakshmanan, Vasundhara Thomas, Priyashri Rao, Lasya Priya R, and Nrithika B Natesh. \nPresented by: \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/smriti-pravah-2025/",
    "keywords": [
      "Dance",
      "In Memory",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-724.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70972-1741199400-1741204800@bangaloreinternationalcentre.org",
    "name": "Caring for the Caregiver",
    "startDate": "2025-03-05T18:30:00+05:30",
    "endDate": "2025-03-05T20:00:00+05:30",
    "description": "In this talk, Norman Sartorius emphasizes the critical need to address the challenges faced by caregivers of individuals with mental illness. Often overlooked, these caregivers, typically family members, find themselves thrust into unfamiliar roles, grappling with feelings of guilt, shame, fear and burnout. Caregivers, often also women, also find themselves facing the harshest stigma and judgement. They navigate complex emotions and uncertainties about their impact on their loved one’s illness. Sartorius advocates for focusing on supporting and empowering caregivers as a crucial starting point in improving mental health care. \nThe talk will be followed by a Q&A session with the audience. \n    \n",
    "url": "https://bangaloreinternationalcentre.org/event/caring-for-the-caregiver/",
    "keywords": [
      "Health & Wellness",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-728.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70819-1741372200-1741377600@bangaloreinternationalcentre.org",
    "name": "Quo Vadis Dravidian Politics?",
    "startDate": "2025-03-07T18:30:00+05:30",
    "endDate": "2025-03-07T20:00:00+05:30",
    "description": "On September 17, 1949, C.N. Annadurai (Anna) founded the DMK after splitting with Periyar E.V. Ramaswamy. The party steadily gained mass appeal, shedding its separatist stance in 1962 and winning power in Tamil Nadu in 1967. Since then, it has remained a major force, first under M. Karunanidhi and now under M.K. Stalin. \nDespite political upheavals—including M.G. Ramachandran’s 1972 split, its 1976 ousting during the Emergency, dismissal in 1991 over alleged LTTE ties, and a 1993 split—the DMK has endured, reclaiming power in 2021. \nKnown for its pioneering welfare policies, the DMK now promotes its ‘Dravidian Model’ as a national alternative, emphasizing Tamil cultural nationalism and cooperative federalism. Yet, 75 years on, it faces challenges from caste-based and nationalist forces, as well as accusations of corruption and dynastic rule. \nAt this crucial juncture, veteran political commentator R. Kannan examines the DMK’s journey and future, offering an objective and comprehensive account of its role in Tamil Nadu politics. \nAuthor R. Kannan will be in conversation with Author & Editor Karthik Venkatesh. A Q&A session with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/quo-vadis-dravidian-politics/",
    "keywords": [
      "Books",
      "History",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ta",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-727.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "70212-1740596400-1740600900@bangaloreinternationalcentre.org",
    "name": "This Is Not a Solo",
    "startDate": "2025-02-26T19:00:00+05:30",
    "endDate": "2025-02-26T20:15:00+05:30",
    "description": "This is not a solo | 23 min | Vanessa Vieira da Cunha\n(De)construction. The hidden. The exposed. What is. What was. What it no longer is but could be again. Antagonistic relationships create space for a gray place, the place that inhabits what is not yet one thing or the other. This is not a solo aims to research and deepen issues related to identity, the exposure of the self, the importance we attribute to the set of qualities and particularities that we think define us, the place of confrontation with the vision of the another, the dizzying sensation of detaching ourselves from what is known and comfortable to reveal inner layers that remain inaccessible to others.\n \nEgo | Echo | 15 min | Indrek Kornel\nA dialogue between self and surroundings, Ego | Echo explores the interplay of reflection an resonance. Hyper-aware of the textures, sounds, tastes, and rhythms of the here and now, the performer navigates the constant feedback loop between their body and the world around them. How does the echo of their presence alter the ego of their being? In this improvised journey, they let each moment reshape them—a push and pull between intention and instinct, order and chaos, heaven and hell. It is a movement through the shifting landscapes of self and space, where the only constant is the present. \nFloating Clouds | 15 min | Abhilash Ningappa\nFloating Clouds is a contemplative performance that examines the complexities of life through the lens of artistic expression. It reflects on the universal challenges, aspirations, and fleeting triumphs that shape the human experience The piece combines expressive dance, spoken word, and symbolic gestures to create a rich tapestry of movement and meaning. The choreography, marked by fluidity and grace, evokes the transient beauty of clouds, offering a metaphor for the impermanence of life. Spoken text serves as a bridge, drawing the audience into the narrative and fostering a shared space of reflection. Through its interplay of movement and language. Floating Clouds invites audiences to engage with themes of transformation, resilience, and the ephemeral nature of existence.\n \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/this-is-not-a-solo/",
    "keywords": [
      "Dance",
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "This Is Not a Solo"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-721.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70824-1740913200-1740918600@bangaloreinternationalcentre.org",
    "name": "Grandmas’ Grand Adventures",
    "startDate": "2025-03-02T11:00:00+05:30",
    "endDate": "2025-03-02T12:30:00+05:30",
    "description": "Nanammal and Kamalathal are as different as they come. Except for one thing – they both love to travel! \nJoin us for three stories, all about Nanammal and Kamalathal’s adventures through air, land and water as they set out to explore the world. \nWe’ll also do a fun activity at the end for you to share something about your own grandmas! \n",
    "url": "https://bangaloreinternationalcentre.org/event/grandmas-grand-adventures/",
    "keywords": [
      "Books",
      "Cities",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-722.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "70636-1740769200-1740774600@bangaloreinternationalcentre.org",
    "name": "Reeds and Keys",
    "startDate": "2025-02-28T19:00:00+05:30",
    "endDate": "2025-02-28T20:30:00+05:30",
    "description": "This is a BIC Elsewhere event at Sabha: An Arts and Crafts Shaale \nDmitry Rasul-Kareyev, Principal Clarinet with the Orchestre de la Suisse Romande in Geneva, and renowned Russian organist, Ekaterina Melnikova, will perform a range of music from Johann Sebastian Bach in the 17th century to Darius Milhaud in the 20th century, with a combination of instruments and repertoire rarely heard in Bangalore. The mother and son duo will also perform one of Ekaterina Melnikova’s own compositions, “March” from “Seasons”. \n \n  \nAbout BIC Elsewhere: \nWhile the majority of our events find a home at our premises in Domlur, BIC Elsewhere represents our commitment to bringing conversations, arts, and culture directly to diverse audiences. Through this initiative, we collaborate with various venues, extending the reach of our events beyond our own space. These partnerships not only breathe life into our gatherings but also play a crucial role in cultivating an environment for the flourishing of arts and culture in the city. \nIn collaboration with Shankaraa Foundation and Sabha \n      \nSupported by Furtados and Steinway \n      \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/reeds-and-keys/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Sabha: An Arts and Crafts Shaale, No.44/A, Kamaraj Rd, Bharati Nagar, Shivaji Nagar, Bengaluru, Karnataka, 560042, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Reeds and Keys"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-726.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "70762-1740508200-1740513600@bangaloreinternationalcentre.org",
    "name": "Science, Technology & Society in a Tumultuous World",
    "startDate": "2025-02-25T18:30:00+05:30",
    "endDate": "2025-02-25T20:00:00+05:30",
    "description": "Politician, economist, social activist, strategist, or even mere scientist: Today, an expert in any walk of life anywhere in the world feels like they are in a bus going downhill with the brakes only somewhat working. For us in India, this kind of ride is everyday. Risks, uncertainties, and exigencies interfere daily with efforts  at careful planning and developing polices and their translation to action. Yet, through the dust and churn around us, it is worth examining how India has developed its policy and decision-making tools in complex and challenging areas since independence. Where have we done reasonably, and where are there causes for concern for the future? \nIn the first third of this talk, the speaker will summarise India’s science and technology journey from the early twentieth century to the present. Here, they will also point out how the world of science and technology has changed. The next third will address how science and technology have been used and have enabled the rise of technology giants and of current societies. Finally explored will be the question of what the future holds for India—seen through the lens of science and technology—in a world that could not have been imagined in 1900? What awaits us in 2050, a new, placid, peaceful valley, or will the bus continue to careen along? \nThe talk will be followed by a Q&A session with the audience. \nThis lecture is a part of Azim Premji University’s Public Lecture Series. \nPresented by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/science-technology-society-in-a-tumultuous-world/",
    "keywords": [
      "Science",
      "Society",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "70622-1740931200-1740936600@bangaloreinternationalcentre.org",
    "name": "Soliloquy With Tabla",
    "startDate": "2025-03-02T16:00:00+05:30",
    "endDate": "2025-03-02T17:30:00+05:30",
    "description": "The event highlights the experience of the age old practice of CHILLA (A 40 days intense practice, where the individual practices their art form without any outside world contact totally unaware of the time,day and night. The participant is allowed only to meet their Guru for timely advice if need be. The practice regime is absolutely challenging mentally, physically and emotionally. \nThe evening will also feature a traditional Tabla solo performance, followed by an interactive session where the audience can engage with the artist. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/soliloquy-with-tabla/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Soliloquy With Tabla"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-723.jpg"
  }
]