[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "62931-1725130800-1725136200@bangaloreinternationalcentre.org",
    "name": "Nirvrithi",
    "startDate": "2024-08-31T19:00:00+05:30",
    "endDate": "2024-08-31T20:30:00+05:30",
    "description": "Nirvrithi is a state of inexplicable ecstasy. \nThrough the medium of Bharatanatyam, Shijith N Parvathy takes you on a journey in pursuit of this eternal bliss, the ultimate experience. In Bharatanatyam, the Margam is a path that unravels a seeking. Through this path the dancer attains Nirvrithi. \nThe concept of Satchitananda described in the central piece of the performance is what Shijith N Parvathy through their conceptual choreographic Margam takes you to experience. Nirvrithi is woven from manifested inner thoughts to stimulate the body, mind and soul. \nFor Shijith N Parvathy, Bharatanatyam is a spiritual recourse and Nirvrithi is their experience. \nThis is the fourth edition of the ‘All For Dance’ series presented by Kalavaahini in association with BIC curated by Malavika Sarukkai. The ‘All For Dance’ series is presented every quarter at BIC to spotlight some of the best of classical dance from across India. The series is supported by Tanishq and Taneira. The event is managed by Shreya Nagarajan Singh Arts Department Consultancy. \nIn collaboration with:\n \nSupported by:\n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/nirvrithi/",
    "keywords": [
      "Culture*",
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-571.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63385-1726254000-1726259400@bangaloreinternationalcentre.org",
    "name": "Her Voice",
    "startDate": "2024-09-13T19:00:00+05:30",
    "endDate": "2024-09-13T20:30:00+05:30",
    "description": "Her Voice by SaMaRaSa is an exploration of compositions that are created by women, or about women, set in the context of a Carnatic concert, but with a novel approach. The musicians explore the nuances of the raga, lyric and soul of the composition, while sharing what each piece means to them personally as women and artistes. Interspersed with spoken word and poetry, this concert will be an intimate yet exciting journey into the world of raga and rhythm. They will share inspirational stories of fearless artistes who conquered barriers within and without to leave a lasting legacy. \nPresenting the concert are three accomplished musicians – Manasi Prasad (vocals), Aditi Krishnaprakash (violin) and Deepika Sreenivasan (mridangam) who have travelled the world sharing their music. In addition, their academic and corporate credentials have enabled them to develop a world view that is unique, contemporary and relevant. \n‘SaMaRaSa’ – Sisters in Harmony, is a collective of women musicians who believe that music not only entertains and elevates, but can also create change. Through performances and ideas that celebrate women, SaMaRaSa aims to bring fresh ideas to the way Carnatic music is presented and performed. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/her-voice/",
    "keywords": [
      "Gender",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Her Voice"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-587.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63144-1725042600-1725051600@bangaloreinternationalcentre.org",
    "name": "Musical Ecologies",
    "startDate": "2024-08-30T18:30:00+05:30",
    "endDate": "2024-08-30T21:00:00+05:30",
    "description": "What is nature? Though it is a term used so ubiquitously, its meaning has been debated and questioned, changing with each era. While trees, animals and the planets are considered natural elements, it is the human relationship to nature that concerns us the most. Aren’t humans too part of nature, rather than external to it? What is the relationship between humans and nature? Is it merely utilitarian, or is there hope that can it be something more? \nMusical Ecologies is an exploration of how music and art can answer such questions for us, by showing us how to experience nature as a world of emotion. Hindustani music has a long tradition of celebrating natural beauty and seasons. These compositions capture the subjective human response to nature, locating humans very much inside the natural ecosystem as co-habitants. Perhaps by relating to nature on its own terms rather than from a position of control or exploitation, we can contemplate a symbiotic model of living for the future. \nHindustani vocalist Priya Purushothaman presents bandishes and raags that celebrate the environment and its rich ecosystems, interspersed with commentary addressing these philosophical questions, suggesting a way of bringing together environmental consciousness and music. \nThe session will also include readings and a discussion with Musician, Playwright and Social Justice Worker Rumi Harish. \n  \nIn collaboration with: \n  \nSupported by: \n     \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/musical-ecologies/",
    "keywords": [
      "Environment",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Musical Ecologies"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTERS-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "62849-1725129000-1725134400@bangaloreinternationalcentre.org",
    "name": "Till Death Us Do Part",
    "startDate": "2024-08-31T18:30:00+05:30",
    "endDate": "2024-08-31T20:00:00+05:30",
    "description": "The marital and the martial are sometimes interchangeable in the long-term landscape. As infidelity and indifference run through many relationships, and the future looks polyamorous, are marriages going out of fashion? \nAuthors Selma Carvalho, Shinie Antony and author/relationship counsellor Vijay Nagaswami are all set to discuss the unholy state of matrimony with journalist/author Prajwal Hegde. \nThe discussion will be followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/till-death-us-do-part/",
    "keywords": [
      "Culture*",
      "Gender",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-583.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63363-1725820200-1725825600@bangaloreinternationalcentre.org",
    "name": "AI: The Architect of Politics",
    "startDate": "2024-09-08T18:30:00+05:30",
    "endDate": "2024-09-08T20:00:00+05:30",
    "description": "Humanity stands on the brink of a new era defined by intelligence. Artificial intelligence is evolving at a breakneck pace, transforming not only business and daily life but also politics- both personal and the world’s. \nThis session draws from Juna Antonio March’s book Momentum that confronts the pivotal challenge of our age- the allure of extraordinary progress, juxtaposed against a world teetering on the edge of chaos, held back by outdated political structures. Momentum charts the trajectory of this new world and the path to avoid fatal collapse. \nThis session will shed light on how AI is dramatically reshaping the world by revolutionising various sectors, the challenges it presents, how we interact with technology and navigate our environments, how AI is increasingly influencing politics by shaping public discourse, campaign strategies, and policy decisions, thus, becoming instrumental in affecting strategic decisions of  politics and governance. \nJuna Antonio March will be in conversation with Tanuj Bhojwani. The discussion will be followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/ai-the-architect-of-politics/",
    "keywords": [
      "Books",
      "Fiction",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/POSTERS_Thumbnail-copy-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "63240-1725390000-1725398100@bangaloreinternationalcentre.org",
    "name": "ಜತೆಗಿರುವನು ಚಂದಿರ | Jotegiruvanu Chandira",
    "startDate": "2024-09-03T19:00:00+05:30",
    "endDate": "2024-09-03T21:15:00+05:30",
    "description": "Kannada | 130 Minutes | For ages 8 years + \nIn Jayant Kaikini’s Kannada play ‘Jotegiruvanu Chandira,’ based on Joseph Stein’s classic ‘Fiddler on the Roof,’ the audience is taken on a heartwarming journey that blends traditional stubbornness with a tender embrace of life’s bigger picture. Set against the backdrop of citizenship and partition, this story is akin to a sweet eye-opener, inviting us to ponder the true meaning of being a citizen. \nAt the heart of the play lies a family in an Indian coastal village during the tumultuous partition era. The wounds and displacements caused by the division of the nation have traveled far, reaching even this remote southern hamlet. Yet, the unique sense of humour and the strong family dynamics that define the village people become the lifeblood of the narrative. \nThe play challenges the notion that citizenship is merely about papers and borders. Instead, it explores the deeper, more complex question of what it means to feel truly at home – a sentiment that transcends the physical boundaries of a nation. \nThe play’s rich tapestry of characters and their experiences weave a tapestry of resilience, adaptability, and the enduring power of community. As the audience follows the family’s journey, they are confronted with the harsh realities of displacement and the fragility of identity, but also with the profound joy and comfort found in the embrace of a supportive, close-knit society. \nThrough its blend of humour, poignancy, and universal themes, ‘Jategiruvanu Chandira’ emerges as a powerful testament to the human spirit, reminding us that the true essence of citizenship lies not in documents, but in the sense of belonging and the connections that bind us together, transcending the artificial divisions of the world. \nಜೋಸೆಫ್ ಸ್ಟೀನ್‌ರ ಕ್ಲಾಸಿಕ್ ‘ಫಿಡ್ಲರ್ ಆನ್ ದಿ ರೂಫ್’ ಆಧಾರಿತ ಜಯಂತ ಕಾಯ್ಕಿಣಿಯವರ ಕನ್ನಡ ನಾಟಕ ‘ಜೊತೆಗಿರುವನು ಚಂದಿರ’ದಲ್ಲಿ, ಪ್ರೇಕ್ಷಕರನ್ನು ಸಾಂಪ್ರದಾಯಿಕ ಹಠಮಾರಿತನ ಮತ್ತು ಜೀವನದ ದೊಡ್ಡ ಚಿತ್ರಣದ ಕೋಮಲ ಆಲಿಂಗನದ ನಡುವಿನ ಹೃದಯಸ್ಪರ್ಶಿ ಪ್ರಯಾಣಕ್ಕೆ ಕರೆದೊಯ್ಯಲಾಗುತ್ತದೆ. ನಾಗರಿಕತ್ವ ಮತ್ತು ವಿಭಜನೆಯ ಹಿನ್ನೆಲೆಯಲ್ಲಿ ಹೆಣೆದ ಈ ಕಥೆ, ನಿಜವಾದ ನಾಗರಿಕನಾಗಿರುವುದರ ಅರ್ಥವನ್ನು ಯೋಚಿಸಲು ನಮ್ಮನ್ನು ಆಹ್ವಾನಿಸುವ ಒಂದು ಸಿಹಿಯಾದ ಕಣ್ತೆರೆಸುವಿಕೆಯಂತಿದೆ. \nನಾಟಕದ ಕೇಂದ್ರ ಬಿಂದುವಿನಲ್ಲಿ ಭಾರತದ ಕರಾವಳಿ ಗ್ರಾಮದ ಒಂದು ಕುಟುಂಬವಿದೆ, ಅದೂ ಕೂಡ ಗೊಂದಲಮಯ ದೇಶ ವಿಭಜನೆಯ ಕಾಲದಲ್ಲಿ. ರಾಷ್ಟ್ರದ ವಿಭಜನೆಯಿಂದ ಉಂಟಾದ ಗಾಯಗಳು ಮತ್ತು ವಿಸ್ಥಾಪನೆಗಳು ದೂರದ ಈ ದಕ್ಷಿಣದ ಹಳ್ಳಿಯನ್ನೂ ತಲುಪಿವೆ. ಆದರೂ, ಹಳ್ಳಿಯ ಜನರನ್ನು ವ್ಯಾಖ್ಯಾನಿಸುವ ವಿಶಿಷ್ಟ ಹಾಸ್ಯಪ್ರಜ್ಞೆ ಮತ್ತು ಬಲವಾದ ಕೌಟುಂಬಿಕ ಸಂಬಂಧಗಳು ಕಥಾನಕದ ಜೀವಾಳವಾಗುತ್ತವೆ. \nನಾಗರಿಕತ್ವವು ಕೇವಲ ಕಾಗದಪತ್ರಗಳು ಮತ್ತು ಗಡಿಗಳ ಬಗ್ಗೆ ಮಾತ್ರವಲ್ಲ ಎಂಬ ಭಾವನೆಯನ್ನು ಈ ನಾಟಕ ಸವಾಲು ಮಾಡುತ್ತದೆ. ಬದಲಿಗೆ, ನಿಜವಾಗಿಯೂ ಮನೆಯಲ್ಲಿರುವ ಭಾವನೆ ಎಂದರೇನು ಎಂಬ ಆಳವಾದ, ಹೆಚ್ಚು ಸಂಕೀರ್ಣವಾದ ಪ್ರಶ್ನೆಯನ್ನು ಅನ್ವೇಷಿಸುತ್ತದೆ – ರಾಷ್ಟ್ರದ ಭೌತಿಕ ಗಡಿಗಳನ್ನು ಮೀರಿದ ಭಾವನೆ ಇದು. \nನಾಟಕದ ಸಮೃದ್ಧ ಪಾತ್ರಗಳು ಮತ್ತು ಅವರ ಅನುಭವಗಳು ಸ್ಥೈರ್ಯ, ಹೊಂದಿಕೊಳ್ಳುವ ಸಾಮರ್ಥ್ಯ ಮತ್ತು ಸಮುದಾಯದ ಶಾಶ್ವತ ಶಕ್ತಿಯ ಜಾಲವನ್ನು ಹೆಣೆಯುತ್ತವೆ. ಕುಟುಂಬದ ಪ್ರಯಾಣವನ್ನು ಅನುಸರಿಸುವಾಗ, ಪ್ರೇಕ್ಷಕರು ವಿಸ್ಥಾಪನೆಯ ಕಠೋರ ವಾಸ್ತವತೆ ಮತ್ತು ಗುರುತಿನ ಭಂಗುರತೆಯನ್ನು ಎದುರಿಸುತ್ತಾರೆ, ಆದರೆ ಬೆಂಬಲಿಸುವ, ನಿಕಟ ಸಮಾಜದ ಆಲಿಂಗನದಲ್ಲಿ ಕಂಡುಬರುವ ಆಳವಾದ ಸಂತೋಷ ಮತ್ತು ಸಮಾಧಾನವನ್ನೂ ಅನುಭವಿಸುತ್ತಾರೆ. \nಹಾಸ್ಯ, ಭಾವುಕತೆ ಮತ್ತು ಸಾರ್ವತ್ರಿಕ ವಿಷಯಗಳ ಮಿಶ್ರಣದ ಮೂಲಕ, ‘ಜೊತೆಗಿರುವನು ಚಂದಿರ’ ಮಾನವ ಮನಸ್ಸಿನ ಶಕ್ತಿಯ ಬಲವಾದ ಸಾಕ್ಷಿಯಾಗಿ ಹೊರಹೊಮ್ಮುತ್ತದೆ. ನಾಗರಿಕತ್ವದ ನಿಜವಾದ ಸಾರವು ದಾಖಲೆಗಳಲ್ಲಿ ಅಲ್ಲ, ಬದಲಾಗಿ ಸೇರಿದ ಭಾವನೆಯಲ್ಲಿ ಮತ್ತು ನಮ್ಮನ್ನು ಬಂಧಿಸುವ ಸಂಬಂಧಗಳಲ್ಲಿ ಅಡಗಿದೆ ಎಂದು ನಮಗೆ ನೆನಪಿಸುತ್ತದೆ, ಜಗತ್ತಿನ ಕೃತಕ ವಿಭಜನೆಗಳನ್ನು ಮೀರಿ ನಿಲ್ಲುತ್ತದೆ. \n  \nCredits: \nನಾಟಕಕಾರರು – ಜಯಂತ ಕಾಯ್ಕಿಣಿ\nPlaywright – Jayanth Kaikini \nವಿನ್ಯಾಸ, ನಿರ್ದೇಶನ – ಹುಲುಗಪ್ಪ ಕಟ್ಟೀಮನಿ\nDirection and Design – Huligappa Kattimani \nಸಂಗೀತ – ಶ್ರೀನಿವಾಸ್ ಭಟ್ ಚೀನಿ\nMusic – Shrinivas Bhat Cheeni \nಸಂಚಾಲಕರು – ಶಶಿಧರ್ ಭಾರಿಘಾಟ್, ಗೋಪಿನಾಥ್.\nCo-ordinators – Shashidhar Bharighat, Gopinath \nರಂಗ ನಿರ್ವಹಣೆ – ರಾಹುಲ್, ದಿವ್ಯಶ್ರೀ, ಬಾಷ್ ರಾಘವೇಂದ್ರ\nStage Management – Rahul, Divyashree, Bosch Raghavendra \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%9c%e0%b2%a4%e0%b3%86%e0%b2%97%e0%b2%bf%e0%b2%b0%e0%b3%81%e0%b2%b5%e0%b2%a8%e0%b3%81-%e0%b2%9a%e0%b2%82%e0%b2%a6%e0%b2%bf%e0%b2%b0-jotegiruvanu-chandira/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "ಜತೆಗಿರುವನು ಚಂದಿರ | Jotegiruvanu Chandira"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-589.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "63574-1725188400-1725197400@bangaloreinternationalcentre.org",
    "name": "ದೇವರ ಕಾಡು | Devara Kaadu",
    "startDate": "2024-09-01T11:00:00+05:30",
    "endDate": "2024-09-01T13:30:00+05:30",
    "description": "Kannada with English Subtitles | 113 Minutes | 1993 \nAfter the death of the father, a family is forced to move from their home in the forest to the city, where they barely scrape by. \nThis month’s film featured in our informal film club is Devara Kaadu (1993) \n“Devara Kaadu” is a poignant Indian film that weaves together themes of environmental conservation, family bonds, and the struggle for survival. Directed by Pattabhirama Reddy, this 1993 drama tells the story of Deva, a young man whose life journey takes him from the forests of his childhood to the harsh realities of urban life, and back again to his roots. \nThe narrative begins with tragedy, as Deva and his mother are forced to leave their forest home after his father’s death. In the city, they face the challenges of poverty head-on. While his mother works as a domestic helper, young Deva takes on the role of a rag-picker, scraping together what he can to support their meager existence. As he grows older, Deva advances to pulling a rickshaw, a symbol of his determination to improve their circumstances. \nHowever, the city’s toll on his mother’s health becomes evident. Her dying wish to return to their native place sets in motion a bittersweet journey. Though she doesn’t survive to see their homeland, Deva ensures her final resting place is beside his father’s grave. \nIt’s at this pivotal moment that Deva’s true life’s work begins. Honouring his parents’ wishes and memory, he embarks on a remarkable four-decade mission to reforest the barren land they once called home. Through his tireless efforts, Deva transforms the landscape, creating a lush forest where once there was only abandoned earth. \n“Devara Kaadu” is not just a tale of personal loss and perseverance; it’s a powerful allegory for mankind’s relationship with nature. The film showcases how one individual’s dedication can lead to monumental change, breathing life back into forgotten lands and communities. \nRecognized for its environmental message, “Devara Kaadu” was awarded the National Film Award for Best Film on Environment Conservation/Preservation in 1993, cementing its place as a significant work in Indian cinema. \nCredits: \nDirector: Pattabhirama Reddy\nAssociate Director: Konark Reddy\nStory and Screenplay: Pattabhirama Reddy\nDialogue: Su Ramakantha, C Chandrashekar\nMusic: Konark Reddy\nCinematography: Navroze Contractor\nEditor: Suresh Urs\nArt Direction: G Murthy\nCostume Design: G Murthy\nMakeup: Sharavanan\nSound: V Aravindan, P K Suresh (Dialogues), K S Krishnamurthy (Re-Recording) \nStarring:\nKirthana Kumar, K T Abraham, Kantharaj, Prabhu, Anand, T S Nagabharana, Katte Ramachandra, Suman Ramesh, C Chandrashekar, A R Chandrashekar, Usha Bhandari, Dakshinachar, Abbas Abbalagere, Kantesh, C V Rudrappa, Uma Rudrappa, Indu, Raja Balakrishna, Joseph Katukaran, Chandra, Mutthuraj \nProduced by: Pattabhirama Reddy Productions\nPresented by: The Concerned for Working Children (Bangalore)\nProduction Manager: Kotappa \n\nAbout B•Cinematic \n\nCalling all cinephiles! BIC is thrilled to present B•Cinematic, an initiative dedicated to celebrating the most essential, impactful, and artistically significant cinematic works from across the state and the country. \nAt B•Cinematic, our mission is to curate and share those remarkable films that is a must-watch (or re-watch) experience for every passionate cinema lover. From groundbreaking classics to under-appreciated gems, our carefully curated selection will take you on an unparalleled (pun not intended) cinematic journey through the ages. \nThrough curated screenings, insightful discussions, and engaging analyses from distinguished cinematic voices, we aim to not only watch these films together but to truly appreciate their craftsmanship, cultural impact, and intellectual depth. Our vibrant community of film aficionados will collectively rediscover Indian cinema’s most stunning and enduring masterpieces. \nSo join us on this quest to experience the films that have defined and redefined the art form. Don’t miss out on crossing these essential works off your bucket list. Because to truly live, you must first watch the films that make life worth living. \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%a6%e0%b3%87%e0%b2%b5%e0%b2%b0-%e0%b2%95%e0%b2%be%e0%b2%a1%e0%b3%81-devara-kaadu/",
    "keywords": [
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "ದೇವರ ಕಾಡು | Devara Kaadu"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-588.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63157-1726167600-1726174800@bangaloreinternationalcentre.org",
    "name": "Harmonica Magic",
    "startDate": "2024-09-12T19:00:00+05:30",
    "endDate": "2024-09-12T21:00:00+05:30",
    "description": "Many years ago, in Detroit during a chance meeting with Jerry Murad of the Harmonicats, a commitment was made. Sulaiman Jamal met Jerry Murad at a harmonica convention, and he asked Sulaiman to continue playing the chromatic harmonica. He highlighted the versatility and beauty of the small instrument. That was Sulaiman’s motivation and inspiration to continue playing the unique instrument which he had actually put in cold storage. \nWhile Jerry had passed away many years ago, Sulaiman was reminded by a mutual friend that he had not fulfilled Jerry’s request – This concert is to do just that. \nThe theme of the concert is to cover some of the greatest Broadway and cinema themes, mainly from yesteryear which have warmed our hearts. \nThe evening will include favourites from Phantom of the Opera, The Wizard of Oz, Jesus Christ Superstar, Fiddler on the Roof and more. Not to forget the classics from The Beatles, Leonard Cohen, Simon and Garfunkel, and Big Band and Blues numbers. \nWith a group of extremely talented and accomplished musicians, the evening can’t be anything but memorable. The magic of the Harmonica and an incredible music ensemble awaits you. \nPresented by: \n \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/harmonica-magic/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Harmonica Magic"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-2_POSTER-17.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63492-1725647400-1725652800@bangaloreinternationalcentre.org",
    "name": "Demystifying Climate Change",
    "startDate": "2024-09-06T18:30:00+05:30",
    "endDate": "2024-09-06T20:00:00+05:30",
    "description": "Every day we hear something unusual. A fire here, a flood there, a storm surge, a cloudburst. These events affect all of us, our well-being, our health, our family, our work. Their frequency and intensity are increasing. Fortunately, however, we no longer lack explanations for these events. We know fossil fuels and the destruction of Nature by us humans are the primary reasons for the alarming acceleration in global warming. \nAwareness is the first step towards change, and Rajan Mehta’s Backstage Climate is an attempt to make you aware of global warming and climate change in a simple and interesting manner. It demystifies this grim reality—the science, the politics and the economics behind climate change. It also gives you a glimpse of the policies, technology and solutions that can help save the planet and ensure our survival. \nGoing slightly beyond mere awareness, the attempt is to help the reader connect the dots and develop a perspective on the reasons, impact and solutions that can help us avoid a climate crisis. \nRajan Mehta will be in conversation with Prem Panicker. The discussion will be followed by a Q&A session with the audience. \nPresented by \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/demystifying-climate-change/",
    "keywords": [
      "Climate Change",
      "Environment",
      "Nonfiction"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/POSTER_Thumbnail-copy-3-4.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63375-1725562800-1725567300@bangaloreinternationalcentre.org",
    "name": "Kathas in Kathak",
    "startDate": "2024-09-05T19:00:00+05:30",
    "endDate": "2024-09-05T20:15:00+05:30",
    "description": "Kathak, one of India’s most iconic classical dance forms, has continuously evolved over centuries, shaped by the dynamic interplay of poetry, politics, and cultural shifts. Imperative to its evolution are the poetic narratives and political landscapes that have informed and transformed both its content and form. \nIn this performance, Madhu Nataraj and the Natya STEM Dance Kampni present a space-temporal retelling of Kathak’s rich history. Through an array of rare, vintage, and contemporary choreographies, the dancers weave together the past and the present, allowing historical veracity to coexist with artistic resilience. \nThis unique performance delves into Kathak’s diverse journey across regions and eras, offering an insightful exploration of how artistic expression has both shaped and been shaped by the socio-political contexts of its time. From the courts of ancient kingdoms to the modern stage, the show showcases Kathak’s timeless beauty and enduring adaptability, all while celebrating the dance’s poetic spirit. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/kathas-in-kathak/",
    "keywords": [
      "Dance",
      "History",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-15.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63431-1725188400-1725193800@bangaloreinternationalcentre.org",
    "name": "Neighbourhood Narratives",
    "startDate": "2024-09-01T11:00:00+05:30",
    "endDate": "2024-09-01T12:30:00+05:30",
    "description": "Experience Bangalore through the eyes of those who have explored its streets with curiosity and passion. \nIn this session, listen to a variety of curated experiences uncovering the lesser-known facets of Bangalore that often go unnoticed. From the bustling markets to tranquil bookstores, from historical landmarks to contemporary cafes, these narratives offer a blend of personal reflection and historical research. \nThe topics presented will be the Karaga Connection, Literary Trail and Cafe Crawl.  \nWhether you’re a lifelong Bangalorean or new to the city, you’ll leave with a deeper understanding and appreciation of Bangalore’s unique character and charm. \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/neighbourhood-narratives/",
    "keywords": [
      "Bangalore",
      "Cities",
      "Culture*"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-586.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63420-1725795000-1725798600@bangaloreinternationalcentre.org",
    "name": "Object Stories",
    "startDate": "2024-09-08T11:30:00+05:30",
    "endDate": "2024-09-08T12:30:00+05:30",
    "description": "You’ve read books. You’ve read comics. You’ve read magazines. But have you ever read an object? From ancient times, inventive humans have created objects to enrich their world. Join award-winning children’s author Devika Cariapa as she introduces her latest book, A Children’s History of India in 100 Objects and learn to read clues from some of these old material remains. Turn into ‘object detectives’ as tiny coins and crumbling pottery reveal secrets of the long-ago people who made them. Then, write your own exciting object stories. Discover a whole new way of understanding the past! \n",
    "url": "https://bangaloreinternationalcentre.org/event/object-stories/",
    "keywords": [
      "Culture*",
      "History",
      "Literature",
      "Visual Arts",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/POSTER_Thumbnail-copy-3-3.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "62957-1725044400-1725049800@bangaloreinternationalcentre.org",
    "name": "Tango Ports",
    "startDate": "2024-08-30T19:00:00+05:30",
    "endDate": "2024-08-30T20:30:00+05:30",
    "description": "Puertos de Tango (Tango Ports) aims to revisit lesser-known themes of great Uruguayan authors, thus keeping wonderful compositions alive. The project includes a special tribute to Astor Piazzolla and the great Uruguayan poet Horacio Ferrer, evoking much of their creative duo and reinterpreting part of their repertoire inspired by the artists’ homeland, Uruguay. In this kind of cosmopolitan tango without temporal and spatial boundaries, some versions in Italian and French are included, justified in the words of Ramón Pelinski (Argentine ethnomusicologist and composer) who describes tango as a “global metaphor”: a tango with infinite possibilities, capable of imagining and travelling to other worlds, without fear that “its entire life is yesterday, holding it in its past.” \nNatalia Bolani seeks her own interpretation from her perspective as an actor, resignifying and valuing the chosen texts through contemporary sounds, mainly appealing to the sound of the piano and the bandoneón, instruments with strong organic and referential connotations in Rio de la Plata culture. \nThe project intends to attract new audiences to this genre, as well as to offer a repertoire not usually enjoyed by those more familiar with the music. Its raison d’être is, ultimately, the encounter with the emotions, a meeting where interpretive and sonorous power intermingle in the same waters, in a kind of cathartic ritual through artistic creation. \nPresented by the Embassy of Uruguay and MLC Estates LLP \n  \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/tango-ports/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Tango Ports"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTERS.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63449-1726081200-1726086600@bangaloreinternationalcentre.org",
    "name": "Ardha | The Incomplete Dream",
    "startDate": "2024-09-11T19:00:00+05:30",
    "endDate": "2024-09-11T20:30:00+05:30",
    "description": "Ardha – The Incomplete Dream is a solo work born out of a collection of essays contained in the book, Finding Radha by Namita Gokhale and Malashri Lal. Weaving together Bharatanatyam and spoken word, Ardha looks at Radha as the ‘adhara’ in whom the essence of Krishna is held. Beyond her oft-recognized status as Krishna’s lover and his chosen gopi, Radha is ‘Hladini Shakti’ – the potency that is half of Krishna, their spirits engaged in perpetual ‘Lila Hava’- the exchange of ornaments, attire, and souls. \nCould Radha be an illusion that, through her dhara (flow) of joy and pain in union and separation, symbolizes the yearning for something beyond, a yearning that exists in every human? What happened to Radha after Krishna left Mathura? Why is Krishna celebrated while Radha, is a mere shadow in her aradhana to him? \nCredits:  \n– Concept, Choreography, Dance, Spoken word: Vidhya Subramanian \n– Music Composition: Shreya Devnath \n– Sound track produced at Resound India and mixed and mastered by Sai Shravanam \n– Musicians: Keerthana Vaidyanathan, Shreya Devnath, Sivaprasad, Sruti Sagar, Sai Shravanam, Manonmani, Vidhya Subramanian \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/ardha/",
    "keywords": [
      "Dance",
      "Mythology",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-16.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63225-1725649200-1725653700@bangaloreinternationalcentre.org",
    "name": "मेरे ऐनक से | Mere Aenak Se",
    "startDate": "2024-09-06T19:00:00+05:30",
    "endDate": "2024-09-06T20:15:00+05:30",
    "description": "What happens when we begin to realise that perhaps what we see isn’t through clear eyes? \nWhat if we not just sense that many lenses exist in this world,\nBut also that each one of us has an endless supply of them. Lenses big and small\nLenses of all kinds\nDifferent lenses for different people\nDifferent lenses for different situations\nLenses Inspired by the learnings and un learnings of our individual and collective journeys. Lenses inspired by the biases and fears we wear as shields. \nAnd what happens when lenses begin to come off\nOne at a time? \nMeri Aenak Se is a journey a part of each one of us is on. A secret quest each human being is on, a quest of love, a quest for a world with that love\nSo one can surrender to it\nWe take these journeys while we travel on roads that are parallel to one another,\nas we live alongside each other\nBut we take these journeys in isolation.\n\nWhat would happen if suddenly, these journeys became aware of one another?\n\n\nAbout The Aahvaan Project \n\n\n\nThe journey of Aahvaan, a musical collective, has been nothing short of an odyssey. Beginning in late 2016, the past two years have been a watershed moment for the group, as they have traversed the length and breadth of the country, performing, conducting workshops, and enriching themselves through the experience. \nThroughout their tours, Aahvaan has continued to refine their musical style, fusing diverse genres and collaborating with like-minded artists to create a sound that they believe is a modern representation of Nirgun. This constant evolution has allowed them to connect with fellow travellers along the way, each encounter contributing to their artistic growth. \nAahvaan’s latest presentation, “Meri Aenak Se,” is an exploration of the differences in perception, attitudes, and actions that shape our individual experiences. It invites the audience to step into the shoes of another, to see the world through their eyes, and to share in their joys and struggles as if they were one’s own. \nThe original songs and stories, lovingly and thoughtfully curated by Vedi and Sumant, are a testament to Aahvaan’s commitment to storytelling. They cherish the opportunity to share their journey with audiences, fostering a deeper understanding and connection between individuals and cultures. \nAahvaan’s story is one of growth, exploration, and the power of music to bridge the gaps between us. Through their performances and workshops, they continue to inspire and captivate audiences, inviting them to embark on a journey of self-discovery and empathy. \n  \nSupported by \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%a4%ae%e0%a5%87%e0%a4%b0%e0%a5%87-%e0%a4%90%e0%a4%a8%e0%a4%95-%e0%a4%b8%e0%a5%87-mere-aenak-se/",
    "keywords": [
      "Music",
      "Performing Arts",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "मेरे ऐनक से | Mere Aenak Se"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-17.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "63616-1726599600-1726605000@bangaloreinternationalcentre.org",
    "name": "Patterns in Time",
    "startDate": "2024-09-17T19:00:00+05:30",
    "endDate": "2024-09-17T20:30:00+05:30",
    "description": "A piece of music can be considered a pattern in time… the strange thing is that it doesn’t really exist until it is being played… A great work also captures something of the era in which it was written and then travels through time via aural tradition… or in notated form to be performed hundreds of years later. \nPatterns in Time, a range of music from the 16th century to the present, takes the audience through a journey not only through time but also through geographies and cultures from all over the world. \nThe concert begins with Spanish music inspired by the Andalusian flamenco tradition and will proceed to Renaissance and Baroque standards by Dowland, Scarlatti and Bach. This will be followed by an extended and programmatic avant garde composition by the guitar virtuoso Pavel Steidl. \nThe second half of the recital will set off with some refreshingly tropical South American music and some tunes by Indian composers. This will be followed by music inspired by Turkey and end with Shamal, an improvisatory piece consisting of extended techniques and percussion featuring a blend of sonorities and rhythms from the Middle East and the Indian subcontinent. \n \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/patterns-in-time/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Patterns in Time"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-590.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63029-1725042600-1725048000@bangaloreinternationalcentre.org",
    "name": "Inside India’s Red Corridor",
    "startDate": "2024-08-30T18:30:00+05:30",
    "endDate": "2024-08-30T20:00:00+05:30",
    "description": "The Red Corridor remains one of the most complex and challenging areas in India, marred by Naxal-State conflict, that has been shaping the lives of its residents for over half a century. In the years of reporting from the conflict zone of Bastar, journalist Ashutosh Bhardwaj pieced together The Death Script: Dreams and Delusions in Naxal Country. \nIn this session, Ashutosh will shed light on his experience in the conflict zone – reporting on the Maoist, the state atrocities, the plight of the Adivasis caught in the civil war and what it means to live through and write about these experiences as a journalist and a bilingual writer. He will talk about deviating from the traditional form of journalistic writing into more creative ones and the crossroads where these forms converge and diverge. The talk will also offer insights into the status of the Hindi media, its role in shaping the Hindi belt polity, and the urgent need to focus on and invest in this media section. \nAshutosh Bhardwaj will be in conversation with Kannada author Vasudhendra followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/inside-indias-red-corridor/",
    "keywords": [
      "Books",
      "Governance",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_poster.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "62998-1725120000-1725123600@bangaloreinternationalcentre.org",
    "name": "The Story of Kalbelia",
    "startDate": "2024-08-31T16:00:00+05:30",
    "endDate": "2024-08-31T17:00:00+05:30",
    "description": "Kalbelia, a vibrant and mesmerizing traditional dance form from Rajasthan, India, is inscribed on UNESCO’s 2003 Representative List of the Intangible Cultural Heritage of Humanity. This workshop offers participants a unique opportunity to immerse themselves in the rich cultural heritage of the Kalbelia community, which is closely linked to the Navnaths and believed to have gypsy origins. The name “Kalbelia” itself reflects the community’s historical connection to snake charming, with “kal” meaning snake and “belia” meaning friendship. \nParticipants will explore the striking features of Kalbelia dance, known for its swirling movements and colorful costumes, which have made it one of the most captivating dance forms in India. The session will be led by renowned Kalbelia dancers, Kavita Kalbelia and Kanchan Kalbelia, from Chopasani, Jodhpur—a village famous for its Kalbelia performers. They will be accompanied by Govardhan Nath on the dafli and other musicians on the dholak and pungi. \nThe session begins with an introduction to Kalbelia’s rich heritage, followed by a film screening that showcases the traditions and lifestyle of the Kalbelia community. After the film screening, the artists will present a short live performance, showcasing the energetic and captivating Kalbelia dance. This performance will highlight the intricate movements and rhythmic patterns that are the hallmark of Kalbelia. The session culminates in an interactive session where participants can learn Kalbelia dance steps and songs directly from the artists, providing a truly hands-on and memorable experience. \nIn collaboration with: \n      \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-story-of-kalbelia/",
    "keywords": [
      "Culture*",
      "Dance",
      "Performing Arts",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-2_POSTER-16.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "63142-1725388200-1725393600@bangaloreinternationalcentre.org",
    "name": "SpaceAge Solutions",
    "startDate": "2024-09-03T18:30:00+05:30",
    "endDate": "2024-09-03T20:00:00+05:30",
    "description": "India, being one of the developing countries in the world, does face many challenges when it comes to taking up specific developmental projects for the benefit of the people. Natural resources management and societal applications are the biggest areas for India where the Government spends lots of funds for the benefit of its people. \nGovernment spendings of public money in many important areas, such as, building rural and urban infrastructure, programs on land & water conservation, agriculture, water, forests, energy and many others to ensure sustainable development of all basic needs of the people, are efforts towards achieving our sustainable developmental goals. This calls for meticulous planning and well-orchestrated implementation and monitoring. \nSpace technology provides many interesting solutions in terms of Earth observation, communication and GNSS based solutions. The presentation brings out specific areas where such solutions are being provided to the Government using space technology so that the goals of development and governance are met amicably. \nThe talk by Prof. Diwakar will be followed by a discussion with Ecologist, Harini Nagendra. A Q&A session with the audience will follow. \nThis session is part of the Let’s Talk Climate Change Talk series. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/spaceage-solutions/",
    "keywords": [
      "Climate Change",
      "Development",
      "Environment",
      "Science",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-584.jpg"
  }
]