[
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "61741-1722187800-1722194100@bangaloreinternationalcentre.org",
    "name": "Dhrupad Double Bill",
    "startDate": "2024-07-28T17:30:00+05:30",
    "endDate": "2024-07-28T19:15:00+05:30",
    "description": "Dhrupad is one of the oldest pristine art forms that textures the Indian musical system. Join us for an evening of Dhrupad, reimagined by two young and talented Dhrupadiyas. \nMurali Mohan Gowda will introduce the basic concepts and techniques of Dhrupad, specifically related to Dagarbani and Raga music in general. He will cover topics including the basic differences between Dhrupad and other forms of Indian classical music, the origin of Dhrupad, the concept of Ragas, structure and improvisational tools, and Talas and compositions. \nIn the second part of the concert, Shilpa Shankar Narrain will explore unique aspects of Muthuswami Dikshitar’s compositions from a Dhrupad perspective. Considered one of the holy trinity of Carnatic music, Dikshitar traveled far and wide, and it is believed he lived in Varanasi for eight years. During this time, he was greatly influenced by Dhrupad and is known to have composed various kritis with Dhrupad and Hindustani elements. \nCome and be part of a musical journey that bridges the past and the present, honoring the legacy of Dhrupad while exploring its future possibilities. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/dhrupad-double-bill/",
    "keywords": [
      "Heritage",
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Dhrupad Double Bill"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-10.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "61072-1722105000-1722110400@bangaloreinternationalcentre.org",
    "name": "Patterns in Bhasha",
    "startDate": "2024-07-27T18:30:00+05:30",
    "endDate": "2024-07-27T20:00:00+05:30",
    "description": "The book The Politics of Modern Indian Language Literature examines various works of literature, focusing on prose narrative forms such as novels, short stories, memoirs and plays. It deals with works by 25 different writers in 14 languages including those from the religious minorities, marginalised sections and ethnic groups such as those from Kashmir and Manipur, and also women writers from across India. The thrust of the book is primarily the politics of the writing and the common concerns that surface in the selected works. Since so many languages are covered, the works are studied in English language translation and important are primarily the concerns and attitudes of the writers as they are revealed in the translated works. \nThe book tries to look beyond the expressed concerns of each writer at covert significations if any. The discussion is expected to shed light on issues pertaining to Indian language literature after 1947, since this is the first book on the subject to scrutinize it in this way. \nThe author MK Raghavendra will be in conversation with Chiranjiv Singh, IAS and N Vidyashankar Jois, both of whom have been highly active culturally in Bengaluru. The discussion will be followed by a Q&A session. \n",
    "url": "https://bangaloreinternationalcentre.org/event/patterns-in-bhasha/",
    "keywords": [
      "Books",
      "Culture*",
      "Language",
      "Literature",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-2_POSTER-13.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "61664-1722018600-1722024000@bangaloreinternationalcentre.org",
    "name": "'STEMinism' and Feminism",
    "startDate": "2024-07-26T18:30:00+05:30",
    "endDate": "2024-07-26T20:00:00+05:30",
    "description": "What does it mean to be a feminist? And specifically, what does it mean to be a feminist in science studies? What does it mean to examine science at multiple levels, using the twin conceptual tools of feminism: gender and patriarchy? Furthermore, what does it mean to bring in intersectional perspectives to our understanding of science? Using her work on a) developing the field of Feminist Science Studies in India, b) archiving the gendered experiences of women in science and c) exploring questions about masculinities in science, Prof. Gita Chadha will present the possibilities of critically reimagining institutional cultures in and around science. \nThis lecture is part of the Obaid Siddiqi Lectures, Annual lectures delivered by the Obaid Siddiqi Chair in the History and Culture of Science at the Archives at NCBS. \nImage credit: Thumbnail and Header Art by Megha Ramachandra \nIn collaboration with \n     \n",
    "url": "https://bangaloreinternationalcentre.org/event/steminism-and-feminism/",
    "keywords": [
      "Gender",
      "Science"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-2_POSTER-14.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "61423-1722364200-1722371400@bangaloreinternationalcentre.org",
    "name": "The Making of a Campus",
    "startDate": "2024-07-30T18:30:00+05:30",
    "endDate": "2024-07-30T20:30:00+05:30",
    "description": "The design of the IIM Bangalore (IIMB) campus has evolved through contributions from multiple architects over time, yet its adaptable built and open spaces seem to have allowed it to develop into a cohesive and integrated entity. The book The Making of a Campus: IIM Bangalore shares how this campus came into being and how it has been experienced over time. Through its pages, the book reveals the thought processes, design philosophies, and the interplay between architecture and community that have contributed to the campus’s continuing appeal and functionality. \nUsing the book as a starting point, the session will explore how a shared design philosophy has imbued the campus with a sense of timelessness. This project, conceived and executed by architects Balkrishna Doshi and Achyut Kanvinde with subsequent additions by Sanjay Mohe & Medappa, stands as a testament to the enduring design. \nThe session will commence with an introduction by the book’s author, Kiran Keswani, followed by insights from Bijoy Ramachandran, who has produced two documentary films on Doshi. Subsequently, architects Sanjay Mohe and Medappa will present their contributions to the campus design, sharing their discoveries, challenges, and outcomes. The event will conclude with a dialogue on ‘creative collaboration’ among the speakers and a Q&A session with the audience. \nIn collaboration with: \n             \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-making-of-a-campus/",
    "keywords": [
      "Architecture",
      "Books",
      "Design",
      "History",
      "Management"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-537.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "61848-1722794400-1722799800@bangaloreinternationalcentre.org",
    "name": "O Gaanewali",
    "startDate": "2024-08-04T18:00:00+05:30",
    "endDate": "2024-08-04T19:30:00+05:30",
    "description": "Entertaining the nobility of India, her life was different from the other women around her. She had financial independence, she could choose her patrons and partners, and most importantly, she was highly skilled at her art, her music! \nTawaifs and women performers were given a reputation, one that made their life difficult and tainted them as prostitutes and sex workers. Unfortunately, history doesn’t credit them enough for their most valuable contribution to Indian Culture, their Music! Even though they were known for Thumri, Dadra, other semiclassical forms like hori, jhoola, chaiti and so on, they were the first performers to set ghazals to tune and bring them to the performance space as a music genre. This performance will be tracing the evolution of this beautiful genre that gained popularity through the performance of Tawaifs and many other women performers over the years. \nO Gaanewali invites you on a journey through the rich cultural heritage of Indian music, sharing fascinating stories and anecdotes as it introduces iconic forms like thumri, dadra, hori, chaiti, and ghazal, made famous by the legendary Tawaifs and the many talented women who followed in their footsteps \nCreated for lovers for Ghazal, this format explores a slightly later time period in the lives of these artists, taking the audience through a nostalgic musical journey. Expect to hear some evergreen Ghazals like Aye Muhobbat Tere Anjaam Pe Rona Aya, Hum Dekhenge, Woh Jo Hum Mein Tum Mein Qarar Tha, Mere Humnafas and more! \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/o-gaanewali-2/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "O Gaanewali"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-543.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "61754-1722623400-1722629700@bangaloreinternationalcentre.org",
    "name": "Seed Stories",
    "startDate": "2024-08-02T18:30:00+05:30",
    "endDate": "2024-08-02T20:15:00+05:30",
    "description": "2024 | 42 minutes | Odiya, Kui, English with English subtitles | India \nIn a village in the Niyamgiri mountains of Odisha’s Eastern Ghats, a heroic effort is underway. Barefoot ecologist Dr. Debal Deb and his 3 member-team are conserving in-situ over 1000 endangered heirloom varieties of rice. \nOdisha’s Eastern Ghats region is one of the world’s surviving biodiversity hotspots, with Adivasi (Indigenous) communities like the Kondhs possessing the knowledge of growing multiple crops with their folk seeds, evolved over centuries. At the same time, the village and the wider region is irreversibly changing with the coming of genetically modified cotton seeds and associated chemicals. \nSeed Stories takes a worm’s eye view of how this is reshaping a geography and a people steeped in agro-ecological knowledge, and altering their attitudes towards farming, food and ecology. It invites audiences to reflect on the question, ‘What is sustainability?’ \nCredits\nDirector & Camera: Chitrangada Choudhury\nAssociate Director: Aniket Aga\nEditor: Ajay TG\nSound: Asheesh Pandya\nColourist: Srikanth Kabothu \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/seed-stories/",
    "keywords": [
      "Agriculture",
      "Film",
      "Food"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Seed Stories"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-538.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "62034-1722708000-1722715200@bangaloreinternationalcentre.org",
    "name": "Mahatma Gandhi Vastrodyama",
    "startDate": "2024-08-03T18:00:00+05:30",
    "endDate": "2024-08-03T20:00:00+05:30",
    "description": "Recognising the potential of the handloom sector to provide sustainable employment and meet the growing demand for handloom fabric, the Government of Karnataka introduced ‘Mahatma Gandhi Vastrodyama’, a liaison between weaver co-operatives, producers, and the market, in last year’s budget. However, this project has not progressed beyond a few meetings and the initial proposal stage. Meanwhile, the past year has seen the condition of handloom weavers decline further, reaching a state of emergency. Without proper access to markets and design interventions, they are unable to realise the true value of their traditional skills. \nAs we face increasing natural disasters, periods of flood and drought, and the looming climate catastrophe, ecologically sustainable rural industries such as handlooms and khadi can provide sustainable employment opportunities without harming nature. On Handloom Day, we hope to rekindle this discussion and draw attention to this critical issue. \nPresented by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/mahatma-gandhi-vastrodyama/",
    "keywords": [
      "Culture*",
      "Design",
      "Development",
      "Heritage",
      "Society",
      "Sustainability",
      "Textiles"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-544.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "60749-1718409600-1722470399@bangaloreinternationalcentre.org",
    "name": "B·Lore (Season 3)",
    "startDate": "2024-06-15T05:30:00+05:30",
    "endDate": "2024-08-01T05:30:00+05:30",
    "description": "B•LORE is back with Season 3! \nCalling all Bengalureans – new and old – to share your city story. Whether you inhabit the Uru, the Pete, the Halli or the City, show us your Bengaluru. \nB•LORE is an Open Call from Bangalore International Centre (BIC) that wishes to document fresh crowd sourced perspectives about our city. We invite you to share an interesting 5-minute story about Bengaluru! B·LORE is an open call and grant initiative from the Bangalore International Centre (BIC) that aims to document fresh, crowd-sourced perspectives about our city. \nAn “open call” means this opportunity is open to participation from any individual or organisation interested in creating short films about Bengaluru. There are no restrictions on who can apply. \nThe “grant” component means that successful applicants whose films are selected will receive a financial award to support the creation and submission of their work. This grant or honorarium is intended to facilitate the documentation of diverse Bengaluru narratives. \nWe are seeking a range of diverse stories in short, audio-visual (AV) formats. Our goal is to create a collective memory of our city through your contributions to the B·LORE online archives. Submissions can be recorded using mobile phones or any other devices. \nPossible subjects for exploration include: culture (people, customs, language dialects, food, work), arts (visual, performing), innovation, citizen involvement, inspiring stories of change, history (formation, pre-independence, natural, industrial), heritage (of all kinds), and local personalities. This is a suggestive list, not exhaustive – we hope it sparks more novel ideas! \nApplication Deadline: 15 July 2024 \nSubmission Requirements: \n\nThe final outcome should be an AV film (mp4 video) related to Bengaluru, maximum 5 minutes including titles and credits.\nThe film can be in any language, but English subtitling of the entire film is mandatory.\n\nWe look forward to B·LORE submissions that demonstrate creativity, originality, interesting insights, and even humour. B·LORE will feature the selected films on its website/YouTube channel and amplify them across social media. \nA completed, accepted film is eligible for a ₹20,000 honorarium. \nApplication Process: \n\nIndividuals or organisations may submit multiple entries.\nYou can submit a completed film or a proposed draft (with or without a trailer).\nEntries must be shared through a URL link that allows viewing access. No other formats will be accepted.\nA 3-person jury will evaluate all proposals/submissions.\nApplicants will be informed of the status by July 31, 2024.\n\nRights and Grants: \n\nBIC reserves the right to accept or reject any application without providing reasons.\nIf a final submission is accepted, the applicant must provide a high-resolution file and a write-up about the film.\nThe applicant must confirm there are no copyright or third-party rights violations, and obtain necessary permissions.\nGrants are structured as follows:\n\n₹20,000 for a completed, accepted film\n₹5,000 for a shortlisted draft film with potential; remaining ₹15,000 upon completion and acceptance\n\n\nBIC has the right to use the final submission non-commercially, in perpetuity, across mediums, including under Creative Commons license.\nThe applicant retains original ownership rights and is free to transfer, license or use the submission as desired, without interfering with BIC’s rights.\n\nFor any questions, please email blore@bangaloreinternationalcentre.org with the subject “B·LORE Submission”. We look forward to your entries! \nApply Here! \n",
    "url": "https://bangaloreinternationalcentre.org/event/b%e2%80%a2lore-season-3/",
    "keywords": [
      "Bangalore",
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-533.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "61259-1722771000-1722776400@bangaloreinternationalcentre.org",
    "name": "India’s Southern Story",
    "startDate": "2024-08-04T11:30:00+05:30",
    "endDate": "2024-08-04T13:00:00+05:30",
    "description": "Make your way across south India, exploring its kaleidoscopic past and dazzling heritage, right from its first inhabitants up to the Vijayanagara Empire through Pradeep Chakravarthy’s book, A History of South India for Children \nSeparated from the north by the Vindhya mountains and surrounded on three sides by water, southern India developed its own unique features – with outstanding rulers, incredible literature, spellbinding architecture, stunning dance forms and delicious food. \nMeet its royalty and courtiers, builders and sculptors, poets and authors, traders and merchants, spiritual leaders and devotees, and all the other people who went to make it a top destination of the time. \nWritten in an easy style, by theme, and peppered with illustrations, photographs and tips for museum or monument visits, the book tells the thrilling and eventful story of the region’s proud past. \nIn this session, Pradeep Chakravarthy is in conversation with Vikram Sampath. A Q&A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/indias-southern-story/",
    "keywords": [
      "Books",
      "Culture*",
      "Heritage"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/POSTER_Thumbnail-copy-3-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "61886-1722018600-1722024000@bangaloreinternationalcentre.org",
    "name": "India's Paradox",
    "startDate": "2024-07-26T18:30:00+05:30",
    "endDate": "2024-07-26T20:00:00+05:30",
    "description": "In this talk, Professor Ashutosh Varshney, will delve into the paradoxes and complexities of India’s democratic journey. Drawing on his extensive research, he will explore India’s resilience as the world’s largest democracy and its challenges in maintaining liberal democratic norms. He will examine India’s democratic trajectory, highlighting the foundational choices made by political elites that have contributed to its stability since independence in 1947, contrasting India’s vibrant electoral democracy with the recent decline in democratic standards observed since 2014, marked by the erosion of civil liberties, minority rights, and checks on executive power. By comparing India’s experience with other democracies worldwide, particularly in the developing world, he will provide a comprehensive analysis using global indices and datasets such as V-Dem, offering insights into how India’s democratic credentials measure up globally. \nProfessor Varshney will also discuss the critical role of political elites and civil society in sustaining and undermining democratic governance. He will emphasise the importance of elite values and interests in shaping democratic trajectories and offer recommendations for reinforcing democratic norms and institutions in India. Strategies for reversing democratic backsliding, the significance of free and fair elections, a robust civil society, and the role of international support for democracy will be key points of discussion. This talk promises to offer profound insights and provoke thoughtful discussion on the state and future of democracy in India. \nThe talk will be followed by a Q&A session with the audience. \n",
    "url": "https://bangaloreinternationalcentre.org/event/indias-paradox/",
    "keywords": [
      "Development",
      "Governance",
      "Policy & Regulation",
      "Politics"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-540.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "62156-1721952000-1722038399@bangaloreinternationalcentre.org",
    "name": "324. “I Eat God, I Drink God”",
    "startDate": "2024-07-26T05:30:00+05:30",
    "endDate": "2024-07-27T05:30:00+05:30",
    "description": "Wild Women: Seekers, Protagonists and Goddesses in Sacred Indian Poetry [Penguin India, 2024], edited by poet and seeker Arundhathi Subramaniam, is a new anthology of compelling women mystics in Indian literature. \nThese poems are the cries of women who refused, quietly, and sometimes not so quietly, to be bullied into submission. Women who surrendered not to the authority of the world, but to the authority of the spirit. Women whose voices have far too often been sanitized by the grand narratives of religion and sidelined by rationalist versions of history. \nThe names of Mirabai, Akka Mahadevi, and Andal, are known to many. But there are innumerable others. And little is known of the urgency of their words, of their feral sensuality, of their relentless questioning of the custodians of gender and faith. It is time to re-fang them, to tune into their brazenness and heartbreaking longing. Not just for their sake, but for ours. \nIn this episode of BIC Talks, Author Arundhathi Subramaniam is in conversation with Poet & Translator, Mani Rao, with readings of translations by Mani Rao, Vanamala Viswanatha and Ahalya Ballal. This is an excerpt from a conversation that took place in the BIC premises in June 2024. \nSubscribe to the BIC Talks Podcast on your favorite podcast app! BIC Talks is available everywhere, including Apple Podcasts, Spotify, Google Podcasts, Castbox, Overcast, Audible and Amazon Music. \n",
    "url": "https://bangaloreinternationalcentre.org/event/324-i-eat-god-i-drink-god/",
    "keywords": [
      "Books",
      "Gender",
      "Literature",
      "Podcast",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/wildwomen.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "61792-1723055400-1723060800@bangaloreinternationalcentre.org",
    "name": "A Roadmap for Effective Governance",
    "startDate": "2024-08-07T18:30:00+05:30",
    "endDate": "2024-08-07T20:00:00+05:30",
    "description": "Seventy-five years after Independence, India has much to be proud of. We are both the world’s biggest democracy and the fastest-growing large economy. Yet, we also face profound challenges that hinder both individual well-being and aggregate growth, including education and skills, health and nutrition, public safety, justice, social protection, and jobs. \nDrawing from his highly-acclaimed book Accelerating India’s Development: A State-Led Roadmap for Effective Governance, Karthik Muralidharan will speak on the critical importance of investing in better governance and state capacity in achieving national development goals. \nThrough his analysis of India’s governance challenges, especially in delivering essential public services, he will highlight how these are limiting India’s development. Drawing on a wealth of research and practical insights, he will share actionable, evidence-based strategies, emphasizing state-level reforms as critical for India’s advancement. \nThe talk will offer insights into how effective public service delivery can drive economic growth and societal well-being, and offer practical, evidence-based strategies to accelerate India’s development, crucial event for policymakers, scholars, citizens, and anyone dedicated to fostering national progress and interested in the future of India’s development. \nThe talk by Prof. Karthik Muralidharan will be followed by a discussion with Manish Sabharwal, moderated by Pranay Kotasthane, and a Q&A session with the audience. \nIn collaboration with: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-roadmap-for-effective-governance/",
    "keywords": [
      "Development",
      "Economics",
      "Governance"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-541.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "61873-1722709800-1722715200@bangaloreinternationalcentre.org",
    "name": "Layam in Trinity Compositions",
    "startDate": "2024-08-03T18:30:00+05:30",
    "endDate": "2024-08-03T20:00:00+05:30",
    "description": "“Shruthi Maatha, Laya Pitah” is a famous saying where Shruthi and Layam are seen as two most important fundamentals of music. Layam is a basic rhythm that flows through any movement, expressed as Thaalam (beats). There is an implicit Layam and explicit Layam. The former is something that has to be realised for the latter to be grounded into one’s sensibilities and mind. \nMany music composers have explored this layam aspect of music, but the Trinity (Thyagarajaswamy , Muthuswamy Deekshitar and Shyama Saastrigal) stand out in this. Just like in Raagam, in Layam also they have many firsts. The basic framework of tala dasha pranas have also been used by them intelligently in their kritis. \nThis presentation will look at that basic framework of layam and how trinity made it shine even better, both intuitive and explicit. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/layam-in-trinity-compositions/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Layam in Trinity Compositions"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/POSTER_Thumbnail-5.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "62021-1722103200-1722113100@bangaloreinternationalcentre.org",
    "name": "Chilli Chicken",
    "startDate": "2024-07-27T18:00:00+05:30",
    "endDate": "2024-07-27T20:45:00+05:30",
    "description": "\n\nKannada, English, Manipuri with English Subtitles | 125 minutes | Suitable for 14+ years \nPrateek Prajosh’s debut feature as director, ‘Chilli Chicken’ is a thought-provoking Kannada film that attempts an authentic portrayal of Northeast Indian migrant workers navigating life in urban Bengaluru. \nFollowing the screening, the director and team will be in conversation with Laishram Romal Singh as they explore the film’s themes of identity, discrimination, and cultural integration. \nThis event is part of our ‘Meet the Maker’ series and will be an evening of cinema and conversation, shedding light on the often-overlooked experiences of migrant workers in India’s bustling cities. \nSynopsis \nFive migrant workers from the North East – Ajoy, Khaba, Jason, Jimpa and Ranjoy (Ajoy’s cousin) – find themselves in the heart of Bengaluru, working for Adarsh, a second-grade restaurant owner of ‘Noodle Home’, who aspires to open a fine dining restaurant, Noodle Palace, one day. \nHis ambitious yet delusional plans take a turn for the worse when his most promising employee, Ajay, dies under mysterious circumstances on the restaurant premises, leaving each one of the boys guilt-ridden, unsure of the events that transpired and uncertain of what the future holds. \nWith a suspicious Ranjoy keen on uncovering the mystery surrounding his cousin’s death and a cash-strapped Adarsh re-evaluating options to open his new restaurant, the rest are forced to fend for themselves and safeguard their own survival. How does Adarsh navigate through the tricky state of affairs while his boys combat racism, abuse and numerous other problems? \nAbout the Film \n\n\nIn “Chilli Chicken,” the narrative is deeply enriched by characters hailing from Assam and Manipur, bringing to the screen an authentic portrayal that delves into the cultural wealth and unique societal challenges faced by these communities in urban India. These Northeastern protagonists not only add layers of complexity to the story with their diverse backgrounds but also highlight pressing issues like racial discrimination and identity struggles. Central to the film’s plot and social critique, their individual and collective experiences offer a nuanced perspective that is as enlightening as it is engaging. Their representation in the film transcends mere entertainment; it educates and builds bridges, challenging entrenched stereotypes. By sharing their journey, “Chilli Chicken” becomes a potent vehicle for promoting understanding and inclusivity, and celebrates the stories of Assam and Manipur, fostering a richer cultural dialogue within the cinematic landscape. \nCredits: \nDirector: Prateek Prajosh\nWriter: KAS & Prateek Prajosh\nMusic director: Siddhanth Sundar \nCast:\nShrunga BV\nBijou Thaangjam\nRini\nNithyashri\nVictor Thoudam\nJimpa Bhutia \n",
    "url": "https://bangaloreinternationalcentre.org/event/chilli-chicken/",
    "keywords": [
      "Culture*",
      "Film"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "Chilli Chicken"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTERS.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "61177-1722366000-1722371400@bangaloreinternationalcentre.org",
    "name": "Sampradāya",
    "startDate": "2024-07-30T19:00:00+05:30",
    "endDate": "2024-07-30T20:30:00+05:30",
    "description": "In this presentation of Odissi, new and original as well as reimagined compositions inspired by the rich and vibrant cultural tradition of Odissi will be showcased. \nThe compositions are connected through a thread of blossoming, evolution, and joy. Each composition adds its own uniqueness and essence to the recital, elaborating on the universality of celebration in its own way. The performance celebrates divinity, art and sculptures, space, emotions, and the act of surrendering. Above all, it celebrates the rich Sampradāya of Odissi. \nThe presentation will also be supported by audio-visuals and archival recordings. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sampradaya/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-534.jpg"
  }
]