[
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "83426-1768330800-1768336200@bangaloreinternationalcentre.org",
    "name": "Wind, Wood and Wire",
    "startDate": "2026-01-13T19:00:00+05:30",
    "endDate": "2026-01-13T20:30:00+05:30",
    "description": "A jugalbandi for the new age! \nThis Hindustani concert brings together three musicians whose journeys converge at the frontier that is Indo-jazz. Saxophonist Phill Scarff, long associated with cross-cultural explorations, meets Bengaluru-based slide guitarist Dr. Prakash Sontakke, whose fluid phrasing draws from Hindustani grammar while remaining open to contemporary sound worlds. Tabla maestro Gurumurthy Vaidya completes the trio, grounding the dialogue with rhythmic depth and supple responsiveness. \nWhat unfolds is a conversation through improvisation. The saxophone’s burnished tone, the gliding resonance of the slide guitar, and the intricate play of taal move between structure and freedom, tradition and risk. Rooted in classical sensibility yet shaped by jazz’s openness, the music charts a shared space where genres blur, listening deepens, and new possibilities quietly emerge. \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/wind-wood-and-wire/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Wind, Wood and Wire"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-81-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "83678-1768503600-1768509000@bangaloreinternationalcentre.org",
    "name": "Monkey See, Monkey Do, Seetha Says Boo",
    "startDate": "2026-01-15T19:00:00+05:30",
    "endDate": "2026-01-15T20:30:00+05:30",
    "description": "Humour and elegance share the stage!  \nLakshmi Girish and Parvathi Jayaram, a newly formed duo, explore a classical form through a modern lens. Inspired by the Subhashitha Ratnabhandagaram, this performance offers a satirical retelling of an encounter between two mischievous monkey wives and Seetha, reframing an epic moment through humour and surprise.  \nThis evening showcases a rarely explored comic register of Mohiniyattam: hasyam. Synonymous with grace and lyricism, Mohiniyattam here is choreographed with a refreshing perspective. Live music featuring mizhavu, vocals, edakka, and flute deepens the rhythmic and narrative play.  \nMusicians:\nMizhavu (Kerala’s ancient drum) – Kalamandalam Ratheesh Bhas (Kerala,India)\nEdakka – Kalamandalam Sarod Kumar (Kerala, India)\nFlute – Rakesh Dath (Bangalore, India)\nLive carnatic vocals – Harshitha Vidya (Bangalore, India)\nNattuvangam – Vinaya Narayanan (Bangalore, India) \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/monkey-see-monkey-do-seetha-says-boo/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_MSMD2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "83687-1768415400-1768420800@bangaloreinternationalcentre.org",
    "name": "Sidis of Gujarat",
    "startDate": "2026-01-14T18:30:00+05:30",
    "endDate": "2026-01-14T20:00:00+05:30",
    "description": "Hidden within Gujarat’s landscape is the living memory of the malunga: a sacred musical bow of the African-Indian Sidi community, whose sound carries histories of migration, faith, and resilience. This event opens a rare window into a niche cultural world in India, where music is not performance alone, but inheritance. Through documentary and dialogue, it introduces the Sidis as Sufi Muslims of the Rifa’i tariqa, rooted in the spiritual lineage of Bava Gor, the fourteenth-century saint from Nubia who journey and settled in India. \nThe evening begins with a screening of The Sidi Malunga Project: Rejuvenating the African Musical Bow in India (2002), by Amy Catlin-Jairazbhoy and Nazir Ali Jairazbhoy: a film that documents not only the malunga’s near-disappearance, but also captures the extraordinary moment of revival that brought elders and youth together to ensure its survival. The screening is followed by a presentation of the newly formed Sidi Culture and Heritage Trust, outlining ongoing efforts to sustain Sidi musical, spiritual, and cultural life. \n\n\n\n\n\n\n\n\nA rare window into a living, resilient culture: a musical world few know, but many will remember. \n\n\n\n\n\n\n\n\n",
    "url": "https://bangaloreinternationalcentre.org/event/sidis-of-gujarat/",
    "keywords": [
      "Anthropology",
      "Culture",
      "Film",
      "Heritage",
      "Music"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-77-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "83667-1768417200-1768422600@bangaloreinternationalcentre.org",
    "name": "Tapestry of Traditions",
    "startDate": "2026-01-14T19:00:00+05:30",
    "endDate": "2026-01-14T20:30:00+05:30",
    "description": "A simple, resonant idea turned into an immersive, evocative performance. \nLed by vocalist Samarth Nagarkar, this programme looks at khayal as a tradition shaped by centuries of dialogue through devotional song, folk expression, courtly aesthetics, and theatrical imagination. Light, space, and sound work together to draw listeners into the unfolding emotional landscape of the raag. \nMusic endures not by remaining closed, but by absorbing, listening, and transforming. This evening’s performance is a true testament to the trends that have become tradition. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/tapestry-of-traditions/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Tapestry of Traditions"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_ToT-1-1.jpg"
  }
]