[
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "65471-1730314800-1730321100@bangaloreinternationalcentre.org",
    "name": "Ditty",
    "startDate": "2024-10-30T19:00:00+05:30",
    "endDate": "2024-10-30T20:45:00+05:30",
    "description": "Ditty is an Indian singer songwriter based in Berlin, Germany. Trained in architecture and ecology, she writes songs inspired by the natural world. \nIn 2019, she released her first album called Poetry Ceylon that spoke about her life on the island of Sri Lanka and her relationships with birds, trees, the ocean, the forests and herself. \nSoon after, she created India’s first carbon neutral tour, Make Forests Not War. This tour was aimed to be carbon neutral, post which she planted a local, indigenous food forest with the help of local environmentalists in Goa. The singer-songwriter traveled by train to 9 cities across the country, singing earth-songs in gardens. She collaborated with local environmentalists to start important conversations around climate change, sacred ecology, communal regeneration and transformation \nThe programme will begin with a screening of Ditty’s documentary film Make Forests Not War, followed by a conversation on all things musical and ecological. She will then be sharing songs– both old and new! \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/ditty/",
    "keywords": [
      "Environment",
      "Music",
      "Performing Arts",
      "Sustainability"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Ditty"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-631.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "64885-1730631600-1730638800@bangaloreinternationalcentre.org",
    "name": "ಬರ | Bara",
    "startDate": "2024-11-03T11:00:00+05:30",
    "endDate": "2024-11-03T13:00:00+05:30",
    "description": "Kannada (with English Subtitles) | 1982 | 118 minutes \nAs citizens of a drought hit district struggle to deal with the situation compounded by political and systemic apathy, a young collector decides to save the city and expose the truth about a corrupt landlord involved in the crisis. \nThis month’s film featured in our informal film club is Bara: The Arid Earth (1982) \nBara, a Kannada-language film is directed by M. S. Sathyu and was released in 1982. The film is based on the novella by U. R. Ananthamurthy and focuses on the political and social issues surrounding a drought-stricken district in rural India. \nThe story follows a district collector, played by Anant Nag, as he confronts the challenges of managing the crisis while dealing with political pressures and bureaucratic obstacles. The film raises important questions about governance, caste, and the role of individuals in positions of authority. \nDirected by M. S. Sathyu, Bara highlights the complexities of rural life and administration in India. With performances by Anant Nag, C. R. Simha, and Somu, the film remains a relevant exploration of the intersection between politics and society. \nCredits: \nBased on the novella by U R Ananthamurthy \nDirector: MS Sathyu \nWriters: Shama Zaidi and Javed Siddiqui \nCinematography: Ashok Gunjal \nEditor: S Chakravarthy \nArt Director: Bijon Das Gupta \nCast: Anant Nag, C. R. Simha, Uma Shivakumar, Loveleen Madhu, Veeraj Byakod, Shivaram, Nitin Sethi, M. V. Narayana Rao, Pankaj Dheer, Vaijanath Biradar \n\nAbout B•Cinematic \n\nCalling all cinephiles! BIC is thrilled to present B•Cinematic, an initiative dedicated to celebrating the most essential, impactful, and artistically significant cinematic works from across the state and the country. \nAt B•Cinematic, our mission is to curate and share those remarkable films that is a must-watch (or re-watch) experience for every passionate cinema lover. From groundbreaking classics to under-appreciated gems, our carefully curated selection will take you on an unparalleled (pun not intended) cinematic journey through the ages. \nThrough curated screenings, insightful discussions, and engaging analyses from distinguished cinematic voices, we aim to not only watch these films together but to truly appreciate their craftsmanship, cultural impact, and intellectual depth. Our vibrant community of film aficionados will collectively rediscover Indian cinema’s most stunning and enduring masterpieces. \nSo join us on this quest to experience the films that have defined and redefined the art form. Don’t miss out on crossing these essential works off your bucket list. Because to truly live, you must first watch the films that make life worth living. \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%ac%e0%b2%b0-bara/",
    "keywords": [
      "Film",
      "Society"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "ಬರ | Bara"
    },
    "subtitleLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Untitled-design-9-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65627-1730568600-1730574000@bangaloreinternationalcentre.org",
    "name": "Books aur Baatein",
    "startDate": "2024-11-02T17:30:00+05:30",
    "endDate": "2024-11-02T19:00:00+05:30",
    "description": "Join us for Books aur Baatein – an intimate gathering at the BIC Library where stories come alive through thoughtful discussion and warm conversation. Each month, we’ll share selected short works of fiction and non-fiction in advance, allowing participants to read and reflect before we meet. We’ll dive deep into these carefully chosen texts, exploring themes, sharing perspectives, and discovering new insights together. \nTo ensure rich and meaningful discussions, we encourage you to read the selected material beforehand – it’s a small commitment that greatly enhances our collective experience. Our aim is to build connections through literature, one thoughtful conversation at a time. \nFiction : Cat Person by Kristen Roupenian (around 7,000 words)\nPublished in The New Yorker in 2017, this story about modern dating went viral and sparked intense online discussions. It follows a college student’s brief relationship with an older man, exploring modern dating, texting culture, and the complexities of human connection in the digital age. \nNon-fiction companion : What It Felt Like When ‘Cat Person’ Went Viral by Kristen Roupenian\nThis reflection piece discusses how the story unexpectedly became a cultural phenomenon and sparked discussions about dating, consent, and gender dynamics in the social media era. \n",
    "url": "https://bangaloreinternationalcentre.org/event/books-aur-baatein/",
    "keywords": [
      "Books",
      "Language",
      "Literature"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-51.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64979-1732042800-1732048200@bangaloreinternationalcentre.org",
    "name": "Akhyāt - Ākhyānā ",
    "startDate": "2024-11-19T19:00:00+05:30",
    "endDate": "2024-11-19T20:30:00+05:30",
    "description": "Words of inspiration from India’s first female teacher…  \nWritings of unabashed desire from the heart of Tamizh land…  \nQuestions of existentialism asked by Buddhist nuns…  \nProse that interrogates anthropocentrism… \nVerses that subvert gender roles and patriarchy…  \n…and more insight into the female perspective of desire, denouncement, faith and activism. Only this time, through poetry authored by women themselves! \nAkhyāt – Ākhyānā is an experiential exploration of rare multilingual poetry tactfully woven into a Bharatanatyam repertoire performed along with live musicians. This work stems from Divya’s diverse encounters with heart-wrenching poetic expressions of women from across timelines and geographies, in a quest to unearth narratives ‘by’, ‘for’ and ‘of’ women. \nCast:\nDance | Choreography | Script – Divya Ravi\nMusic composition | Vocals – Sharan Subramanian\nNattuvangam – DV Prasanna Kumar\nMridangam – Srihari Rangaswamy\nFlute – Vivek Krishna \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/akhyat-akhyana/",
    "keywords": [
      "Dance",
      "Performing Arts",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-629.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "65377-1730142000-1730146500@bangaloreinternationalcentre.org",
    "name": "The Magic of Sound",
    "startDate": "2024-10-28T19:00:00+05:30",
    "endDate": "2024-10-28T20:15:00+05:30",
    "description": "Music is the most delicate and precise way to improve your well-being. Through music, we can look inside ourselves, at our desires, and our true feelings. In today’s fast-paced world, where we need to act quickly and decisively, there is often no time for feelings, for awareness, and for experiencing our accumulated emotions. ‘The Magic of Sound’ will be your gentle guide into the spiritual world. You will find inspiration, escape the ordinary, and fill yourself with beauty. For a deeper immersion, in addition to the sound component, a visual sequence corresponding to the mood of the piece will be presented. The action will take place in almost complete darkness, creating a trusting atmosphere of a warm evening. Having experienced ‘The Magic of Sound’, you will acquire a new energy shell that will envelop you in its magical warmth and light. \n \nSupported by: \n   \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-magic-of-sound/",
    "keywords": [
      "Music",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "The Magic of Sound"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "65005-1731092400-1731097800@bangaloreinternationalcentre.org",
    "name": "The End",
    "startDate": "2024-11-08T19:00:00+05:30",
    "endDate": "2024-11-08T20:30:00+05:30",
    "description": "90 mins | English & Hindi \nA college romance slowly takes a turn for something complicated and traumatic. \nA young live-in couple begins to realize that maybe love isn’t all that you need\nto build a home with someone. \nDoubt, deceit, and the past come to haunt a marriage that is struggling to survive. \nAn anthology of 3 stories about 3 couples, ‘The End’ uses text, movement, music, and memory to understand what we look for in romance and relationships when the odds are stacked against us, when love starts making way for loss, and questions about desire and the need for control start popping up. How does one unlearn societal norms and expectations to build relationships that are authentic, nurturing, and filled with love still? \nWe meet these 3 couples near what they think is the end of their (love) stories. \nBut is it, really, The End? \nCredits: \nDesign & Direction: Nikhita Singh \nWriters: Nikhita Singh, Mitali Kalagi, Sambita De \nCast: Mitali Kalagi, Rituparna Sanyal, Kaustav Sinha, Aditya Kashyap \nMovement Director: Babusha Jain \nMusic: Hashparker (Harsh Choudhary) \nLyrics & Poetry: Madhumoy Satpathy \nAssistant Director: Rituparna Sanyal \nProduction Manager & Photographer: Divyansh Thada \nProduction Assistant: Sambita De \nCostume Design: Simran Jagdale \nSet Design: Nikhita Singh, Rituparna Sanyal, Vivek Jadhav \nLight Design: Nikhita Singh, Rahul Kumar \nPoster Design: Vighnesh Kharadkar, Debosmita Mazumdar \nSocial Media Design: Tanya Vaghela \nSocial Media Planning & Strategy: Divya Sundrani \nMarketing & Publicity: Dheeraj Dubey \nCreative Director for Visual Promos: Omkar Phatak \nOutreach & Brand Advocacy Partner: Centre for Contemporary Folklore \nSupported by Tamaasha Studio Foundation’s UsPaar Residency. \n  \nThis is a BIC Elsewhere Event. \nWhile the majority of our events find a home at our premises in Domlur, BIC Elsewhere represents our commitment to bringing conversations, arts, and culture directly to diverse audiences. Through this initiative, we collaborate with various venues, extending the reach of our events beyond our own space. These partnerships not only breathe life into our gatherings but also play a crucial role in cultivating an environment for the flourishing of arts and culture in the city. \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/the-end/",
    "keywords": [
      "Performing Arts",
      "Theatre"
    ],
    "location": {
      "@type": "Place",
      "name": "Shoonya Center for the Art and Somatic Practices, 4th Floor, B Block, Brahmananda Court, 37, Lal Bagh Main Rd, K.S. Garden, Raja Ram Mohanroy Extension, Sudhama Nagar,, Bengaluru, Karnataka, 560027, India"
    },
    "inLanguage": "hi",
    "workPerformed": {
      "@type": "TheaterPlay",
      "name": "The End"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-625.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65637-1730545200-1730550600@bangaloreinternationalcentre.org",
    "name": "A World of Wonders",
    "startDate": "2024-11-02T11:00:00+05:30",
    "endDate": "2024-11-02T12:30:00+05:30",
    "description": "Step into a world where stories sparkle as brightly as festive lights! \nJoin us for a reading journey that spans across cultures and traditions, uncovering the heartwarming legends behind some of the world’s most beloved festivals. From the joyous colors of Holi to the quiet glow of Christmas lights, each tale reveals the spirit of celebration that connects us all. \nGet ready for an afternoon of wonder, wisdom, and a few surprises along the way! \nIn collaboration with:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/a-world-of-wonders/",
    "keywords": [
      "Books",
      "Young BIC"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-52.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65337-1730919600-1730925000@bangaloreinternationalcentre.org",
    "name": "Musings in Mohiniyattam",
    "startDate": "2024-11-06T19:00:00+05:30",
    "endDate": "2024-11-06T20:30:00+05:30",
    "description": "Vijayalakshmi will present a unique programme, comprising items that are both traditional and very innovative and singular. They will exemplify and underline the quintessential spirit and technique of Mohiniyattam and have been specially selected, to offer a pan-Indian experience of the dance form to the audience. Be it a “traditional’’ pan-Indian piece from the revered Jayadeva’s Gitagovinda, or a piece inspired by the traditional North Indian chaupai, or an excerpt from her Indo-American work called Rain, or from the soundtrack of Beyond Grace, a documentary feature film about her Guru-mother and her, by LA based film makers. \nHer diverse repertoire truly reflects her pan-Indian and global perspective towards Mohiniyattam, besides also highlighting the inherent richness of Mohiniyattam’s vocabulary, which lends itself with equal ease to both traditional and multicultural/world music. The presentation underlines the dance form’s immense versatility and the diverse multicultural influences that have shaped Vijayalakshmi, the artist and the person. Besides her own multi-dimensional forms of creative expression and her unique collaborations and inspirations both in India and abroad. \nThe session will conclude with a brief Q&A, moderated by Masoom Parmar, who is a Bangalore based artist, curator and arts manager. \nIn collaboration with: \n \n  \nSupported by: \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/musings-in-mohiniyattam/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-24.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65225-1730631600-1730637000@bangaloreinternationalcentre.org",
    "name": "Body and Breath: Our Sacred Spaces",
    "startDate": "2024-11-03T11:00:00+05:30",
    "endDate": "2024-11-03T12:30:00+05:30",
    "description": "Degula | Shreema Upadhya | 35 mins \nThe human form is considered sacred across civilizations and religions. Scriptures describe its sanctity and godliness; the significance its protection holds. Just as a shrine constructed with symbolism and care houses the deity, so does the body act as a vessel for our soul. This parallel also manifests itself in the Indian temple, whose structure appears to mirror the human anatomy, in both the physical and metaphysical sense. \nWhy then do we abuse this body, hate it, neglect it, and constantly attempt to alter it to fit into an external mold that it was never meant to conform to? We journey thus through the length of our very being to where the worshipped resides, with an exploration of the body through culture and time to celebrate the beauty of the imperfectly unique over the ideal, the purpose behind the periphery. \nBreath | Deepali Salil, Sayani Chakraborty | 45 mins \n“Breath is our maadhyam, a conduit for our emotional well being and a spiritual gateway. Living in the breath allows us to experience our present and our body completely. It allows healing. \nHave you noticed that emotions and thoughts disturb the rhythm of your breath, leaving it shallow, or reluctant at the bottom of an exhale or top of an inhale? When left unchecked, these thoughts and emotions calcifies into repeated, reactive responses. Meditating and /or regulating our breath opens our awareness, breaking the chain reaction of emotional and thought elaboration. We can recognize that our incessant breath is always informing us of our inner world, while simultaneously providing us with the solutions to disturbances in our emotions, thoughts, and physical wellbeing. \nThis incessant breath dances within me and I seek that breath while I dance, and when I dance there are two dancers, one me and one Shiva. When Shiva gradually merges into me and two dancers become one. I become a manifestation of his Ananda Tandava, where everything that moves in this universe is a beautiful dance. \nHe dances, the world dances, I dance and we all become one.” \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/body-and-breath-our-sacred-spaces/",
    "keywords": [
      "Dance",
      "Performing Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-630.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "65142-1731110400-1731196799@bangaloreinternationalcentre.org",
    "name": "ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ | Krishna to Kaveri",
    "startDate": "2024-11-09T05:30:00+05:30",
    "endDate": "2024-11-10T05:30:00+05:30",
    "description": "Journey through the heart of Karnataka as we explore the vibrant tapestry of cultures and languages that define this diverse state. Our festival, “Krishna to Kaveri,” draws inspiration from the mighty rivers that cradle Karnataka’s landscapes, communities, and experiences. \nJust as the Krishna and Kaveri rivers traverse geographies, our festival aims to bridge the myriad cultures and languages of Karnataka. These life-giving waters serve as a powerful metaphor for the state’s expansive terrain, rich diversity, and syncretic nature. \nTaking our cue from the rejuvenating powers of these sacred rivers, our event curation focuses on revival and revitalisation. We aim to breathe new life into traditional art forms, customs, and practices, ensuring their relevance in contemporary times. \nJoin us for two days of immersive experiences as we celebrate the essence of Karnataka – a land where cultures converge and flourish, much like the rivers that shape its identity. \nPresented by Azim Premji University in collaboration with Bangalore International Centre \nSchedule: \nDay 1 | Saturday, November 9 \n10:00 am | Ground Floor Foyer \nWelcome \n11:00 am | Auditorium \nSangeeta Ganga Kaveri \nA lecture-demonstration by Dr. Nagarajrao Havaldar on the history and evolution of Hindustani music in Karnataka \n11:30 am | Seminar Halls \nUnited by Language: The Story of How Karnataka was Born \n12:00 noon | Library \nWorkshop on Chittara \nThe Chittara Mural artform, established by the Deevaru Community, is a traditional phenomenon that involves intricate stories and geometric patterns. Geetha Bhat will lead a workshop where participants can engage in learning the basics of the art form and interact with the artists while learning about its 500 year old history and cultural significance. \n12:30 pm | Amphitheatre \nRangageethe \nA sharing session of songs that have emerged from the ear of musical theatre in Karnataka over many decades. \n2:00 pm | Auditorium \nAdbhuta Ramayana  \nA Leather Shadow Puppet Performance by Gombe Mane, Dharwad \n3:00 pm | Library \nWorkshop on Kasuti \nA lecture demonstration on the intricate form of traditional folk embroidery originating in Dharwad round the 7th Century CE. It is one of India’s most famous handicrafts and is protected by the Geographical Indication (GI) tag. \n4:00 pm | Seminar Halls \nಮಲೆನಾಡಿನ ಹುಲಿ, ಚಿರತೆಗಳ ಜಾಡಿನಲ್ಲಿ | Malenad: Bringing Big Cats Back from the Brink \nA talk by Dr. Ullas Karanth on the necessary framework necessary to balance nature protection with development. \nಡಾ. ಉಲ್ಲಾಸ್ ಕಾರಂತ್ ಅವರಿಂದ ಪ್ರಕೃತಿ ಸಂರಕ್ಷಣೆ ಮತ್ತು ಅಭಿವೃದ್ಧಿಯ ನಡುವೆ ಸಮತೋಲನ ಸಾಧಿಸಲು ಅಗತ್ಯವಿರುವ ಚೌಕಟ್ಟಿನ ಕುರಿತು ಉಪನ್ಯಾಸ \n4:30 pm | Amphitheatre \nDollu Kunitha \nA performance of the traditional form dance form of Dollu Kunitha accompanied by percussion but with a twist. \n6:00 pm | Seminar Halls \nThe Past, Future and Present of Sports in Karnataka \nA panel of eminent sportspersons – Aditi Ashok, ⁠Shreyanka Patil, ⁠Dhinidhi Desinghu, ⁠Avani Prashant and Rakshitha Raju share their experiences while reflecting on the larger picture of history of sporting and era defining sports personalities that have emerged from Karnataka. \n7:00 pm | Auditorium \nA Trifecta of Folk Dance Forms \nAn Evening of folk performances in collaboration with Sangamam \nFor Day 2 | Sunday, November 10 Click Here \nOngoing Throughout the Festival \n10:00 am to 8:00 pm \nExhibition | Through the Building \nKarnataka Vaibhava: Treasures & Turning Points \nಕರ್ನಾಟಕ ವೈಭವ: ಸಂಪತ್ತು ಮತ್ತು ಸಂದಿಗ್ಧ ಕ್ಷಣಗಳು \nIn collaboration with Shashidhar Adapa \nFood Festival | Terrace \nರುಚಿಗಳ ಜಾತ್ರೆ | Flavour Fair \nAnchored by Coracle with Chef Tresa \nExperiential Interactions with Artisans | Ground Floor Foyer \nಕರಕುಶಲತೆಯ ಕೈಪಿಡಿ | Hand in Hand \nಕುಶಲಕರ್ಮಿಗಳ ಮಾರ್ಗದರ್ಶನದಲ್ಲಿ | Guided by Master Artisans \n  \n  \n",
    "url": "https://bangaloreinternationalcentre.org/event/%e0%b2%95%e0%b3%83%e0%b2%b7%e0%b3%8d%e0%b2%a3%e0%b3%86%e0%b2%af%e0%b2%bf%e0%b2%82%e0%b2%a6-%e0%b2%95%e0%b2%be%e0%b2%b5%e0%b3%87%e0%b2%b0%e0%b2%bf%e0%b2%b5%e0%b2%b0%e0%b3%86%e0%b2%97%e0%b3%86-krishna/",
    "keywords": [
      "Culture",
      "Krishna to Kaveri",
      "Language",
      "Music",
      "Performing Arts",
      "Theatre",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "ಕೃಷ್ಣೆಯಿಂದ ಕಾವೇರಿವರೆಗೆ | Krishna to Kaveri"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-5_POSTER.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "65574-1730457000-1730664000@bangaloreinternationalcentre.org",
    "name": "Mirrors",
    "startDate": "2024-11-01T10:30:00+05:30",
    "endDate": "2024-11-03T20:00:00+05:30",
    "description": "Mirrors is a creative fellowship encouraging an artistic exploration of masculinities. The inspiration for the fellowship emerged from ‘(De)constructions of Masculinities’, a research study which undertook a critical review of approaches to programming on masculinity within the development sector. \nThe reflections and challenges shared by various civil society organizations/ unions around masculinity made us feel that there was a need for a more expansive understanding of masculinity, which needs to move beyond merely, reforming the behaviours of boys and men. To this end, we invited 12 individuals from different parts of the country to produce daily ethnographies on how they perceive masculinity in and around them. Given the diversity of social locations, their writings reveal the way in which masculinity is shaped by social differences of caste, gender, sexuality, religion, class and so on. The study made us realise that we have only scratched the surface when it comes to engaging with the vast, often messy terrain, of what constitutes masculinity and femininity. \nWe believe artistic practice can offer a way of expressing the silences, frictions, contradictions, suppressions and desires that shape this experience. We put out an open call for applications and received an overwhelming response, across geographies, language, and socio-economic locations. The works you see featured are by the 12 fellows who were selected under the fellowship. \nIn collaboration with \n \n",
    "url": "https://bangaloreinternationalcentre.org/event/mirrors/",
    "keywords": [
      "Gender",
      "Society",
      "Visual Arts"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-53.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "64969-1730052000-1730057400@bangaloreinternationalcentre.org",
    "name": "Sound of Streets",
    "startDate": "2024-10-27T18:00:00+05:30",
    "endDate": "2024-10-27T19:30:00+05:30",
    "description": "Teesta Troupers are a collective of musicians, rappers and songwriters that came to life in 2022 in a jam room below a garage on the Teesta highway, set up as a part of the research methodology in the Arts Research project Water Cuts Stone by Veecheet Vigya Dhakal. \nTheir music draws from their experience of growing up along the highway and reflects the hustle, melancholy and dreams of young people from their hometown. They released their debut album Sound of Streets in April 2024. This performance draws an amorphous portrait of the Teesta highway line, capturing the rhythm of life and work along the highway. \nLanguage: Nepali | English \nThis event is in collaboration with India Foundation for the Arts (IFA), as part of their festival Past Forward: The Pleasure, Purpose and Practice of Arts Research, that celebrates the work of over 70 artists in the last 10 years of their Arts Research programme.\n \nSupported by:\n \n",
    "url": "https://bangaloreinternationalcentre.org/event/sound-of-streets/",
    "keywords": [
      "Music",
      "Performing Arts",
      "Poetry"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "ne",
    "workPerformed": {
      "@type": "CreativeWork",
      "name": "Sound of Streets"
    },
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-23.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "64974-1730917800-1730923200@bangaloreinternationalcentre.org",
    "name": "Thriving with AI",
    "startDate": "2024-11-06T18:30:00+05:30",
    "endDate": "2024-11-06T20:00:00+05:30",
    "description": "Ravi Bapna and Anindya Ghose, in their new MIT Press book Thrive: Maximizing Well-being in the Age of AI take on the challenge of demystifying AI for the layperson using examples from everyday life. Their hope is that by giving citizens agency and understanding in shaping AI we can get the most out of this newest industrial revolution. \nJoin Ravi Bapna in conversation with Narayan Ramachandran as they chart their way through the ‘House of AI,’ a framework that provides a holistic perspective of the different pillars and layers of AI. They will discuss the role of generative AI versus traditional AI, what barriers companies face in adopting this technology, how we should think about the future of work and reskilling the workforce, and what an agentic future looks like where AI will augment human intelligence and capacity. \nA Q & A with the audience will follow. \n",
    "url": "https://bangaloreinternationalcentre.org/event/thriving-with-ai/",
    "keywords": [
      "Society",
      "Technology"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-626.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "65538-1730226600-1730232000@bangaloreinternationalcentre.org",
    "name": "Sincerely Yours",
    "startDate": "2024-10-29T18:30:00+05:30",
    "endDate": "2024-10-29T20:00:00+05:30",
    "description": "Remember the last time you got a real letter in the mail? Not a bill or a flyer, but an actual honest-to-goodness letter? Let’s bring that magic back! \nJoin us for a cozy 90-minute gathering where we’ll trade our screens for paper and rediscover the joy of writing letters. Never written a proper letter? Worried about your handwriting? Perfect! This is for you too. We’ll have prompts for everyone – from “Dear Future Me” to “Dear Swiggy Delivery Man” (why not?). \nWhat’s in store?\n• Fun writing prompts that’ll get your creativity flowing\n• A chance to write that letter you’ve been meaning to send forever\n• Zero pressure, zero judgment\n• Maybe even make a few friends who also love the lost art of letter writing \nBring yourself and your stories. We’ll provide everything else – paper, pens, envelopes, and enough inspiration to fill a mailbag. Come write with us! \nP.S. Your future self/ mom/ best friend/ pet fish will thank you for coming! \n",
    "url": "https://bangaloreinternationalcentre.org/event/sincerely-yours/",
    "keywords": [
      "Language",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "inLanguage": "en",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-50.png"
  }
]