[
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Tales of Tenacity",
    "startDate": "2024-03-31T11:00:00+05:30",
    "endDate": "2024-03-31T12:30:00+05:30",
    "description": "Enter an enchanting world of storytelling with Devanshi Joshi, author of Young Hearts, Wise Minds who will share stories inspired by real people and their life journeys. \nThrough fun activities and engaging tales, Devanshi will help young participants explore the meaning behind stories and how it relates to their life. \nThis event is a part of BIC’s Programmes at the Library. \nBIC Library Programmes are designed to mould the library into a community-centered reading space. Our primary goal is to curate sessions that cater to the diverse interests and ages within our library community. Through this programming we wish for the library to become a dynamic space that goes beyond traditional book-related activities. \nWe also aim to provide a platform for members of the community to sometimes host these events we curate. If you have event ideas that align with our vision, please reach out to us at collab@bangaloreinternationalcentre.org \nIn Collaboration with:\n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/tales-of-tenacity/",
    "keywords": "Books, Young BIC",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-401.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Orange Butterflies and Aqua Sequins",
    "startDate": "2024-03-23T19:00:00+05:30",
    "endDate": "2024-03-23T20:30:00+05:30",
    "description": "Date: March 23 | Saturday\nTime: 7pm – 8:30pm\nVenue: Indian Music Experience Museum (IME) \nWeaving a colourful tapestry of women’s voices across time, cultures and languages, the evening will string together diverse poems from Noor Jahan Sarvat to Kobita Sinha, from Ntozake Shange to Bahinabai Chowdhari, from Soyrabai  to Arundhathi Subramaniam. Poems that tease and prod, poems that churn and swirl, poems that occupy space and celebrate reams and desires, faith and faithlessness. \nThis is a BIC Elsewhere Event. \nWhile the majority of our events find a home at our premises in Domlur, BIC Elsewhere represents our commitment to bringing conversations, arts, and culture directly to diverse audiences. Through this initiative, we collaborate with various venues, extending the reach of our events beyond our own space. These partnerships not only breathe life into our gatherings but also play a crucial role in cultivating an environment for the flourishing of arts and culture in the city. \nIn collaboration with:\n     \n",
    "location": {
      "@type": "Place",
      "name": "Indian Music Experience Museum (IME), Brigade Millennium Avenue, JP Nagar 7th phase, Bengaluru, Karnataka, 560078, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/orange-butterflies-and-aqua-sequins/",
    "keywords": "Dance, Gender, Performing Arts, Poetry, Theatre",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/ThumbnailIME_BE.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Glass House Festival of Poetry",
    "startDate": "2024-03-23T10:00:00+05:30",
    "endDate": "2024-03-24T18:00:00+05:30",
    "description": "The Glass House Festival of Poetry is celebrating the theme of Planet, Prosperity, People and Peace in this edition, bringing together eighty-six poets and speakers in person, with twenty-five poets joining us online from outside India. The Festival is responding to the current heat-haze of violence, with this edition’s theme and selected poets / speakers. \nThis edition of Glass House Festival includes panels of poets responding to current issues, reading their work, ekphrastic poetry with Art and Poetry on Film, workshops to participate in, panel discussions, lectures, performances, Awards, book-signings and pop-up stalls. \nThe Glass House Festival of Poetry was first held in 2020 responding to the zeitgeist of isolation in COVID, by coming together to celebrate differences and to centre the margins. And we are turning to holding the next iteration of the Glass House Festival as succour and soul food. \nDon’t miss out on this unique opportunity to experience the transformative power of poetry firsthand. Come and be a part of this extraordinary celebration of art, culture, and the human spirit at the Glass House Festival of Poetry! \n  \nSchedule \nDay 1 | Mar 23 | Saturday \n10:00 am – 10:15 am: Inauguration (Hall 1) \n10:15 am – 10:30 am: Silence No Bar | Vikram the Silent Poet (Hall 1) \n10:30 am – 11:30 am: Dignity of Bone | Canon in a Time of Accessibility (Hall 1)\nSpeakers: Ashwani Kumar, Amit Ranjan, Siddharth Dasgupta, Somrita Urni Ganguly \n11:30 am – 12:15 pm: Plan of the Heart | Hindi and Urdu Poetry (Hall 1)\nSpeakers: Khaleel Mamoon, Kamal K Rajput, Dr. Prem Tanmay \n11:30 am – 12:15 pm: Kaa Kaa Koo | Poetry by Children for Children (Gallery)\nPerformers: John Devaraj & Group \n12:15 pm – 1:00 pm: Fire in the Rain | Poetry and Culture Building (Hall 1)\nSpeakers: Gopikrishnan Kottoor, Gayatri Majumdar, Yumna Hari Singh \n12:15 pm – 12:45 pm: Storytelling Session | 8- 13 Years (Gallery)\nFacilitator: Ramendra Kumar \n2:00 pm – 3:00 pm: Returning in a Hundred Shapes | Spirituality as the Key to Peace (Hall 1)\nSpeakers: Sabari Roy, Rajorshi Patranabis, Somali Panda, Bhawna Vij Arora, Jagari Mukherjee \n3:00 pm – 4:00 pm: Pocketful of Seeds | Poetry Readings (Hall 1)\nSpeakers: Anuradha Nalapat, Devendra Bhatnagar, Swati Pal, Sushmita Gupta, Rugmani Prabhakar \n4:00 pm – 5:00 pm: Season of Memory | Bhakti Poetry (Hall 1)\nSpeakers: Mani Rao, Geetha Suranjana, Pratibha Nayak, Karuna Sivasailam, Vinaya Baligar, Dhanalakshmi Raju \n4:30 pm – 5:45 pm: Poetry on Film (Gallery)\nPoets and Films: Terveen Gill – Our Steps, John Devaraj – Three Beautiful Words, Anju Kishore – Finding You, Amaan Ahmad – Carnitapu, Santasree Chaudhuri – If They All Met at Pushkin Cafe, Mona Zamfirescu & Neil Daswani – War and Peace \n5:00 pm – 5:30 pm: Cartwheeling in the Skies | Fiery Jugalbandi (Hall 2)\nSpeakers: Rochelle Potkar & Jagari Mukherjee \n5:30 pm – 6:00 pm: Sufi Poetry and Performance (Hall 1)\nPerformers: Shaista Yacoob & Khyoumars \n  \nDay 2 | Mar 24 | Sunday \n10:00 am – 11:00 am: Half of What I See | Haiku (Hall 1)\nSpreakers: Anju Kishore, Kavita Ratna, Namratha Varadharajan, Shloka Shankar, Teji Sethi, Vinay Leo R, Kala Ramesh \n10:00 am – 11:00 am: Unmeasured Time | Vibrant Verses – Malayalam (Auditorium)\nSpeakers: Satchidanandan, KG Sankara Pillai, Vinod TP, Bindu, Rama Pisharody, Soman Kataloor \n11:00 am – 12:30 pm: Words Are All I Have | Reflections on Music and Lyrics (Ground Floor Foyer)\nPerformer: Adi Rao \n11:00 am – 12:00 noon: Playing the Magician | Art and Poetry – Malayalam, English, Marathi, Kannada (Auditorium)\nSpeakers: Balamani Amma, Sulochana Nalapat & Anuradha Nalapat; Shan Re & Romicon Revola; Bharati Sagar & Aditi Barve; Ramesh Terdal & Mudnakudu Chinnaswamy \n12:00 noon – 12:45 pm: Defiant Daughters | Women in Indian English Poetry (Hall 1)\nSpeakers: Smeetha Bhoumik, Lina Krishnan, Somrita Urni Ganguly \n12:00 noon – 1:00 pm: Silence of Daylight | Vibrant Verses – Kannada (Auditorium)\nSpeakers: Prof. SG Sidramaiah, Nadoja Dr. Manu Baligar, BR Laxmana Rao, Dr. HL Pushpa, Dr. Basavaraj Sadar, Dr. BR Shruti \n12:45 pm – 1:15 pm: Sky Without Sky | Fireside Chat (Gallery)\nSpeakers: Kala Krishnan Ramesh, Shafigeh Lal \n1:00 pm – 1:45 pm: Unknown Leaf | Haiku and Mohiniattam Performance (Auditorium)\nPerformers: Kala Ramesh and Anita Muktaa Shourya \n2:00 pm – 3:00 pm: Patio Dawn | Exploring Light-Hearted Poetry (Hall 1)\nSpeakers: Shwetha Hariharan, Manju Pillai, Anil Kumar, Lakshmi Ishwar, Pavitra Krishmamurthy, Moderator – Rugmani Prabhakar \n3:00 pm – 4:00 pm: SHORTS @ GHF (Hall 1)\nSpeakers: Shinie Antony, Siddharth Dasgupta, Shaista Yacoob, Kasturika Mishra \n3:15 pm – 4:00 pm: Jupiter Sky | Pardey ke Peechey Kya Hai (Auditorium)\nSpeakers: Jija Madhavan Harisingh, Rugmani Prabhakar, Somrita Urni Ganguly, Jagari Mukherjee \n4:00 pm – 5:00 pm: Seven Fireflies | Voice of Harmony (Hall 1)\nSpeakers: Jayanthi Manoj, Achingliu Kamei, Aaron Pamei, Rochelle Potkar \n4:00 pm – 4:45 pm: Shaping Urban Landscapes | The Interplay of Festivals, Audiences, and City Dynamics (Auditorium)\nSpeakers: Subodh Sanker, V Ravichander, Deepa Rao Acharya, Shinie Antony, Yumna Hari Singh \n4:45 pm – 5:15 pm: Celebrating Gangadhar Chittal in the Year of His Birth Centenary |  ಹರಿವ ನೀರಿದು | This Is Flowing Water – Kannada (Auditorium)\nSpeaker: Jayant Kaikini \n5:15 pm – 5:45 pm: Ricky Kej | Closing Address (Auditorium) \nPresented by:\n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-glass-house-festival-of-poetry/",
    "keywords": "Faith, Film, Heritage, Literature, Performing Arts, Poetry, Society, Sustainability",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/ThumbnailGHF.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Journey from Fear to Love",
    "startDate": "2024-03-22T18:30:00+05:30",
    "endDate": "2024-03-22T20:00:00+05:30",
    "description": "In 1893, Swami Vivekananda travelled to Chicago to attend the Parliament of World Religions. There, amidst representatives of the various religions of the world, Vivekananda—who grew up in an affluent Bengali household in Calcutta, studied to be a lawyer, only to give it up to become a wandering monk—spoke of Universal Religion—‘a religion which will have no place for persecution or intolerance in its polity, which will recognize the divinity in every man and woman, and whose whole scope, whose whole force, will be created in aiding humanity to realize its own true divine nature’. Although a devout Hindu, he had always been someone who felt a deep sense of belonging to the plural heritage of the Indian sub-continent. Through his learnings and travels he sought to galvanize society on the basis of love. \nComprising three insightful essays, Vivekananda and Our Times situates the Swami in today’s world. Rajni Bakshi’s endeavour—which began a century after the Chicago address, when the country was reeling from the shock of the Ramjanmabhoomi campaign and the consequent demolition of the Babri Masjid—attempts to seek a space for reflection and shows us, through Vivekananda’s ideologies, the need to reconcile with the ‘other’ in a ‘shared quest for freedom from fear’. \nA conversation between the author Rajni Bakshi and Govind Krishnan V will by followed by a Q&A session with the audience. \nPresented by:\n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-journey-from-fear-to-love/",
    "keywords": "Books, Faith, History, Philosophy",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy-3_POSTER-7.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Seeds of Democracy",
    "startDate": "2024-04-06T18:30:00+05:30",
    "endDate": "2024-04-06T20:00:00+05:30",
    "description": "In India, the question of whether voters are truly getting what they vote for remains a complex and often debated issue. While elections provide a platform for citizens to express their preferences and hold their representatives accountable, challenges such as electoral misconduct, corruption, and the influence of money and power continue to cast doubt on the efficacy of the electoral process. Moreover, the disconnect between campaign promises and actual governance outcomes further muddles the picture. Despite strides in transparency and electoral reforms, the gap between voter expectations and political realities underscores the need for sustained efforts to enhance accountability, strengthen institutions, and foster a more responsive and inclusive democracy. \nCultivating Democracy: Politics and Citizenship in Agrarian India by Mukulika Banerjee is an anthropological study of the relationship of formal political democracy and the cultivation of active citizenship in one particular rural setting in India, studied from 1998 to 2013. It draws on deep ethnographic engagement with the people and social life in two villages, both during elections and in the time in between them, to show how these two temporalities connect. The analysis shows how an agrarian village society produces the social imaginaries required for democratic and republican values. The ethnographic microscope on a single paddy growing setting allows us to examine how the various social institutions of kinship, economy, and religion are critical sites for the continual civic cultivation of cooperation, vigilance, redistribution, inviolate commitment, and hope—values that are essential for democracy. \nA talk by Mukulika Banerjee will be followed by a Q&A session with the audience. \nThis event is a part of BIC’s Election series. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/seeds-of-democracy/",
    "keywords": "Governance, Policy & Regulation, Politics",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-395.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Words Are All I Have",
    "startDate": "2024-03-24T11:00:00+05:30",
    "endDate": "2024-03-24T12:30:00+05:30",
    "description": "In this recital and conversation, Adi Rao will sing his story-oriented, soulful, acoustic music. He will also speak about his relationship with the songs he performs – their music and their lyrics. \n  \nPresented by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/words-are-all-i-have/",
    "keywords": "Music, Performing Arts, Poetry",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/ThumbnailAW.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Africa - The Wild Secrets",
    "startDate": "2024-03-24T18:30:00+05:30",
    "endDate": "2024-03-24T20:00:00+05:30",
    "description": "Pradeep Rao’s fervent dedication to capturing the essence of wildlife through photography has led him on an extraordinary journey spanning numerous countries, such as Kenya, Tanzania, Botswana, Namibia, Uganda, Rwanda, Ecuador, Costa Rica, Bhutan, the Philippines, and beyond. In his quest to document mammals and avifauna in their natural habitats, he has not only immortalized their beauty but also delved into the rich tapestry of history, culture, and indigenous tribes across these diverse landscapes. \nThroughout his travels, Pradeep has discovered that while wildlife may be ubiquitous, their ability to adapt to varying terrains and climates in pursuit of sustenance is a captivating phenomenon. Witnessing firsthand the anatomical adaptations these creatures have undergone over time, as well as observing the grand spectacle of animal behavior, such as the awe-inspiring Great Migration of Wildebeest, has left an indelible mark on his perspective. \nThe talk will be followed by a moderated conversation with Praneet Goteti and a Q&A session with the audience. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/africa-the-wild-secrets/",
    "keywords": "Environment, Photography, Visual Arts",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-373.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Meeting Kabir in the 21st Century",
    "startDate": "2024-03-31T17:30:00+05:30",
    "endDate": "2024-03-31T19:30:00+05:30",
    "description": "The aim is to present a performative piece with story and song, based on the values of trust, surrender and love. The storytelling is based on Deepa’s lived experiences during the pandemic from Delhi to Auroville in 2020, on a cycle without phone & money. These stories will be complemented and enriched with songs by Anahita based on Sufi and Nirgun Bhakti poetry. \nDeepa’s storytelling comes from a space of intuition, honesty and vulnerability. She talks as openly about the gifts received on this journey, as she does about the struggles and difficulties that came along the way. Her style of narration is engaging and immersive, taking the audience on a journey within themselves. \nAnahita sings the works of mystic poets like Kabir, Khusro, Bulleh Shah, and others, and explores how we relate to them in our own lives. She would weave this poetry in folk, Hindustani classical and qawwali styles of singing. \nAs Anahita sings songs, Deepa will narrate stories from her journey, thus making this collaboration akin to a bridge that connects the root ideas reflected in mystic poetry from centuries ago, to the lived experience based on these very ideas in the 21st century. \nIn collaboration with: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/meeting-kabir-in-the-21st-century/",
    "keywords": "Faith, Music, Performing Arts, Poetry",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-24.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "China through Another Prism",
    "startDate": "2024-04-16T18:30:00+05:30",
    "endDate": "2024-04-16T20:00:00+05:30",
    "description": "Discussions surrounding China and India’s relationship remain urgent and crucial due to their geopolitical significance, economic interdependence, and potential for conflict. As two of the world’s most populous nations and emerging global powers, their interactions shape regional stability and have far-reaching implications for international relations. With ongoing territorial disputes, trade tensions, and differing strategic interests, understanding and managing their relationship is vital for fostering cooperation, averting conflicts, and navigating the complexities of a rapidly changing world order. \nExploring themes from his book Beyond Binaries: The World of India and China based on his writings on India, China and their often-tumultuous relationship, Shastri Ramachandaran unravels a succinct history of how ties between the two Asian neighbours have evolved over the 15 years from 2008–2022 and the internal and bilateral compulsions that shaped them. The book makes the reader aware about the strategic thinking that went into each move and counter-move by the two nations that are often at odds with each other, as they are at present. It is an attempt to deepen understanding of the recent history of Sino-Indian relations and, as the title suggests, look at India-China relations without putting it in the category of good or bad. \nIn this session, author Shastri Ramachandran will be in conversation with Manoj Kewalramani taking the listener beyond the binaries in which perceptions of India and China, their relationship and their role on the world stage is trapped. A Q&A with the audience will follow. \nThis is the first event in BIC’s two-part China Series. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/china-through-another-prism/",
    "keywords": "History, International Relations, Politics",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-400.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "MiniSalone",
    "startDate": "2024-03-19T11:00:00+05:30",
    "endDate": "2024-03-21T20:00:00+05:30",
    "description": "The show puts together a selection of design pieces from local importers of Italian brands, with the idea of playfully recreate a miniature of Salone del Mobile of Milan. \nThe 2024 Salone del Mobile is back as the star of the design calendar: the leading international event for the design industry will be held from 16th to 21st April, in its traditional time frame, at Milan’s Rho Fiera fairgrounds. Set up in 1961, the trade fair boasts a wide range of furnishing products, distinguished by their expressive power and their functional, technological and material innovation, devised to enhance the domestic scene. Ingenuity, vision, innovation, sustainable excellence and emotion make up the familiar lexicon of the companies and brands that exhibit at the Salone Internazionale del Mobile, which has now been proved to be increasingly more global, inclusive and in dialogue with the entire creative and productive furnishing system. Each year, the trade fair gives shape to its mission as a laboratory of experimentation and cross-pollination, a place to meet, to interface and create new business opportunities. It is here that prototypes and innovations in terms of furnishings, domestic spaces and lifestyles are presented: bedrooms, living and dining areas, entrance corridors and service areas, outdoor spaces with their furniture and cupboards, upholstereds, tables and chairs set the scene for a narrative that starts with this room, exploring how the way we live is changing and, consequently, home living and furnishing. \nPresented by: \n  \nThe exhibition is in collaboration with Living Art Interiors, Simply Sofas and Ventura Gallery \n                 \n  \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/minisalone/",
    "keywords": "Design, Science, Sustainability, Technology",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/ThumbnailIDD.png"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Sakhi",
    "startDate": "2024-04-03T19:00:00+05:30",
    "endDate": "2024-04-03T20:30:00+05:30",
    "description": "We have all heard about the abduction of Sita, but how many have seen the Ramayana from Sita’s point of view? \nHave you ever wondered how Draupadi would describe the turmoil she faced in the Mahabharata? \nThey are the two most powerful female figures in Hindu mythology, yet their perspective is often overlooked. This dance-theatre production brings Sita and Draupadi face-to-face in a conversation about their lives, told through their voices. A unique amalgamation of Bharatanatyam, contemporary dance, and theatre, this performance will take you on an extraordinary journey as the two goddesses relive their stories through dance. \nThe production is by Jyotsna Shourie Dance Society and Keelaka Dance Company \nDirector: Jyotsna Shourie\nProducer: Aneesha Grover\nSponsor: MADSTARBASE\nMusic: OS Arun and MadStarBase \nSupported by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/sakhi/",
    "keywords": "Dance, Mythology, Performing Arts, Theatre",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-403.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Snakeman of India",
    "startDate": "2024-03-28T18:30:00+05:30",
    "endDate": "2024-03-28T20:00:00+05:30",
    "description": "Join us for an enthralling evening as we dive into the wild, formative years of Romulus Whitaker through his memoir, Snakes, Drugs and Rock ‘n’ Roll: My Early Years. Esteemed conservationist and the revered ‘Snakeman of India’, Whitaker, along with his co-author Janaki Lenin, will be in conversation with Darius Sunawala. \nThis event brings to life his journey of a boy from the US to the heart of India, where his passion for snakes and wildlife conservation took root. From harbouring a pet python under his boarding school bed to his hair-raising adventures across continents, Whitaker’s story in Snakes, Drugs and Rock ‘n’ Roll is not just about snakes but a love affair with nature. \nThe evening will comprise firsthand experiences that led Whitaker to become a leading figure in the global conservation space. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/snakeman-of-india/",
    "keywords": "Biography, Books, Environment, Sustainability, Wildlife",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-398.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "The Joy of Creativity in Khayal",
    "startDate": "2024-03-29T00:00:00+00:00",
    "endDate": "2024-04-01T00:00:00+00:00",
    "description": "Explore the essence of Hindustani music through three sessions of our Masterclass series with Pandit Satyasheel Deshpande. Session 1 will illuminate the role of rhythm in fostering individual expression, showcasing its diverse applications in folk, film, and classical genres. In Session 2, we will delve into the gharana traditions as distinct aesthetic ideologies, dissecting their unique approaches to ragas and talas. Finally, Session 3 will unveil the significance of bandishes as carriers of musical expression, offering insights into their nuanced composition and performance dynamics. This journey through the landscape of Hindustani music, where tradition meets innovation at every turn, is suitable for seasoned professionals, gayikas, young performers and music enthusiasts alike. \nSession 1: The Khayal and Individual Expression\nFriday | Mar 29 | 6pm – 8pm\nThis session will introduce the unique nature of rhythm in Hindustani music, and will frame it as an enabler of individual creative expression. Through demonstrations of folk, film and classical music, the session will demonstrate to participants how the tala-system of Hindustani music creates space and scope for creative, improvisatory play. It will also look at how diverse musicians have used this facility to make the music uniquely their own. \nSession 2: Gharanas and Aesthetic Ideologies\nSaturday | Mar 30 | 6pm – 8pm\nThis session will look at some of the  major gharanas of vocal Hindustani music, but instead of seeing them purely as pedagogical lineages, we will think of them as particular aesthetic ideologies, particular ways of handling raga and tala that innovative musicians gave birth to. Through live demonstrations and curated archival recordings, we will do an intensive review of the gharana traditions of Hindustani music and the aesthetics they embody \nSession 3: Bandish\nSunday | Mar 31 | 11am – 1pm\nThis final session will look at bandishes in Hindustani music as carriers of unique musical expression. We will discuss the importance of the bandish to Hindustani music, its uniqueness as a song-genre, and how it is different from other kinds of compositions. We will then look at various kinds of carefully selected bandishes from various ragas, talas, tempos, gharanas, and innovative composers. We will learn to appreciate the nuanced ways in which bandishes use text, how starting from a particular beat in the tala creates new beauty and new challenges for the singer, and many other such forces that drive performance. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/the-joy-of-creativity-in-khayal/",
    "keywords": "Masterclass, Music",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-402.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Why Does India Lag Behind Its Poorer Neighbours?",
    "startDate": "2024-03-29T18:30:00+05:30",
    "endDate": "2024-03-29T20:00:00+05:30",
    "description": "A newborn girl can expect to live to eighty in Sri Lanka, seventy-four in Bangladesh and sixty-nine in India. This is but one of a range of Swati Narayan’s insights from a five-year study across four countries: India, Bangladesh, Nepal and Sri Lanka. She found that even poorer neighbours were doing better than India on a range of social indicators: health, nutrition, education, sanitation, with more women working outside the home. \nNarayan’s intensive, immersive research shows that India’s leapfrogging neighbours have worked hard to dilute social inequalities. Land reforms, investments in schools and hospitals, and socio-political reform movements aimed at diluting caste and gender discrimination – all of these have wrought change over the decades. Excellent networks of primary healthcare clinics, village schools and household toilets have transformed the lives of citizens in these countries. \nIn economically booming India, on the other hand, social ills like sex-selective abortion, child stunting, illiteracy and preventable deaths are rampant. Inequalities are stark here—not only between the burgeoning billionaire class and the neglected masses, but also among the northern states and their southern counterparts. However, it is in fact the successes in states like Tamil Nadu and Kerala that offer grounds for optimism—India is capable of transformation if governments commit to social welfare investments and bridging social inequities. \nPacked with human stories as well as hard data, and shot through with empathy and hope, Swati Narayan’s Unequal is a necessary book for our times. \nSwati will be in conversation with Aakar Patel. A Q&A with the audience will follow. \nPresented by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/why-does-india-lag-behind-its-poorer-neighbours/",
    "keywords": "Books, Development, Gender, Governance, Health & Wellness, Nonfiction, Policy & Regulation",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-399.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Celebrating Gangadhar Chittal in the Year of His Birth Centenary",
    "startDate": "2024-03-24T16:45:00+05:30",
    "endDate": "2024-03-24T17:15:00+05:30",
    "description": "Gangadhar Chittal made his mark as a major poet in Kannada with a total of just 74 poems in his active life. Jayant Kaikini presents his reflections on Chittal’s poetry and vision. \n  \nPresented by: \n \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/celebrating-gangadhar-chittal-in-the-year-of-his-birth-centenary/",
    "keywords": "Language, Literature, Poetry",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/ThumbnailGHF_2.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Living a Masquerade",
    "startDate": "2024-03-23T14:00:00+05:30",
    "endDate": "2024-03-23T16:00:00+05:30",
    "description": "Books have the power and ability to transport and immerse us into times not lived in, be in places not been to, savour food not eaten, befriend people we haven’t met and live lives we haven’t lived! They let us live vicariously through the writings of others. \nJoin Rama Vennelakanti this Saturday and explore books that invoke a feelings of nostalgia for a time you’ve never known (Anemoia), a nostalgic longing for a place which can never be revisited (Hiraeth) and itchy feet (Fernweh). \nYou can bring your own book or choose one from the collection at the library, pick a cosy spot and read with us for 90 minutes. Post this, spend a few minutes chatting with us about your read. \nThis event is a part of BIC’s Programmes at the Library. \nBIC Library Programmes are designed to reshape the BIC Library into a community-centered space. Our primary goal is to curate sessions that cater to the diverse interests and ages within our library community. Through this, we aim to provide a welcoming platform for experimentation, turning the library into a dynamic space that goes beyond traditional book-related activities. \nWe also encourage active participation from our community members. If you have event ideas or proposals that align with our vision, please reach out to us at collab@bangaloreinternationalcentre.org \n",
    "location": {
      "@type": "Place",
      "name": "7, 4th Main Road, Domlur II Stage, Bengaluru, Karnataka, 560 071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/living-a-masquerade/",
    "keywords": "Books, Fiction, Language, Literature",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-40.png"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Femme Fatales in Ancient Tales",
    "startDate": "2024-03-23T18:00:00+05:30",
    "endDate": "2024-03-23T19:30:00+05:30",
    "description": "Are they the bad girls of mythology or just plain misunderstood? \nSeductive, bold, trailing in their wake doom and destruction, these were the early rebels of the epics. In these latest books The Forgotten Wife: The Story of Hidimbi and Bheem by Madahavi Mahadevan, Jezebel by KR Meera, and Eden Abandoned: The Story of Lilith by Shinie Antony, feminism is able to trace its history and origins back to when perhaps women with ambition were dismissed as demonesses. \nThe three authors will discuss legend and lore with poet Mani Rao. A Q&A with the audience will follow. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/femme-fatales-in-ancient-tales/",
    "keywords": "Books, Gender, Mythology",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail_POSTER-391.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Making Rights Real",
    "startDate": "2024-03-26T18:30:00+05:30",
    "endDate": "2024-03-26T20:00:00+05:30",
    "description": "On International Women’s Day 2024, standards of equality reflected in the CEDAW (Convention on the Elimination of All Forms of Discrimination Against Women) continue to be elusive in the private sphere. In India, legal pluralism in family laws has historically seen  men and women treated differently, as well as a reluctance to look beyond the gender binary. \nLaws on reproductive and sexual rights have fallen short of fully protecting rights of women. Making Rights Real examines legal rights in India against the backdrop of the CEDAW. \n",
    "location": {
      "@type": "Place",
      "name": "Bangalore International Centre, 7, 4th Main Road, Domlur II Stage, Bangalore, Karnataka, 560071, India"
    },
    "url": "https://bangaloreinternationalcentre.org/event/making-rights-real/",
    "keywords": "Gender, Law",
    "image": "https://bangaloreinternationalcentre.org/wp-content/uploads/Thumbnail-copy_POSTER-23.jpg"
  }
]