[
  {
    "url": "https://bluetokaicoffee.com/products/a-peek-into-the-world-of-specialty-coffee-roastery-tour-4",
    "name": "A Peek into The World of Specialty Coffee | Roastery Tour",
    "description": "Ever wondered how your favourite Arabica specialty coffees are sourced and roasted? How does one differentiate a light, medium or dark roast? Join us for an exclusive roastery tour to know about the basics of roasting coffee and how we source India’s highest-scoring coffees. \nSoak in the aroma of freshly roasted coffee as you deep dive into our relationship with partner farms, the types of coffees we source, why we choose specific samples and much more. But the fun doesn’t just end there! Witness live sample roasting to see green beans turn into roasted beans! \nTransparency is at the core of everything we do. So, we welcome you to ask us anything during our coffee workshop, and we’ll be happy to share our insights with you.\nDate: 22nd June 2024 (Saturday) Timings: 12 PM - 2 PM Venue:Coffee workshop Gurugram - Blue Tokai Roastery, Udyog Vihar, Gurugram Coffee workshop Mumbai - Blue Tokai Roastery, Chembur, Mumbai Coffee workshop Bengaluru - Blue Tokai Roastery, NGEF Layout, Bengaluru \nPlease note \n\n\nWear covered shoes for the event. No strong cologne or perfume should be  applied as they may impact the aromas of the coffee beans. \n\n\nTickets are non-refundable and you cannot transfer your ticket to a future event. \n\n\n\n\n\n\n",
    "startDate": "2024-06-22T12:00:00+05:30",
    "endDate": "2024-06-22T14:00:00+05:30",
    "image": "https://cdn.shopify.com/s/files/1/0738/1409/files/RoasterTour_130324_1.jpg?v=1716548942",
    "offers": {
      "@type": "Offer",
      "price": "750",
      "priceCurrency": "INR"
    },
    "location": {
      "@type": "Place",
      "name": "Blue Tokai Roastery, NGEF Layout",
      "url": "https://maps.app.goo.gl/fssZvwfXuxhaC7G77",
      "address": "Blue Tokai Roastery, NGEF Layout Bengaluru"
    }
  },
  {
    "url": "https://bluetokaicoffee.com/products/espresso-brewing-and-latte-art-workshop-11",
    "name": "Espresso Brewing and Latte Art Workshop",
    "description": "Ever wondered what it takes to make a perfect espresso or create beautiful latte art in your cup? Think surprising a coffee-loving loved one with a beautifully crafted latte art! \nCurated for both newbies and aficionados alike, with our ‘Espresso Brewing and Latte Art Workshop’ you will learn the basics of making an espresso, milk steaming, crema and recipes for different milk-based espresso drinks. Also, learn how to perfect your latte art skills in this session with our in-house trainers. \nWe recommend this coffee workshop to all coffee enthusiasts and budding baristas!  \nWorkshop Highlights \nOur brewing experts will take you through all the steps for making espresso and creating latte art, answer your questions and help you practice everything you’ve learnt!  \nCoffee workshop Banglore\nDate: 23rd June 2024, SundayTime: 12 PM - 2 PMVenue: Blue Tokai Coffee Roasters | Koramangala 8th Block, Bengaluru  \nPlease note that the tickets for this event are non-refundable and you cannot transfer your ticket to a future event. \n",
    "startDate": "2024-06-23T12:00:00+05:30",
    "endDate": "2024-06-23T14:00:00+05:30",
    "image": "https://cdn.shopify.com/s/files/1/0738/1409/files/JuneEvents_StoryAdapts_300622_AjaySaxena_sconflictedcopy2023-03-23_66eeec18-6309-4700-a157-4486813f76e6.jpg?v=1716533611",
    "offers": {
      "@type": "Offer",
      "price": "700",
      "priceCurrency": "INR"
    },
    "location": {
      "@type": "Place",
      "name": "Blue Tokai Coffee Roasters Koramangala",
      "url": "https://cafe.bluetokaicoffee.com/koramangala-bengaluru-33591/home",
      "address": "Blue Tokai Coffee Roasters Koramangala Bengaluru"
    }
  }
]