[
  {
    "url": "https://bluetokaicoffee.com/products/capsules-to-concoctions",
    "name": "Capsule to Concoctions",
    "description": "Got a delicious coffee mocktail recipe that your friends keep asking you to craft? Well, it could be your ticket to exciting prizes. \nAt Capsule to Concoctions, a mocktail making competition, use an espresso as the base to craft a mocktail that impresses our judges and take home a brand-new capsule machine or a thoughtful hamper! \nRules and Regulations:  \n\nParticipants must use the provided coffee capsule machine to brew their coffee base.  \nThe use of additional coffee brewing equipment (e.g., espresso machines, French presses) is not permitted.  \nParticipants must demonstrate proficiency in operating the coffee capsule machine safely.  \nParticipants will be allotted only 10 minutes to make their coffee mocktails.  \nThe participants should also specify their ingredients and explain what their mocktail contains and why did they choose to make the same.  \nExcluding the capsules, participants will be responsible for bringing their own ingredients.\nParticipants can use a maximum of 2 pods in their recipes.\n\nDate: 22nd September 2024 (Sunday) Timings: 11 PM - 1 PM Venue:Delhi - Blue Tokai Roastery, Rajouri GardenMumbai - Blue Tokai Roastery, New Excelsior Cinemas, FortBengaluru - Blue Tokai Roastery, Koramangala 5th Block",
    "startDate": "2024-09-22T23:00:00+05:30",
    "endDate": "2024-09-22T13:00:00+05:30",
    "image": "https://cdn.shopify.com/s/files/1/0738/1409/files/2_16.jpg?v=1725018208",
    "offers": {
      "@type": "Offer",
      "price": "499",
      "priceCurrency": "INR"
    },
    "location": {
      "@type": "Place",
      "name": "Blue Tokai Coffee Roasters Koramangala, 5th Block",
      "url": "https://cafe.bluetokaicoffee.com/koramangala-bengaluru-36832/home",
      "address": "Blue Tokai Coffee Roasters Koramangala, 5th Block Bengaluru"
    }
  }
]