[
  {
    "@context": "http://schema.org",
    "url": "https://bluetokaicoffee.com/products/a-peek-into-the-world-of-specialty-coffee-roastery-tour-3",
    "@type": "Event",
    "name": "A Peek into The World of Specialty Coffee | Roastery Tour",
    "description": "Ever wondered how your favourite Arabica specialty coffees are sourced and roasted? How does one differentiate a light, medium or dark roast? Join us for an exclusive roastery tour to know about the basics of roasting coffee and how we source India’s highest-scoring coffees. \nSoak in the aroma of freshly roasted coffee as you deep dive into our relationship with partner farms, the types of coffees we source, why we choose specific samples and much more. But the fun doesn’t just end there! Witness live sample roasting to see green beans turn into roasted beans! \nTransparency is at the core of everything we do. So, we welcome you to ask us anything and we’ll be happy to share our insights with you. \nDate: 20th April 2024 (Saturday) Timings: 12 PM - 2 PM Venue:Gurugram - Blue Tokai Roastery, Udyog Vihar, Gurugram Mumbai - Blue Tokai Roastery, Chembur, Mumbai Bengaluru - Blue Tokai Roastery, NGEF Layout, Bengaluru \nPlease note \n\n\nWear covered shoes for the event. No strong cologne or perfume should be  applied as they may impact the aromas of the coffee beans. \n\n\nTickets are non-refundable and you cannot transfer your ticket to a future event. \n\n\n\n\n\n\n",
    "startDate": "2024-04-20T12:00:00+05:30",
    "endDate": "2024-04-20T14:00:00+05:30",
    "image": "https://cdn.shopify.com/s/files/1/0738/1409/files/RoasterTour_130324.jpg?v=1710405355",
    "offers": {
      "@type": "Offer",
      "price": "750",
      "priceCurrency": "INR"
    },
    "organizer": {
      "@type": "Organization",
      "name": "Blue Tokai Coffee Roasters"
    },
    "location": {
      "@type": "Place",
      "name": "Blue Tokai Roastery, NGEF Layout",
      "url": "https://maps.app.goo.gl/fssZvwfXuxhaC7G77",
      "address": "Blue Tokai Roastery, NGEF Layout Bengaluru"
    }
  },
  {
    "@context": "http://schema.org",
    "url": "https://bluetokaicoffee.com/products/the-art-of-brewing-coffee",
    "@type": "Event",
    "name": "The Art of Brewing Coffee",
    "description": "Join us in this carefully curated session, in partnership with Public Art Festivals, as Blue Tokai’s in-house trainers take you through the basics of home brewing and the science behind pouring the perfect cup, every time! Established in 2013, the Public Art Festivals are a not-for-profit initiative supported by the Yuj Arts Foundation. Over the past 9 years, they’ve enriched the cultural calendars of several Indian cities through partnerships with renowned institutions and eminent artists, that enable a dynamic art festival rooted in the ethos of host cities. Whitefield Art Collective is Bengaluru's edition of the Public Art Festivals.\nOur team will demonstrate 4 manual brewing methods during the workshop—French Press, AeroPress, Pour Over and Channi. Whether you’re a beginner or an expert brewer, you can sign up for this workshop, join our community of fellow coffee lovers and ace the art of manual brewing!\nDay and Date: Saturday, 27th April 2024Time: 11 AM - 1 PMVenue: Blue Tokai Coffee Roasters, VR Bengaluru\nPlease note that the tickets for this event are non-refundable and you cannot transfer your ticket to a future event.",
    "startDate": "2024-04-27T11:00:00+05:30",
    "endDate": "2024-04-27T13:00:00+05:30",
    "image": "https://cdn.shopify.com/s/files/1/0738/1409/files/1.-Web-Banner_030424.jpg?v=1712735962",
    "offers": {
      "@type": "Offer",
      "price": "1000",
      "priceCurrency": "INR"
    },
    "organizer": {
      "@type": "Organization",
      "name": "Blue Tokai Coffee Roasters"
    },
    "location": {
      "@type": "Place",
      "name": "Blue Tokai Coffee Roasters Whitefield",
      "url": "https://cafe.bluetokaicoffee.com/mahadevapura-bengaluru-33593/home",
      "address": "Blue Tokai Coffee Roasters Whitefield Bengaluru"
    }
  },
  {
    "@context": "http://schema.org",
    "url": "https://bluetokaicoffee.com/products/espresso-brewing-and-latte-art-workshop-9",
    "@type": "Event",
    "name": "Espresso Brewing and Latte Art Workshop",
    "description": "﻿Ever wondered what it takes to make a perfect espresso or create beautiful latte art in your cup? Think surprising a coffee-loving loved one with a beautifully crafted latte art! \nCurated for both newbies and aficionados alike, with our ‘Espresso Brewing and Latte Art Workshop’ you will learn the basics of making an espresso, milk steaming, crema and recipes for different milk-based espresso drinks. Also, learn how to perfect your latte art skills in this session with our in-house trainers. \nWe recommend this workshop to coffee enthusiasts and all budding baristas!  \nWorkshop Highlights \nOur brewing experts will take you through all the steps for making espresso and creating latte art, answer your questions and help you practice everything you’ve learnt!  \nDate: 28th April 2024, SundayTime: 12 PM - 2 PMVenue: Blue Tokai Coffee Roasters | Koramangala Unit 1, Bengaluru  \nPlease note that the tickets for this event are non-refundable and you cannot transfer your ticket to a future event. \n",
    "startDate": "2024-04-28T12:00:00+05:30",
    "endDate": "2024-04-28T14:00:00+05:30",
    "image": "https://cdn.shopify.com/s/files/1/0738/1409/files/JuneEvents_StoryAdapts_300622_AjaySaxena_sconflictedcopy2023-03-23.jpg?v=1712734268",
    "offers": {
      "@type": "Offer",
      "price": "700",
      "priceCurrency": "INR"
    },
    "organizer": {
      "@type": "Organization",
      "name": "Blue Tokai Coffee Roasters"
    },
    "location": {
      "@type": "Place",
      "name": "Blue Tokai Coffee Roasters Koramangala",
      "url": "https://cafe.bluetokaicoffee.com/koramangala-bengaluru-33591/home",
      "address": "Blue Tokai Coffee Roasters Koramangala Bengaluru"
    }
  }
]