[
  {
    "url": "https://bluetokaicoffee.com/products/blue-tokai-s-cup-tasters-championship-2025",
    "name": "Blue Tokai’s Cup Tasters Championship 2025",
    "description": "Join us for a sensory challenge and the chance to win a relaxing two-day getaway at Bicode Estate, a tranquil coffee plantation, for you and a plus one  \nBrought to you in partnership with Benki Brewing Tools and Sangameshwar Coffee Estates, this is a fast-paced contest where every sip counts. Identify the \"odd one out\" in a lineup featuring carefully selected brews.\nThe ChallengeIdentify the \"odd one out\" in a lineup featuring carefully selected brews from Sangameshwar Coffee Estates. It's fast-paced and every sip counts!\nRules and Format☕ Triangular Cupping FormatTaste 8 sets of 3 cups. Two are identical, one is different. Can you pick the odd one out?🔒 Rely on Your SensesNo devices or tools allowed.⏱ Race Against TimeEach round is 5 minutes—stay focused and finish quickly to stay ahead!🎭 Blind TastingNo labels, origins, or roast profiles. It’s just you, your senses, and the coffee.🧴 Maintain HygieneUse sanitised spoons and hands to maintain hygiene.🏅 Rounds & ScoringCompete through the prelims, semifinals, and final round. Earn 1 point for each correct guess. In case of a tie, the fastest taster wins.\nRewards That Await🥇 Grand PrizeA two-day stay at Biccode Estate for two, plus a luxury gift hamper. 🥈 Runner-Up₹5000 worth of shopping on our website, and a curated gift hamper.\nDate: 16th February 2025 (Sunday)Time: 11 AM - 4 PM Location: The Pour Room, Koramangala\nPlease Note: Tickets for this event are non-refundable and cannot be transferred to future events. ",
    "startDate": "2025-02-16T11:00:00+05:30",
    "endDate": "2025-02-16T16:00:00+05:30",
    "image": "https://cdn.shopify.com/s/files/1/0738/1409/files/WhatsApp_Image_2025-01-10_at_16.42.34.jpg?v=1736507743",
    "offers": {
      "@type": "Offer",
      "price": "300",
      "priceCurrency": "INR"
    },
    "location": {
      "@type": "Place",
      "name": "Blue Tokai Coffee Roasters Koramangala",
      "url": "https://cafe.bluetokaicoffee.com/koramangala-bengaluru-33591/home",
      "address": "Blue Tokai Coffee Roasters Koramangala Bengaluru",
      "geo": {
        "@type": "GeoCoordinates",
        "latitude": 12.94098007,
        "longitude": 77.62012452
      }
    }
  }
]