[
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch: The Great Nicobar Betrayal, curated by Pankaj Sekhsaria | 9 June, 5PM at Champaca Bookstore",
    "startDate": "2024-06-09T17:00:00+05:30",
    "description": "Join us for a book launch of THE GREAT NICOBAR BETRAYAL and tune into the discussion between Pankaj Sekhsaria and Samar Halarnkar as they discuss the contemporary issues that threaten to destroy the Andaman and Nicobar Islands. The book is a catalogue of the manmade catastrophe that lurks on the horizon, and the discussion promises to be an insightful one.  THE GREAT NICOBAR BETRAYAL is a Frontline Publication.  About the speakers:  Pankaj Sekhsaria is the author/editor of 6 books on the Andaman and Nicobar islands and has spent 20 years covering the region as a journalist.  Samar Halarnkar an author, founder-editor of Article 14 , and a columnist for Scroll.in. He is also cofounder of the India Love Project.      Details of the event: Date: Sunday, 9 June  Time: 5 PM  Venue: Champaca Bookstore     RSVP here   to confirm your presence. ",
    "url": "https://champaca.in/blogs/events/book-launch-the-great-nicobar-betrayal-curated-by-pankaj-sekhsaria-9-june-5pm-at-champaca-bookstore",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-the-great-nicobar-betrayal-curated-by-pankaj-sekhsaria-9-june-5pm-at-champaca-bookstore?variant=40465677385763",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "We're Turning 5 and Everyone's Invited!",
    "startDate": "2024-06-05T00:00:00+05:30",
    "description": "We are so excited to invite you to the celebration of our 5th birthday! It's been 5 great years of running our independent bookstore and we're super grateful for your support.  Do come by to Champaca this Saturday, 8 June, and join the festivities.  We are super excited to meet all of you, our community of readers and well wishers, who have made our journey possible.  Come celebrate with us and party!  📕Explore our favourite books with us! 📘 Come with all your questions about how we curate and run our bookstore: we are here to talk! 📕Meet our whole team! 📘 Ask for book recommendations! We'll do our best to give you bespoke ideas for what to read :)  📕Get your books stamped by our amazing new Champaca stamp :) 📘 Join us for a literary and bookish quiz with quizmaster Berty Ashley!  You can confirm your participation on this  RSVP link . 🎂 It's our birthday, we're all eating cake! (don't worry, there's savoury snacks too!) Date : Saturday, 8 June Time : 10 AM to 8 PM Venue : Champaca Bookstore   Our store can only be reached by stairs. We look forward to seeing you there!",
    "url": "https://champaca.in/blogs/events/were-turning-5-and-everyones-invited",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/our-5th-birthday-quiz-with-berty-ashley?_pos=1&_sid=d0ee1e58b&_ss=r&variant=40465594155043",
        "price": "100",
        "priceCurrency": "INR"
      }
    ]
  }
]