[
  {
    "@type": "Event",
    "name": "YouTube Live with Amitava Kumar and Aditya Mani Jha on THE GREEN BOOK ୲ 28 February, 7:30 PM",
    "startDate": "2025-02-28T19:30:00+05:30",
    "endDate": "2025-02-28T21:30:00+05:30",
    "description": "Tune in for a very interesting conversation with  Amitava Kumar  and  Aditya Mani Jha  on Amitava’s latest work THE GREEN BOOK, published by HarperCollins India. This is an online discussion happening on the 28th of February on the Champaca YouTube channel. The video will also be available on YouTube after the session. Here are all the details about the event -  DATE - 28 FEBRUARY TIME - 7:30 PM IST YOUTUBE LIVE DISCUSSION:  https://www.youtube.com/watch?v=hZVzDUgLEWc About the book -  Many of the drawings and paintings in this book are the result of the walks I have undertaken. Don't stop walking! And keep a journal. What you draw is a way of keeping a diary, of course, but write words to record what you see. - Amitava Kumar The third book in the series that started with THE BLUE BOOK and continued with THE YELLOW BOOK, THE GREEN BOOK gives us a profound insight into the mind of a writer who observes closely and attempts to capture in images and words what is happening to the world around us. About the speakers -  Amitava Kumar A mitava Kumar is a writer, journalist and a professor of English at Vassar College. His novel IMMIGRANT, MONTANA was on the best of the year lists at The New Yorker, The New York Times, and President Obama’s list of favorite books of 2018. The New Yorker magazine called his 2021 novel A TIME OUTSIDE THIS TIME “a shimmering assault on the Zeitgeist.” His latest novel is MY BELOVED LIFE and was described by James Wood as “beautiful, truthful fiction.” Amitav’s work has appeared in Granta, The New Yorker, The New York Times, Harper’s, BRICK, Guernica, The Nation and several other publications. Aditya Mani Jha Aditya Mani Jha is a writer and journalist with 10 years of work experience. He was Commissioning Editor at The Hindu Business Line between 2015-2017 and at Penguin Random House India between 2017-2019. He was a Books Editor at The Sunday Guardian between 2012-2015. He has a screen column at The Hindu called 'Binge Watch' and his articles are regularly featured at Mint Lounge, India Today, Times of India, Open, FirstPost and several other publications.  ",
    "url": "https://champaca.in/blogs/events/youtube-live-with-amitava-kumar-and-aditya-mani-jha-on-the-green-book-28-february-7-30-pm",
    "offers": []
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: Karthik Venkatesh and Vinay Kumar on 10 MAKERS OF INDIAN CONSTITUTION ୲ 15 March, 5:30 PM",
    "startDate": "2025-03-10T00:00:00+05:30",
    "endDate": "2025-03-10T02:00:00+05:30",
    "description": "We are excited to host Karthik Venkatesh and Vinay Kumar at our bookstore for a discussion around Karthik’s latest book 10 MAKERS OF INDIAN CONSTITUTION.  Here are the details of the event - DAY - SATURDAY DATE - 15 March TIME - 5:30 PM Since there is limited seating, we recommend you book your spot by clicking on this  link . About the book - This book explores the lives of ten remarkable women and men who played pivotal roles in shaping the Indian Constitution. From challenging caste norms to advocating for freedom of speech, they contributed ideas that were significant in moulding India as we know it today.  About the speakers -  Karthik Venkatesh When Karthik Venkatesh was growing up in Bangalore, he followed the rules. When he later lived in Delhi and Bathinda, he reluctantly learned to bend the rules. That was the beginning of his interest in the Constitution. He then moved back to Bangalore where he now lives with his wife, Amarinder, sons Geet and Neil, and dog Norah. On weekdays, he runs. On weekends, he naps. He more or less follows the rules always. Vinay Kumar Vinay Kumar is an Aerospace Engineer & founder of  #ReclaimConstitution , a project aimed at fostering a constitutional culture. Started on 26 Jan 2023, the project now has people from many walks of life including Doctors, Artists, Scientists, Engineers & professionals from the Social sector who are exploring newer means to engage in conversations about our Constitution.",
    "url": "https://champaca.in/blogs/events/book-discussion-karthik-venkatesh-and-vinay-kumar-on-10-makers-of-indian-constitution-14-march-5-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-karthik-venkatesh-and-vinay-kumar-on-10-makers-of-indian-constitution-14-march-5-30-pm?variant=40735795544099",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]