[
  {
    "@type": "LiteraryEvent",
    "name": "Westland Books invites you to an evening of conversations | Radhika Swarup and Unmana with Radhika Timbadia | 12 December, 6 PM",
    "startDate": "2024-12-12T18:00:00+05:30",
    "endDate": "2024-12-12T20:00:00+05:30",
    "description": "Join us to celebrate Unmana's debut novel CHIKKAMMA TOURS (PVT.) and Radhika Swarup's THE NEW NEW DELHI BOOK CLUB. While CHIKKAMMA TOURS (PVT.) LTD is a queer bibliomystery set in Bangalore, THE NEW NEW DELHI BOOK CLUB paints a vivid portrait of a community in lockdown. Both the books are about the act of reading (be it solitary or in a community) and offer a delightful treat for bibliophiles. The authors will be in conversation with Radhika Timbadia. Here are the details of the event-  DATE- 12 DECEMBER, THURSDAY TIME- 6 PM Since the seating is limited, please  RSVP here  to confirm your spot.  About the speakers:  Unmana  is a Mumbai-based author who writes about gender, queerness, trauma, home, and found family. Their debut novel, CHIKKAMMA TOURS (PVT.) LTD is a cozy murder mystery set in Bangalore and is published by Westland Books. Unmana's short stories have been nominated for the Best of the Net and the Deodar Prize. Radhika Swarup  spent a nomadic childhood in India, Italy, Qatar, Pakistan, Romania and England, which gave her a keen sense for the dispossessed. She studied at Cambridge University and worked in investment banking before turning to writing. She has written opinion pieces for Indian broadsheets and the Huffington Post as well as short stories for publications including the Edinburgh Review. ' Radhika Timbadia  is the proprietrix of Champaca. She has previously worked in the field of community-based wildlife conservation in Spiti and Ladakh.",
    "url": "https://champaca.in/blogs/events/westland-books-invites-you-to-an-evening-of-conversations-radhika-swarup-and-unmana-with-radhika-timbadia-12-december-6-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/westland-books-invites-you-to-an-evening-of-conversations-radhika-swarup-and-unmana-with-radhika-timbadia-12-december-6-pm?variant=40668842852387",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book discussion and reading: YOU ARE THE WORLD with Rajan Chandy and T.M. Veeraraghav | 15 December, 11:30 AM",
    "startDate": "2024-12-15T11:30:00+05:30",
    "endDate": "2024-12-15T13:30:00+05:30",
    "description": "Join us at the bookstore for a reading session and book discussion on  J. Krishnamurti's YOU ARE THE WORLD. Rajan Chandy, a teacher at Rishi Valley School, will be in conversation with T.M. Veeraraghav, Executive Editor at NDTV.  The details of the event are as follows:  DATE: 15 DECEMBER, SUNDAY  TIME: 11:30 AM Since the seating is limited, please RSVP  on this link  to confirm your presence.  About the speakers:  Rajan Chandy was a political activist in the late sixties and seventies. The questions that arose out of this experience led him to a more philosophical enquiry, and he moved to Germany, where he studied Western Philosophy and Indology at the University of Heidelberg for seven years. It was there that he came across the Buddha Dharma and the Teachings of J. Krishnamurti; he has been studying these ever since. At present, he teaches Economics at Rishi Valley School where he has been living for the last 30 years. He will read a brief text from the works of J. Krishnamurti and then speak on the theme: YOU ARE THE WORLD.  T. M. Veeraraghav is a journalist who has reported on socio-political issues and has facilitated and moderated conversations on a variety of issues, including education. He is currently an Executive Editor with NDTV, and has worked with The Hindu as their Resident Editor in their Bengaluru office and also as a senior reporter at CNN. He will have a conversation with Rajan Chandy around the book YOU ARE THE WORLD.   ",
    "url": "https://champaca.in/blogs/events/book-discussion-and-reading-you-are-the-world-with-rajan-chandy-and-t-m-veeraraghav-15-december-11-30-am",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-and-reading-you-are-the-world-with-rajan-chandy-and-t-m-veeraraghav-15-december-11-30-am?variant=40663884824611",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book launch and discussion: GOVERNING FORESTS by Arpitha Kodiveri in conversation with Disha Ravi | 14 December, 5 PM",
    "startDate": "2024-12-14T17:00:00+05:30",
    "endDate": "2024-12-14T19:00:00+05:30",
    "description": "Join us for a book launch of GOVERNING FORESTS authored by environmental lawyer and legal scholar, Arpitha Kodiveri. Arpitha will be in conversation with Disha Ravi. In this book the author narrates her encounters with various   forest -dwelling communities, and discusses many of their challenges in the face of mining and pressure for conserving   forests . It examines the history of environmental laws in India, touching upon several subjects such as citizenship, the role of the State, the exclusion of the Dalit community in these   forest   laws, and much more.  The details of the events are as follows: DATE- 14 DECEMBER, SATURDAY TIME- 5 PM Since the seating is limited, please  RSVP here  to confirm your presence.  About the speakers  Arpitha Kodiveri is an environmental law and justice scholar and assistant professor of political science at Vassar College. Her work focuses on the role of law in the context of redressing climate harms faced by indigenous communities in South Asia. Her previous research examines land conflicts and legal mobilization by forest-dwelling communities in India. She has worked as an environmental lawyer supporting Adivasi and forest-dwelling communities in India. She is the recipient of the Hans Kelsen Fellowship at the EUI and the Fulbright-Nehru Fellowship. Disha A Ravi is a climate and human rights activist who co- founded Fridays For Future India in 2019. She was named as 'The Climate Change Agent' in the Forbes Women Power List in 2021, and as one of the '9 Indian Climate Warriors Paving the Path for a More Sustainable Tomorrow' by Vogue India. Disha became an activist after seeing her family impacted by the water crisis. She advocates for better environmental and climate policies and governance. She has been at the forefront of demanding protection for environmental defenders and activists across the world. Disha is a writer, passionate about making sure the voices of MAPA (the Most Affected People and Areas) are heard in climate conversations.",
    "url": "https://champaca.in/blogs/events/book-launch-and-discussion-governing-forests-by-arpitha-kodiveri-in-conversation-with-disha-ravi-14-december-5-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-and-discussion-governing-forests-by-arpitha-kodiveri-in-conversation-with-disha-ravi-14-december-5-pm?variant=40663881777187",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]