[
  {
    "@type": "LiteraryEvent",
    "name": "Cracking Open Shakespeare: An interactive reading workshop",
    "startDate": "2026-01-24T10:00:00+05:30",
    "endDate": "2026-01-24T12:00:00+05:30",
    "description": "Ever read a Shakespeare play and felt quite lost? Find the language is too dense? The meaning and the hype impossible to see?   Then this workshop is for you! Join us for an interactive session that demystifies the Bard’s work and makes it come alive — not as high art, but as the gripping, witty, and dramatic entertainment it was always meant to be!  Here are all the Event Details: Date:  24th January, Saturday Time:  10 am to 1 pm Venue:  Champaca Bookstore, Indiranagar Fee:  INR 750 Age Group:  13 years and above What to expect? Through fun, practical exercises, we’ll explore: - Verse & the Iambic Pentameter: How rhythm shapes meaning and emotion in Shakespeare’s text. - And Rhetoric: how Shakespeare’s characters persuade, argue, and plot their way through every scene We’ll break down sonnets, famous speeches and scenes together, lightly touch on the themes and contexts, and end with a lively group reading to celebrate the text’s performative power. Walk away with simple tools to get reading and enjoying Shakespeare on your own. Open yourself to one of the best in world literature, learn from his characterizations and storytelling, and see the magic that has kept his work alive for over 400 years. No prior experience needed. Just bring your curiosity and a pencil and we'll bring the fun! Since seats are limited, we request you to  register here  to reserve your spot.",
    "url": "https://champaca.in/blogs/events/cracking-open-shakespeare-an-interactive-reading-workshop-24-january-10am-champaca-bookstore-indiranagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/cracking-open-shakespeare-an-interactive-reading-workshop-24-january-10am-champaca-bookstore-indiranagar?variant=41857465024547",
        "price": "750",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "LiteraryEvent",
    "name": "Read Aloud and Activity: Rain Perfume – Monsoon Magic with Boondi",
    "startDate": "2026-01-10T00:00:00+05:30",
    "endDate": "2026-01-10T02:00:00+05:30",
    "description": "This January, join us at our Indiranagar store for a sensory storytelling session inspired by  Rain Perfume  by Niveditha Reddy, illustrated by Shubshree Mathur. Children will step into Boondi’s world of rain, Thatha, and that familiar wet-earth smell many of us love. As they listen to the story of how Boondi finds a way to share the joy of the first rain with her grandfather, they’ll move like rain-loving creatures, solve small puzzles, play with the sounds of thunder and raindrops, and respond to the monsoon through simple art activities. Date:  Saturday, 10 January 2026   Time:  11:00 AM onwards   Venue:  Champaca Bookstore, Indiranagar   Age group:  4–8 years Rain Perfume , published by Kalpavriksh, follows Boondi, a little girl who adores the smell of rain and wants to share it with her bedridden Thatha. It’s a gentle story about love, intergenerational bonds, and noticing the quiet but powerful changes nature brings with the monsoon. The book captures the scent of wet soil, small family rituals around rain, and the way children often notice what adults overlook. At the event, children will hear the story read aloud and then explore its ideas through play, art, and conversation. Niveditha is an engineer-turned-writer who discovered her love for storytelling while spinning tales for her young son. Inspired by her travels and everyday encounters, she writes regularly for children’s magazines across genres, with stories that help young readers connect with themselves and the world around them. As seating is limited, please  RSVP here  to book your spot.  ",
    "url": "https://champaca.in/blogs/events/read-aloud-and-activity-rain-perfume-monsoon-magic-with-boond-champaca-bookstore-indiranagar-saturday-10-january-2026-11-am-onwards",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/read-aloud-and-activity-rain-perfume-monsoon-magic-with-boond-champaca-bookstore-indiranagar-saturday-10-january-2026-11-am-onwards?variant=41845769142307",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "India Street Lettering: Book Launch with Pooja Saxena and Nia Thandapani at Champaca Vasanth Nagar",
    "startDate": "2026-01-17T00:00:00+05:30",
    "endDate": "2026-01-17T02:00:00+05:30",
    "description": "We are delighted to host the launch of   India Street Lettering: A Journey Through Typographic Craft & Culture   by typeface designer and lettering artist   Pooja Saxena , in conversation with design historian and graphic designer   Nia Thandapani ,   at Champaca Vasanthnagar. Drawing from over a decade of documentation and research,   India Street Lettering   is a 200-page hardcover, full-colour book that showcases striking public lettering from across Indian cities in paint, relief, mosaic, neon, wood and more. It brings together photographs, essays and interviews that trace how shopfronts, hand-painted signs and vernacular letterforms tell stories about language, labour, design and everyday life in India’s streets. At Champaca, Pooja and Nia will talk about building this archive of signs, the collaborations and fieldwork that shaped the book, and what it means to argue for street lettering as part of the design canon. The evening will also explore the politics of the urban visual landscape, questions of preservation in the age of vinyl and digital printing, and how designers might learn from the ingenuity of sign painters and local lettering traditions. Date:   January 17, 2026, Saturday Time:   6:00 PM onwards Venue:   Champaca Bookstore, Vasanth Nagar Champaca is only accessible through stairs. Pooja Saxena  is a typeface designer, lettering artist and typographer. She is best known for her work with Indic scripts and her writing on locally rooted typographic cultures. Pooja is a devoted collector of ephemera and chronicler of street lettering. Since 2017, she has maintained an online archive of letterforms on public signs around the country. Nia Thandapani   is an independent design historian and practising graphic designer and book maker based in Bangalore. Her work spans colonial and post-independence design history in India and the United Kingdom, with a focus on how questions of power, coloniality and public memory play out in museums, heritage spaces and design practice today. Seats are limited, so please   RSVP here   to save your spot:",
    "url": "https://champaca.in/blogs/events/india-street-lettering-book-launch-with-pooja-saxena-and-nia-thandapani-at-champaca-vasanth-nagar-17-january-2026-6pm-onwards",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/india-street-lettering-book-launch-with-pooja-saxena-and-nia-thandapani-at-champaca-vasanth-nagar-17-january-2026-6pm-onwards?_pos=1&_sid=2a2d33ac1&_ss=r&variant=41845726281763",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Screenings: Stories on the Page, Stories on the Screen",
    "startDate": "2026-01-11T00:00:00+05:30",
    "endDate": "2026-01-11T02:00:00+05:30",
    "description": "Champaca is excited to host  Book Screenings , a workshop that brings together books and films to think about how stories build the places we inhabit. Three cities, one afternoon of watching, reading and talking about how medium shapes meaning. Book Screenings pairs three books with three films to explore the same place through different lenses. Over the course of the session, we will move between page and screen to ask how writers and filmmakers choose to show a city, a neighbourhood, a life. We will screen clips, read short excerpts and discuss how narrative choices, framing, sound and silence work alongside (or against) what the text is doing. The workshop will also touch on questions of whose stories get told, and how form itself can be political. The three pairings for this edition are: Strange Weather in Tokyo   by Hiromi Kawakami and   Lost in Translation   (Japan) Roman Stories   by Jhumpa Lahiri and   The Bicycle Thief   (Italy) Hour of the Star   by Clarice Lispector and   Hour of the Star   (Brazil) Book Screenings is for readers, film lovers and anyone curious about how stories shape the worlds we think we know. You do not need to have read all the books or watched all the films in advance; the facilitators will guide you through key scenes and passages. Come prepared to watch closely, listen carefully and join in a relaxed, participatory conversation about medium, place and storytelling. The workshop is facilitated by   Rahul Gautam , a director, cinematographer and acting coach with over 15 years of experience working with moving images, and   Pallavi Prasad , a journalist, writer and editor who has spent more than a decade working with words. Together, they bring their perspectives from film and publishing into the room, opening up questions about craft, collaboration and how different mediums invite us to see the same story in new ways. Date:  Sunday, 11 January 2026 Time:  11–12:30 PM Venue:  Champaca Bookstore, Indiranagar Fee:  INR 1599 (Includes a INR 599 Champaca voucher redeemable on books.) Seats are limited. Please  RSVP here  to save your spot! No refunds or cancellations.",
    "url": "https://champaca.in/blogs/events/book-screenings-stories-on-the-page-stories-on-the-screen-11-january-2026-champaca-indiranagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-screenings-stories-on-the-page-stories-on-the-screen-11-january-2026-champaca-indiranagar?variant=41843879542819",
        "price": "1599",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book discussion: Days at the Morisaki Bookshop and More Days at the Morisaki Bookshop with Satoshi Yagisawa and Shinie Antony",
    "startDate": "2026-01-20T19:00:00+05:30",
    "endDate": "2026-01-20T21:00:00+05:30",
    "description": "Champaca is delighted to host an evening with   Satoshi Yagisawa , the author of the much-loved novel   Days at the Morisaki Bookshop , in conversation with writer and festival director   Shinie Antony .  Set in a second-hand bookshop in Tokyo’s Jinbocho district,   Days at the Morisaki Bookshop   has found readers all over the world who recognise the comfort of shelves, regular customers, and a room above the store where life can begin again. At Champaca,  Satoshi Yagisawa  will speak about writing these worlds of cosy bookshops and deeply felt relationships, the sequel   More Days at the Morisaki Bookshop , and the ways in which stories about ordinary days can carry great emotional weight. The conversation will be moderated by Shinie Antony, and will be followed by an audience Q&A and book signing. Date:  20 January 2026 Time:  7 PM onwards Venue:  Champaca Bookstore, Vasanth Nagar Seats are limited, so please  RSVP here  to save your spot. Days at the Morisaki Bookshop   follows Takako, a young woman whose life has come undone, as she moves into the cramped room above her uncle’s second-hand bookshop and slowly finds her way back to herself through books, routine and community. It is a gentle, hopeful novel about heartbreak, healing and the solace of a familiar corner in a bookstore. In   More Days at the Morisaki Bookshop ,  Yagisawa  returns to Jinbocho to spend more time with Takako, her family and the world of the shop, deepening the themes of connection, change and the small rituals that give shape to a life. Together, the two books create a tender portrait of people held together by stories and by a beloved neighbourhood bookshop. Satoshi Yagisawa  was born in Chiba, Japan, in 1977, and has become known internationally for his Morisaki bookshop novels.   Days at the Morisaki Bookshop , his debut, was first published in 2009 and went on to win the Chiyoda Literature Prize before reaching a wide global readership in translation. Shinie Antony is  the author of several novels and short story collections and is the curator of the Bangalore Literature Festival. Her work is known for its insight, dark humour, and emotional honesty, and she brings her signature wit and empathy to every literary conversation.",
    "url": "https://champaca.in/blogs/events/book-discussion-days-at-the-morisaki-bookshop-and-more-days-at-the-morisaki-bookshop-with-satoshi-yagisawa-and-shinie-antony-20-january-7pm-onwards-champaca-vasanth-nagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-days-at-the-morisaki-bookshop-and-more-days-at-the-morisaki-bookshop-with-satoshi-yagisawa-and-shinie-antony-20-january-7pm-onwards-champaca-vasanth-nagar?variant=41843621199907",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]