[
  {
    "@type": "EducationEvent",
    "name": "Journalling For Self Expression: Workshop with Shruti Parthasarathy | 14 July, 11 AM",
    "startDate": "2024-07-14T11:00:00+05:30",
    "endDate": "2024-07-14T13:00:00+05:30",
    "description": "Join us for a workshop on journalling for self expression. The workshop will be led by Shruti Parthasarathy. Here are some details about the event:  What is JOURNALLING? - Journaling is a form of self -expression, like dancing, singing, sketching etc. - Journaling can be an individual and group activity. - There are various types of journaling - Prompt Based Journaling, Bullet journaling, Sprint Journaling, Diary entry, Letter writing, Doodle Journaling etc. - You can journal on a daily, weekly, monthly, yearly basis or whenever you feel like. During the session we will work on *PROMPT* based *JOURNALLING*. - On the day of the session, you will be given a bunch of prompts to choose from. (A prompt can be a quote, text, visual, audio cue, a question etc, that pushes you to think in a certain direction) - You will have to pick one, and write wherever that prompt takes you. - You can write how ever little or much you would like to.   We shall also discuss the benefits of journaling & how to maintain a journal. How does this help? - To provide healthy outlets of emotional expression - To develop a habit of writing/journaling - To tap into your creative side - Let’s you recenter and/or set goals If you are a novice and have always thought about writing or maintaining a journal, then this workshop is a great place to start. \n This workshop is for you if you : 1.⁠ ⁠Have always wanted to try journaling, but couldn't get into the habit. 2.⁠ ⁠Have wondered about journaling 3.⁠ ⁠Have been overwhelmed with everything happening around you 4.⁠ ⁠Find it hard to manage your emotions and the little things 5.⁠ ⁠Enjoy writing, listening or being part of communities \n What you need: If you are old school : A journal and/or pen/pencil If you like to go digital : Your phone/tablet/laptop and your fingers What this workshop is NOT : - This workshop is not about good grammar, or English, or about testing your skills as a writer. - It is not therapy, but it can be therapeutic. Other Details: When - 14th July, 11 AM Where - Champaca, Bangalore You can RSVP here. About the Host : Shruti  Parthasarathy is a writer, photographer, filmmaker and avid journaller. She is an alumni of Satyajit Ray Film and Television Institute. She has conducted creative writing, photography, and journaling workshops and been associated with companies like IBM, Bosch, Schlumberger, Bajaj Auto, Harness and Aruba to name a few. She believes that everything one does is a reflection of the people, place and time one lives in. Journaling has helped her grow as an individual and as a writer. The heaps of journals she has written on is a testament to that! ",
    "url": "https://champaca.in/blogs/events/journalling-for-self-expression-workshop-with-shruti-parthasarathy-14-july-11-am-1",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/journalling-workshop-with-shruti-parthasarathy-14-july-11-am?variant=40495855435811",
        "price": "1099",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book discussion with Lakshmi Swaminathan and Chitra Vishwanath: A Call to Return : A Journey with Didi Contractor | 13 July, 5 PM",
    "startDate": "2024-07-13T17:00:00+05:30",
    "endDate": "2024-07-13T19:00:00+05:30",
    "description": "Tune into this conversation between author Lakshmi Swaminathan and architect Chitra Vishwanath as they discuss the extraordinary life of Didi Contractor. This discussion will cover Lakshmi's experience of compiling and editing the life and values of Didi Contractor, in her latest book A CALL TO RETURN: A JOURNEY WITH DIDI CONTRACTOR .This book is published by Banyan Tree, an alternative book publisher known for publishing books on farming, food, non-formal education, small scale economy, alternative architecture and so on.  You can RSVP here.  About the speakers:  Lakshmi Swaminathan Lakshmi  Swaminathan is an architect from Chennai. After graduation, she worked in a conventional architecture office, taught in design schools, and pursued her passion for khadi textiles through weaving and block printing. In 2017, seeking inspiration for her own practice, she came to Kangra valley to spend a day with Didi in 2017. She ended up living with her for the next four years, and assisting her on multiple projects. Currently,  Lakshmi  lives in Tiruvannamalai where she continues her independent architectural practice, undertaking projects in earthen building techniques. She also focuses on disseminating Didi's work through different publications.  Chitra Vishwanath Chitra Vishwanath is the founder and senior architect at Biome Environmental Solutions- an architectural firm based in Bangalore. Biome Environmental Solutions is a multidisciplinary firm working on ecological architecture and intelligent water and sanitation designs, and through their work they strive to showcase that an ecological design practice can be mainstream and relevant in various contexts, including geography, typology and scale, balanced by the client’s aspirations for aesthetics, functionality and budget.  Details of the event are as follows:  Date- 13 July  Time- 5 PM Venue- Champaca Bookstore ",
    "url": "https://champaca.in/blogs/events/book-discussion-with-lakshmi-swaminathan-and-chitra-vishwanath-a-call-to-return-a-journey-with-didi-contractor-13-july-5-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-with-lakshmi-swaminathan-and-chitra-vishwanath-a-call-to-return-a-journey-with-didi-contractor-13-july-5-pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Seagull Week: Book launch of 'To Break and to Branch' by Ranjit Hoskote with Mani Rao | 29 June, 5 PM",
    "startDate": "2024-06-29T17:00:00+05:30",
    "endDate": "2024-06-29T19:00:00+05:30",
    "description": "We're ending the Seagull week at Champaca bookstore with a book launch and discussion of 'To Break and to Branch' by Ranjit Hoskote with Mani Rao.  The details of the event are as follows: Date- 29 June Time- 5 PM Venue- Champaca Bookstore You can  RSVP  on this link.    About the book:  \n \n To Break and to Branch  is a collection of six essays on the artist Gieve Patel (1940–2023), written by poet, cultural theorist, and curator Ranjit Hoskote over nearly two decades, gathered together for the first time and accompanied by over fifty illustrations of Patel’s paintings. In an introductory essay written especially for this edition, Hoskote looks back over the long friendship he shared with Patel, contextualizing it within the vibrant artistic milieu that was once special to Bombay, their home city: a milieu premised on a mutual curiosity that brought the arts together, hospitable to poetry, painting, theater, cinema, music, and architecture.   Hoskote’s writings trace both the constant preoccupations and the changing interests that gave Patel’s art its distinctive character and reflect on the aesthetic, philosophical, and political dimensions of Patel’s gradual movement from a human-centric understanding of the world to a more holistic view as generated and sustained by interrelationships across orders of being. \n \n",
    "url": "https://champaca.in/blogs/events/seagull-week-book-launch-of-to-break-and-to-branch-by-ranjit-hoskote-with-mani-rao-29-june-5-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-of-to-break-and-to-branch-by-ranjit-hoskote-with-mani-rao-29-june-5-pm?variant=40477745676323",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]