[
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch: The Only City with Jeet Thayil, Dharini Bhaskar and Anindita Ghose",
    "startDate": "2025-12-20T19:00:00+05:30",
    "endDate": "2025-12-20T21:00:00+05:30",
    "description": "We are delighted to host the launch of   The Only City: Bombay in Eighteen Stories   at Champaca Bookstore, Indiranagar. Edited by writer and journalist  Anindita Ghose , this new anthology collects eighteen short stories that capture Bombay through many lives and vantage points. Join us for an evening of readings and conversation with  Jeet Thayil ,  Dharini Bhaskar  and  Anindita Ghose  as they talk about writing the city, its memories and its myths. The event will be followed by a book signing, and you can pick up your copy of   The Only City   at the store. Here are the details for the event: Date:   Saturday, 20 December Time:   7 PM onwards Venue:   Champaca Bookstore, Indiranagar Seats are limited, so do   RSVP to save your spot ! About the Book: Bombay is financial capital, home to film studios, mill lands, sea fronts and crowded trains, and is always in motion.   The Only City   brings together eighteen new short stories that follow many of its inhabitants, from runaway teenagers and immigrant nurses to writers, artists and film workers, each carrying their own fragment of the city. Through these voices, the book reflects a Bombay that can be tender, harsh, strange and deeply familiar all at once. About the Editor: Anindita Ghose  is a writer, journalist and communications consultant based in Bombay, and the author of the novel   The Illuminated . She was previously editor of the Saturday magazine   Mint Lounge , has worked in strategic communications for a global social impact consultancy, and has studied journalism and linguistics at Columbia University and the University of Mumbai. She conceived, commissioned and edited   The Only City , which also includes a short story by her. About the Speakers: Dharini Bhaskar  is the author of   These, Our Bodies, Possessed by Light , shortlisted for the JCB Prize for Literature and the Literature Live! Award, and   Like Being Alive Twice . She is associate publisher, literary, at HarperCollins India. A St Xavier’s College alumnus, she left Bombay in her twenties but keeps returning to the city, where her parents live and where her son and many of her animals were born. Jeet Thayil  is a poet, novelist, librettist and musician. His novel   Narcopolis   was shortlisted for the Booker Prize and won the DSC Prize, and his collection   These Errors are Correct   received the Sahitya Akademi Award. His latest poetry collection   I’ll Have it Here   has won the Sarojini Naidu Award and the Kalinga Literary Award, and his new novel is   The Elsewhereans . Jeet Thayil is a Bombayite who now lives elsewhere.",
    "url": "https://champaca.in/blogs/events/book-launch-the-only-city-with-jeet-thayil-dharini-bhaskar-and-anindita-ghose-20-december-7pm-onwards-champaca-indiranagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-the-only-city-with-jeet-thayil-dharini-bhaskar-and-anindita-ghose-20-december-7pm-onwards-champaca-indiranagar?variant=41500573466659",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch: River Traveller with Sanjoy Hazarika, moderated by Harini Nagendra",
    "startDate": "2025-12-21T18:00:00+05:30",
    "endDate": "2025-12-21T20:00:00+05:30",
    "description": "We are delighted to host the Bangalore launch of   River Traveller: Journeys on the Tsangpo Brahmaputra from Tibet to the Bay of Bengal   by  Sanjoy Hazarika  at Champaca Bookstore. Join us for an engaging evening where Sanjoy will be in conversation with ecologist and writer  Harini Nagendra . The event offers a chance to hear about decades of travel along the Brahmaputra, and the making of a book that brings together history, reportage and personal stories from Tibet, Arunachal Pradesh, Assam and Bangladesh. Mark your calendars and bring your questions about rivers, politics, borders and the lives that unfold along one of the world’s great waterways. The discussion will be followed by a book signing. Here are the details for the event: Date:   21 December 2025, Sunday Time:   6PM Venue:   Champaca Bookstore, Vasanthnagar Seats are limited, so do   RSVP here to save your spot ! About the Book: River Traveller   follows the Brahmaputra from its glacial origins in Tibet, through the gorges of Arunachal Pradesh and the floodplains of Assam, to its wide delta in Bangladesh. Sanjoy Hazarika weaves together historical research, political observation and travel writing, reflecting on extremism, environmental responsibility, disasters and resilience along the river’s course. The book includes photographs and on ground accounts that offer a close view of how people live with a river that both sustains and destroys. About the Speakers: Sanjoy Hazarika  is a journalist, researcher and activist who has reported widely from North East India and South Asia. He is the author of books including   Strangers of the Mist   and   Strangers No More , and has also made documentaries on the Brahmaputra, conflict, governance and wildlife. Harini Nagendra  is an ecologist and professor at Azim Premji University, whose work focuses on urban sustainability and conservation. She is the author of   Nature in the City ,   Cities and Canopies   and the   Bangalore Detectives Club   mysteries, and writes regularly on science, climate and cities for a wide readership.",
    "url": "https://champaca.in/blogs/events/book-launch-river-traveller-with-sanjoy-hazarika-moderated-by-harini-nagendra-21-december-6pm-onwards-champaca-vasanthnagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-river-traveller-with-sanjoy-hazarika-moderated-by-harini-nagendra-21-december-6pm-onwards-champaca-vasanthnagar?variant=41500433907747",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Secret Santa Social: Champaca x Copper + Cloves x Love Me Twice. A Little Festive Mix-Up at our Shared Space in Indiranagar",
    "startDate": "2025-12-20T19:00:00+05:30",
    "endDate": "2025-12-20T21:00:00+05:30",
    "description": "Secret Santa can be a gentle, thoughtful way to close the year, especially when it brings together books, thrifted finds and something good to sip. This December, Champaca, Copper + Cloves and Love Me Twice are hosting a cosy evening at our shared space in Indiranagar. Inviting you to experience our take on Secret Santa, where Champaca’s shelves, Love Me Twice’s one of a kind finds and Copper + Cloves’ plant based food turn a simple festive gifting tradition into slow conversations, careful gifting and time spent in a lived bungalow with people who love books, thrift and good food as much as you do, and where you might just meet a buddy for many seasons to come.  How it works We open with a few light icebreakers led by Radhika Timbadia from Champaca and Mridula Pai from Love Me Twice to help everyone settle in and ease into conversation. Once everyone is comfortable, the Secret Santa begins. You pick a chit, find your buddy and talk for a few minutes to get a sense of what they enjoy. Then follows the fascinating task of choosing a present for your new friend from Champaca’s collection of books and an array of thrifted pieces at Love Me Twice. There is something joyful about picking a present for someone you have just met. You get to make a small, thoughtful choice for them and you also leave with a gift chosen for you. Event Details  Date: 12 December  Time: 7:00 PM to 8:30 PM  Venue: Champaca Bookstore, Indiranagar, Bengaluru  Ticket: INR 999. This includes a drink and a Secret Santa gift worth INR 799. Spots are limited, and registration is required in advance.  Register Here. Cover Charges  Your ticket charge is INR 999. Of this, INR 799 goes towards the Secret Santa gift selected for your match. The remaining amount covers a drink from Copper + Cloves, the plant based café in the shared space. You are free to wander between bookshelves and thrift racks with your drink in hand while looking for the right gift. No cancellations or refunds once registered.",
    "url": "https://champaca.in/blogs/events/secret-santa-social-champaca-x-copper-cloves-x-love-me-twice-a-little-festive-mix-up-at-our-shared-space-in-indiranagar-12-december-7-00-pm-to-8-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/secret-santa-social-champaca-x-copper-cloves-x-love-me-twice-a-little-festive-mix-up-at-our-shared-space-in-indiranagar-12-december-7-00-pm-to-8-30-pm?variant=41498382172195",
        "price": "999",
        "priceCurrency": "INR"
      }
    ]
  }
]