[
  {
    "@type": "LiteraryEvent",
    "name": "Crime Book Swap at The Biere Club | 16 May at 5:30 PM",
    "startDate": "2024-05-16T17:30:00+05:30",
    "description": "Join us at The Biere Club for a thrilling book swap event tailored for all crime fiction enthusiasts! This time, let's exchange puzzling clues and exciting plot twists, and celebrate the art of storytelling within our community. You can  RSVP  to the event here.    Come by to exchange books, and don't forget to explore our curated collection of Crime Bestsellers. Let's spread the love for crime stories together! Here are the details-  DAY- 16 MAY, THURSDAY TIME- 5:30 PM  VENUE: THE BIERE CLUB  ",
    "url": "https://champaca.in/blogs/events/crime-book-swap-at-the-biere-club-16-may-at-5-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/crime-book-swap-16-may-5-30-pm-the-biere-club?variant=40422794723363",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Instagram discussion with Manish Gaekwad on THE LAST COURTESAN | 5 May 12:00 PM",
    "startDate": "2024-05-05T12:00:00+05:30",
    "description": "Tune into Manish Gaekwad in conversation with Kavya Murthy as they delve into the pages of Manish's book THE LAST COURTESAN. Join us for an insightful discussion about this poignant memoir, where he shares his mother's remarkable tale of resilience in the kothas of Calcutta.  Featured in our Champaca Book Subscription for April, this book garnered quite a lot of conversations and we are eager to hear your  thoughts and address any questions you may have after reading this powerful narrative. Mark your calendars for this engaging conversation on Instagram Live! DETAILS  5 MAY, SUNDAY  12:00 PM,  INSTAGRAM   ",
    "url": "https://champaca.in/blogs/events/instagram-discussion-with-manish-gaekwad-on-the-last-courtesan-5-may-12-00-pm",
    "offers": []
  },
  {
    "@type": "Event",
    "name": "Build-a-book with Pustakala | 10:30 AM, 19 May, Sunday",
    "startDate": "2024-05-19T10:30:00+05:30",
    "description": "This book-making workshop by   Pustakala   is a carefully crafted, skill-focused experience in the art of book-making. Join us as participants collaborate, experiment, and discover how to repurpose and transform everyday household items into beautifully crafted journals and notebooks! In this workshop you will learn: - How to build basic book structures - Two elaborate ways to stitch your own books - Two fun ways to make folding/sticking books - How to customise notebooks and journals You won't need any materials.  We're looking at a total of 6-8 people, so book your seats before they're sold out! You can  RSVP   here.    Saachi   is an artist, educator, and designer with over 5 years of industry experience.",
    "url": "https://champaca.in/blogs/events/build-a-book-with-pustakala-10-30-am-19-may-sunday",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/build-a-book-with-pustakala-10-30-am-19-may-sunday?variant=40422727581731",
        "price": "2500",
        "priceCurrency": "INR"
      }
    ]
  }
]