[
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion on THE BLAFT ANTHOLOGY OF GUJARATI PULP FICTION with Vishwambhari S Parmar and Rakesh Khanna in conversation with Zac O’Yeah",
    "startDate": "2025-07-26T18:00:00+05:30",
    "endDate": "2025-07-26T20:00:00+05:30",
    "description": "Join us on Saturday, 26 July, as we dive into the wild, weird, sometimes shocking, but always entertaining world of  THE BLAFT ANTHOLOGY OF GUJARATI PULP FICTION . Translator Vishwambhari S. Parmar and editor Rakesh Khanna will be in conversation with Zac O’Yeah, as they give us a sneak peek into the delightful short stories and novellas in this anthology. Here are the details of the event:  Date :  26 July 2025, Saturday Time :  6PM Venue :  Champaca Bookstore, Vasanth Nagar Since there is limited seating, RSVP to  confirm your spot soon!   About the book:  A rollicking, rip-roaring ride through the world of Gujarati pulp! This collection of short stories and novellas from Gujarat's bestselling adventure, horror, and mystery writers includes Kaal Kundali by H.N. \"Atom\" Golibar, known for his supernatural-tinged crime thrillers; Varunlokma by Bansidhar Shukla, which features genetically-altered mermen in a secret undersea empire; two stories by Ekta Nirav Doshi, famous for her folk horror about khavis and haunted forts; Bar Dancer by Vibhavari Varma, a revenge fantasy set in the Mumbai underworld (read an excerpt of the translation  here !); and a story by Kanu Baghdev, one of the most prolific Gujarati writers of all time.  About the speakers:  Vishwambhari S. Parmar   hails from Baroda, Gujarat, and currently lives in Bengaluru. The curator and translator of this anthology, she grew up reading Gujarati literature and loves pulp fiction precisely for its unrealistic and sensational narratives, which she finds refreshingly liberating, and immensely entertaining.  Rakesh Khanna   is a co-founder of Blaft Publications and a California native with a background in mathematics education. In addition to this anthology, he has edited  THE BLAFT ANTHOLOGY OF TAMIL PULP FICTION  series, and is the co-author of  GHOSTS, MONSTERS, AND DEMONS OF INDIA , an encyclopædia of folkloric fiends from all over the country.  Moderating the session is  Zac O’Yeah , a Bengaluru-based author originally from Sweden. He has written over twenty books which have been widely translated in India and elsewhere, and is best known for the  MAJESTIC TRILOGY , a series of detective stories set in Bengaluru. He also writes about travel and food, and dabbles in theatre and music. ",
    "url": "https://champaca.in/blogs/events/book-discussion-on-the-blaft-anthology-of-gujarati-pulp-fiction-with-vishwambhari-s-parmar-and-rakesh-khanna-in-conversation-with-zac-o-yeah-champaca-vasanth-nagar-26-july-6pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-on-the-blaft-anthology-of-gujarati-pulp-fiction-with-vishwambhari-s-parmar-and-rakesh-khanna-in-conversation-with-zac-o-yeah-champaca-vasanth-nagar-26-july-6pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch of Into the Leopard’s Den by Harini Nagendra, in conversation with Ramjee Chandran",
    "startDate": "2025-07-27T18:00:00+05:30",
    "endDate": "2025-07-27T20:00:00+05:30",
    "description": "We’re delighted to invite you to the launch of  INTO THE LEOPARD’S DEN  by Harini Nagendra, the much-awaited continuation of the beloved BANGALORE DETECTIVES CLUB series. Harini will be in conversation with writer and podcaster Ramjee Chandran. Here are the event details: Date:  27 July 2025, Sunday Time:  6:00PM Venue:  Champaca Bookstore, Vasanth Nagar ( Champaca is accessible only by stairs) Since there is limited seating, we recommend that you  RSVP to confirm your spot! About the book: Set in 1920s Bangalore and the misty hills of Coorg, INTO THE LEOPARD’S DEN follows amateur detective Kaveri Murthy as she faces her most intricate investigation yet. Confined to her home due to pregnancy and her mother-in-law’s watchful eye, Kaveri is drawn back into sleuthing when an elderly woman dies clutching a photograph of her and pleading for help. What begins as a single murder leads her into a tangled web of secrets stretching from Bangalore’s bungalows to Coorg’s coffee plantations. With her husband Ramu away in Coorg, and aided by her loyal companions Venu and Anandi, Kaveri uncovers sinister happenings involving a ghost leopard, an attempt on the life of the Coffee King of Coorg, and multiple murders. Emotionally invested after a plea from two vulnerable children, Kaveri races against time to stop a cold-blooded killer in this gripping continuation of  THE BANGALORE DETECTIVES CLUB  series. About the Speakers: Harini Nagendra , a professor of ecology at Azim Premji University, is a well-respected scholar on sustainability. Her impressive body of work includes the award-winning  NATURE IN THE CITY: BENGALURU IN THE PAST, PRESENT, AND FUTURE , and co-authored books like  CITIES AND CANOPIES: TREES IN INDIAN CITIES , which won the 2020 Publishing Next Award for Best Non-Fiction Book. Harini’s work has been internationally recognised, and she has made an indelible impact on both academic circles and the general public. Her debut crime novel,  THE BANGALORE DETECTIVES CLUB , has been followed by sequels, including  MURDER UNDER A RED MOON  and  A NEST OF VIPERS , and now is the new book which is a continuation. Ramjee Chandran  is a journalist, author, and media entrepreneur. He is the host of  THE LITERARY CITY  podcast — featuring conversations with acclaimed writers, and  THE HISTORY OF BANGALORE  podcast. A long-time magazine publisher and writer, he brings decades of experience to his fiction. He is currently working on his next book,  THE HISTORY OF BANGALORE , a meticulously researched narrative tracing the region’s history from prehistoric times to the present. He also plays jazz guitar at the professional level. He recently released a book titled  FOR NO REASON AT ALL .",
    "url": "https://champaca.in/blogs/events/book-launch-of-into-the-leopard-s-den-by-harini-nagendra-in-conversation-with-ramjee-chandran-champaca-vasanth-nagar-27-july-6-00pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-of-into-the-leopard-s-den-by-harini-nagendra-in-conversation-with-ramjee-chandran-champaca-vasanth-nagar-27-july-6-00pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]