[
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: INVISIBLE EMPIRE | Pranay Lal in conversation with Thejaswi Shivanand | 23 October 6 PM",
    "startDate": "2024-10-23T18:00:00+05:30",
    "endDate": "2024-10-23T20:00:00+05:30",
    "description": " Join Pranay Lal in conversation with Thejaswi Shivanand as they discuss INVISIBLE EMPIRE: THE NATURAL HISTORY OF VIRUSES and INDICA: A DEEP NATURAL HISTORY OF THE INDIAN SUBCONTINENT.  The details of the event are as follows:  DATE- 23 OCTOBER, 2024 TIME- 6 PM Kindly  RSVP  here since there will be limited seating.  About the speakers  Pranay Lal is a biochemist by training and works for a non-profit organisation on public health. He has been a caricaturist for newspapers, an animator for an advertising agency and an environmental campaigner. His first book, INDICA: A DEEP NATURAL HISTORY OF THE INDIAN SUBCONTINENT was published by Allen Lane in December 2016 which won the best non-fiction debut award at the Tata Lit Fest in Mumbai in 2017, the best book award at the Delhi Book Fair 2017, and was named among the top 10 memorable books of the year by Amazon and The Hindu’s non-fiction list of 2017.   \n \n Thejaswi Shivanand  is currently a library educator and curator of books at Champaca Bookstore and Children’s Library, Bengaluru. At Champaca, he has been a regular part of the book club discussions and hosted several events with authors over the past five years. He also currently works with schools and library-focused organisations across India in the professional development space to nurture and support the growth of communities of readers, and has been part of initiating and sustaining book-related communities for the past eighteen years. \n \n When Thejaswi Shivanand began reading in childhood, the Indian tectonic plate was farther away from the Eurasian plate by 66 cm. He likes to track the consequences of this plate movement during annual hikes in the Himalayas and other landscapes of geological interest while continuing to read history, geology, natural history, music, picture books and much fiction while in Bangalore. \n \n \n \n \n About the books:  \n \n \n INVISIBLE EMPIRE: THE NATURAL HISTORY OF VIRUSES \n \n \n Viruses are the world’s most abundant life form, and now, when humanity is in the midst of a close encounter with their immense power, perhaps the most feared. But do we understand viruses? Possibly the most enigmatic of living things, they are sometimes not considered a life form at all. Everything about them is extreme, including the reactions they evoke. However, for every truism about viruses, the opposite is also often true. So complex and diverse is the world of viruses that it merits being labelled an empire unto itself. And whether we see them as alive or dead, as life-threatening or life-affirming, there is an ineluctable beauty, even a certain elegance, in the way viruses go about their lives – or so Pranay Lal tells us in  Invisible Empire: The Natural History of Viruses . \n This is a book that defies categorisation. It brings together science, history and great storytelling to paint a fascinating picture of viruses as a major actor, not just in human civilisation but also in the human body. With rare photographs, paintings, illustrations and anecdotes, it is a magnificent and an extremely relevant book for our times, when we are attempting to understand viruses and examining their role in the lives of humans. \n \n \n INDICA: A DEEP NATURAL HISTORY OF THE INDIAN SUBCONTINENT  \n \n \n Did you know that the exquisite caves of Ellora were hewn from rock formed in the greatest lava floods the world has known—eruptions so enormous that they may well have obliterated dinosaurs? Or that Bengaluru owes its unique climate to a tectonic event that took place 88 million years ago? That the Ganga and Brahmaputra sequester nearly 20 percent of global carbon, and their sediments over millions of years have etched submarine canyons in the Bay of Bengal that are larger than the Grand Canyon? Ever heard of Rajasaurus, an Indian dinosaur which was perhaps more ferocious than T-rex? Many such amazing facts and discoveries—from 70-million-year-old crocodile eggs in Mumbai to the nesting ground of dinosaurs near Ahmedabad—are a part of  Indica: A Deep Natural History of the Indian Subcontinent . \n Researching across wide-ranging scientific disciplines and traveling with scientists all over the country, biochemist Pranay Lal has woven together the first compelling narrative of India’s deep natural history, filled with fierce reptiles, fantastic dinosaurs, gargantuan mammals and amazing plants. This story, which includes a rare collection of images, illustrations, and maps, arts at the very beginning—from the time when a galactic swirl of dust coalesced to become our life-giving planet—and ends with the arrival of our ancestors on the banks of the Indus. Pranay Lal tells this story with verve, lucidity and an infectious enthusiasm that comes from his deep, abiding love of nature. \n \n",
    "url": "https://champaca.in/blogs/events/book-discussion-invisible-empire-pranay-lal-in-conversation-with-thejaswi-shivanand-23-october-6-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-invisible-empire-pranay-lal-in-conversation-with-thejaswi-shivanand-23-october-6-pm?variant=40597604925475",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]