[
  {
    "@type": "LiteraryEvent",
    "name": "Politics & Culture: A workshop led by V. Geetha from Tara Books | 26 January, 9:45 AM to 12:30 PM",
    "startDate": "2025-01-26T09:45:00+05:30",
    "endDate": "2025-01-26T11:45:00+05:30",
    "description": "Join us at the bookstore this Republic Day and be a part of an engaging workshop led by V. Geetha from Tara Books. At this workshop we will be discussing books on politics and culture. You can buy tickets for the workshop on  this link.  Here is what the morning will look like-  Kickstarting the event with an introduction of the theme: 9:45 AM Discuss the theme in the first book- A POTTER'S TALE: 10 AM  Activity based on the first theme discussed: 10:20 AM Sharing the activity and exchanging feedback: 10:45 AM \n \n <Break> \n Discuss the theme in the second book- ANOTHER HISTORY OF THE CHILDREN'S PICTUREBOOK: 11:15 AM  \n Activity based on the theme discussed: 11:30 AM \n Sharing the activity and exchanging feedback: 11: 50 AM \n \n Closing note: 12:10 PM \n \n \n \n \n Things to keep in mind-  \n \n 1. We will be discussing two books- A POTTER'S TALE and ANOTHER HISTORY OF THE CHILDREN'S PICTUREBOOK.  \n 2. We are looking at a maximum number of 20 participants in this workshop.  \n 3. The workshop is priced at 1500 INR.  \n 4. Participants will get a special discount on the books discussed in the workshop.  \n \n Looking forward to seeing you at the workshop! Do purchase a ticket to confirm your presence.  \n",
    "url": "https://champaca.in/blogs/events/politics-culture-a-workshop-led-by-v-geetha-from-tara-books-26-january-9-45-am-to-12-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/politics-culture-a-workshop-led-by-v-geetha-from-tara-books-26-january-9-45-am-to-12-30-pm?variant=40692180058147",
        "price": "1500",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "IN PURSUIT OF FREEDOM: Pradeep Damodaran in conversation with Subir Dey | 18 January, 5 PM",
    "startDate": "2025-01-18T17:00:00+05:30",
    "endDate": "2025-01-18T19:00:00+05:30",
    "description": "Join us at the bookstore for a conversation with Pradeep Damodaran and Subir Dey. They will be discussing Pradeep's latest book IN PURSUIT OF FREEDOM.  Pradeep Damodaran travels the length and breadth of the country, to places that played an important role in the Independence movement. A genre-bending book, IN PURSUIT OF FREEDOM touches upon several critical issues—religion, economic disparity, gender, environment, politics—as it blends travelogue, history and current affairs. The event details are as follows:  DATE- 18th January 2025  TIME- 5 PM RSVP here  to confirm your presence.  About the speakers  Pradeep Damodaran  is the author of the critically acclaimed BORDERLANDS, which was shortlisted for the Raymond Crossword Book Award for Non-fiction in 2017. His first book THE MULLAPERIYAR WATER WAR was published in 2015. Subir Dey   taught at Indraprastha College for Women as an Assistant Professor in the Department of History from July 2017 to May 2019, after which he joined Azim Premji University in 2021.   He has an   MA , MPhil and PhD degrees in Modern Indian History from the Centre for Historical Studies ( CHS ), Jawaharlal Nehru University, New Delhi. ",
    "url": "https://champaca.in/blogs/events/in-pursuit-of-freedom-pradeep-damodaran-in-conversation-with-subir-dey-18-january-5-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/in-pursuit-of-freedom-pradeep-damodaran-in-conversation-with-subir-dey-18-january-5-pm?variant=40690547294243",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]