[
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch: The Great Nicobar Betrayal, curated by Pankaj Sekhsaria | 9 June, 5PM at Champaca Bookstore",
    "startDate": "2024-06-09T17:00:00+05:30",
    "description": "Join us for a book launch of THE GREAT NICOBAR BETRAYAL and tune into the discussion between Pankaj Sekhsaria and Samar Halarnkar as they discuss the contemporary issues that threaten to destroy the Andaman and Nicobar Islands. The book is a catalogue of the manmade catastrophe that lurks on the horizon, and the discussion promises to be an insightful one.  THE GREAT NICOBAR BETRAYAL is a Frontline Publication.  About the speakers:  Pankaj Sekhsaria is the author/editor of 6 books on the Andaman and Nicobar islands and has spent 20 years covering the region as a journalist.  Samar Halarnkar an author, founder-editor of Article 14 , and a columnist for Scroll.in. He is also cofounder of the India Love Project.      Details of the event: Date: Sunday, 9 June  Time: 5 PM  Venue: Champaca Bookstore     RSVP here   to confirm your presence. ",
    "url": "https://champaca.in/blogs/events/book-launch-the-great-nicobar-betrayal-curated-by-pankaj-sekhsaria-9-june-5pm-at-champaca-bookstore",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-the-great-nicobar-betrayal-curated-by-pankaj-sekhsaria-9-june-5pm-at-champaca-bookstore?variant=40465677385763",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "We're Turning 5 and Everyone's Invited!",
    "startDate": "2024-06-05T00:00:00+05:30",
    "description": "We are so excited to invite you to the celebration of our 5th birthday! It's been 5 great years of running this independent bookstore and we're super grateful for your support that has helped us reach this milestone.  Make your way to our bookstore in Bangalore this Saturday, 8th June to be part of the festivities. We are super excited to meet our patrons and well-wishers on our big day.  How to party with us-  📘 Explore and buy our favourite books! 📕 Bring all your questions about curation and bookstores, we're here to talk!  📘Meet the entire team at our bookstore- including our advisory committee!  📕Ask for personalised book recommendations, we're all about sharing our love for stories!  💚 Don't forget to get your books stamped by us.  📖 We're also hosting a quiz all about books and literature by Berty Ashley. You can confirm your participation on this  RSVP  link.  🎂 It's our birthday, we're all eating cake! Event details  Date: Saturday, 8th June Time: 10 AM to 8 PM  Venue: Champaca Bookstore    We're looking forward to a special celebration this June!  ",
    "url": "https://champaca.in/blogs/events/were-turning-5-and-everyones-invited",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/our-5th-birthday-quiz-with-berty-ashley?variant=40465594155043",
        "price": "100",
        "priceCurrency": "INR"
      }
    ]
  }
]