[
  {
    "@type": "Event",
    "name": "CHAMPACA X DK BOOKS: DINOSAUR DAY",
    "startDate": "2025-06-28T10:30:00+05:30",
    "endDate": "2025-06-28T12:30:00+05:30",
    "description": "In collaboration with DK Books, join us on Saturday, 28 June, at our cosy Indiranagar space for DK Dinosaur Day— a roaring adventure into the world of prehistoric giants! Dive into an epic story from our specially curated collection of dino books, enjoy fun-filled games and DIY activities, and test your inner paleontologist with a thrilling quiz. Children are sure to enjoy this exciting morning full of fun, stories, and learning. Here are the details of the event: Date:   28 June 2025, Saturday  Time:   10:30AM - 12:00PM Venue:   Champaca Bookstore, Indiranagar Age Group:   5-8 years Since there is limited seating, we recommend that you  confirm your spot soon! About DK Books: We’re thrilled to be hosting this event in collaboration with DK Books. DK is a leading publisher known for creating beautifully designed, visually engaging, and fact-filled books for readers of all ages, covering everything from science and history to nature, learning, and beyond. With a strong commitment to inspiring curiosity and making learning fun, DK has become a trusted name among educators, parents, and young readers across the world. DK is bringing the excitement of dinosaurs to life with events happening across the globe in celebration of these ancient creatures. About the facilitators:  Ivy Sengupta   is Managing Art Editor for the Children's team at DK. A designer at heart, she loves to interact with kids to hear their stories, get inspired by their energy and out-of-the-box thinking. Radhika Haswani   is a Senior Editor who is passionate about reading, writing, travelling, baking delicious treats, and creating fun children’s books, especially dinosaur books.",
    "url": "https://champaca.in/blogs/events/champaca-x-dk-books-dinosaur-day-champaca-indiranagar-28-june-10-30am",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/champaca-x-dk-books-dinosaur-day-champaca-indiranagar-28-june-10-30am",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch of HOW TO FORGET by Meera Ganapathi with Joshua Muyiwa",
    "startDate": "2025-06-29T18:00:00+05:30",
    "endDate": "2025-06-29T20:00:00+05:30",
    "description": "Join us on Sunday, 29 June, for the launch of Meera Ganapathi’s new book  HOW TO FORGET: A BOOK OF SHORT STEPS AND LONG WALKS , a gentle, lyrical exploration of the act of walking, and how it helps us lose and find ourselves. Meera will be in conversation with Joshua Muyiwa, and the discussion promises to be profound and insightful—perhaps in unexpected ways. Here are the details of the event:  Date:  29 June 2025, Sunday Time:   6:00PM Venue:   Champaca Bookstore, Vasanth Nagar Since there is limited seating, we recommend that you  confirm your spot  soon. About the book:  In spare and lucid lines of poetry and prose,  How to Forget  takes the reader on a walk through childhood, love, loss and longing. Told through memory and impressions both personal and communal, the book chronicles lifetimes through the act of walking. These journeys often follow the same paths but end in unexpected conclusions. An elephant wanders through tea estates in the Nilgiris, a woman confronts the night, prawns are tossed in chilli oil, a childhood is lost and solitude is found in fifty-five walks across cities and timelines. With gentle and insightful observations, Ganapathi offers soothing respite from the chaos of our cities and the clamour of our thoughts. About the speakers: Meera Ganapathi  is a former advertising professional, and the founder and editor of the literary and arts publication, The Soup. She has written various books for children, like  THE GIRL WHO COULD NOT STOP LAUGHING, UMA VS UPMA, A FRIEND FOR POOCHI  and  PAATI VS UNCLE .  Her poems and short stories have appeared in several anthologies, including,  CAT PEOPLE  and  A CASE OF INDIAN MARVELS: DAZZLING SHORT STORIES BY INDIA'S FINEST WRITERS . Meera lives in Goa with her baby, her partner and her misunderstood cat, Apple. Moderating the session is  Joshua Muyiwa , a Bangalore-based poet and freelance writer, editor and columnist. He has written for publications like The Week, Tehelka, Bangalore Mirror, Firstpost, Mint Lounge, Conde Nast Traveller, and the Hindu Business Line amongst others. His poems have appeared in  POETRY WITH PRAKRITI, THE WORLD THAT BELONGS TO US: AN ANTHOLOGY OF QUEER POETRY FROM SOUTH ASIA  and  elsewhere. He is always looking for different ways to present, perform, and play with his poems. ",
    "url": "https://champaca.in/blogs/events/book-launch-of-how-to-forget-by-meera-ganapathi-with-joshua-muyiwa-champaca-vasanth-nagar-29-june-6-00pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-of-how-to-forget-by-meera-ganapathi-with-joshua-muyiwa-champaca-vasanth-nagar-29-june-6-00pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Tasting: Champaca Bookstore X Copper + Cloves",
    "startDate": "2025-06-27T19:30:00+05:30",
    "endDate": "2025-06-27T21:30:00+05:30",
    "description": "What if you could  taste  a book before reading it? Not just read the blurb, but actually sample its mood, voice, and texture? Just like a spoonful of soup or a bite of dessert, giving you a sense of what’s to come. Welcome to BOOK TASTING, a collaboration between Champaca and Copper + Clove, where food and literature come together to create an unforgettable, sensory journey. In this special event, we’re exploring Sri Lanka, Japan, and Spain through both carefully chosen books and cuisine. With each course- an appetiser, a main, and a dessert, you'll also get a curated  “taste”  of a book from that region: a short reading, a guided discussion, and space to reflect. Whether it’s a lyrical opening chapter, a compelling excerpt, or a vivid scene- you’ll sample a story, just enough to awaken your curiosity and expand your bookshelf. What’s on the menu? 3 book excerpts selected by Radhika Timbadia (Champaca), to match each course Curated dishes prepared by Sarah Nicole Edwards (Copper + Clove) A 3-course plant-based meal inspired by Sri Lanka, Japan, and Spain Guided conversation and reflection after each course INR 999 redeemable on books you discover and fall in love with Date : 20 June, 2025 Time : 7:30 PM Location : Champaca Bookstore, Indiranagar Ticket : INR 1999 (INR1000 for food, INR 999 fully redeemable on books) Spots are limited – reserve your seat soon!  RSVP now",
    "url": "https://champaca.in/blogs/events/book-tasting-champaca-bookstore-x-copper-cloves-20-july-2025-friday-7-30-pm-champaca-bookstore-indirnagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/champaca-bookstore-x-copper-cloves-book-tasting-20-july-2025-friday-7-30-pm-champaca-bookstore-indirnagar",
        "price": "1999",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: THE BEAST WITHIN by Rudraneil Sengupta. The author in conversation with Sharda Ugra at Champaca Bookstore, Vasanth Nagar",
    "startDate": "2025-06-22T17:30:00+05:30",
    "endDate": "2025-06-22T19:30:00+05:30",
    "description": "We’re delighted to host author Rudraneil Sengupta at Champaca for the book discussion of his new book,  THE BEAST WITHIN . The discussion will be a conversation between Rudraneil and journalist Sharda Ugra, as they dive into the themes of the book- crime, caste, identity, and the many layers of life in Delhi. Here are the details of the event: Date:  21 June 2025, Saturday Time :  5:30PM Venue :  Champaca Bookstore, Vasanth Nagar Since there is limited seating, we recommend that you confirm your spot soon -  RSVP here! About the book: THE BEAST WITHIN  takes readers into the murky, complex world of the Delhi Police and the many political and social layers of the city. Written with the insight of years spent reporting from within the force, Rudraneil Sengupta brings to life a compelling, gritty narrative that reads like a binge-worthy crime procedural. The book explores caste, regionalism, identity politics, power, grief, and the divides that mark Delhi’s landscape—from Outer Delhi to its elite South. At its heart,  THE BEAST WITHIN  is a gripping examination of the machinery and human cost of policing in India. About the speakers: Rudraneil Sengupta  is an Indian journalist and author, best known for his work in sports journalism and his acclaimed book  Enter the Dangal: Travels through India’s Wrestling Landscape . Formerly the deputy editor of Lounge, the weekly feature magazine of  Mint , his journalistic work has explored gender, human rights, and the social complexities of contemporary India. Sharda Ugra  has been a powerful voice in Indian sports journalism for over two decades, with a career spanning Mid-Day, The Hindu, and India Today. She has written for Radio Australia, contributed to research projects by the British Sports Council, and is a recipient of awards from the Sports Journalists Federation of India. She also co-authored  John Wright’s Indian Summers , the memoir of the former New Zealand cricket captain.",
    "url": "https://champaca.in/blogs/events/book-discussion-the-beast-within-by-rudraneil-sengupta-the-author-in-conversation-with-sharda-ugra-at-champaca-bookstore-vasanth-nagar-21-june-2025-saturday-5-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-the-beast-within-by-rudraneil-sengupta-the-author-conversation-with-sharda-ugra-at-champaca-bookstore-vasanth-nagar-21-june-2025-saturday-5-30-pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]