[
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: INTERSTELLAR MEGACHEF with Lavanya Lakshminarayan and Shrabonti Bagchi | 23 November, 5 PM",
    "startDate": "2024-11-23T17:00:00+05:30",
    "endDate": "2024-11-23T19:00:00+05:30",
    "description": "Join us at the bookstore to tune into this conversation between Lavanya Lakshminarayan and Shrabonti Bagchi as they discuss Lavanya's latest science-fiction novel,  INTERSTELLAR MEGACHEF.  The event details are as follows:  DATE: 23 NOVEMBER, SATURDAY TIME: 5 PM VENUE: CHAMPACA BOOKSTORE  Since there is limited seating, we recommend you to   RSVP  here to confirm your presence!  About the book Stepping off a long-haul star freighter from Earth, Saras Kaveri has one bag of clothes, her little flying robot Kili... and an invitation to compete in the galaxy's most watched, most prestigious cooking show.  Interstellar MegaChef  is the showcase of the planet Primus's austere, carefully synthesised cuisine. No one from Earth where they're so incredibly primitive they still cook with  fire   has ever graced its flowmetal cookstations before, or smiled awkwardly for its buzzing drone-cams. Until now. Corporate prodigy Serenity Ko, inventor of the smash-hit sim SoundSpace, has just got messily drunk at a floating bar, narrowly escaped an angry mob and been put on two weeks' mandatory leave to rest and get her work-life balance back. Perfect time to start a new project! And she's got just the idea: a sim for  food.  Now she just needs someone to teach her how to cook. A chance meeting in the back of a flying cab has Saras and Serenity Ko working together on a new technology that could change the future of food--and both their lives forever! About the speakers Lavanya Lakshminarayan  is the author of THE TEN PERCENT THIEF. She’s the first Indian woman to be shortlisted for the prestigious Arthur C. Clarke Award, and is currently a finalist for the Subjective Chaos Kind of Award. She's also a Locus Award finalist, and the winner of the Times of India AutHer Award and the Valley of Words Award. Her short fiction has appeared in a number of magazines and anthologies, including THE BIG BOOK OF CYBERPUNK and THE BEST OF WORLD SF: VOLUME 2. Lavanya is occasionally a game designer, and has built worlds for Zynga Inc.’s  FarmVille  and  Mafia Wars , among other games.  Shrabonti Bagchi  is a journalist and reviewer. She currently writes for Mint Lounge, a weekly magazine of art, culture, books and lifestyle. ",
    "url": "https://champaca.in/blogs/events/book-discussion-interstellar-megachef-with-lavanya-lakshminarayan-and-shrabonti-bagchi-23-november-5-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/interstellar-megachef-pre-order?_pos=1&_sid=9efc9e339&_ss=r&variant=40618065428515",
        "price": "599",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-interstellar-megachef-with-lavanya-lakshminarayan-and-shrabonti-bagchi-23-november-5-pm?variant=40627547504675",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]