[
  {
    "@type": "LiteraryEvent",
    "name": "Silent Journeys: Book Launch with Benyamin and Karthik Venkatesh",
    "startDate": "2025-10-12T00:00:00+05:30",
    "endDate": "2025-10-12T02:00:00+05:30",
    "description": "What of the many travels undertaken through history by men and women—through war and peace—that have remained unrecorded, forgotten, and silent? This October, we invite you to the launch of  Benyamin’s  latest novel,  Silent Journeys , a sparkling chronicle of Kerala’s pioneering women. Benyamin’s  Silent Journeys  brings one such story to life, exploring the remarkable lives of women whose travels shaped communities and inspired generations. In  Silent Journeys , we follow Mariamma, a young nurse from Manthalir, Kerala, whose remarkable journey in the 1940s was uncovered decades later by her inquisitive great-grandson. Her story is emblematic of the courage, resilience, and determination of countless women whose adventures have gone unheard. Part quest, part epistolary narrative, the novel brings these unsung protagonists to life through the power of fiction.  Here are the event Details:   Date:  12 October 2025, Sunday   Time:  6:00 PM   Venue:  Champaca Bookstore, Vasanth Nagar Since the seating is limited,  sign up here! About the Book:   Silent Journeys  follows Mariamma’s extraordinary path from Kerala to the farthest reaches of the world in the 1940s. A story of adventure, hardship, resilience, and love,  Silent Journeys  illuminates the lives of these silent pioneers and brings their legacy into the light. Through her experiences, the novel honors the brave, unaccompanied women whose travels have remained unrecorded. About the Speakers:  Benyamin  is an acclaimed Malayalam author, whose novel  Aadu Jeevitham  ( Goat Days ) won the Kerala Sahitya Akademi Award in 2009 and was shortlisted for the DSC Prize in South Asian Literature in 2013. In 2018, he won the inaugural JCB Prize for Literature for  Mullapoo Niramulla Pakalukal  ( Jasmine Days ). Benyamin’s work is celebrated for its compelling storytelling, exploration of human resilience, and deep engagement with social and cultural histories. Karthik Venkatesh  is a literary curator and cultural commentator who has hosted numerous book launches, discussions, and literary festivals across India. With a deep passion for storytelling, Karthik brings authors and readers together to explore the layers of narrative, history, and imagination in contemporary literature.",
    "url": "https://champaca.in/blogs/events/silent-journeys-book-launch-with-benyamin-and-karthik-venkatesh-october-12-2025-champaca-bookstore-vasanth-nagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/silent-journeys-book-launch-with-benyamin-and-karthik-venkatesh-october-12-2025-champaca-bookstore-vasanth-nagar?variant=40963263660067",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Koko’s Colours of India Read Aloud with Akhila Das Blah",
    "startDate": "2025-10-11T00:00:00+05:30",
    "endDate": "2025-10-11T02:00:00+05:30",
    "description": "Some stories delight little ones while also planting the seeds of big ideas.  Koko’s Colours of India  is one such story—a playful yet profound picture book that celebrates self-confidence, individuality, and the rich hues of India. This October, we’re bringing  Koko’s Colours of India  off the page with a special  read aloud at our Indiranagar store . It’s a chance for children to listen, imagine, and engage with Koko’s world of colour.  Here are the event details:    Date:  11 October 2025 (Saturday)   Time:  11:00 AM   Venue:  Champaca Bookstore, Indiranagar   Age:  4–6 years Since the seating is limited, we recommend that you  sign up here! About the Book:  In this beautifully illustrated tale, a little crow named Koko sets out to discover the vibrant colours of his country. Along the way, he learns to embrace his own black feathers, showing young readers that every shade has its own beauty. Written by  Akhila Das Blah  and illustrated by  Vimal Chandran , the book is designed for children aged 3–7 years and comes with interactive elements like puzzles and cards, making it a playful and engaging experience that extends beyond the page. Through Koko’s story, young readers are encouraged to appreciate themselves, their surroundings, and the rich cultural palette of India. About the Speaker: Akhila Das Blah  is the founder of First Adda and co-founder of Indigrow Kids, with over 20 years of experience in early childhood education. An entrepreneur deeply committed to child-focused, value-driven businesses, her career spans education, teacher training, curriculum design, play-led experiences, drama productions, NGO initiatives, corporate partnerships, and brand building. She has worked across grassroots organisations and global corporations, always driven by the belief that early childhood experiences lay the foundation for lifelong success.",
    "url": "https://champaca.in/blogs/events/koko-s-colours-of-india-read-aloud-with-akhila-das-blah-october-11-2025-champaca-bookstore-indiranagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/koko-s-colours-of-india-read-aloud-with-akhila-das-blah-october-11-2025-champaca-bookstore-indiranagar?variant=40963224600611",
        "price": "0",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/koko-s-colours-of-india-read-aloud-with-akhila-das-blah-october-11-2025-champaca-bookstore-indiranagar?variant=40963224600611",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Between Worlds: Book Discussion moderated by Gautam Bhatia with Suchitra Sukumar, Priyamvadha Shivaji, and Srividya Tadepalli",
    "startDate": "2025-10-19T00:00:00+05:30",
    "endDate": "2025-10-19T02:00:00+05:30",
    "description": "Join us on 19th October, for a discussion on  Between Worlds , a groundbreaking anthology of Indian science fiction and fantasy. The evening will feature a panel discussion with the editor and contributing authors, exploring the vibrant and diverse voices shaping the future of SFF writing in India. Here are the details: Date:  19 October 2025 Time:  6:00 PM Venue:  Champaca Bookstore, Vasanth Nagar Since seats are limited, we recommend you  sign up here! About the Book: Between Worlds  is the introductory Indian speculative fiction anthology of new SFF writing. Eschewing the model of commissioning stories to collect a “best of,” this anthology seeks to ask, with curiosity: what’s out there? Thoughtfully curated and shepherded by  Gautam Bhatia , it showcases the vibrant and diverse voices shaping Indian speculative fiction today. Blending the surreal with the urgent, these original stories traverse memory and identity, rebellion and love, from queer inter-species romance to interplanetary sleuthing. Alongside the fantastical, the collection confronts the very real—climate catastrophe, AI, surveillance and capitalism—offering bold, unexpected visions from the liminal spaces of Indian SF. About the Speakers: Gautam Bhatia  is a writer, reviewer and editor based in New Delhi, India. He is the author of  The Sentence , and the science fiction duology,  The Wall  and  The Horizon , and the coordinating editor of the science fiction magazine  Strange Horizons . In his other life, he is a constitutional lawyer and public commentator on civil and constitutional rights in India. Suchitra Sukumar  is a self-taught writer based in Bangalore, India. She has published short fiction in the  Bombay Literary Magazine ,  Mean Pepper Vine  and  Tasavvurnama , and is currently working on a fantasy novel. She juggles her time between writing and a full-time job. Priyamvadha Shivaji  grew up on Chennai's beaches, dreaming about strange worlds beyond the horizon. She spends her time working as a human rights lawyer and policy researcher, and devouring fantasy stories along with endless bowls of Maggi and cups of cold coffee. Srividya Tadepalli  is a writer based in Chennai. She won the Deodar Prize in 2023 for her story,  Funeral for a Demon . Prashanth Srivatsa  is the author of The Spice Gate, a standalone fantasy novel published by HarperCollins. The Spice Gate was a finalist for the Locus Award and a UK Sunday Times Bestseller. He lives in Bangalore with his partner and two cats.",
    "url": "https://champaca.in/blogs/events/between-worlds-book-discussion-moderated-by-gautam-bhatia-with-suchitra-sukumar-priyamvadha-shivaji-and-srividya-tadepalli-19-oct-2025-champaca-vasanth-nagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/between-worlds-book-discussion-moderated-by-gautam-bhatia?variant=40957778919459",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "EducationEvent",
    "name": "Heart Lamp Workshop",
    "startDate": "2025-10-05T00:00:00+05:30",
    "endDate": "2025-10-05T02:00:00+05:30",
    "description": "Some books stay with you long after you’ve turned the last page.  Heart Lamp , the International Booker Prize–winning anthology by Banu Mushtaq, is one of those rare works. It makes you think and it makes you feel—drawing you into the lived experiences of Indian Muslim women, while also inviting you to reflect on your own world. This October, we’re bringing  Heart Lamp  off the page and into our lives with an interactive workshop on the idea of  freedom  at our Indiranagar store.  But this isn’t your usual book discussion. Instead, we’ll explore three of the anthology’s most powerful stories through music, art, and storytelling. It’s a chance to step away from screens, share perspectives, and spend a Sunday morning in meaningful conversation with fellow readers. No prior prep is needed—just pick up your copy of  Heart Lamp  at Champaca before the workshop.  Here are the event details: Date:   Sunday, October 5th, 2025   Time :  10:30 AM – 12:30 PM   Venue:  Champaca Bookstore, Indiranagar  Age:  18+ Fee:  Rs.999/- (without a copy of the book) or Rs.1398/- (with a copy of the book) No prior prep is needed—just pick up your copy of  Heart Lamp  at Champaca before the workshop.  Since seats are limited, we recommend that you  sign up here !  About   SkilLit :  SkilLit Readers is an innovative educational initiative that transforms literature into a dynamic platform for developing real-world skills in children. Founded in 2024 by  Poorvaja Prakash  and  Srilakshmi R , SkilLit Readers offers a story-led skills lab where books become launchpads for critical thinking, creativity, and self-expression. Poorvaja Prakash Poorvaja has more than 12 years of experience in international development, social impact, facilitation, and research. She is a graduate of Columbia University (Teachers College), LSE, and Stella Maris, and has published in peer-reviewed journals. Srilakshmi R. Srilakshmi has over 12 years’ experience teaching English and Social Science in IB & ICSE schools. She studied at Azim Premji University and Christ University and is IB certified with a strong interest in children’s literature.",
    "url": "https://champaca.in/blogs/events/heart-lamp-workshop",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/heart-lamp-workshop?_pos=2&_sid=bb99c7fec&_ss=r&variant=40950400385059",
        "price": "999",
        "priceCurrency": "INR"
      }
    ]
  }
]