[
  {
    "@type": "EducationEvent",
    "name": "Stories at Play: A Hands-on Story-Building Workshop with Project DEFY",
    "startDate": "2026-02-14T00:00:00+05:30",
    "endDate": "2026-02-14T02:00:00+05:30",
    "description": "Join us at Champaca Bookstore, Indiranagar for  Stories at Play , a hands-on Story-Building workshop in collaboration with  Project DEFY . This session invites readers of all ages to spend a slow morning with stories, reading together, thinking aloud, and creating something new. It’s designed for anyone curious about how stories shape learning, imagination, and connection, without needing any prior writing or teaching experience. What to expect Participants will work in small mixed-age groups, reading a curated children’s book together and using it as a starting point to imagine new characters, worlds, and stories. Through simple prompts, each group will build a short, handmade children’s book. The session ends with a shared reflection on reading, learning, and what it feels like to build stories together. Stories at Play: Champaca x Project DEFY Date:  Saturday, 14 February Time:  11 AM onwards Venue:  Champaca Bookstore, Indiranagar Open to adults, children, families, educators, and anyone interested in stories and learning. For over a decade, Project DEFY has been working with communities to run learning spaces called Nooks, challenging conventional ideas of education and placing curiosity, agency, and collaboration at the centre of learning, for children and adults alike. The workshop is facilitated by  Radhika Ravikumar , who manages partnerships at Project DEFY. With close to seven years of experience in the social impact space, her work focuses on reimagining learning as creative, relational, and deeply human. A lifelong reader, she brings her love for stories and conversation into the way she facilitates learning. Seats are limited. We request you to  REGISTER HERE  to confirm your spot. Please note that there will be no refunds or cancellations. The ticket price will be used towards fundraising for Project DEFY.",
    "url": "https://champaca.in/blogs/events/stories-at-play-a-hands-on-story-building-workshop-with-project-defy-14-february-11am-onwards-champaca-indiranagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/stories-at-play-a-hands-on-story-building-workshop-with-project-defy-14-february-11am-onwards-champaca-indiranagar?variant=41889982808099",
        "price": "999",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "LiteraryEvent",
    "name": "Bombay Imagined: An illustrated talk by Robert Stephens",
    "startDate": "2026-02-13T18:00:00+05:30",
    "endDate": "2026-02-13T20:00:00+05:30",
    "description": "What if the cities we live in were shaped not only by what was built, but also by what was imagined and never realised? Bombay Imagined  is an illustrated talk that revisits Mumbai’s unbuilt past to explore what these forgotten ideas can still offer cities like Bangalore today. Drawing from ambitious but unrealised plans for housing, urban parks, water systems, public libraries, and civic infrastructure, the talk brings archival drawings together with contemporary speculation and artistic overlays to reveal alternate urban futures. It suggests that ideas never truly disappear, and that revisiting them can reshape how we think about cities in the present. The session will be led by architect and writer  Robert Stephens , author of  Bombay Imagined: An Illustrated History of the Unbuilt City . Having lived and worked in Mumbai for sixteen years, and now based in Bengaluru, Robert brings a perspective shaped by both cities. He is the founder of Urbs Indis, an architecture practice and publishing studio, and the creator of the Urbs Indis Library & Garden, a publicly accessible collection of rare books on urban India. Here are all the event details: Date:  Sunday, 1 February Time:  6 pm onwards Venue:  Champaca Bookstore, Vasanth Nagar Seats are limited, so we request you to  RSVP here  to save your spot.",
    "url": "https://champaca.in/blogs/events/bombay-imagined-an-illustrated-talk-by-robert-stephens-1-february-sunday-6-pm-onwards-champaca-bookstore-vasanth-nagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/bombay-imagined-an-illustrated-talk-by-robert-stephens-1-february-sunday-6-pm-onwards-champaca-bookstore-vasanth-nagar?variant=41872964190243",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]