[
  {
    "@type": "EducationEvent",
    "name": "Character and Night: Writing Ecology as Fact or Fiction",
    "startDate": "2025-08-24T00:00:00+05:30",
    "endDate": "2025-08-24T02:00:00+05:30",
    "description": "We’re excited to announce that we’ll be hosting acclaimed author Sonali Prasad’s workshop on uncovering stories in reportage, archives and articles and turning them into compelling character sketches and ecological narratives. Join us on 24th August at our Indiranagar bookstore to slow down and really look at the world and the stories that always surround us. Here are the details of the workshop:  Date : 24th August 2025, Sunday Time : 11AM - 1:00PM Venue : Champaca Bookstore, Indiranagar Fees : INR 1200 (including Sonali Prasad’s book, Glass Bottom) Since there are limited slots available, we encourage you to  sign up here! ABOUT THE EVENT: Where do stories come from? In the beginning, they were songs. Passed down, from generation to generation, they morphed and changed. Those with boundless imagination drew upon these stories, inventing new characters and situations, changing details and making retellings. Millennials passed, and five thousand years ago, we started writing our stories down. Tablets with engraved stories travelled across seas and mountains, reaching the hands of cultures so distant, stories felt alien and impossible. Perhaps they were even more valuable in foreign lands than in native ones, for in distant cultures, they inspired others to write stories that were new, weird and unique. That tradition has continued; in pre-civil war America, Margaret Garner, an African-American woman killed her daughter to save her from slavery. More than a century later, Toni Morrison came across a clipping from 1856, about Garner’s infanticide. Inspired by Garner’s story, she wrote her award winning masterpiece, Beloved. Many writers have drawn inspiration from other stories;  Carrie  was inspired  by an article  Stephen King read  about the possibility of telekinesis in young girls during puberty,  Susan Orlean's  The Orchid Thief  started with an article about the arrest of John Laroche, a plant dealer in Florida. In this workshop, Pulitzer Traveling Fellowship winner Sonali Prasad will teach attendees how to spot stories in the world around us through magazines, reports and testimonies and how to use them as launching pads for rich character studies and narrative structures. Using clips from her book,  Glass Bottom,  she will discuss working around the central questions in a story and how narrative journeys can help answer them. She will focus on ecological stories, and the interactions of humans with nature. About The Book : Glass Bottom :   Gul, Arth, Luni and Himmo live by the sea that bestows as much waste as wonder upon the shores. When a storm passes through their small town, the two mother-daughter pairs are pulled into a whirlwind of deep entanglements and hidden desires.Each of them is forced to confront the turbulence within and around themselves: Gul, tethered to the earth’s seismic murmurs, finds herself unravelling with the weather. Her daughter Arth grapples with the territories of personal and collective memory. Luni, threading her hopes and fears into her embroidery, tries to find solace amidst the chaos, while her daughter Himmo, drawn to the forbidden ocean, explores where her search and longing might take her. Set against the intractable Arabian Sea,  Glass Bottom  offers a profound and lyrical meditation on the ordinary and strange places we occupy, and the ties binding us to our planet and to each other. About the Author: Sonali Prasad  was born and raised in New Delhi, India. Her journalism has appeared in publications such as The Guardian, The Washington Post, Hakai Magazine, Quartz, and Esquire Singapore. She has been awarded a Pulitzer Traveling Fellowship, Global TED Fellowship, MIT Knight Science Journalism Fellowship, Logan Science Journalism Fellowship and a Jan Michalski Writing Residency, among other grants and honours. Her debut novel, Glass Bottom, was published by Picador India (2024), who called it their 'literary debut of the year'. It was listed in Telegraph India's 'The page turners of 2024: Fiction' and was shortlisted for the Kalinga Literary Festival Book Award in the category 'Debut (English)'.",
    "url": "https://champaca.in/blogs/events/character-and-night-writing-ecology-as-fact-or-fiction-writing-workshop-at-champaca-indiranagar-24-august-sunday-11-00-am",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/character-and-night-writing-ecology-as-fact-or-fiction-writing-workshop-at-champaca-indiranagar-24-august-sunday-11-00-am?variant=40913504141347",
        "price": "1200",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "EducationEvent",
    "name": "Book Restoration Workshop with David Timethy",
    "startDate": "2025-08-31T00:00:00+05:30",
    "endDate": "2025-08-31T02:00:00+05:30",
    "description": "In a world increasingly populated by and filtered through screens, the book is a source of unending comfort and joy: a physical, enduring presence that holds stories, art, and memories within its pages, and takes on a life of its own. Every old book, scrap of paper, and discarded box has potential—and this process of restoration and recycling celebrates imperfection, demystifies scarcity, and infuses sentiment into every step. We are thrilled to present an exciting workshop on book-making and book restoration with master bookbinder David Timethy, on 31 August 2025 at Champaca Indiranagar!  Join us for a chance to slow down, work with your hands, and rediscover the joy of creating something lasting. Here are the details of the workshop: Date:  31 August 2025, Sunday Time:  11AM - 1:00PM Venue:  Champaca Bookstore, Indiranagar Fees:  INR 1499 Since there are limited slots available, we encourage you to  sign up here!   About the workshop: The workshop blends practical skill-building along with a deeper appreciation for the book as a tactile, enduring object. Participants learn traditional bookbinding techniques while exploring how to repurpose and reimagine materials around them. The first half of the workshop will focus on repairing books through creative reuse of discarded materials and common household objects. In the second half, participants will learn how to make a notebook using upcycled materials and a hands-on approach, creating something that is aesthetically pleasing, useful, and sustainably crafted. About the facilitator:  David Timethy  is a bookbinder and paper artisan known for his thoughtful, hands-on approach to restoring and creating books. He has years of experience in reviving old, damaged books—carefully repairing spines, mending torn pages, and preserving the unique character of each volume. David also designs handbound journals and notebooks using upcycled and discarded materials to create beautiful, functional objects. A firm believer in sustainability, David’s craft goes beyond aesthetics—it’s a quiet celebration of resourcefulness and respect for materials. His papermaking practice reflects this, turning everyday waste into textured, meaningful sheets.",
    "url": "https://champaca.in/blogs/events/book-restoration-workshop-with-david-timethy-champaca-indiranagar-31-august-sunday-11-am",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-restoration-workshop-with-david-timethy-champaca-indiranagar-31-august-sunday-11-am?variant=40913472454691",
        "price": "1499",
        "priceCurrency": "INR"
      }
    ]
  }
]