[
  {
    "@type": "Event",
    "name": "Secret Santa Social: Champaca x Copper + Cloves x Love Me Twice. A Little Festive Mix-Up at our Shared Space in Indiranagar",
    "startDate": "2025-12-26T19:00:00+05:30",
    "endDate": "2025-12-26T21:00:00+05:30",
    "description": "Secret Santa can be a gentle, thoughtful way to close the year, especially when it brings together books, thrifted finds and something good to sip. This December, Champaca, Copper + Cloves and Love Me Twice are hosting a cosy evening at our shared space in Indiranagar. Inviting you to experience our take on Secret Santa, where Champaca’s shelves, Love Me Twice’s one of a kind finds and Copper + Cloves’ plant based food turn a simple festive gifting tradition into slow conversations, careful gifting and time spent in a lived bungalow with people who love books, thrift and good food as much as you do, and where you might just meet a buddy for many seasons to come.  How it works We open with a few light icebreakers led by Radhika Timbadia from Champaca and Mridula Pai from Love Me Twice to help everyone settle in and ease into conversation. Once everyone is comfortable, the Secret Santa begins. You pick a chit, find your buddy and talk for a few minutes to get a sense of what they enjoy. Then follows the fascinating task of choosing a present for your new friend from Champaca’s collection of books and an array of thrifted pieces at Love Me Twice. There is something joyful about picking a present for someone you have just met. You get to make a small, thoughtful choice for them and you also leave with a gift chosen for you. Event Details  Date: 12 December  Time: 7:00 PM to 8:30 PM  Venue: Champaca Bookstore, Indiranagar, Bengaluru  Ticket: INR 999. This includes a drink and a Secret Santa gift worth INR 799. Spots are limited, and registration is required in advance.  Register Here. Cover Charges  Your ticket charge is INR 999. Of this, INR 799 goes towards the Secret Santa gift selected for your match. The remaining amount covers a drink from Copper + Cloves, the plant based café in the shared space. You are free to wander between bookshelves and thrift racks with your drink in hand while looking for the right gift. No cancellations or refunds once registered.",
    "url": "https://champaca.in/blogs/events/secret-santa-social-champaca-x-copper-cloves-x-love-me-twice-a-little-festive-mix-up-at-our-shared-space-in-indiranagar-12-december-7-00-pm-to-8-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/secret-santa-social-champaca-x-copper-cloves-x-love-me-twice-a-little-festive-mix-up-at-our-shared-space-in-indiranagar-12-december-7-00-pm-to-8-30-pm?variant=41498382172195",
        "price": "999",
        "priceCurrency": "INR"
      }
    ]
  }
]