[
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch of ON THE BANKS OF THE PAMPA by Volga in conversation with Purnima Tammireddy and Chandan Gowda",
    "startDate": "2025-08-07T19:00:00+05:30",
    "endDate": "2025-08-07T21:00:00+05:30",
    "description": "We are delighted to announce the Bengaluru launch of Volga’s much-awaited new novel, ON THE BANKS OF THE PAMPA—a powerful and piercing retelling of a familiar episode from the Ramayana that invites us to read the epic differently. Join us on 7 August in our beautiful Indiranagar space for a stimulating and thought-provoking conversation, moderated by Purnima Tammireddy and Prof. Chandan Gowda. Here are the details of the event:  Date :  7th August 2025, Thursday Time :  7:00PM Venue :  Champaca Bookstore, Indiranagar Since there is limited seating, we recommend that you  RSVP soon ! About the book:  Sabari’s encounter with Rama is an important episode in the Ramayana. But who was Sabari, a forest-dweller who became Rama’s ardent devotee? In  On the Banks of the Pampa , award-winning writer Volga narrates the tale of Sabari, born of aranyavasis, once forced into slavery by a power-seeking state, which she breaks free from. It traces the journey of her spiritual awakening and birth into a voice of dissent for the oppressed and dispossessed. Sabari’s is a narrative entwined with the forest along the Pampa river – one she comes to dwell in and is at one with. Poignant and piercing, this concluding volume in Volga’s trilogy of feminist retellings of the Indian epics drives us to reconsider the meaning of dharma, and rejects ideologies that legitimize conquest and the exploitation of nature. Powerfully translated into English by Purnima Tammireddy, this is a story of resistance – a story for the times we live in, drawn from the classic tale we know so well. About the speakers:  Volga   is a writer, critic, translator and poet, who has been a forerunner in introducing a feminist perspective into the literary-political discourse of the Telugu-speaking states. She is best known for her feminist retellings of Indian epics,  The Liberation of Sita  and  Yashodhara , and her latest novel concludes this trilogy. Other notable works include her earlier novels  Sahaja  and  Sveccha , short story collections, feminist philosophy and literary criticism, and translations of Telugu works. She is the recipient of numerous awards including the Sahitya Akademi Award, and her work opened the floodgates for a host of women writers to articulate the doubts and confusions they experienced as women.  Purnima Tammireddy  is a writer, translator, and publisher, who currently lives in Bengaluru. She is the translator of  On the Banks of the Pampa , and has also translated works by Manto and Amrita Pritam into Telugu. She is also the author of the short-story collection  Emotional Pregnancy . She is the founder of Elami Publications, an independent Telugu publishing house, and co-founder of  pustakam.net , a website for book reviews. Moderating today's session is  Chandan Gowda   is a Professor of Sociology and the Dean of Vidyashilp University’s School of Liberal Arts. His areas of interest include Indian intellectual history and modern Kannada literature and cinema. He is the author of  Another India: Events, Memories, People,  and has edited and translated several works of Kannada literature, including an anthology of  The Greatest Kannada Stories Ever Told.  He has also contributed to columns in the Bangalore Mirror and Deccan Herald, among others.",
    "url": "https://champaca.in/blogs/events/book-launch-of-on-the-banks-of-the-pampa-by-volga-in-conversation-with-purnima-tammireddy-and-chandan-gowda-champaca-indiranagar-7-august-7-00pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-of-on-the-banks-of-the-pampa-by-volga-in-conversation-with-purnima-tammireddy-and-chandan-gowda-champaca-indiranagar-7-august-7-00pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Tasting: Champaca Bookstore X Broth Noodle Bar",
    "startDate": "2025-08-01T00:00:00+05:30",
    "endDate": "2025-08-01T02:00:00+05:30",
    "description": "What if you could  taste  a book before reading it? Not just skim the blurb, but truly sample its mood, voice, and texture? Welcome to Book Tasting  - a one-of-a-kind collaboration between  Champaca  and  Broth Noodle Bar , where food and literature come together in a multi-sensory journey. In this special edition, we travel to  Japan  through a thoughtfully paired menu and a curated selection of books. With each course - a steaming bowl of ramen and a matcha-inspired dessert - you’ll be served not only a meal, but also a “taste” of a story from the region: a short reading, a guided discussion, and space to reflect. Japan’s literary landscape pays attention to its locals - in either describing in vivid detail their domestic lives which sometimes serves as a meta-commentary on political issues, or in taking us to its more surreal corners. Thus one moment, you’re living with pages full of charming stories that feel both tender and comforting ; the next ; you’re confronted with strange metaphors that require you to vigorously exercise your imagination. In a way, literature from Japan is both energetic, gritty and enigmatic as its cities,  where neon skywalks co-exist with century old temples. We are delighted to be able to present a selection that offers a portrait of the same. What’s on the menu? Books selected by Radhika Timbadia (Champaca), to match each course Curated dishes prepared by BrothNoodlebar team  Kara Tonkotsu (Non-Veg Ramen) A 48-hour simmered pork bone broth served with thin-cut handmade noodles, chashu, soy egg, pickled radish, scallions, and shiitake mushrooms. The standout: Karadare, a house-made sauce crafted from slow-roasted local Byadgi chillies. Tan Tan Veggie Ramen A light vegetable stock enriched with soy milk and sesame paste, topped with spicy tofu crumble, pickled mustard greens, scallions, sesame seeds, and thin alkaline noodles. Dessert – Matcha White Chocolate Panna Cotta With a sesame-sea salt crumble, this panna cotta combines grassy matcha and smooth white chocolate with a crackle of texture and a touch of salt. Date : 01 August 2025 Time : 7:30 PM Location :  Kale- A Salad Symphony, Indiranagar Ticket : INR 1999 (INR1000 for food, INR 999 fully redeemable on books) PLEASE NOTE:   Our kitchen does not have the capacity to accommodate food allergies. Please review the ingredients carefully before registering. Spots are limited – reserve your seat soon!  RSVP now Let us know your food preferences here",
    "url": "https://champaca.in/blogs/events/book-tasting-champaca-bookstore-x-broth-noodle-bar-01-august-2025-friday-7-30-pm-kale-a-salad-symphony-indiranagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-tasting-champaca-bookstore-x-broth-noodle-bar-01-august-2025-friday-7-30-pm-kale-a-salad-symphony-indiranagar",
        "price": "1999",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion on THE BLAFT ANTHOLOGY OF GUJARATI PULP FICTION with Vishwambhari S Parmar and Rakesh Khanna in conversation with Zac O’Yeah",
    "startDate": "2025-07-26T18:00:00+05:30",
    "endDate": "2025-07-26T20:00:00+05:30",
    "description": "Join us on Saturday, 26 July, as we dive into the wild, weird, sometimes shocking, but always entertaining world of  THE BLAFT ANTHOLOGY OF GUJARATI PULP FICTION . Translator Vishwambhari S. Parmar and editor Rakesh Khanna will be in conversation with Zac O’Yeah, as they give us a sneak peek into the delightful short stories and novellas in this anthology. Here are the details of the event:  Date :  26 July 2025, Saturday Time :  6PM Venue :  Champaca Bookstore, Vasanth Nagar Since there is limited seating, RSVP to  confirm your spot soon!   About the book:  A rollicking, rip-roaring ride through the world of Gujarati pulp! This collection of short stories and novellas from Gujarat's bestselling adventure, horror, and mystery writers includes Kaal Kundali by H.N. \"Atom\" Golibar, known for his supernatural-tinged crime thrillers; Varunlokma by Bansidhar Shukla, which features genetically-altered mermen in a secret undersea empire; two stories by Ekta Nirav Doshi, famous for her folk horror about khavis and haunted forts; Bar Dancer by Vibhavari Varma, a revenge fantasy set in the Mumbai underworld (read an excerpt of the translation  here !); and a story by Kanu Baghdev, one of the most prolific Gujarati writers of all time.  About the speakers:  Vishwambhari S. Parmar   hails from Baroda, Gujarat, and currently lives in Bengaluru. The curator and translator of this anthology, she grew up reading Gujarati literature and loves pulp fiction precisely for its unrealistic and sensational narratives, which she finds refreshingly liberating, and immensely entertaining.  Rakesh Khanna   is a co-founder of Blaft Publications and a California native with a background in mathematics education. In addition to this anthology, he has edited  THE BLAFT ANTHOLOGY OF TAMIL PULP FICTION  series, and is the co-author of  GHOSTS, MONSTERS, AND DEMONS OF INDIA , an encyclopædia of folkloric fiends from all over the country.  Moderating the session is  Zac O’Yeah , a Bengaluru-based author originally from Sweden. He has written over twenty books which have been widely translated in India and elsewhere, and is best known for the  MAJESTIC TRILOGY , a series of detective stories set in Bengaluru. He also writes about travel and food, and dabbles in theatre and music. ",
    "url": "https://champaca.in/blogs/events/book-discussion-on-the-blaft-anthology-of-gujarati-pulp-fiction-with-vishwambhari-s-parmar-and-rakesh-khanna-in-conversation-with-zac-o-yeah-champaca-vasanth-nagar-26-july-6pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-on-the-blaft-anthology-of-gujarati-pulp-fiction-with-vishwambhari-s-parmar-and-rakesh-khanna-in-conversation-with-zac-o-yeah-champaca-vasanth-nagar-26-july-6pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch of Into the Leopard’s Den by Harini Nagendra, in conversation with Ramjee Chandran",
    "startDate": "2025-07-27T18:00:00+05:30",
    "endDate": "2025-07-27T20:00:00+05:30",
    "description": "We’re delighted to invite you to the launch of  INTO THE LEOPARD’S DEN  by Harini Nagendra, the much-awaited continuation of the beloved BANGALORE DETECTIVES CLUB series. Harini will be in conversation with writer and podcaster Ramjee Chandran. Here are the event details: Date:  27 July 2025, Sunday Time:  6:00PM Venue:  Champaca Bookstore, Vasanth Nagar ( Champaca is accessible only by stairs) Since there is limited seating, we recommend that you  RSVP to confirm your spot! About the book: Set in 1920s Bangalore and the misty hills of Coorg, INTO THE LEOPARD’S DEN follows amateur detective Kaveri Murthy as she faces her most intricate investigation yet. Confined to her home due to pregnancy and her mother-in-law’s watchful eye, Kaveri is drawn back into sleuthing when an elderly woman dies clutching a photograph of her and pleading for help. What begins as a single murder leads her into a tangled web of secrets stretching from Bangalore’s bungalows to Coorg’s coffee plantations. With her husband Ramu away in Coorg, and aided by her loyal companions Venu and Anandi, Kaveri uncovers sinister happenings involving a ghost leopard, an attempt on the life of the Coffee King of Coorg, and multiple murders. Emotionally invested after a plea from two vulnerable children, Kaveri races against time to stop a cold-blooded killer in this gripping continuation of  THE BANGALORE DETECTIVES CLUB  series. About the Speakers: Harini Nagendra , a professor of ecology at Azim Premji University, is a well-respected scholar on sustainability. Her impressive body of work includes the award-winning  NATURE IN THE CITY: BENGALURU IN THE PAST, PRESENT, AND FUTURE , and co-authored books like  CITIES AND CANOPIES: TREES IN INDIAN CITIES , which won the 2020 Publishing Next Award for Best Non-Fiction Book. Harini’s work has been internationally recognised, and she has made an indelible impact on both academic circles and the general public. Her debut crime novel,  THE BANGALORE DETECTIVES CLUB , has been followed by sequels, including  MURDER UNDER A RED MOON  and  A NEST OF VIPERS , and now is the new book which is a continuation. Ramjee Chandran  is a journalist, author, and media entrepreneur. He is the host of  THE LITERARY CITY  podcast — featuring conversations with acclaimed writers, and  THE HISTORY OF BANGALORE  podcast. A long-time magazine publisher and writer, he brings decades of experience to his fiction. He is currently working on his next book,  THE HISTORY OF BANGALORE , a meticulously researched narrative tracing the region’s history from prehistoric times to the present. He also plays jazz guitar at the professional level. He recently released a book titled  FOR NO REASON AT ALL .",
    "url": "https://champaca.in/blogs/events/book-launch-of-into-the-leopard-s-den-by-harini-nagendra-in-conversation-with-ramjee-chandran-champaca-vasanth-nagar-27-july-6-00pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-of-into-the-leopard-s-den-by-harini-nagendra-in-conversation-with-ramjee-chandran-champaca-vasanth-nagar-27-july-6-00pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]