[
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: INTERSTELLAR MEGACHEF with Lavanya Lakshminarayan and Shrabonti Bagchi | 23 November, 5 PM",
    "startDate": "2024-11-23T17:00:00+05:30",
    "endDate": "2024-11-23T19:00:00+05:30",
    "description": "Join us at the bookstore to tune into this conversation between Lavanya Lakshminarayan and Shrabonti Bagchi as they discuss Lavanya's latest science-fiction novel,  INTERSTELLAR MEGACHEF.  The event details are as follows:  DATE: 23 NOVEMBER, SATURDAY TIME: 5 PM VENUE: CHAMPACA BOOKSTORE  Since there is limited seating, we recommend you to   RSVP  here to confirm your presence!  About the book Stepping off a long-haul star freighter from Earth, Saras Kaveri has one bag of clothes, her little flying robot Kili... and an invitation to compete in the galaxy's most watched, most prestigious cooking show.  Interstellar MegaChef  is the showcase of the planet Primus's austere, carefully synthesised cuisine. No one from Earth where they're so incredibly primitive they still cook with  fire   has ever graced its flowmetal cookstations before, or smiled awkwardly for its buzzing drone-cams. Until now. Corporate prodigy Serenity Ko, inventor of the smash-hit sim SoundSpace, has just got messily drunk at a floating bar, narrowly escaped an angry mob and been put on two weeks' mandatory leave to rest and get her work-life balance back. Perfect time to start a new project! And she's got just the idea: a sim for  food.  Now she just needs someone to teach her how to cook. A chance meeting in the back of a flying cab has Saras and Serenity Ko working together on a new technology that could change the future of food--and both their lives forever! About the speakers Lavanya Lakshminarayan  is the author of THE TEN PERCENT THIEF. She’s the first Indian woman to be shortlisted for the prestigious Arthur C. Clarke Award, and is currently a finalist for the Subjective Chaos Kind of Award. She's also a Locus Award finalist, and the winner of the Times of India AutHer Award and the Valley of Words Award. Her short fiction has appeared in a number of magazines and anthologies, including THE BIG BOOK OF CYBERPUNK and THE BEST OF WORLD SF: VOLUME 2. Lavanya is occasionally a game designer, and has built worlds for Zynga Inc.’s  FarmVille  and  Mafia Wars , among other games.  Shrabonti Bagchi  is a journalist and reviewer. She currently writes for Mint Lounge, a weekly magazine of art, culture, books and lifestyle. ",
    "url": "https://champaca.in/blogs/events/book-discussion-interstellar-megachef-with-lavanya-lakshminarayan-and-shrabonti-bagchi-23-november-5-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/interstellar-megachef-pre-order?_pos=1&_sid=9efc9e339&_ss=r&variant=40618065428515",
        "price": "599",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-interstellar-megachef-with-lavanya-lakshminarayan-and-shrabonti-bagchi-23-november-5-pm?variant=40627547504675",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Film Screening: Worlds of Ursula K. Le Guin by Arwen Curry | 16 NOVEMBER, 7 PM",
    "startDate": "2024-11-16T19:00:00+05:30",
    "endDate": "2024-11-16T21:00:00+05:30",
    "description": "We are thrilled to be screening  Worlds of Ursula K. Le Guin , a documentary by Arwen Curry, at our bookstore this November! Worlds of Ursula K. Le Guin  is a feature documentary exploring the remarkable life and legacy of the late feminist author  Ursula K. Le Guin.  Best known for groundbreaking science fiction and fantasy works such as  A Wizard of Earthsea, The Left Hand of Darkness, and The Dispossessed , Le Guin held her ground on the margin of “respectable” literature until the sheer excellence of her work, at long last, forced the mainstream to embrace fantastic literature. Her fascinating story has never before been captured on film.  Watch the trailer. Produced with Le Guin’s participation over the course of a decade,  Worlds of Ursula K. Le Guin  is a journey through the writer’s career and her worlds, both real and fantastic. Viewers will join the writer on an intimate journey of self-discovery as she comes into her own as a major feminist author, opening new doors for the imagination and inspiring generations of women and other marginalized writers along the way.  The film features stunning animation and reflections by literary luminaries including Margaret Atwood, David Mitchell, Michael Chabon, and more.  Filmmaker Arwen Curry with the author during the production of  Worlds of Ursula K.Le Guin. About the director: Filmmaker Arwen Curry worked with Ursula K. Le Guin for ten years to create  Worlds of Ursula K. Le Guin . She served as Associate Producer and Archivist of the PBS American Masters film   EAMES: The Architect and the Painter ,  and associate-produced both  American Jerusalem: Jews and the Making of San Francisco ,  and the acclaimed HBO film  Regarding Susan Sontag . Arwen is a former chief editor of the seminal punk magazine  Maximum Rocknroll   and has written for print, radio, and film. She is a San Francisco Bay Area native and a graduate of the UC Berkeley Graduate School of Journalism. Event details We will open the event with an introduction and talk about the books and works of Ursula K. Le Guin by our curator and writer Kavya Murthy*. The documentary screening is of 68 minutes and will be followed by an open house to discuss and respond to the film together. Limited seating. Please purchase a  ticket  to confirm your spot. *Kavya Murthy is a writer, editor, reader and curator who has worked with Champaca Bookstore from the very beginning. She likes urban sketching, tango, dragons in fiction and queer writing.  ",
    "url": "https://champaca.in/blogs/events/film-screening-worlds-of-ursula-k-le-guin-by-arwen-curry-16-november-7-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/screening-worlds-of-ursula-k-le-guin-by-arwen-curry-16-november-7-pm?variant=40607185305635",
        "price": "599",
        "priceCurrency": "INR"
      }
    ]
  }
]