[
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch: Real Life by Amrita Mahale",
    "startDate": "2025-09-20T18:00:00+05:30",
    "endDate": "2025-09-20T20:00:00+05:30",
    "description": "We’re delighted to welcome you to the launch of  Real Life , the much-anticipated new novel by  Amrita Mahale . Set in the mysterious Mahamaya Valley in the Himalayas,  Real Life  begins with the disappearance of wildlife biologist Tara and unfolds into a layered story of friendship, obsession, and truth-seeking.  Amrita Mahale  will be in conversation with author  Dharini Bhaskar , as they discuss the novel, its themes, and the stories that shape their writing. Here are the event details:  Date:  20th September, Saturday Time:  6:00 pm Venue:  Champaca Bookstore, Vasanth Nagar Since the seating is limited, we recommend you to  sign up here! About the Book: In the remote Mahamaya Valley in the Himalayas, wildlife biologist Tara has vanished. Hunting for answers, Tara’s best friend Mansi sets out to retrace her whereabouts in the days before her disappearance. The prime suspect Bhaskar sits in police custody, his obsession with Tara laid bare, his testimony a labyrinth of contradictions and half-truths. As the investigation deepens, the valley reveals its own mysteries―a backpacker paradise where the timeless and the ephemeral collide, where technology and nature clash, and where a woman's voice can be silenced in countless ways. Rendered in exquisite prose,  Real Life  is a gripping mystery that transforms into a masterful exploration of love and loss, visibility and erasure, AI and surveillance and the never-ending tussle between individual desires and societal demands. In an age of surveillance and enforced conformity, what does it mean for a woman to seek a more authentic, real existence? About the Speakers:  Amrita Mahale : Born in Mumbai, Dharini  grew up in five cities across India. Milk Teeth, her first novel, was published to widespread acclaim in 2018 and was longlisted for the JCB Prize for Literature and shortlisted for the Crossword Book Award for Fiction. She was trained as an aerospace engineer at IIT Bombay and Stanford University. Dharini Bhaskar :  Born in Bombay, Dharini has at various points also called the UK, Greece, Delhi and Bangalore home. Her debut novel These, Our Bodies Possessed by Light (Hachette India) was shortlisted for the 2020 JCB Prize for Literature, Tata Literature Live! (First Book: Fiction), and the Valley of Words book awards. ",
    "url": "https://champaca.in/blogs/events/book-launch-real-life-by-amrita-mahale",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-real-life-by-amrita-mahale-i-vasanth-nagar-i-september-20th-6-pm?variant=40947956318243",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch and Neighbourhood Walk: Be a Neighbourhood Naturalist I Indiranagar I September 27th, 4 PM",
    "startDate": "2025-09-27T16:00:00+05:30",
    "endDate": "2025-09-27T18:00:00+05:30",
    "description": "Join us at Champaca Bookstore, Indiranagar for the launch of  Be a  Neighbourhood  Naturalist .  We'll start with a walk around the neighbourhood led by the book's creators -  spotting wildlife, trying creative activities from the book and discovering the magic of everyday nature.  After the walk, we’ll return to Champaca for a conversation with  Labonie Roy , Suhel Quader, and Vena Kapoor. We'll discuss their book - a beautifully crafted guide that invites you to slow down, look closer, and discover the wonders of the living world right in your neighbourhood. Blending creative experiments with stunning illustrations, this book offers fresh ways to reimagine the natural world just outside your door.   Here are the event details:  Date:  27th September, Saturday Time:  4:00 pm Venue:   Champaca Bookstore, Indiranagar, followed by a walk in the neighbourhood around the store Fee:  Rs. 499/- ( fully redeemable against the book) Since the seating is limited, we recommend that you  sign up here ! About the Book:  Be a Neighbourhood Naturalist has been created by a team with decades of experience studying the natural world, and working in the field of nature conservation.  Packed with creative experiments and stunning illustrations, this book will open your eyes to the magic of the natural world and the amazing living things that share your neighborhood. About the Speakers:  Labonie Roy   is a designer, illustrator, and artist, working towards creating engaging learning resources for children and adults. Growing up, she spent most of her time peering among plants for bugs, collecting leaves, petting every passing dog, and devouring every nature book and documentary she came across. Not much has changed since then, except that she now shares her passions with others through her work whether it’s creating classroom tools or writing children’s books about the natural world.  Suhel Quader  is a scientist at NCF, and head of the Education and Public Engagement programme there. After an academic focus on wildlife biology, animal behaviour and evolutionary ecology, he has spent the last 13 years concentrating instead on trying to broaden and deepen public engagement with nature. Vena Kapoor  is a nature educator, ecologist and conservation practitioner.  She founded Nature Classrooms - an initiative that connects learning to the natural world. With her team she designs age-appropriate and locally-culturally relevant nature learning modules and activities that can be weaved into the school curricula. ",
    "url": "https://champaca.in/blogs/events/book-launch-and-neighbourhood-walk-be-a-neighbourhood-naturalist",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-and-neighbourhood-walk-be-a-neighbourhood-naturalist-i-indiranagar-i-september-27th-4-pm?variant=40942891466787",
        "price": "499",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion : The Ex-Daughters of Tolstoy House with Author Arunima Tenzin Tara and Sheila Kumar",
    "startDate": "2025-09-21T18:00:00+05:30",
    "endDate": "2025-09-21T20:00:00+05:30",
    "description": "Join us on Sunday, 21st September for a discussion around  The Ex-daughters of Tolstoy House , a  macabre novel of crime and a near-hypnotic study of evil that will stay with you long after the last page is  turned.  Author Arunima Tenzin Tara will be in conversation with Sheila Kumar as they discuss the way patriarchy impacts what looks like a perfect Indian family in this gory novel and the larger implications of misogyny in Indian society.    Here are the event details:  Date:  21st September, Sunday Time:  6:00 pm Venue:   Champaca Bookstore, Vasanth Nagar Since the seating is limited, we recommend that you  sign up here! About the Book:  Meera appears to be living the perfect life. She has a good husband,  Ambarish, and three obedient daughters, Sujata, Kavita and Naina. But  Ambarish’s odd disappearances in the middle of the night and the salt he  leaves scattered on the floor, all lead her to a dark secret. One that brings the  past into the present, and threatens to consume her daughters’ lives.  Naina is used to following her father’s orders, it’s how her mother has raised  her. So when he calls on her to wipe blood off a dead body, Naina obliges,  after all, she has been doing this for nearly thirty years. But this time, the  body is not a stranger. It’s her mother. Forced to reckon with her own complicity in the act, Naina must navigate her  family’s history, if only to provide the next generation with a better life.   About the Speakers:  Arunima Tenzin Tara   is a writer, filmmaker and cook based in New Delhi.  She studied  history at the University of Delhi and documentary film making at Sri Aurobindo Centre of Arts and Communication. She has made three short films: Home Ground, For Susan and Moment's Notice. The Ex-daughters of Tolstoy House is her debut novel.  Sheila Kumar   is an independent writer and editor based in Bangalore. She worked for the Times of India Group in Bangalore and Delhi, then at 'Femina', Delhi for over a dozen years before turning freelancer. Her books include a collection of short stories 'Kith and Kin; Chronicles of a Clan, No Strings Attached' and 'A Gluten-free Life' (as co-author).",
    "url": "https://champaca.in/blogs/events/book-discussion-the-ex-daughters-of-tolstoy-house",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-the-ex-daughters-of-tolstoy-house-with-author-arunima-tenzin-tara-and-sheila-kumar-vasanth-nagar-i-21-september-6-pm?_pos=2&_sid=643dadefe&_ss=r&variant=40942744567843",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]