[
  {
    "@type": "LiteraryEvent",
    "name": "Readings of Tagore and Poetry with Sharmishta Mohanty and Mani Rao",
    "startDate": "2025-10-04T00:00:00+05:30",
    "endDate": "2025-10-04T02:00:00+05:30",
    "description": "Some stories are timeless, returning to us with new meanings each time they are retold.  Broken Nest and Other Stories , translated by acclaimed poet  Sharmistha Mohanty , brings Rabindranath Tagore’s unforgettable tales into a contemporary voice that resonates with today’s readers. At this special discussion, poet and translator  Sharmistha Mohanty  will be in conversation with writer and scholar  Mani Rao , exploring how translation can revive, reframe, and reimagine Tagore’s narratives for new generations. Together, they will reflect on the enduring power of Tagore’s explorations of love, alienation, memory, and the fragile strength of women’s lives. Here are the details: Date: 4 October 2025 Time: 6:00 PM Venue: Champaca Bookstore, Vasanth Nagar Since seats are limited, we recommend you  sign up here. About the Book:  This selection of Tagore’s stories exemplifies his remarkable ability to enter the complexities of human relationships. Within seemingly simple plots, Tagore portrays with unusual compassion and lyricism the predicament of Bengali women in traditional contexts—moving from the loneliness of an intelligent, beautiful woman neglected by her husband in his acclaimed novella  Broken Nest  to the powerlessness of a young girl whose prized possession is taken away in  Notebook , from the casual abandonment of an orphan in  Postmaster  to a girl robbed of her childhood in  The Ghat’s Tale . Powerful in their simplicity, brilliant in their astuteness, the novella and three short stories included in this collection—translated by acclaimed poet and fiction writer  Sharmistha Mohanty —are some of the Nobel Laureate’s finest prose works. About the Speakers:  Sharmistha Mohanty  is a celebrated Indian poet and fiction writer. Her poetry collections  Book One  and  Extinctions  often deal with themes of home, womanhood, alienation, love, and identity. Her translations of Tagore’s stories have been widely read and admired. Mani Rao  is a poet, translator, and scholar. She is the author of twelve poetry collections and acclaimed translations of the Bhagavad Gita and Kalidasa. Her work explores intersections of literature, philosophy, and spirituality, and she frequently moderates and participates in literary discussions across the world.",
    "url": "https://champaca.in/blogs/events/readings-of-tagore-and-poetry-with-sharmishta-mohanty-and-mani-rao-4-october-2025-champaca-bookstore-vasanth-nagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/readings-of-tagore-and-poetry-with-sharmishta-mohanty?_pos=1&_sid=8d81361ab&_ss=r&variant=40957752967203",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "EducationEvent",
    "name": "Heart Lamp Workshop",
    "startDate": "2025-10-05T00:00:00+05:30",
    "endDate": "2025-10-05T02:00:00+05:30",
    "description": "Some books stay with you long after you’ve turned the last page.  Heart Lamp , the International Booker Prize–winning anthology by Banu Mushtaq, is one of those rare works. It makes you think and it makes you feel—drawing you into the lived experiences of Indian Muslim women, while also inviting you to reflect on your own world. This October, we’re bringing  Heart Lamp  off the page and into our lives with an interactive workshop on the idea of  freedom  at our Indiranagar store.  But this isn’t your usual book discussion. Instead, we’ll explore three of the anthology’s most powerful stories through music, art, and storytelling. It’s a chance to step away from screens, share perspectives, and spend a Sunday morning in meaningful conversation with fellow readers. No prior prep is needed—just pick up your copy of  Heart Lamp  at Champaca before the workshop.  Here are the event details: Date:   Sunday, October 5th, 2025   Time :  10:30 AM – 12:30 PM   Venue:  Champaca Bookstore, Indiranagar  Age:  18+ Fee:  Rs.999/- (without a copy of the book) or Rs.1398/- (with a copy of the book) No prior prep is needed—just pick up your copy of  Heart Lamp  at Champaca before the workshop.  Since seats are limited, we recommend that you  sign up here !  About   SkilLit :  SkilLit Readers is an innovative educational initiative that transforms literature into a dynamic platform for developing real-world skills in children. Founded in 2024 by  Poorvaja Prakash  and  Srilakshmi R , SkilLit Readers offers a story-led skills lab where books become launchpads for critical thinking, creativity, and self-expression. Poorvaja Prakash Poorvaja has more than 12 years of experience in international development, social impact, facilitation, and research. She is a graduate of Columbia University (Teachers College), LSE, and Stella Maris, and has published in peer-reviewed journals. Srilakshmi R. Srilakshmi has over 12 years’ experience teaching English and Social Science in IB & ICSE schools. She studied at Azim Premji University and Christ University and is IB certified with a strong interest in children’s literature.",
    "url": "https://champaca.in/blogs/events/heart-lamp-workshop",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/heart-lamp-workshop?_pos=2&_sid=bb99c7fec&_ss=r&variant=40950400385059",
        "price": "999",
        "priceCurrency": "INR"
      }
    ]
  }
]