[
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: Invisible Housemates with Deepa Padmanaban and Radha Ranagarajan",
    "startDate": "2025-11-02T18:00:00+05:30",
    "endDate": "2025-11-02T20:00:00+05:30",
    "description": "We are delighted to host a conversation with  Deepa Padmanaban , the author of  Invisible Housemates , at Champaca Bookstore. Join us for an engaging discussion where Deepa will be in conversation with Radha Rangarajan. The event promises a unique opportunity to interact with the author and discover the invisible world within our walls. Mark your calendars and bring your questions and observations. The discussion will be followed by a book signing. Here are the details for the event:  Date:  2 November 2025, Sunday Time:   6:00 PM Venue:  Champaca Bookstore, Vasanth Nagar  Seats are limited, so do  RSVP to save your spot ! About the Book: Invisible Housemates  explores the many unseen but ever-present animals that share our homes and how they shape our lives. The book blends folklore and scientific inquiry, inviting readers to learn about the spiders in the corners, geckos at the windows, and other creatures who quietly cohabit our spaces. It offers insights into their place in local culture, the scientific breakthroughs inspired by them, and their role in everyday lives. About the Speakers:   Deepa Padmanaban  is an independent journalist and author, writing on science, environment, biodiversity, wildlife conservation, public health and climate change. Her stories have been published in The Guardian, Harvard Public Health Magazine, Discover magazine, Scientific American, National Geographic, Mongabay, IndiaSpend, and others. She was awarded a special mention in the Environmental Impact category by the One World Media Awards (UK) in 2023. In a previous avatar, she worked as a biochemistry researcher at the Indian Institute of Science, Bengaluru, and Harvard University, USA.  Radha Rangarajan  works on telling vital stories about the natural world, through photography, filmmaking and writing. She drives media, communications and community building at Black Baza. She was the Editor at Nature inFocus where she commissioned features on environmental issues and curated their annual photography competition and social media communication. She has also curated and edited stories for JLR Explore for over a decade. Radha has written and edited over 15 picture books for children (Pratham Books) and co-authored a book on Indian environmental heroes. ",
    "url": "https://champaca.in/blogs/events/book-discussion-invisible-housemates-with-deepa-padmanaban-and-radha-ranagarajan-2-november-6pm-champaca-vasanth-nagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-invisible-housemates-with-deepa-padmanaban-and-radha-ranagarajan-2-november-6pm-champaca-vasanth-nagar?_pos=2&_sid=7196b51fa&_ss=r&variant=41006975090723",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Tender & Fierce: A Poetry Lab on Feeling Beyond Gender with Naomi George",
    "startDate": "2025-10-26T00:00:00+05:30",
    "endDate": "2025-10-26T02:00:00+05:30",
    "description": "We’re delighted to host a poetry workshop with Naomi George that explores how gendered expectations shape our emotions and how poetry can lead us beyond boundaries—past the pink and blue boxes, and into the full spectrum of human feeling. In this interactive Poetry Lab, participants will reflect on the ways our experiences of tenderness and fierceness have been shaped by cultural narratives of gender, and consider how poetry can help us rediscover and expand our language for emotion. Whether you’re a poet, writer, or a reader curious about the intersections of gender, feeling, and creative expression, this workshop is designed to invite you into new ways of thinking, writing, and sharing. About the Facilitator: Naomi George  is a poet, DEIB consultant, and co-parenting mother of two teens in Bangalore. A Harper Collins author and mental health advocate, she champions women’s wellbeing and invites us to feel beyond gender—to meet in our shared humanity. Here are the details of the event: Date:   Sunday, 26 October Time:   11 AM to 12 PM Venue:   Champaca Bookstore, Indiranagar Fee:   INR 799 Seats are limited.  Confirm your spot here!",
    "url": "https://champaca.in/blogs/events/tender-fierce-a-poetry-lab-on-feeling-beyond-gender-with-naomi-george-26th-october-sunday-champaca-bookstore-indiranagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/tender-fierce-a-poetry-lab-on-feeling-beyond-gender-with-naomi-george-26th-october-sunday-champaca-bookstore-indiranagar?variant=40977879040035",
        "price": "799",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: So That You Know and Kalidasa: Selected Poetry and Drama with Mani Rao and Dharini Bhaskar",
    "startDate": "2025-10-30T00:00:00+05:30",
    "endDate": "2025-10-30T02:00:00+05:30",
    "description": "We’re delighted to invite you to an evening with  Mani Rao  and  Dharini Bhasker , as we celebrate the launch of  Kalidasa: Selected Poetry & Drama  and  So That You Know . These two books bring together voices from different times —  Kalidasa’s  evergreen drama and poetry in new translation, and  Mani Rao ’s own reflections on language, love, and memory. Join us for readings and conversation on poetry, translation, and the enduring pulse of the written word. Here are the details of the event:  Date:  30th October, Thursday Time:  6:30 PM Venue:  Champaca Bookstore, Indiranagar  Since seats are limited, we recommend you  sign up here! About the Books:  Kalidasa: Selected Poetry and Drama :   Mani Rao 's  Kalidasa  brings together a range of poetry and drama by the greatest poet and dramatist of Sanskrit literature and revitalizes them for the modern reader. Through her remarkable translations,  Mani  evokes in all its richness the vibrant montage of life in ancient India that Kalidasa depicted in his, one replete with kings-queens-jesters-sages and abounding in romantic intrigues and promises, misunderstandings and betrayals; where humanity and nature intertwine, and characters negotiate their freedom within the framework of duty and destiny.  So That You Know  is the quintessential  Mani Rao  collection. These are poems that hold the playful exuberance of youth and the dazzling insight of age; that are at times measured, at times extravagant. What unites them is their commitment to mining deep into the recesses of the heart and offering moments of ecstatic revelation. About the Speakers: Mani Rao:   Mani Rao  is a poet, translator, and scholar. She is the author of twelve poetry collections and acclaimed translations of the Bhagavad Gita and  Kalidasa . Her work explores intersections of literature, philosophy, and spirituality, and she frequently moderates and participates in literary discussions across the world. Dharini Bhaskar:  Born in Bombay,  Dharini  has at various points also called the UK, Greece, Delhi and Bangalore home. Her debut novel  These, Our Bodies Possessed by Light  (Hachette India) was shortlisted for the 2020 JCB Prize for Literature, Tata Literature Live (First Book: Fiction), and the Valley of Words book awards.",
    "url": "https://champaca.in/blogs/events/book-discussion-so-that-you-know-and-kalidasa-selected-poetry-and-drama-with-mani-rao-and-dharini-bhaskar-30th-october-thursday-champaca-bookstore-indiranagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-so-that-you-know-and-kalidasa-selected-poetry-and-drama-with-mani-rao-and-dharini-bhaskar-30th-october-thursday-champaca-bookstore-indiranagar?variant=40975994781731",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "SkilLit Readers x Champaca : Emerging Readers Programme",
    "startDate": "2025-11-01T00:00:00+05:30",
    "endDate": "2025-11-01T02:00:00+05:30",
    "description": "When children step into a story, they don’t just meet characters, they meet ideas that shape how they think. This November, Champaca is partnering with SkilLit Readers, a story-led skills lab, to launch the Emerging Readers Programme for children aged 6–9. This programme transforms books into springboards for reflection, expression, and connection, nurturing confidence, critical thinking, and creativity. In this first edition, children will explore the theme of inclusivity, engaging with books that open conversations about belonging, empathy, and courage. Our November–December batch will explore this theme through two wonderful books: Left-Out Paru  by Bijal Vachharajani Manya Learns to Roar  by Shruthi Rao Here are the details: Dates:  Every Saturday from 1 November to 13 December 2025 ( except 6 December) Time:  11:00 AM – 12:30 PM Venue:  Champaca Bookstore, Indiranagar Age Group:  6–9 years Fee  : INR 7000 Since seating is limited,  sign up here! About the Event: The Emerging Readers Programme is a six-session journey designed to help children discover the joy of reading while building essential life skills. Each session includes a read-aloud followed by playful, experiential activities through art, roleplay, music, movement, and more. These activities encourage children to reflect on themes, characters, and stories in fresh ways. Each programme wraps up with a lively showcase, where children get to share what they’ve discovered in their own unique and creative ways. Parents are invited to join one of the sessions, and kids will also get to meet and chat with a children’s author! About the Facilitators: Poorvaja Prakash – Co-Founder, SkilLit Readers  Poorvaja has over 12 years of experience in International Development, Social Impact, Facilitation, and Research in organisations such as Teach For All, Peepul, and Global School Leaders, among others. She is an alumna of Columbia University (Teachers College), London School of Economics (LSE), and Stella Maris College. She has also published in a peer-reviewed journal and other platforms and is the host of a sports-related podcast. Srilakshmi R – Co-Founder, SkilLit Readers Srilakshmi has 12+ years of experience as an English and Social Science teacher in IB and ICSE schools such as Chaman Bhartiya School, Oberoi International School (JVLR Mumbai), The Gateway School of Mumbai, and Head Start Educational Academy, Bangalore. She is an alumna of Azim Premji University and Christ University. Srilakshmi is an IB Certified Educator. She has a special interest in children’s literature from across the world.",
    "url": "https://champaca.in/blogs/events/skillit-readers-x-champaca-emerging-readers-programme-champaca-indiranagar-1-november-to-13-december-2025",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/skillit-readers-x-champaca-emerging-readers-programme-champaca-indiranagar-1-november-to-13-december-2025?variant=40963222274083",
        "price": "7000",
        "priceCurrency": "INR"
      }
    ]
  }
]