[
  {
    "@type": "Event",
    "name": "Nusrat F. Jafri in conversation with Thejaswi Shivanand on THIS LAND WE CALL HOME | 9 NOVEMBER, 6 PM",
    "startDate": "2024-11-09T18:00:00+05:30",
    "endDate": "2024-11-09T20:00:00+05:30",
    "description": "Join us at the bookstore to tune into this conversation between Nusrat Jafri and Thejaswi Shivanand as they discuss THIS LAND WE CALL HOME.  THIS LAND WE CALL HOME  is Nusrat F. Jafri's debut non fiction book. It traces her maternal family history, through the lens of caste and conversions and the making of modern India. Here are the details of the event-  DATE- 9 NOVEMBER  TIME- 6 PM  VENUE- CHAMPACA BOOKSTORE Please  RSVP  here since there is limited seating for the event.  Read on to know more about the book and the speakers.  About the book  In this book Nusrat F. Jafri traces the roots of her nomadic forebears through the lens of caste and religious conversions over the last century. This affecting memoir explores religious and multicultural identities and delves into the profound concepts of nation-building and belonging. Nusrat’s family’s conversion to Christianity as a response to Brahmanical gatekeeping highlights their struggle for acceptance. The family found acceptance in the church, alongside a sense of community, theology, songs and carnivals, and quality education for the children in missionary schools. Parallelly, we see the family’s experiences during Gandhi’s return in 1915, the Partition, the two World Wars, the Emergency and the prime ministers’ assassinations. In a way, this is a story like and unlike the stories all of us carry within us; the inherited weight of who we are and where we come from, our tiny little freedoms and our everyday struggles and, mostly, the intricate jumble of our collective ancestry. Nusrat pays homages to her foremothers, the first feminists, and her forefathers, the ones who tried hard to fit into a caste society only to be spat out, and eventually chose alternative faiths in pursuit of acceptance. About the speakers  Nusrat F Jafri , is a Mumbai based cinematographer, with twenty years of experience in filmmaking. Born and brought up in Lucknow, Nusrat, did her schooling from La Martiniere Girls College. She did her graduation from Delhi University and her Masters in Mass Communication from MCRC, Jamia Millia Islamia.   Her latest short film, “ Pilibhit ,” starring Raj Arjun and Joyshree Arora, won her an IPTDA Award for the Best Cinematographer 2022, and a Critics Choice Award, nomination for the same film.  She lives in Mumbai with her husband, son and a cat named Jamia. Thejaswi Shivanand  is a library educator and curator of books at Champaca where he has been a regular part of the book club discussions and hosted several events with authors over the past five years. He&nbsp;has been part of initiating and sustaining different book-related communities for the past eighteen years. He currently works across India to nurture and support the growth of communities of readers in schools and libraries.",
    "url": "https://champaca.in/blogs/events/nusrat-f-jafri-in-conversation-with-thejaswi-shivanand-on-this-land-we-call-home-9-november-6-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/this-land-we-call-home-the-story-of-a-family-caste-conversions-and-modern-india?_pos=1&_sid=92655df82&_ss=r&variant=40419207741475",
        "price": "699",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/nusrat-f-jafri-in-conversation-with-thejaswi-shivanand-on-this-land-we-call-home-9-november-6-pm?variant=40617778216995",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Film Screening: Worlds of Ursula K. Le Guin by Arwen Curry | 16 NOVEMBER, 7 PM",
    "startDate": "2024-11-16T19:00:00+05:30",
    "endDate": "2024-11-16T21:00:00+05:30",
    "description": "We are thrilled to be screening  Worlds of Ursula K. Le Guin , a documentary by Arwen Curry, at our bookstore this November! Worlds of Ursula K. Le Guin  is a feature documentary exploring the remarkable life and legacy of the late feminist author  Ursula K. Le Guin.  Best known for groundbreaking science fiction and fantasy works such as  A Wizard of Earthsea, The Left Hand of Darkness, and The Dispossessed , Le Guin held her ground on the margin of “respectable” literature until the sheer excellence of her work, at long last, forced the mainstream to embrace fantastic literature. Her fascinating story has never before been captured on film.  Watch the trailer. Produced with Le Guin’s participation over the course of a decade,  Worlds of Ursula K. Le Guin  is a journey through the writer’s career and her worlds, both real and fantastic. Viewers will join the writer on an intimate journey of self-discovery as she comes into her own as a major feminist author, opening new doors for the imagination and inspiring generations of women and other marginalized writers along the way.  The film features stunning animation and reflections by literary luminaries including Margaret Atwood, David Mitchell, Michael Chabon, and more.  Filmmaker Arwen Curry with the author during the production of  Worlds of Ursula K.Le Guin. About the director: Filmmaker Arwen Curry worked with Ursula K. Le Guin for ten years to create  Worlds of Ursula K. Le Guin . She served as Associate Producer and Archivist of the PBS American Masters film   EAMES: The Architect and the Painter ,  and associate-produced both  American Jerusalem: Jews and the Making of San Francisco ,  and the acclaimed HBO film  Regarding Susan Sontag . Arwen is a former chief editor of the seminal punk magazine  Maximum Rocknroll   and has written for print, radio, and film. She is a San Francisco Bay Area native and a graduate of the UC Berkeley Graduate School of Journalism. Event details We will open the event with an introduction and talk about the books and works of Ursula K. Le Guin by our curator and writer Kavya Murthy*. The documentary screening is of 68 minutes and will be followed by an open house to discuss and respond to the film together. Limited seating. Please purchase a  ticket  to confirm your spot. *Kavya Murthy is a writer, editor, reader and curator who has worked with Champaca Bookstore from the very beginning. She likes urban sketching, tango, dragons in fiction and queer writing.  ",
    "url": "https://champaca.in/blogs/events/film-screening-worlds-of-ursula-k-le-guin-by-arwen-curry-16-november-7-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/screening-worlds-of-ursula-k-le-guin-by-arwen-curry-16-november-7-pm?variant=40607185305635",
        "price": "599",
        "priceCurrency": "INR"
      }
    ]
  }
]