[
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch: Half Light by Mahesh Rao in conversation with Sumana Mukherjee",
    "startDate": "2025-11-23T18:30:00+05:30",
    "endDate": "2025-11-23T20:30:00+05:30",
    "description": "We’re delighted to invite you for the book launch of  Half Light  by  Mahesh Rao   at Champaca Indiranagar on 23rd of November. Join us for an engaging discussion where  Mahesh Rao  will be in conversation with  Sumana Mukherjee . The event promises a unique opportunity to interact with the author. Mark your calendars and bring your questions and observations. Here are the details for the event:  Date:  23 November 2025, Sunday Time:   6:30 PM Venue:  Champaca Bookstore, Indiranagar Seats are limited, so do  RSVP to save your spot ! About the Book: Half Light  is set in the misty mountains of Darjeeling, a landslide entraps the guests and staff of a dilapidated hotel. Cooped up inside, two men exchange lingering glances. Four years later, their paths cross again amidst the towering skyscrapers and ghostly smog of Mumbai. Pavan has fled the hills, burying all memories of their encounter, while Neville is now a flailing graduate, craving something more than the naked torsos blowing up his phone. When he glimpses Pavan working behind the reception of a luxurious hotel, he demands a meeting, pursuing him with mischief and menace as the secrets of their time together threaten to tumble into the light. Set on the brink of India’s ruling to decriminalise homosexuality,  Half Light  captures the tender, richly atmospheric and elegantly wry story of outlawed desire and the hope of a life beyond concealment. About the Speakers:   Mahesh Rao   grew up in Nairobi, Kenya. In the UK he has worked as a lawyer, academic researcher and bookseller. His work has appeared in numerous publications, including the New York Times, Prospect, Conde Nast Traveller, The Baffler, Prairie Schooner, Caravan and Elle. His debut novel, ‘ The Smoke Is Rising’ , won the Tata First Book Award for fiction and was shortlisted for the Shakti Bhatt First Book Prize and the Crossword Prize. ‘ One Point Two Billion’ , his collection of short stories, was published in 2015. ‘ Polite Society’ , his Delhi-set reimagining of Jane Austen’s ‘ Emma ’, was published to critical acclaim in 2018. ‘ Half Light’  is his most recent novel. Sumana Mukherjee  is a Bangalore-based writer and editor with 30+ years of experience with publications including The Indian Express, Forbes India and Mint Lounge. After a seven-year stint with an IT major recording its history, she now writes independently with a special focus on literature, food, textiles, art and culture.",
    "url": "https://champaca.in/blogs/events/book-launch-half-light-by-mahesh-rao-in-conversation-with-sumana-mukherjee-23-november-6-30-pm-champaca-indiranagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-into-the-forest-with-avtar-singh-and-sumana-mukherjee-2-august-6-pm?_pos=7&_sid=d43152549&_ss=r&variant=40520826421283",
        "price": "0",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-invisible-housemates-with-deepa-padmanaban-and-radha-ranagarajan-2-november-6pm-champaca-vasanth-nagar-copy?variant=41036837814307",
        "price": "0",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-into-the-forest-with-avtar-singh-and-sumana-mukherjee-2-august-6-pm?_pos=7&_sid=d43152549&_ss=r&variant=40520826421283",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]