[
  {
    "@type": "Event",
    "name": "Moy Moy's Circle: Discussion with Suchitra Shenoy and Shubhi Mehta",
    "startDate": "2026-02-07T18:00:00+05:30",
    "endDate": "2026-02-07T20:00:00+05:30",
    "description": "Join us at Champaca, Vasanthnagar for a conversation between Suchitra Shenoy- author of the beloved book  Moy Moy’s Circle ,  with Shubhi Mehta .  This discussion will then be followed by a book signing.    Here are all the event details: Date: 7 February, Saturday Time: 6PM Venue: Champaca Bookstore, Vasanthnagar About the Book   Moy Moy’s Circle  is an inspiring true story about love, resilience, and the power of one life to spark lasting change. Through compassion, determination, and unwavering belief in dignity for all, this book traces how a single act of courage grew into a movement that has transformed thousands of lives. At its heart,  Moy Moy’s Circle  is a testament to hope and the extraordinary impact of choosing to care. About the Author Suchitra Shenoy is a writer and teacher in the Buddhist tradition whose work explores compassion, mindful living, and the transformative power of care. She is the author of  Mindful Parenting: The First One Thousand Days for Parent and Baby , which was featured on Amazon India’s Top Parenting Books list. Her earlier book,  Infinite Vision: How Aravind Became the World’s Largest Business Case for Compassion  (co-authored with Pavithra Mehta), was named among Amazon’s Top 40 Management Books and was a finalist for the US Academy of Management’s George Terry Award.  Drawing from the discourses of the Buddha, Suchitra’s teaching emphasises bringing wisdom into everyday life. She holds degrees from Brandeis University and the London School of Economics and finds renewal in time spent among trees and nature.   About the Moderator Shubhi Mehta is a corporate trainer, motivational speaker, and anchor with over twelve years of cross-cultural and international experience. She has worked across diverse industry sectors in India and globally, specialising in MICE events, leadership coaching, and corporate facilitation. An accomplished artist with experience in films, television, and radio, Shubhi is also a Certified Professional Behavioral Analyst, certified trainer, and coach, with extensive experience in outbound and experiential learning programmes.       Seats are limited, we recommend you to  RSVP here  to save your spot.  ",
    "url": "https://champaca.in/blogs/events/moy-moys-circle-discussion-with-suchitra-shenoy-and-shubhi-mehta-7-february-6pm-onwards-champaca-vasanthnagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/moy-moys-circle-discussion-with-suchitra-shenoy-and-shubhi-mehta-7-february-6pm-onwards-champaca-vasanthnagar?_pos=2&_sid=79c6e0d83&_ss=r&variant=41888440254499",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Chacha Nehru Story Time: A children’s storytelling session with transgender storytellers",
    "startDate": "2026-02-07T11:00:00+05:30",
    "endDate": "2026-02-07T13:00:00+05:30",
    "description": "Inspired by Jawaharlal Nehru’s deep love for children and his vision of a compassionate, diverse, and inclusive India,  Chacha Nehru Story Time  comes to Bengaluru this January at Champaca Bookstore. Curated by the All India Professionals’ Congress – LGBTQIA+, this special storytelling session brings together three transgender storytellers reading thoughtfully chosen children’s books that celebrate imagination, kindness, and the freedom to be oneself. Date:  7 February, Saturday Time:  11AM - 12:30PM Venue:  Champaca Bookstore, Indiranagar Age group:  Children aged 6–12, accompanied by a parent or guardian The session will include readings from two carefully selected children’s books: Uncle Nehru, Please Send an Elephant  by Devika Cariapa and Satwik Gade Guthli Has Wings  by Kanak Shashi Through these stories, children are invited to think about kindness, difference, identity, and dignity in ways that are warm, empowering, and easy to relate to. Uma P  is the Founder-Trustee of Jeeva, a community-led organisation working with Gender and Sexual Minorities in Karnataka. Her work spans mental health, livelihood, community media, and key legal and policy interventions, including challenges to Section 377 and Section 36A of the Karnataka Police Act. Sana Suman  is a transgender woman and founder of Swatantra, an initiative focused on education, rights advocacy, and community empowerment for transgender individuals in Bengaluru. With over a decade of experience and a Master’s degree in Journalism, she uses community organising and media to advocate for equality and representation. Lava (Bombay Bejaar)  is a writer, performance artist, and anthropologist of transmasculine experience. His work spans theatre and journalism, with writing published in outlets such as  The Hindu  and  Gaysi Family , and he was a recipient of the 2024 CREA Storytelling Initiative grant. This session hopes to create positive first experiences of children interacting with transgender persons, challenge stigma through human connection rather than instruction, and encourage children to ask questions openly and without fear. Seats are limited, we recommend you to  RSVP here  to save your spot.",
    "url": "https://champaca.in/blogs/events/chacha-nehru-story-time-a-children-s-storytelling-session-with-transgender-storytellers-7-february-11am-onwards-champaca-indiranagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/chacha-nehru-story-time-a-children-s-storytelling-session-with-transgender-storytellers-7-february-11am-onwards-champaca-indiranagar?_pos=1&_sid=949622a4b&_ss=r&variant=41872968646691",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Bombay Imagined: An illustrated talk by Robert Stephens",
    "startDate": "2026-02-01T18:00:00+05:30",
    "endDate": "2026-02-01T20:00:00+05:30",
    "description": "What if the cities we live in were shaped not only by what was built, but also by what was imagined and never realised? Bombay Imagined  is an illustrated talk that revisits Mumbai’s unbuilt past to explore what these forgotten ideas can still offer cities like Bangalore today. Drawing from ambitious but unrealised plans for housing, urban parks, water systems, public libraries, and civic infrastructure, the talk brings archival drawings together with contemporary speculation and artistic overlays to reveal alternate urban futures. It suggests that ideas never truly disappear, and that revisiting them can reshape how we think about cities in the present. The session will be led by architect and writer  Robert Stephens , author of  Bombay Imagined: An Illustrated History of the Unbuilt City . Having lived and worked in Mumbai for sixteen years, and now based in Bengaluru, Robert brings a perspective shaped by both cities. He is the founder of Urbs Indis, an architecture practice and publishing studio, and the creator of the Urbs Indis Library & Garden, a publicly accessible collection of rare books on urban India. Here are all the event details: Date:  Sunday, 1 February Time:  6 pm onwards Venue:  Champaca Bookstore, Vasanth Nagar Seats are limited, so we request you to  RSVP here  to save your spot.",
    "url": "https://champaca.in/blogs/events/bombay-imagined-an-illustrated-talk-by-robert-stephens-1-february-sunday-6-pm-onwards-champaca-bookstore-vasanth-nagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/bombay-imagined-an-illustrated-talk-by-robert-stephens-1-february-sunday-6-pm-onwards-champaca-bookstore-vasanth-nagar?variant=41872964190243",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]