[
  {
    "@type": "LiteraryEvent",
    "name": "Online Book Discussion of GODDESS COMPLEX by Sanjena Sathian with Nirica Srinivasan",
    "startDate": "2025-08-08T19:30:00+05:30",
    "endDate": "2025-08-08T21:30:00+05:30",
    "description": "Tune in on 8 August for an exciting and illuminating discussion around Sanjena Sathian’s  GODDESS COMPLEX —a thrilling, bitingly satirical novel about the complexities of femininity, parenthood and social norms in the modern age. Sanjena will be in conversation with Nirica Srinivasan on Champaca’s YouTube channel, and the video will also be available on YouTube after the session.  Here are the details of the event:  Date :  8 August 2025, Friday Time : 7 :30PM YouTube Live Link :  https://www.youtube.com/live/gy30cyhfFcw?si=pZJTD6MpdF-RrE22 About the book:  Sanjana Satyananda is trying to recover her life. It’s been a year since she walked out on her husband, a struggling actor named Killian, at a commune in India, after a disagreement about whether to have children. Now, Sanjana is struggling to resurrect her busted anthropology dissertation and crashing at her annoyingly perfect sister’s while her similarly well-adjusted peers obsess over marriages, mortgages, and motherhood. Sanjana needs to move forward-and finalize her divorce, ASAP. There’s just one problem: Killian is missing. As Sanjana tries to track him down, she’s bombarded with unnerving calls from women seeking her advice on pregnancy and fertility. Soon, Sanjana comes face to face-literally-with what her life might have been if she’d chosen parenthood. And the road not taken turns out to be wilder, stranger, and more tempting than she imagined. A darkly funny, genre-bending novel about the dilemmas of procreation, pregnancy, and parenting, Goddess Complex is both a twist-filled psychological thriller and a feminist satire of our age of GirlBosses turned Self Care influencers, optimization cults, social media mommy gurus, egg-freezing crazes, procreative peer pressure, and general uterine madness.  About the speakers:  Sanjena Sathian  is a writer and essayist who lives in Hong Kong. She is the author of the critically acclaimed novels  GODDESS COMPLEX  and  GOLD DIGGERS . Her short fiction appears in The Best American Short Stories, The Atlantic, Conjunctions, One Story, and more. She also writes for screen, and has bylines in The New York Times, The Yale Review, and The New Yorker, among others. She’s an alumna of the Iowa Writers' Workshop, and has taught fiction at Emory University, Mercer University, the University of Iowa, and Victoria University.  Moderating the session is  Nirica Srinivasan ,  a writer, editor, and illustrator. She is the curator of Champaca Bookstore, interviews editor at Write or Die Magazine, and contributing editor of fiction at Interlocutor Interviews. She is passionate about all forms of storytelling, from literature to cinema to music. At any point in time, she can be found reading at least six books, and excited to talk about all of them.",
    "url": "https://champaca.in/blogs/events/online-book-discussion-of-goddess-complex-by-sanjena-sathian-with-nirica-srinivasan-8-august-8-30pm",
    "offers": []
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch of ON THE BANKS OF THE PAMPA by Volga in conversation with Purnima Tammireddy and Chandan Gowda",
    "startDate": "2025-08-07T19:00:00+05:30",
    "endDate": "2025-08-07T21:00:00+05:30",
    "description": "We are delighted to announce the Bengaluru launch of Volga’s much-awaited new novel, ON THE BANKS OF THE PAMPA—a powerful and piercing retelling of a familiar episode from the Ramayana that invites us to read the epic differently. Join us on 7 August in our beautiful Indiranagar space for a stimulating and thought-provoking conversation, moderated by Purnima Tammireddy and Prof. Chandan Gowda. Here are the details of the event:  Date :  7th August 2025, Thursday Time :  7:00PM Venue :  Champaca Bookstore, Indiranagar Since there is limited seating, we recommend that you  RSVP soon ! About the book:  Sabari’s encounter with Rama is an important episode in the Ramayana. But who was Sabari, a forest-dweller who became Rama’s ardent devotee? In  On the Banks of the Pampa , award-winning writer Volga narrates the tale of Sabari, born of aranyavasis, once forced into slavery by a power-seeking state, which she breaks free from. It traces the journey of her spiritual awakening and birth into a voice of dissent for the oppressed and dispossessed. Sabari’s is a narrative entwined with the forest along the Pampa river – one she comes to dwell in and is at one with. Poignant and piercing, this concluding volume in Volga’s trilogy of feminist retellings of the Indian epics drives us to reconsider the meaning of dharma, and rejects ideologies that legitimize conquest and the exploitation of nature. Powerfully translated into English by Purnima Tammireddy, this is a story of resistance – a story for the times we live in, drawn from the classic tale we know so well. About the speakers:  Volga   is a writer, critic, translator and poet, who has been a forerunner in introducing a feminist perspective into the literary-political discourse of the Telugu-speaking states. She is best known for her feminist retellings of Indian epics,  The Liberation of Sita  and  Yashodhara , and her latest novel concludes this trilogy. Other notable works include her earlier novels  Sahaja  and  Sveccha , short story collections, feminist philosophy and literary criticism, and translations of Telugu works. She is the recipient of numerous awards including the Sahitya Akademi Award, and her work opened the floodgates for a host of women writers to articulate the doubts and confusions they experienced as women.  Purnima Tammireddy  is a writer, translator, and publisher, who currently lives in Bengaluru. She is the translator of  On the Banks of the Pampa , and has also translated works by Manto and Amrita Pritam into Telugu. She is also the author of the short-story collection  Emotional Pregnancy . She is the founder of Elami Publications, an independent Telugu publishing house, and co-founder of  pustakam.net , a website for book reviews. Moderating today's session is  Chandan Gowda   is a Professor of Sociology and the Dean of Vidyashilp University’s School of Liberal Arts. His areas of interest include Indian intellectual history and modern Kannada literature and cinema. He is the author of  Another India: Events, Memories, People,  and has edited and translated several works of Kannada literature, including an anthology of  The Greatest Kannada Stories Ever Told.  He has also contributed to columns in the Bangalore Mirror and Deccan Herald, among others.",
    "url": "https://champaca.in/blogs/events/book-launch-of-on-the-banks-of-the-pampa-by-volga-in-conversation-with-purnima-tammireddy-and-chandan-gowda-champaca-indiranagar-7-august-7-00pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-of-on-the-banks-of-the-pampa-by-volga-in-conversation-with-purnima-tammireddy-and-chandan-gowda-champaca-indiranagar-7-august-7-00pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Tasting: Champaca Bookstore X Broth Noodle Bar",
    "startDate": "2025-08-01T19:30:00+05:30",
    "endDate": "2025-08-01T21:30:00+05:30",
    "description": "What if you could  taste  a book before reading it? Not just skim the blurb, but truly sample its mood, voice, and texture? Welcome to Book Tasting  - a one-of-a-kind collaboration between  Champaca  and  Broth Noodle Bar , where food and literature come together in a multi-sensory journey. In this special edition, we travel to  Japan  through a thoughtfully paired menu and a curated selection of books. With each course - a steaming bowl of ramen and a matcha-inspired dessert - you’ll be served not only a meal, but also a “taste” of a story from the region: a short reading, a guided discussion, and space to reflect. Japan’s literary landscape pays attention to its locals - in either describing in vivid detail their domestic lives which sometimes serves as a meta-commentary on political issues, or in taking us to its more surreal corners. Thus one moment, you’re living with pages full of charming stories that feel both tender and comforting ; the next ; you’re confronted with strange metaphors that require you to vigorously exercise your imagination. In a way, literature from Japan is both energetic, gritty and enigmatic as its cities,  where neon skywalks co-exist with century old temples. We are delighted to be able to present a selection that offers a portrait of the same. What’s on the menu? Books selected by Radhika Timbadia (Champaca), to match each course Curated dishes prepared by BrothNoodlebar team  Kara Tonkotsu (Non-Veg Ramen) A 48-hour simmered pork bone broth served with thin-cut handmade noodles, chashu, soy egg, pickled radish, scallions, and shiitake mushrooms. The standout: Karadare, a house-made sauce crafted from slow-roasted local Byadgi chillies. Tan Tan Veggie Ramen A light vegetable stock enriched with soy milk and sesame paste, topped with spicy tofu crumble, pickled mustard greens, scallions, sesame seeds, and thin alkaline noodles. Dessert – Matcha White Chocolate Panna Cotta With a sesame-sea salt crumble, this panna cotta combines grassy matcha and smooth white chocolate with a crackle of texture and a touch of salt. Date : 01 August 2025 Time : 7:30 PM Location :  Kale- A Salad Symphony, Indiranagar Ticket : INR 1999 (INR1000 for food, INR 999 fully redeemable on books) PLEASE NOTE:   Our kitchen does not have the capacity to accommodate food allergies. Please review the ingredients carefully before registering. Spots are limited – reserve your seat soon!  RSVP now Let us know your food preferences here",
    "url": "https://champaca.in/blogs/events/book-tasting-champaca-bookstore-x-broth-noodle-bar-01-august-2025-friday-7-30-pm-kale-a-salad-symphony-indiranagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-tasting-champaca-bookstore-x-broth-noodle-bar-01-august-2025-friday-7-30-pm-kale-a-salad-symphony-indiranagar",
        "price": "1999",
        "priceCurrency": "INR"
      }
    ]
  }
]