[
  {
    "@type": "LiteraryEvent",
    "name": "Book discussion on FOR NO REASON AT ALL with Ramjee Chandran and Shinie Anthony | 24th May, 5:30PM |  Champaca Bookstore, Vasanth Nagar",
    "startDate": "2025-05-24T17:30:00+05:30",
    "endDate": "2025-05-24T19:30:00+05:30",
    "description": "Join us at Champaca Bookstore in Vasanth Nagar for a conversation on  FOR NO REASON AT ALL , the latest book by  Ramjee Chandran , in conversation with writer and editor Shinie Anthony. An evening of storytelling and behind-the-scenes anecdotes about the making of a book that blends satire, suspense, and political drama. Event Details: Date:   Saturday, 24 May 2025 Time:   5:30 PM Venue:   Champaca Bookstore, Vasanth Nagar Since there is limited seating, we recommend you  book your spot soon . About the book: Set in New Delhi in the 1980s,  FOR NO REASON AT ALL  is based on true events. When a young Prime Minister is faced with a decision that could shape the future of Indian innovation, a storm brews around the local production of silicon metal. As corporate lobbying, foreign interference, and government ambition collide, a web of espionage, deception, and unexpected humour emerges. At the centre of it all is Solly Nilla, a sharp and adroit lobbyist, navigating diplomatic pressure, political power plays, and the chaos of a fast-changing world. With its blend of suspense and sharp social commentary, the novel offers both a thrilling plot and a wry reflection on bureaucracy, ambition, and absurdity. About the speakers: Ramjee Chandran  is a journalist, author, and media entrepreneur. He is the host of The Literary City podcast - featuring conversations with acclaimed writers, and The History of Bangalore podcast. A long-time magazine publisher and writer, he brings decades of experience to his fiction. He is currently working on his next book, The History of Bangalore, a meticulously researched narrative tracing the region’s history from prehistoric times to the present. He also plays jazz guitar at the professional level. Shinie Anthony  is the author of several novels and short story collections and is the curator of the Bangalore Literature Festival. Her work is known for its insight, dark humour, and emotional honesty, and she brings her signature wit and empathy to every literary conversation.  ",
    "url": "https://champaca.in/blogs/events/join-us-for-a-book-discussion-on-for-no-reason-at-all-with-ramjee-chandran-and-shinie-anthony-24th-may-5-30pm-champaca-bookstore-vasanth-nagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/for-no-reason-at-all?_pos=1&_sid=2dd51aa33&_ss=r&variant=40714998874147",
        "price": "699",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/join-us-for-a-book-discussion-on-for-no-reason-at-all-with-ramjee-chandran-and-shinie-anthony-24th-may-5-30pm-champaca-bookstore-vasanth-nagar?_pos=2&_sid=8145e61e3&_ss=r&variant=40813647233059",
        "price": "0",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/for-no-reason-at-all?_pos=1&_sid=2dd51aa33&_ss=r&variant=40714998874147",
        "price": "699",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]