[
  {
    "@type": "Event",
    "name": "Launch of GOOD ARGUMENTS with Deepika Arwind",
    "startDate": "2026-01-16T18:30:00+05:30",
    "endDate": "2026-01-16T20:30:00+05:30",
    "description": "Join us at Champaca, Indiranagar for the launch of  GOOD ARGUMENTS  by Deepika Arwind, with a short reading, time to mingle, a book signing, and plant-based bites from Copper + Cloves on the house. Date:  16th January, Friday Time:  6:30 PM onwards Venue:  Champaca, Indiranagar Since seats are limited, we request you to  RSVP here  to reserve your spot. Good Arguments  follows Delphi, a young woman in Bangalore who discovers theatre and is drawn into rehearsals, friendships and a fragile arts scene. As a new venue, Navarasa, is about to open and the 2012 Delhi gangrape and protests shake the country, the questions she explores on stage about voice and power spill into her everyday life. It is a coming-of-age novel about making art with limited resources, and about who gets to tell which stories. Deepika Arwind  is an award-winning writer and playwright whose work has been produced on many continents.  Good Argumnets  is her debut novel. She divides her time between Berlin and Bangalore. she always wanted to say that but now that she actually does, she realises it’s a far more exhausting predicament that she thought it would be. She thinks that in general bios should be funnier and finds Sharanya’s preferable to her own.  Sharanya tells  people she's a theatre maker but she's not. She's a theatre breaker. She's a bored housewife in Basavanagudi drinking single malt whiskey in steel tumblers. She has fascinating insights on idli dose and monogamy. She made a show with Deepika in 2018 called ‘I am not here: an 8-step guide on how to censor women’s writing’. And here she is in conversation about writing and theatre with her.",
    "url": "https://champaca.in/blogs/events/launch-of-good-arguments-with-deepika-arwind-16-january-2026-6-30-pm-onwards",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/launch-of-good-arguments-with-deepika-arwind-16-january-2026-6-30-pm-onwards?variant=41858707324963",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Cracking Open Shakespeare: An interactive reading workshop",
    "startDate": "2026-01-24T10:00:00+05:30",
    "endDate": "2026-01-24T12:00:00+05:30",
    "description": "Ever read a Shakespeare play and felt quite lost? Find the language is too dense? The meaning and the hype impossible to see?   Then this workshop is for you! Join us for an interactive session that demystifies the Bard’s work and makes it come alive — not as high art, but as the gripping, witty, and dramatic entertainment it was always meant to be!  Here are all the Event Details: Date:  24th January, Saturday Time:  10 am to 1 pm Venue:  Champaca Bookstore, Indiranagar Fee:  INR 750 Age Group:  13 years and above What to expect? Through fun, practical exercises, we’ll explore: - Verse & the Iambic Pentameter: How rhythm shapes meaning and emotion in Shakespeare’s text. - And Rhetoric: how Shakespeare’s characters persuade, argue, and plot their way through every scene We’ll break down sonnets, famous speeches and scenes together, lightly touch on the themes and contexts, and end with a lively group reading to celebrate the text’s performative power. Walk away with simple tools to get reading and enjoying Shakespeare on your own. Open yourself to one of the best in world literature, learn from his characterizations and storytelling, and see the magic that has kept his work alive for over 400 years. No prior experience needed. Just bring your curiosity and a pencil and we'll bring the fun! Since seats are limited, we request you to  register here  to reserve your spot.",
    "url": "https://champaca.in/blogs/events/cracking-open-shakespeare-an-interactive-reading-workshop-24-january-10am-champaca-bookstore-indiranagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/cracking-open-shakespeare-an-interactive-reading-workshop-24-january-10am-champaca-bookstore-indiranagar?variant=41857465024547",
        "price": "750",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "LiteraryEvent",
    "name": "Read Aloud and Activity: Rain Perfume – Monsoon Magic with Boondi",
    "startDate": "2026-01-11T11:00:00+05:30",
    "endDate": "2026-01-11T13:00:00+05:30",
    "description": "This January, join us at our Indiranagar store for a sensory storytelling session inspired by  Rain Perfume  by Niveditha Reddy, illustrated by Shubshree Mathur. Children will step into Boondi’s world of rain, Thatha, and that familiar wet-earth smell many of us love. As they listen to the story of how Boondi finds a way to share the joy of the first rain with her grandfather, they’ll move like rain-loving creatures, solve small puzzles, play with the sounds of thunder and raindrops, and respond to the monsoon through simple art activities. Date:  Saturday, 10 January 2026   Time:  11:00 AM onwards   Venue:  Champaca Bookstore, Indiranagar   Age group:  4–8 years Rain Perfume , published by Kalpavriksh, follows Boondi, a little girl who adores the smell of rain and wants to share it with her bedridden Thatha. It’s a gentle story about love, intergenerational bonds, and noticing the quiet but powerful changes nature brings with the monsoon. The book captures the scent of wet soil, small family rituals around rain, and the way children often notice what adults overlook. At the event, children will hear the story read aloud and then explore its ideas through play, art, and conversation. Niveditha is an engineer-turned-writer who discovered her love for storytelling while spinning tales for her young son. Inspired by her travels and everyday encounters, she writes regularly for children’s magazines across genres, with stories that help young readers connect with themselves and the world around them. As seating is limited, please  RSVP here  to book your spot.  ",
    "url": "https://champaca.in/blogs/events/read-aloud-and-activity-rain-perfume-monsoon-magic-with-boond-champaca-bookstore-indiranagar-saturday-10-january-2026-11-am-onwards",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/read-aloud-and-activity-rain-perfume-monsoon-magic-with-boond-champaca-bookstore-indiranagar-saturday-10-january-2026-11-am-onwards?variant=41845769142307",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "India Street Lettering: Book Launch with Pooja Saxena and Nia Thandapani at Champaca Vasanth Nagar",
    "startDate": "2026-01-17T00:00:00+05:30",
    "endDate": "2026-01-17T02:00:00+05:30",
    "description": "We are delighted to host the launch of   India Street Lettering: A Journey Through Typographic Craft & Culture   by typeface designer and lettering artist   Pooja Saxena , in conversation with design historian and graphic designer   Nia Thandapani ,   at Champaca Vasanthnagar. Drawing from over a decade of documentation and research,   India Street Lettering   is a 200-page hardcover, full-colour book that showcases striking public lettering from across Indian cities in paint, relief, mosaic, neon, wood and more. It brings together photographs, essays and interviews that trace how shopfronts, hand-painted signs and vernacular letterforms tell stories about language, labour, design and everyday life in India’s streets. At Champaca, Pooja and Nia will talk about building this archive of signs, the collaborations and fieldwork that shaped the book, and what it means to argue for street lettering as part of the design canon. The evening will also explore the politics of the urban visual landscape, questions of preservation in the age of vinyl and digital printing, and how designers might learn from the ingenuity of sign painters and local lettering traditions. Date:   January 17, 2026, Saturday Time:   6:00 PM onwards Venue:   Champaca Bookstore, Vasanth Nagar Champaca is only accessible through stairs. Pooja Saxena  is a typeface designer, lettering artist and typographer. She is best known for her work with Indic scripts and her writing on locally rooted typographic cultures. Pooja is a devoted collector of ephemera and chronicler of street lettering. Since 2017, she has maintained an online archive of letterforms on public signs around the country. Nia Thandapani   is an independent design historian and practising graphic designer and book maker based in Bangalore. Her work spans colonial and post-independence design history in India and the United Kingdom, with a focus on how questions of power, coloniality and public memory play out in museums, heritage spaces and design practice today. Seats are limited, so please   RSVP here   to save your spot:",
    "url": "https://champaca.in/blogs/events/india-street-lettering-book-launch-with-pooja-saxena-and-nia-thandapani-at-champaca-vasanth-nagar-17-january-2026-6pm-onwards",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/india-street-lettering-book-launch-with-pooja-saxena-and-nia-thandapani-at-champaca-vasanth-nagar-17-january-2026-6pm-onwards?_pos=1&_sid=2a2d33ac1&_ss=r&variant=41845726281763",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]