[
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: MOTHER INDIA with Prayaag Akbar and Jeet Thayil | 7 SEPTEMBER, 5:30 PM",
    "startDate": "2024-09-07T17:30:00+05:30",
    "endDate": "2024-09-07T19:30:00+05:30",
    "description": "Join us at the bookstore to tune into this conversation between  Prayaag Akbar  and  Jeet Thayil  as they discuss Prayaag's latest novel,  MOTHER INDIA.  The details of the event are as follows:  DATE: 7 SEPTEMBER  DAY: SATURDAY TIME: 5:30 PM MOTHER INDIA  is the story of two young people living in contemporary Delhi. Plodding away to make a decent living despite a middling education, Mayank is employed in a right-wing content creator’s dingy basement studio. Nisha, recently moved to the city from her small town in the hills, works as a salesgirl for expensive Japanese chocolate in an upscale mall.  When Mayank discovers Nisha beaming off her Instagram like a beacon, he is smitten, and the video clip he devises for his studio ends up having significant consequences for them both. Sparkling and unexpected, Prayaag Akbar’s new novel brilliantly captures what it means to be young and alive in today’s India. The book has been published by Fourth Estate.  Released in July this year, this novel has  already received endorsements and praise from  Amitava Kumar, Meena Kandasamy, Avni Doshi, Vivek Shanbhag, Madhuri Vijay, Mohammed Hanif. Since there is limited seating, we request you to RSVP to confirm your presence.  Prayaag Akbar  is the author of the novel LEILA (2017), winner of the Crossword Jury Prize and the Tata Literature First Book Award. The book was translated into Hindi, Marathi and Turkish and was used as the basis of a Netflix show. Prayaag teaches creative writing at Krea University.   ",
    "url": "https://champaca.in/blogs/events/book-discussion-mother-india-with-prayaag-akbar-and-jeet-thayil-7-september-5-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-mother-india-with-prayaag-akbar-and-jeet-thayil-7-september-5-30-pm?variant=40552073429027",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Build-a-book with Pustakala | 8 September, 10 AM",
    "startDate": "2024-09-08T10:00:00+05:30",
    "endDate": "2024-09-08T12:00:00+05:30",
    "description": "Build -A- Book is a carefully curated skill-based workshop about bookmaking. The participants will experiment together and learn how to transform ordinary household objects to repurpose them into journals and notebooks, and experiment with different materials. In this workshop you will learn: - How to build basic book structures - An elaborate way to stitch your own books - How to customise notebooks and journals while repurposing material. You won't need any materials.  We're looking at a total of 8-10 people, so book your seats before they're sold out!  RSVP here.",
    "url": "https://champaca.in/blogs/events/build-a-book-with-pustakala-8-september-10-am",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/build-a-book-with-pustakala-8-september-10-am?variant=40550491095075",
        "price": "2500",
        "priceCurrency": "INR"
      }
    ]
  }
]