[
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: Karthik Venkatesh and Vinay Kumar on 10 MAKERS OF INDIAN CONSTITUTION ୲ 15 March, 5:30 PM",
    "startDate": "2025-03-10T00:00:00+05:30",
    "endDate": "2025-03-10T02:00:00+05:30",
    "description": "We are excited to host Karthik Venkatesh and Vinay Kumar at our bookstore for a discussion around Karthik’s latest book 10 MAKERS OF INDIAN CONSTITUTION.  Here are the details of the event - DAY - SATURDAY DATE - 15 March TIME - 5:30 PM Since there is limited seating, we recommend you book your spot by clicking on this  link . About the book - This book explores the lives of ten remarkable women and men who played pivotal roles in shaping the Indian Constitution. From challenging caste norms to advocating for freedom of speech, they contributed ideas that were significant in moulding India as we know it today.  About the speakers -  Karthik Venkatesh When Karthik Venkatesh was growing up in Bangalore, he followed the rules. When he later lived in Delhi and Bathinda, he reluctantly learned to bend the rules. That was the beginning of his interest in the Constitution. He then moved back to Bangalore where he now lives with his wife, Amarinder, sons Geet and Neil, and dog Norah. On weekdays, he runs. On weekends, he naps. He more or less follows the rules always. Vinay Kumar Vinay Kumar is an Aerospace Engineer & founder of  #ReclaimConstitution , a project aimed at fostering a constitutional culture. Started on 26 Jan 2023, the project now has people from many walks of life including Doctors, Artists, Scientists, Engineers & professionals from the Social sector who are exploring newer means to engage in conversations about our Constitution.",
    "url": "https://champaca.in/blogs/events/book-discussion-karthik-venkatesh-and-vinay-kumar-on-10-makers-of-indian-constitution-14-march-5-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-karthik-venkatesh-and-vinay-kumar-on-10-makers-of-indian-constitution-14-march-5-30-pm?variant=40735795544099",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]