[
  {
    "@type": "LiteraryEvent",
    "name": "Book Screenings: Stories on the Page, Stories on the Screen",
    "startDate": "2026-01-11T00:00:00+05:30",
    "endDate": "2026-01-11T02:00:00+05:30",
    "description": "Champaca is excited to host  Book Screenings , a workshop that brings together books and films to think about how stories build the places we inhabit. Three cities, one afternoon of watching, reading and talking about how medium shapes meaning. Book Screenings pairs three books with three films to explore the same place through different lenses. Over the course of the session, we will move between page and screen to ask how writers and filmmakers choose to show a city, a neighbourhood, a life. We will screen clips, read short excerpts and discuss how narrative choices, framing, sound and silence work alongside (or against) what the text is doing. The workshop will also touch on questions of whose stories get told, and how form itself can be political. The three pairings for this edition are: Strange Weather in Tokyo   by Hiromi Kawakami and   Lost in Translation   (Japan) Roman Stories   by Jhumpa Lahiri and   The Bicycle Thief   (Italy) Hour of the Star   by Clarice Lispector and   Hour of the Star   (Brazil) Book Screenings is for readers, film lovers and anyone curious about how stories shape the worlds we think we know. You do not need to have read all the books or watched all the films in advance; the facilitators will guide you through key scenes and passages. Come prepared to watch closely, listen carefully and join in a relaxed, participatory conversation about medium, place and storytelling. The workshop is facilitated by   Rahul Gautam , a director, cinematographer and acting coach with over 15 years of experience working with moving images, and   Pallavi Prasad , a journalist, writer and editor who has spent more than a decade working with words. Together, they bring their perspectives from film and publishing into the room, opening up questions about craft, collaboration and how different mediums invite us to see the same story in new ways. Date:  Sunday, 11 January 2026 Time:  11–12:30 PM Venue:  Champaca Bookstore, Indiranagar Seats are limited. Please  RSVP here  to save your spot!",
    "url": "https://champaca.in/blogs/events/book-screenings-stories-on-the-page-stories-on-the-screen-11-january-2026-champaca-indiranagar",
    "offers": []
  }
]