[
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch of INDIA IN TRIANGLES by Shruthi Rao and Meera Iyer in conversation with Udaya Kumar PL",
    "startDate": "2025-07-06T17:30:00+05:30",
    "endDate": "2025-07-06T19:30:00+05:30",
    "description": "Book Launch of INDIA IN TRIANGLES by Shruthi Rao and Meera Iyer in conversation with Udaya Kumar P.L. | Champaca, Vasanth Nagar | 6 July, 5:30PM We’re delighted to invite you to the launch of  India in Triangles  by Shruthi Rao and Meera Iyer. The authors, in conversation with Udaya Kumar PL, will take us through the fascinating history of one of India’s greatest scientific undertakings—the Great Trigonometrical Survey that aimed to map the entire country. Join us for a discussion that promises to be both engaging and informative!  Here are the details of the event:  Date:   06 July 2025, Sunday Time:   5:30PM Venue:   Champaca Bookstore, Vasanth Nagar Since there is limited seating, we recommend that you   confirm your spot soon! About the book: Step into the boots of fearless surveyors as they trek across forests, mountains and monsoons—facing disease, wild animals and gruelling terrain—to chart the subcontinent with astonishing precision.  This was the Great Trigonometrical Survey, an ambitious mission to map India using triangulation—a brilliant method that helped them measure every inch with accuracy. Along the way, they calculated the height of the world’s tallest mountain and revealed the true shape of the earth. Packed with adventure, ingenuity, mishaps and the unsung heroes of science, this is the epic true story of mathematics, grit and discovery. About the speakers:  Meera Iyer  loves listening to, researching and writing about stories of people and places, buildings and streets. She volunteers with the Indian National Trust for Art and Cultural Heritage, to help protect and celebrate Bengaluru's history and heritage. She loves coffee, dark chocolate and potsherds. Shruthi Rao  is the author of 20 fiction and nonfiction books for children published in India and the US. She has a masters’ degree in energy engineering and worked for a few years in tech before becoming a writer. Originally from Bengaluru, Shruthi now lives in California. She loves desserts, benches and long walks.  Moderating the session is  Udaya Kumar PL , a Bengaluru-based heritage conservationist and independent researcher. He serves as the Honorary Director of the Bengaluru Inscriptions 3D Digital Conservation Project at the Mythic Society, leading one of India's most ambitious citizen-driven initiatives to document and preserve over 1500 stone inscriptions from the Bengaluru region. He applies his interdisciplinary expertise in data science, geospatial analysis, and open-access technologies to heritage preservation, reimagining epigraphy for the digital age. In 2019, he was recognized for his contributions to cultural heritage with the Namma Bengaluru Citizen Individual of the Year award.",
    "url": "https://champaca.in/blogs/events/book-launch-of-india-in-triangles-by-shruthi-rao-and-meera-iyer-in-conversation-with-udaya-kumar-pl-champaca-vasanth-nagar-6-july-5-30pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-of-india-in-triangles-by-shruthi-rao-and-meera-iyer-in-conversation-with-udaya-kumar-p-l-champaca-vasanth-nagar-6-july-5-30pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "STORYTELLING SESSION WITH NEIL FLORY",
    "startDate": "2025-07-05T11:00:00+05:30",
    "endDate": "2025-07-05T13:00:00+05:30",
    "description": "Join us at Champaca Indiranagar on Saturday, 5 July, for a fun-filled and engaging storytelling session with  Neil Flory ! Dive into the world of books and creativity through delightful stories, singing and dancing, fun activities, and even the chance to meet a special guest.  Here are the details of the event:  Date:  5 July 2025, Saturday Time:   11:00 AM Venue:   Champaca Bookstore, Indiranagar Age group:   3-6 years Since there is limited seating, we recommend that you confirm your spot soon— RSVP here! About the event:  Join Neil and Cactus at Champaca Indiranagar for this exciting and interactive storytelling session, featuring three books:  Cactus Wants a Hug ,  Marvellously Mixed Up,  and the recently released  Don’t Do It for Candy . Read from these beloved books, engage in some fun activities, and let your imagination and creativity run wild! About the author:  After years working around the world as a Creative Director, Neil Flory now lives in Goa where he makes art; takes film photographs; writes comics, novels and screenplays; experiments with ceramics; listens to his vinyl collection; cooks up elaborate meals; and writes and develops kids' stories.  His books are full of imagination. You'll meet characters like a Donut offering free hugs, Or a Hipsquirrot - that's a mix of a Hippo, a Squirrel and a Parrot. His first book, The Short Giraffe, was nominated for Book at Australia's premier children's literary awards, the CBCAs. He's released three new books with Hachette India in the last year. ",
    "url": "https://champaca.in/blogs/events/storytelling-session-with-neil-flory-champaca-indiranagar-5-july-11-00am",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/storytelling-session-with-neil-flory-champaca-indiranagar-5-july-11-00am",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "CHAMPACA X DK BOOKS: DINOSAUR DAY",
    "startDate": "2025-06-28T10:30:00+05:30",
    "endDate": "2025-06-28T12:30:00+05:30",
    "description": "In collaboration with DK Books, join us on Saturday, 28 June, at our cosy Indiranagar space for DK Dinosaur Day— a roaring adventure into the world of prehistoric giants! Dive into an epic story from our specially curated collection of dino books, enjoy fun-filled games and DIY activities, and test your inner paleontologist with a thrilling quiz. Children are sure to enjoy this exciting morning full of fun, stories, and learning. Here are the details of the event: Date:   28 June 2025, Saturday  Time:   10:30AM - 12:00PM Venue:   Champaca Bookstore, Indiranagar Age Group:   5-8 years Since there is limited seating, we recommend that you  confirm your spot soon! About DK Books: We’re thrilled to be hosting this event in collaboration with DK Books. DK is a leading publisher known for creating beautifully designed, visually engaging, and fact-filled books for readers of all ages, covering everything from science and history to nature, learning, and beyond. With a strong commitment to inspiring curiosity and making learning fun, DK has become a trusted name among educators, parents, and young readers across the world. DK is bringing the excitement of dinosaurs to life with events happening across the globe in celebration of these ancient creatures. About the facilitators:  Ivy Sengupta   is Managing Art Editor for the Children's team at DK. A designer at heart, she loves to interact with kids to hear their stories, get inspired by their energy and out-of-the-box thinking. Radhika Haswani   is a Senior Editor who is passionate about reading, writing, travelling, baking delicious treats, and creating fun children’s books, especially dinosaur books.",
    "url": "https://champaca.in/blogs/events/champaca-x-dk-books-dinosaur-day-champaca-indiranagar-28-june-10-30am",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/champaca-x-dk-books-dinosaur-day-champaca-indiranagar-28-june-10-30am",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch of HOW TO FORGET by Meera Ganapathi with Joshua Muyiwa",
    "startDate": "2025-06-29T18:00:00+05:30",
    "endDate": "2025-06-29T20:00:00+05:30",
    "description": "Join us on Sunday, 29 June, for the launch of Meera Ganapathi’s new book  HOW TO FORGET: A BOOK OF SHORT STEPS AND LONG WALKS , a gentle, lyrical exploration of the act of walking, and how it helps us lose and find ourselves. Meera will be in conversation with Joshua Muyiwa, and the discussion promises to be profound and insightful—perhaps in unexpected ways. Here are the details of the event:  Date:  29 June 2025, Sunday Time:   6:00PM Venue:   Champaca Bookstore, Vasanth Nagar Since there is limited seating, we recommend that you  confirm your spot  soon. About the book:  In spare and lucid lines of poetry and prose,  How to Forget  takes the reader on a walk through childhood, love, loss and longing. Told through memory and impressions both personal and communal, the book chronicles lifetimes through the act of walking. These journeys often follow the same paths but end in unexpected conclusions. An elephant wanders through tea estates in the Nilgiris, a woman confronts the night, prawns are tossed in chilli oil, a childhood is lost and solitude is found in fifty-five walks across cities and timelines. With gentle and insightful observations, Ganapathi offers soothing respite from the chaos of our cities and the clamour of our thoughts. About the speakers: Meera Ganapathi  is a former advertising professional, and the founder and editor of the literary and arts publication, The Soup. She has written various books for children, like  THE GIRL WHO COULD NOT STOP LAUGHING, UMA VS UPMA, A FRIEND FOR POOCHI  and  PAATI VS UNCLE .  Her poems and short stories have appeared in several anthologies, including,  CAT PEOPLE  and  A CASE OF INDIAN MARVELS: DAZZLING SHORT STORIES BY INDIA'S FINEST WRITERS . Meera lives in Goa with her baby, her partner and her misunderstood cat, Apple. Moderating the session is  Joshua Muyiwa , a Bangalore-based poet and freelance writer, editor and columnist. He has written for publications like The Week, Tehelka, Bangalore Mirror, Firstpost, Mint Lounge, Conde Nast Traveller, and the Hindu Business Line amongst others. His poems have appeared in  POETRY WITH PRAKRITI, THE WORLD THAT BELONGS TO US: AN ANTHOLOGY OF QUEER POETRY FROM SOUTH ASIA  and  elsewhere. He is always looking for different ways to present, perform, and play with his poems. ",
    "url": "https://champaca.in/blogs/events/book-launch-of-how-to-forget-by-meera-ganapathi-with-joshua-muyiwa-champaca-vasanth-nagar-29-june-6-00pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-of-how-to-forget-by-meera-ganapathi-with-joshua-muyiwa-champaca-vasanth-nagar-29-june-6-00pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]