[
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch of HOW TO FORGET by Meera Ganapathi with Joshua Muyiwa",
    "startDate": "2025-06-29T18:00:00+05:30",
    "endDate": "2025-06-29T20:00:00+05:30",
    "description": "Join us on Sunday, 29 June, for the launch of Meera Ganapathi’s new book  HOW TO FORGET: A BOOK OF SHORT STEPS AND LONG WALKS , a gentle, lyrical exploration of the act of walking, and how it helps us lose and find ourselves. Meera will be in conversation with Joshua Muyiwa, and the discussion promises to be profound and insightful—perhaps in unexpected ways. Here are the details of the event:  Date:  29 June 2025, Sunday Time:   6:00PM Venue:   Champaca Bookstore, Vasanth Nagar Since there is limited seating, we recommend that you  confirm your spot  soon. About the book:  In spare and lucid lines of poetry and prose,  How to Forget  takes the reader on a walk through childhood, love, loss and longing. Told through memory and impressions both personal and communal, the book chronicles lifetimes through the act of walking. These journeys often follow the same paths but end in unexpected conclusions. An elephant wanders through tea estates in the Nilgiris, a woman confronts the night, prawns are tossed in chilli oil, a childhood is lost and solitude is found in fifty-five walks across cities and timelines. With gentle and insightful observations, Ganapathi offers soothing respite from the chaos of our cities and the clamour of our thoughts. About the speakers: Meera Ganapathi  is a former advertising professional, and the founder and editor of the literary and arts publication, The Soup. She has written various books for children, like  THE GIRL WHO COULD NOT STOP LAUGHING, UMA VS UPMA, A FRIEND FOR POOCHI  and  PAATI VS UNCLE .  Her poems and short stories have appeared in several anthologies, including,  CAT PEOPLE  and  A CASE OF INDIAN MARVELS: DAZZLING SHORT STORIES BY INDIA'S FINEST WRITERS . Meera lives in Goa with her baby, her partner and her misunderstood cat, Apple. Moderating the session is  Joshua Muyiwa , a Bangalore-based poet and freelance writer, editor and columnist. He has written for publications like The Week, Tehelka, Bangalore Mirror, Firstpost, Mint Lounge, Conde Nast Traveller, and the Hindu Business Line amongst others. His poems have appeared in  POETRY WITH PRAKRITI, THE WORLD THAT BELONGS TO US: AN ANTHOLOGY OF QUEER POETRY FROM SOUTH ASIA  and  elsewhere. He is always looking for different ways to present, perform, and play with his poems. ",
    "url": "https://champaca.in/blogs/events/book-launch-of-how-to-forget-by-meera-ganapathi-with-joshua-muyiwa-champaca-vasanth-nagar-29-june-6-00pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-of-how-to-forget-by-meera-ganapathi-with-joshua-muyiwa-champaca-vasanth-nagar-29-june-6-00pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Tasting: Champaca Bookstore X Copper + Cloves",
    "startDate": "2025-06-20T00:00:00+05:30",
    "endDate": "2025-06-20T02:00:00+05:30",
    "description": "What if you could  taste  a book before reading it? Not just read the blurb, but actually sample its mood, voice, and texture? Just like a spoonful of soup or a bite of dessert, giving you a sense of what’s to come. Welcome to BOOK TASTING, a collaboration between Champaca and Copper + Clove, where food and literature come together to create an unforgettable, sensory journey. In this special event, we’re exploring Sri Lanka, Japan, and Spain through both carefully chosen books and cuisine. With each course- an appetiser, a main, and a dessert, you'll also get a curated  “taste”  of a book from that region: a short reading, a guided discussion, and space to reflect. Whether it’s a lyrical opening chapter, a compelling excerpt, or a vivid scene- you’ll sample a story, just enough to awaken your curiosity and expand your bookshelf. What’s on the menu? 3 book excerpts selected by Radhika Timbadia (Champaca), to match each course Curated dishes prepared by Sarah Nicole Edwards (Copper + Clove) A 3-course plant-based meal inspired by Sri Lanka, Japan, and Spain Guided conversation and reflection after each course INR 999 redeemable on books you discover and fall in love with Date : 20 June, 2025 Time : 7:30 PM Location : Champaca Bookstore, Indiranagar Ticket : INR 1999 (INR1000 for food, INR 999 fully redeemable on books) Spots are limited – reserve your seat soon!  RSVP now",
    "url": "https://champaca.in/blogs/events/book-tasting-champaca-bookstore-x-copper-cloves-20-july-2025-friday-7-30-pm-champaca-bookstore-indirnagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/champaca-bookstore-x-copper-cloves-book-tasting-20-july-2025-friday-7-30-pm-champaca-bookstore-indirnagar",
        "price": "1999",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: THE BEAST WITHIN by Rudraneil Sengupta. The author in conversation with Sharda Ugra at Champaca Bookstore, Vasanth Nagar",
    "startDate": "2025-06-21T00:00:00+05:30",
    "endDate": "2025-06-21T02:00:00+05:30",
    "description": "We’re delighted to host author Rudraneil Sengupta at Champaca for the book discussion of his new book,  THE BEAST WITHIN . The discussion will be a conversation between Rudraneil and journalist Sharda Ugra, as they dive into the themes of the book- crime, caste, identity, and the many layers of life in Delhi. Here are the details of the event: Date:  21 June 2025, Saturday Time :  5:30PM Venue :  Champaca Bookstore, Vasanth Nagar Since there is limited seating, we recommend that you confirm your spot soon -  RSVP here! About the book: THE BEAST WITHIN  takes readers into the murky, complex world of the Delhi Police and the many political and social layers of the city. Written with the insight of years spent reporting from within the force, Rudraneil Sengupta brings to life a compelling, gritty narrative that reads like a binge-worthy crime procedural. The book explores caste, regionalism, identity politics, power, grief, and the divides that mark Delhi’s landscape—from Outer Delhi to its elite South. At its heart,  THE BEAST WITHIN  is a gripping examination of the machinery and human cost of policing in India. About the speakers: Rudraneil Sengupta  is an Indian journalist and author, best known for his work in sports journalism and his acclaimed book  Enter the Dangal: Travels through India’s Wrestling Landscape . Formerly the deputy editor of Lounge, the weekly feature magazine of  Mint , his journalistic work has explored gender, human rights, and the social complexities of contemporary India. Sharda Ugra  has been a powerful voice in Indian sports journalism for over two decades, with a career spanning Mid-Day, The Hindu, and India Today. She has written for Radio Australia, contributed to research projects by the British Sports Council, and is a recipient of awards from the Sports Journalists Federation of India. She also co-authored  John Wright’s Indian Summers , the memoir of the former New Zealand cricket captain.",
    "url": "https://champaca.in/blogs/events/book-discussion-the-beast-within-by-rudraneil-sengupta-the-author-in-conversation-with-sharda-ugra-at-champaca-bookstore-vasanth-nagar-21-june-2025-saturday-5-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-the-beast-within-by-rudraneil-sengupta-the-author-conversation-with-sharda-ugra-at-champaca-bookstore-vasanth-nagar-21-june-2025-saturday-5-30-pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion of HOW TO CLIMB A TREE by Aparna Nori in conversation with Gayatri Ganju and Kaamna Patel",
    "startDate": "2025-06-15T17:30:00+05:30",
    "endDate": "2025-06-15T19:30:00+05:30",
    "description": "Join us on Sunday, 15th June, for a presentation of  How to Climb a Tree,  Aparna Nori’s beautiful and deeply personal photobook. Aparna will be in conversation with Gayatri Ganju and Kaamna Patel. Come to marvel over the stunning photographs and intricate illustrations; stay for a meditation on art, time, belonging, and growing up.  Here are the event details:  Date : 15 June 2025, Sunday Time:   5:30PM Venue:   Champaca Bookstore, Vasanth Nagar Since there is limited seating, we recommend that you confirm your spot soon— RSVP here! About the book:  HOW TO CLIMB A TREE , Aparna's deeply lyrical photobook, is a personal, intuitive image series that episodically documents a timespan when her 10-year-old son was living in a boarding school in Madanapalle, India. What emerges is a collaborative project between mother and son drawn over five years of communication, wherein the images become meditative, introspective traces of places and moments that felt like home for both of them. Interspersed with handwritten letters and illustrations, the book examines how a physical absence or distance can be expressively redrafted through emotional awareness. In this photobook, Aparna creates a safe space - one in which she allows her own vulnerability of the experience of motherhood to slip through while also trying to root her son, giving him a way to return to this time and space again and again.  About the speakers:  Author:   Aparna Nori  is a photographer and visual artist based between Singapore and Bangalore, India. Aparna draws upon personal memory to have a dialogue with the quotidian. Her response is articulated through a range of mediums including alternative photographic processes, installations, video, digital photography and the book form. Aparna is a member of Women Photograph. Moderators:  Gayatri Ganju  (b. 1989) is an artist and documentary photographer from Bangalore. Her personal practice is rooted in a deep and tangled relationship with landscape, while editorially she covers stories about women, the environment and public healthcare. Kaamna Patel  is a photographer born in Mumbai, India. She founded Editions JOJO in 2019 an independent publishing house, photobook library & an artist-led platform based in Mumbai where she embodies numerous roles. She has been an artist in residence at the Cité Internationale des Arts, Paris, in 2022, and at SqW:Lab, Mumbai, in 2024. Her books have entered institutional archives such as the Getty Museum in L.A, the Tate Modern in London, Asia Art Archive in Hong Kong, Arab Image Foundation in Beirut, amongst others.",
    "url": "https://champaca.in/blogs/events/book-discussion-of-how-to-climb-a-tree-by-aparna-nori-in-conversation-with-gayatri-ganju-and-kaamna-patel-champaca-vasanth-nagar-15-june-5-30pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-of-how-to-climb-a-tree-by-aparna-nori-in-conversation-with-gayatri-ganju-and-kaamna-patel-champaca-vasanth-nagar-15-june-5-30pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]