[
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch of HOT WATER by Bhavika Govil in conversation with Aravind Jayan",
    "startDate": "2025-07-12T17:30:00+05:30",
    "endDate": "2025-07-12T19:30:00+05:30",
    "description": "Join us on Saturday, 12th July, for the Bangalore launch of Bhavika Govil’s debut novel,  HOT WATER —a poignant, heartrending story about a family of three, and the secrets and tensions that lie beneath the fragile world they have built themselves. Bhavika will be in conversation with author Aravind Jayan, and the discussion promises to be insightful and moving. Here are the details of the event:  Date:   12th July 2025, Saturday  Time:   5:30PM Venue:  Champaca Bookstore, Vasanth Nagar Since there is limited seating, we recommend that you  RSVP to confirm your spot! About the book: It has always been Mira, Ma and Ashu. The three of them—as they sing Simon & Garfunkel in Ma’s sun-yellow car, watch TV on the sofa and holiday on the mango farm—are bound firmly together. Yet, beneath this tale of proximity, lurks another story—that of a family in hot water. Nine-year-old Mira, fourteen-year-old Ashu and Ma harbour secrets. All of them confront questions that have no neat answers. Where is Ma’s husband, for instance? Who does Ashu pine for? Why is Mira on the alert? One long, hot summer, the secrets come tumbling out. And the world Ma, Mira and Ashu have cobbled together threatens to give way. An achingly beautiful novel,  HOT WATER  traces the ways in which the love we feel for one another can both make and wreck us. About the speakers:  Bhavika Govil  was born in New Delhi and dreams of the sea. She holds a master’s degree in creative writing from the University of Edinburgh. A portion of her debut novel, Hot Water, won the Pontas & JJ Bola Emerging Writers Prize and was a finalist for the DHA New Writers’ Open Week. Bhavika’s short fiction has won the Bound Short Story Prize, been shortlisted for the Queen Mary Wasafiri New Writing Prize, and can be read in Wasafiri, Extra Teeth, Gutter, A Case of Indian Marvels and elsewhere. When she isn’t writing, Bhavika teaches creative writing workshops online and in person.  Moderating the session is  Aravind Jayan , a writer from Trivandrum who now lives in Bangalore. He is the winner of the 2017 Toto Funds the Arts Award and was shortlisted for the Commonwealth Short Story Prize in 2021. His first novel,  TEEN COUPLE HAVE FUN OUTDOORS , has been translated into several languages, and was shortlisted for the 2023 Everyman Wodehouse Prize for Comic Fiction. ",
    "url": "https://champaca.in/blogs/events/book-launch-of-hot-water-by-bhavika-govil-in-conversation-with-aravind-jayan-champaca-vasanth-nagar-12-july-5-30pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-of-hot-water-by-bhavika-govil-in-conversation-with-aravind-jayan-champaca-vasanth-nagar-12-july-5-30pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch of INDIA IN TRIANGLES by Shruthi Rao and Meera Iyer in conversation with Udaya Kumar PL",
    "startDate": "2025-07-06T17:30:00+05:30",
    "endDate": "2025-07-06T19:30:00+05:30",
    "description": "Book Launch of INDIA IN TRIANGLES by Shruthi Rao and Meera Iyer in conversation with Udaya Kumar P.L. | Champaca, Vasanth Nagar | 6 July, 5:30PM We’re delighted to invite you to the launch of  India in Triangles  by Shruthi Rao and Meera Iyer. The authors, in conversation with Udaya Kumar PL, will take us through the fascinating history of one of India’s greatest scientific undertakings—the Great Trigonometrical Survey that aimed to map the entire country. Join us for a discussion that promises to be both engaging and informative!  Here are the details of the event:  Date:   06 July 2025, Sunday Time:   5:30PM Venue:   Champaca Bookstore, Vasanth Nagar Since there is limited seating, we recommend that you   confirm your spot soon! About the book: Step into the boots of fearless surveyors as they trek across forests, mountains and monsoons—facing disease, wild animals and gruelling terrain—to chart the subcontinent with astonishing precision.  This was the Great Trigonometrical Survey, an ambitious mission to map India using triangulation—a brilliant method that helped them measure every inch with accuracy. Along the way, they calculated the height of the world’s tallest mountain and revealed the true shape of the earth. Packed with adventure, ingenuity, mishaps and the unsung heroes of science, this is the epic true story of mathematics, grit and discovery. About the speakers:  Meera Iyer  loves listening to, researching and writing about stories of people and places, buildings and streets. She volunteers with the Indian National Trust for Art and Cultural Heritage, to help protect and celebrate Bengaluru's history and heritage. She loves coffee, dark chocolate and potsherds. Shruthi Rao  is the author of 20 fiction and nonfiction books for children published in India and the US. She has a masters’ degree in energy engineering and worked for a few years in tech before becoming a writer. Originally from Bengaluru, Shruthi now lives in California. She loves desserts, benches and long walks.  Moderating the session is  Udaya Kumar PL , a Bengaluru-based heritage conservationist and independent researcher. He serves as the Honorary Director of the Bengaluru Inscriptions 3D Digital Conservation Project at the Mythic Society, leading one of India's most ambitious citizen-driven initiatives to document and preserve over 1500 stone inscriptions from the Bengaluru region. He applies his interdisciplinary expertise in data science, geospatial analysis, and open-access technologies to heritage preservation, reimagining epigraphy for the digital age. In 2019, he was recognized for his contributions to cultural heritage with the Namma Bengaluru Citizen Individual of the Year award.",
    "url": "https://champaca.in/blogs/events/book-launch-of-india-in-triangles-by-shruthi-rao-and-meera-iyer-in-conversation-with-udaya-kumar-pl-champaca-vasanth-nagar-6-july-5-30pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-of-india-in-triangles-by-shruthi-rao-and-meera-iyer-in-conversation-with-udaya-kumar-p-l-champaca-vasanth-nagar-6-july-5-30pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "STORYTELLING SESSION WITH NEIL FLORY",
    "startDate": "2025-07-05T11:00:00+05:30",
    "endDate": "2025-07-05T13:00:00+05:30",
    "description": "Join us at Champaca Indiranagar on Saturday, 5 July, for a fun-filled and engaging storytelling session with  Neil Flory ! Dive into the world of books and creativity through delightful stories, singing and dancing, fun activities, and even the chance to meet a special guest.  Here are the details of the event:  Date:  5 July 2025, Saturday Time:   11:00 AM Venue:   Champaca Bookstore, Indiranagar Age group:   3-6 years Since there is limited seating, we recommend that you confirm your spot soon— RSVP here! About the event:  Join Neil and Cactus at Champaca Indiranagar for this exciting and interactive storytelling session, featuring three books:  Cactus Wants a Hug ,  Marvellously Mixed Up,  and the recently released  Don’t Do It for Candy . Read from these beloved books, engage in some fun activities, and let your imagination and creativity run wild! About the author:  After years working around the world as a Creative Director, Neil Flory now lives in Goa where he makes art; takes film photographs; writes comics, novels and screenplays; experiments with ceramics; listens to his vinyl collection; cooks up elaborate meals; and writes and develops kids' stories.  His books are full of imagination. You'll meet characters like a Donut offering free hugs, Or a Hipsquirrot - that's a mix of a Hippo, a Squirrel and a Parrot. His first book, The Short Giraffe, was nominated for Book at Australia's premier children's literary awards, the CBCAs. He's released three new books with Hachette India in the last year. ",
    "url": "https://champaca.in/blogs/events/storytelling-session-with-neil-flory-champaca-indiranagar-5-july-11-00am",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/storytelling-session-with-neil-flory-champaca-indiranagar-5-july-11-00am",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]