[
  {
    "@type": "LiteraryEvent",
    "name": "Santanu Bhattacharya with Anuja Chauhan: Book discussion of DEVIANTS | 8 February, 5 PM",
    "startDate": "2025-02-08T17:00:00+05:30",
    "endDate": "2025-02-08T19:00:00+05:30",
    "description": "​Join Santanu Bhattacharya and Anuja Chauhan as they discuss DEVIANTS, Santanu's latest book.  The details of the event are as follows-  DAY- Saturday DATE- 8th February 2025 TIME- 5 PM Please  RSVP here  since the seating for this event will be limited.  About the book \n Vivaan, a teenager in India’s silicon plateau, has discovered love on his smartphone. Intoxicating, boundary-breaking love. His parents know he is gay, and their support is something Vivaan can count on, but they don’t know what exactly their son gets up to in the online world. For his uncle, born thirty years earlier, things were very different. Mambro’s life changed forever when he fell for a male classmate at a time, and in a country, where the persecution of gay people was rife under a colonial-era law criminalising homosexuality. And before that was Mambro’s uncle Sukumar, a young man hopelessly in love with another young man, but forced by social taboos to keep their relationship a secret at all costs. Sukumar would never live the life he yearned for, but his story would ignite and inspire his nephew and grand-nephew after him. Bold and bracing, intimate and heartbreaking,  DEVIANTS  examines the histories we inherit and the legacies we leave behind. \n \n \n About the speakers  Santanu Bhattacharya  grew up in India, and studied at the University of Oxford and the National University of Singapore. He won the Desmond Elliott Prize Residency in 2023, and the Mo Siewcharran and Life Writing Prizes in 2021. His first novel,  One Small Voic e, was an Observer best debut novel of 2023, and was shortlisted for the Authors' Club Best First Novel Award and the Society of Authors’ Gordon Bowker Volcano Prize. He now lives in London. \n \n Anuja Chauhan  worked in advertising for over seventeen years and is credited with many popular campaigns, including PepsiCo's Nothing Official About It, Yeh Dil Maange More, Mera Number Kab Aayega, Oye Bubbly and Darr ke Aage Jeet Hai. She is the author of six bestselling novels - THE ZOYA FACTOR, BATTLE FOR BITTORA, THOSE PRICEY THAKUR GIRLS, THE HOUSE THAT BJ BUILT, BAAZ and CLUB YOU TO DEATH, the screen rights for all of which have been acquired by major Bombay studios. She lives outside Bangalore in an empty nest with her husband, Niret Alva, with whom she shares three valiantly adulting children and a varying number of dogs and cats.",
    "url": "https://champaca.in/blogs/events/santanu-bhattacharya-with-anuja-chauhan-book-discussion-of-deviants-8-february-5-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/santanu-bhattacharya-with-anuja-chauhan-book-discussion-of-deviants-8-february-5-pm?variant=40712980332579",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "S.B.Divya in conversation with Shalini Srinivasan on LOKA | 1 February, 6 PM",
    "startDate": "2025-02-01T18:00:00+05:30",
    "endDate": "2025-02-01T20:00:00+05:30",
    "description": "Join S.B.Divya and Shalini Srinivasan at our bookstore as they discuss S.B.Divya's latest book LOKA, and S.B.Divya's  work as an acclaimed writer of science fiction and fantasy. LOKA is set in the same universe as MERU, and is the story of Akshaya who is the hybrid daughter of a human mother and an alloy, a genetically engineered posthuman – and she's the future of life on the planet Meru.  Before choosing where her future lies, she wants to circumnavigate the most historic orb in the universe – the birthplace of humanity: Earth. Akshaya's parents reluctantly agree to her anthropological challenge and now it's just Akshaya, her equally bold best friend, Somya, and a carefully planned itinerary threading continent by continent across a wondrous terrain of things she's never seen: blue skies, sunrises, snowcapped mountains, and roiling oceans. As the adventure unfolds, the travelers discover love and new friendships, but they also learn the risks of a planet that's not entirely welcoming. On this trek – rapturous, dangerous, and life-changing – Akshaya will discover what human existence really means. The details of the event are as follows-  DAY- Saturday DATE- 1 February  TIME- 6 PM Please  RSVP here  to confirm your presence.  About the speakers   S.B.Divya  is an author and editor. S. B.Divya is also the  Nebula Award nominated author of MACHINEHOOD  and RUNTIME , and  Hugo-nominated co-editor of  Escape Pod  from 2017-2022. S.B.Divya holds degrees in computational neuroscience and signal processing.  Shalini  writes fiction, often for children. Her most recent work is the  Manasa  series of picture books with Pratham Books. Before this, she worked with and wrote several comics for Amar Chitra Katha. Comics are also among her research interests – she did a PhD thesis on graphic journalism at the University of Hyderabad.  ",
    "url": "https://champaca.in/blogs/events/s-b-divya-in-conversation-with-shalini-srinivasan-on-loka-1-february-5-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/s-b-divya-in-conversation-with-shalini-srinivasan-on-loka-1-february-5-30-pm?variant=40708731961379",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Vanamala Viswanatha in conversation with Anjum Hasan on Kuvempu's Epic Novel- BRIDE IN THE HILLS | 15 February, 5:30 PM",
    "startDate": "2025-02-15T17:30:00+05:30",
    "endDate": "2025-02-15T19:30:00+05:30",
    "description": "Join us at the bookstore to tune into this conversation between Vanamala Viswanatha and Anjum Hasan as they discuss Kuvempu's Epic Novel (Penguin's Modern Classics Series, 2024) BRIDE IN THE HILLS.  Here are the details of the event-  DAY- Saturday DATE- 15th February  TIME- 5:30 PM Please  RSVP here  to confirm your presence.  BRIDE IN THE HILLS   tells the love stories of young men and women aspiring for a life of freedom, dignity and fulfilment in marriage within a caste-ridden social order. Kuvempu's multi-centred text, with its organic weave of varied narrative strands, much like the Mahabharata, is epic in substance and style. The novel, which is rooted in the regional realities of Malnad, is yet another example of the diversity of modern Indian literature. This epic novel with the sweep of a Tolstoy classic enacts its mission statement: 'Here, nobody is important; nobody is unimportant; nothing is insignificant!' with brilliance, energy and imaginative power. About the speakers  Vanamala Viswanatha has taught English language and literature during the last 40 years.  She is an award-winning translator who works with Kannada and English. She has served as Honorary Director of the Centre for Translation at Sahitya Akademi, Bengaluru, and a member of the Advisory Committee, National Translation Mission. Vanamala has also translated Raghavanka’s medieval epic Harischandra Kavyam for the Murty Classical Library of India, which has been translating the greatest literary works of India from the past two millennia for larger readership in the world.  Anjum Hasan  is the author of the novels THE COSMOPOLITANS, NETI, NETI and LUNATIC IN MY HEAD, and the short story collections A DAY IN THE LIFE AND DIFFICULT PLEASURES. She has also published a book of poems called STREET ON THE HILL. Her latest novel, HISTORY'S ANGEL recently won the Godrej LitLive! Fiction Book of the Year and FICCI Fiction Book of the Year awards. Anjum writes for various publications including the Los Angeles Review of Books and the New York Review of Books.",
    "url": "https://champaca.in/blogs/events/vanamala-viswanatha-in-conversation-with-anjum-hasan-on-kuvempus-epic-novel-bride-in-the-hills-15-february-5-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/vanamala-viswanatha-in-conversation-with-anjum-hasan-on-kuvempus-epic-novel-bride-in-the-hills-15-february-5-30-pm?variant=40708683464739",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book discussion: COLD KITCHEN- Caroline Eden in conversation with Vijeta Kumar | 7 February, 6 PM",
    "startDate": "2025-02-07T18:00:00+05:30",
    "endDate": "2025-02-07T20:00:00+05:30",
    "description": "\n We're thrilled to be hosting Caroline Eden at our store for the launch of her latest book COLD KITCHEN. The author is here in India on tour to promote her latest book, and we're so glad we've got this opportunity to be a part of her journey.  \n \n Vijeta Kumar will be joining Caroline on the panel, and they will be discussing COLD KITCHEN along with Caroline's previous books RED SANDS and BLACK SEA.  \n \n \n \n \n \n The details of the event are as follows-  \n \n DAY- Friday \n DATE- 7th February  \n TIME- 6 PM  \n Since here is limited seating, we recommend you to confirm your presence by clicking on this  RSVP  link.  \n \n \n About the book \n A welcoming refuge with its tempting pantry, shelves of books and inquisitive dog, Caroline Eden finds comfort away from the road in her basement Edinburgh kitchen. Join her as she cooks recipes from her travels, reflects on past adventures and contemplates the kitchen's unique ability to tell human stories. This is a hauntingly honest, and at times heartbreaking, memoir with the smell, taste and preparation of food at its heart. From late night baking as a route back to Ukraine to capturing the beauty of Uzbek porcelain, and from the troublesome nature of food and art in Poland to the magic of cloudberries,  ​COLD KITCHEN  celebrates the importance of curiosity and of feeling at home in the world. \n \n A ​bout the speakers  Caroline Eden is a writer, book critic and multi-award winner. Before moving to journalism she completed an MA in Jewish Studies and Diaspora at SOAS (School of Oriental and African Studies), University of London. She has contributed to the Financial Times, the Guardian and the Times Literary Supplement. Her first book, Samarkand: Recipes and Stories from Central Asia & the Caucasus, was a Guardian Book of the Year in 2016 and won the Guild of Food Writers Food and Travel Award in 2017. Black Sea: Dispatches and Recipes – Through Darkness and Light, Caroline's second book, has won numerous awards, including the John Avery Award in 2018 and the Art of Eating Prize in 2020. Her most recent publication, Red Sands: Reportage and Recipes through Central Asia, from Hinterland to Heartland, was a 'book of the year' for The New Yorker and won the prestigious André Simon Award in 2020.  Vijeta Kumar is a writer, and teaches Communicative English and Creative Writing at St. Joseph’s University, Bengaluru. ",
    "url": "https://champaca.in/blogs/events/book-discussion-cold-kitchens-caroline-eden-in-conversation-with-vijeta-vj-7-february-6-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-cold-kitchens-caroline-eden-in-conversation-with-vijeta-vj-7-february-6-pm?variant=40705423966243",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]