[
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: SEA ICE? NOW YOU DON'T! with Rohan Chakravarty and Menaka Raman| 24 AUGUST 5 PM",
    "startDate": "2024-08-24T17:00:00+05:30",
    "endDate": "2024-08-24T19:00:00+05:30",
    "description": "Join Rohan Chakravarty and Menaka Raman as they discuss Rohan's latest novel SEA ICE? NOW YOU DON'T! This is the third anthology of the multi-award winning series Green humour comics. From penguins balancing their nests on thin ice to tigers basking in their own glamour whilst worrying about their future, from ghazal-loving bats to whales dumping marine plastic waste right back at us, in SEA ICE? NOW YOU DON'T! you meet an array of wild animals with their own list of concerns, and their own brand of humour. The comics will take you from the high skies to geothermal mines in the very bottom of the ocean, and from sweltering tropical mangroves to the icy poles, engaging you in discussions about ecology, biology, nature conservation, and the politics of governing nature. This is a wild ride for sure, but NOT one which needs you to leave your brains at home! SEA ICE? NOW YOU DON'T!  is the third in the series of Green Humour collections, after ‘Green Humour for a Greying Planet’ and ‘Pugmarks and Carbon Footprints’, and includes comics published in periodic columns with platforms like   DW News ,   The Hindu ,   Roundglass Sustain , and   Gocomics. About the speakers Rohan Chakravarty is the creator of Green Humour, a series of comics and illustrations on wildlife and nature conservation. He lives in Nagpur where he goes on nature trails every day, led by his pet dogs Srishti and Sakshi.  Rohan has authored seven other books, including Green Humour for a Greying Planet, Naturalist Ruddy, and Pugmarks and Carbon Footprints. Although he has won awards by UNDP, Sanctuary Asia, WWF International, the Royal Bank of Scotland and the Green and Bangalore Literature Festivals for his work, a fig that once dropped out of a hornbill’s mouth straight into his palm remains his most cherished prize. His worst nightmare is that the wildlife featured in his comics will read them and gang up on him for revenge some day. Menaka Raman is the author of a number of books for children including HOW TO WIN AN ELECTION (A MOST UNRELIABLE GUIDE), WHAT DO WE NAME THIS DOG and THE FREEDOM SISTERS. Her novel LOKI TAKES GUARD won the Valley of Words Award for Writing for Young Adults. She is a regular contributor to The Hindu Sunday Magazine. Kindly  RSVP here  as there is limited seating.  The details of the events are as follows: DATE- 24 AUGUST 2024 DAY- SATURDAY TIME- 5 PM VENUE- CHAMPACA BOOKSTORE",
    "url": "https://champaca.in/blogs/events/book-discussion-sea-ice-now-you-dont-with-rohan-chakravarty-and-menaka-raman-24-august-5-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-sea-ice-now-you-dont-with-rohan-chakravarty-and-menaka-raman-24-august-5-pm?variant=40536818417699",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Launch of a graphic narrative book ROOTED IN POWER: WOMEN'S GRASSROOTS LEADERSHIP AND CLIMATE ACTION IN INDIA| 10 AUGUST 4PM",
    "startDate": "2024-08-10T16:00:00+05:30",
    "endDate": "2024-08-10T18:00:00+05:30",
    "description": "Dear readers and friends of Champaca, We are happy to invite you for the launch of a graphic narrative book 'Rooted in Power: Women's Grassroots Leadership and Climate Action in India.'  The book, co-created by  Asar  in collaboration with several civil society organisations, aims to uncover powerful stories of hope, resilience and transformative leadership of women from different parts of the country as they lie at the frontlines of the climate crisis. Join us for the launch on August 10 followed by a conversation on Women and Climate Change with: Ms. Aparna Karthikeyan, People's Archive of Rural India (PARI) Ms. Nalini Shekar and Ms. Geetha, Hasiru Dala Ms. Janet Orlene, Writer and Researcher Facilitated by Ms. Seema Mundoli, Azim Premji University DATE AND TIME: 10th August, 4-6 pm Venue: Champaca Bookstore 7/1, Off, Edward Rd, Vasanth Nagar, Bangalore Kindly RSVP  here  as there is limited seating. Please note: Champaca is only accessible by stairs",
    "url": "https://champaca.in/blogs/events/launch-of-a-graphic-narrative-book-rooted-in-power-womens-grassroots-leadership-and-climate-action-in-india-10-august-4pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/launch-of-a-graphic-narrative-book-rooted-in-power-womens-grassroots-leadership-and-climate-action-in-india-10-august-4pm?variant=40534776578083",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: THE SPICE GATE with Prashanth Srivatsa and Lavanya Lakshminarayan | 25 AUGUST, 4 PM",
    "startDate": "2024-08-25T16:00:00+05:30",
    "endDate": "2024-08-25T18:00:00+05:30",
    "description": "Join us at the bookstore to tune into this conversation between Prashanth Srivatsa and Lavanya Lakshminarayan as they discuss Prashanth's debut novel, THE SPICE GATE.  In this fantasy you follow Amir, a young man born with the ability to travel between eight kingdoms, and watch as he unravels the power that keeps the world in balance. It's a perfect read for those who've enjoyed Ken Liu’s Dandelion Dynasty, S.A. Chakraborty’s Daevabad Trilogy, and Andrea Stewart’s The Drowning Empire. The event details are as follows:  DATE: 25 AUGUST, SUNDAY TIME: 4 PM VENUE: CHAMPACA BOOKSTORE  You can  RSVP  here.  About the speakers  \n \n Prashanth Srivatsa  is a writer of fantasy and science fiction, based out of Bengaluru, India. Born in Coimbatore, educated in Mumbai and Delhi, and is currently working out of Bengaluru.  Prashanth’s fantasy and science-fiction short stories and novelettes have appeared in magazines such as Magazine of Fantasy and Science Fiction (F&SF), Asimov’s Science Fiction, Beneath Ceaseless Skies, Cast of Wonders, Heroic Fantasy Quarterly, among others.  \n Lavanya Lakshminarayan  is the author of THE TEN PERCENT THIEF. She’s the first Indian woman to be shortlisted for the prestigious Arthur C. Clarke Award, and is currently a finalist for the Subjective Chaos Kind of Award. She's also a Locus Award finalist, and the winner of the Times of India AutHer Award and the Valley of Words Award. Her short fiction has appeared in a number of magazines and anthologies, including THE BIG BOOK OF CYBERPUNK and TEH BEST OF WORLD SF: VOLUME 2. Lavanya is occasionally a game designer, and has built worlds for Zynga Inc.’s  FarmVille  and  Mafia Wars , among other games. Her next novel, INTERSTELLAR MEGACHEF, releases this November. \n \n \n  ",
    "url": "https://champaca.in/blogs/events/book-discussion-the-spice-gate-with-prashanth-srivatsa-and-lavanya-lakshminarayan-25-august-4-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-the-spice-gate-with-prashanth-srivatsa-and-lavanya-lakshminarayan-25-august-4-pm?variant=40524705857571",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "V. Geetha in conversation with Thejaswi Shivanand on Tara Books' MAKERS Series | 11 AUGUST, 5:30 PM",
    "startDate": "2024-08-11T17:30:00+05:30",
    "endDate": "2024-08-11T19:30:00+05:30",
    "description": " Join us at the bookstore to tune into this conversation between V. Geetha and Thejaswi Shivanand as they discuss the books in the MAKERS series, by Tara Books. The books being discussed are A POTTER'S TALE, BOAT BUILDERS OF THE COROMANDEL and WEAVING WITH COMPASSION.  Read on to know more about these books. A POTTER'S TALE, the first book in the series in which Ramu Velar tells us how he views his craft, vocation and life. Just as his fingers deftly mould a lump of clay to create sturdy pots and beautifully carved bowls, his memory creates sharp as well as dreamy vignettes of his journey from a village potter to a resident craftsman in a museum. Richly textured photographs and evocative illustrations bring alive the world of an unusual and introspective artisan. BOAT BUILDERS OF THE COROMANDEL tells the story of a group of craftsmen who build large wooden cargo boats with their bare hands and simple tools. Stunning on-site photographs bring alive the doing of an unusual craft that requires physical strength as well as dexterity, learnt skills as well as improvisation. A compact narrative, interspersed with the builders’ views on their work, guides the reader through a startling history of making. WEAVING WITH COMPASSION offers insight into the life and work of the Meghwal weavers of Kutch. It calls attention to the source of their creativity and the spiritual wisdom that moors them to their craft. Drawing on interviews with weavers, their reflections on their craft and labour, and onsite photographs, the book documents a century of historical change. Equally it celebrates the imagination that has sustained the weavers’ craft and their social lives and relationships. The conversation will cover the stories behind each of the books, and the ones that link them together. The details of the event are as follows:  DATE- 11 AUGUST TIME- 5:30 PM VENUE- CHAMPACA BOOKSTORE You can RSVP here to confirm your presence. About the speakers  V. Geeth a is a historian and translator and has been active in the women’s movement for over thee decades. She has a special interest in pedagogy. Her work at Tara Books includes editing, writing, and working across different aspects of publishing to ensure that Tara’s publishing philosophy remains in focus, in all that they do. Thejaswi Shivanand  is a curator at Champaca Bookstore. He has taught in an alternative school, designed and facilitated learning spaces for children and children's librarians across rural and urban India for several years. He lives in Bangalore and has a collection of over 100 Tara titles published from 1994 to 2024.  ",
    "url": "https://champaca.in/blogs/events/v-geetha-in-conversation-with-thejaswi-shivanand-on-tara-books-makers-series-11-august-5-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/v-geetha-in-conversation-with-thejaswi-shivanand-on-tara-books-makers-series-11-august-5-30-pm?variant=40522041753635",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]