[
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: THE SPICE GATE with Prashanth Srivatsa and Lavanya Lakshminarayan | 25 AUGUST, 4 PM",
    "startDate": "2024-08-25T16:00:00+05:30",
    "endDate": "2024-08-25T18:00:00+05:30",
    "description": "Join us at the bookstore to tune into this conversation between Prashanth Srivatsa and Lavanya Lakshminarayan as they discuss Prashanth's debut novel, THE SPICE GATE.  In this fantasy you follow Amir, a young man born with the ability to travel between eight kingdoms, and watch as he unravels the power that keeps the world in balance. It's a perfect read for those who've enjoyed Ken Liu’s Dandelion Dynasty, S.A. Chakraborty’s Daevabad Trilogy, and Andrea Stewart’s The Drowning Empire. The event details are as follows:  DATE: 25 AUGUST, SUNDAY TIME: 4 PM VENUE: CHAMPACA BOOKSTORE  You can  RSVP  here.  About the speakers  \n \n Prashanth Srivatsa  is a writer of fantasy and science fiction, based out of Bengaluru, India. Born in Coimbatore, educated in Mumbai and Delhi, and is currently working out of Bengaluru.  Prashanth’s fantasy and science-fiction short stories and novelettes have appeared in magazines such as Magazine of Fantasy and Science Fiction (F&SF), Asimov’s Science Fiction, Beneath Ceaseless Skies, Cast of Wonders, Heroic Fantasy Quarterly, among others.  \n Lavanya Lakshminarayan  is the author of THE TEN PERCENT THIEF. She’s the first Indian woman to be shortlisted for the prestigious Arthur C. Clarke Award, and is currently a finalist for the Subjective Chaos Kind of Award. She's also a Locus Award finalist, and the winner of the Times of India AutHer Award and the Valley of Words Award. Her short fiction has appeared in a number of magazines and anthologies, including THE BIG BOOK OF CYBERPUNK and TEH BEST OF WORLD SF: VOLUME 2. Lavanya is occasionally a game designer, and has built worlds for Zynga Inc.’s  FarmVille  and  Mafia Wars , among other games. Her next novel, INTERSTELLAR MEGACHEF, releases this November. \n \n \n  ",
    "url": "https://champaca.in/blogs/events/book-discussion-the-spice-gate-with-prashanth-srivatsa-and-lavanya-lakshminarayan-25-august-4-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-the-spice-gate-with-prashanth-srivatsa-and-lavanya-lakshminarayan-25-august-4-pm?variant=40524705857571",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "V. Geetha in conversation with Thejaswi Shivanand on Tara Books' MAKERS Series | 11 AUGUST, 5:30 PM",
    "startDate": "2024-08-11T17:30:00+05:30",
    "endDate": "2024-08-11T19:30:00+05:30",
    "description": " Join us at the bookstore to tune into this conversation between V. Geetha and Thejaswi Shivanand as they discuss the books in the MAKERS series, by Tara Books. The books being discussed are A POTTER'S TALE, BOAT BUILDERS OF THE COROMANDEL and WEAVING WITH COMPASSION.  Read on to know more about these books. A POTTER'S TALE, the first book in the series in which Ramu Velar tells us how he views his craft, vocation and life. Just as his fingers deftly mould a lump of clay to create sturdy pots and beautifully carved bowls, his memory creates sharp as well as dreamy vignettes of his journey from a village potter to a resident craftsman in a museum. Richly textured photographs and evocative illustrations bring alive the world of an unusual and introspective artisan. BOAT BUILDERS OF THE COROMANDEL tells the story of a group of craftsmen who build large wooden cargo boats with their bare hands and simple tools. Stunning on-site photographs bring alive the doing of an unusual craft that requires physical strength as well as dexterity, learnt skills as well as improvisation. A compact narrative, interspersed with the builders’ views on their work, guides the reader through a startling history of making. WEAVING WITH COMPASSION offers insight into the life and work of the Meghwal weavers of Kutch. It calls attention to the source of their creativity and the spiritual wisdom that moors them to their craft. Drawing on interviews with weavers, their reflections on their craft and labour, and onsite photographs, the book documents a century of historical change. Equally it celebrates the imagination that has sustained the weavers’ craft and their social lives and relationships. The conversation will cover the stories behind each of the books, and the ones that link them together. The details of the event are as follows:  DATE- 11 AUGUST TIME- 5:30 PM VENUE- CHAMPACA BOOKSTORE You can RSVP here to confirm your presence. About the speakers  V. Geeth a is a historian and translator and has been active in the women’s movement for over thee decades. She has a special interest in pedagogy. Her work at Tara Books includes editing, writing, and working across different aspects of publishing to ensure that Tara’s publishing philosophy remains in focus, in all that they do. Thejaswi Shivanand  is a curator at Champaca Bookstore. He has taught in an alternative school, designed and facilitated learning spaces for children and children's librarians across rural and urban India for several years. He lives in Bangalore and has a collection of over 100 Tara titles published from 1994 to 2024.  ",
    "url": "https://champaca.in/blogs/events/v-geetha-in-conversation-with-thejaswi-shivanand-on-tara-books-makers-series-11-august-5-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/v-geetha-in-conversation-with-thejaswi-shivanand-on-tara-books-makers-series-11-august-5-30-pm?variant=40522041753635",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: INTO THE FOREST with Avtar Singh and Sumana Mukherjee | 2 AUGUST, 6 PM",
    "startDate": "2024-08-02T18:00:00+05:30",
    "endDate": "2024-08-02T20:00:00+05:30",
    "description": "Join us at the bookstore to tune into this conversation between Avtar Singh and Sumana Mukherjee as they discuss Avtar Singh's latest book INTO THE FOREST a book that cover themes of crime, loneliness and life in a German town.   About the speakers Avtar Singh  is an author and editor. His recent fiction credits include the short story ‘A Scandal in Punjab’ in The Hachette Book of Indian Detective Fiction (2024), and ‘The Corpse Bearer’ in Subnivean.org (shortlisted for the Subnivean prize 2023). His recent non-fiction credits include work in Foreign Policy, The Washington Post, Nikkei Asian Review, India Today and Biblio. Singh was a summer fellow at the MacDowell Colony in 2018. He was founding editor-in-chief of Time Out Delhi, and managing editor of The Indian Quarterly. His last novel,  Necropolis , about crime, poetry and a woman who may be centuries-old (HarperCollins India and Akashic Press, US, 2014), was translated into German as Nekroplis. His first novel was  The Beauty of These Present Things  (Penguin India, 2000). Among other print credits, his work has been collected in Mumbai Noir, Civil Lines and the essay volume Pilgrim’s India. He has lived and worked in India, the US and China, and is now based in Germany.  Sumana Mukherjee  now works as a writer and editor after a long career in journalism with publications such as The Indian Express, Forbes India and Mint, where she was, at different points, travel and food editor.  Her interests in books include food, literary and crime fiction and, most recently, business. She'll travel anywhere for food, with a book in tow.  Details of the event are as follows DATE- FRIDAY, 2 AUG TIME- 6 PM VENUE- Champaca Bookstore  RSVP here to confirm your presence.      ",
    "url": "https://champaca.in/blogs/events/book-discussion-into-the-forest-with-avtar-singh-and-sumana-mukherjee-2-august-6-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-into-the-forest-with-avtar-singh-and-sumana-mukherjee-2-august-6-pm?variant=40520826421283",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book discussion of Aishwarya Jha's latest THE SCENT OF FALLEN STARS with Deepthi Talwar | 28 JULY, 6 PM",
    "startDate": "2024-07-28T18:00:00+05:30",
    "endDate": "2024-07-28T20:00:00+05:30",
    "description": "Join Aishwarya Jha and Deepti Talwar as they discuss THE SCENT OF FALLEN STARS, Aishwarya's latest book about a  scholarly loner and a musical prodigy  who came to India for  answers, over twenty years apart.  About the speakers: Aishwarya Jha is a writer, designer and entrepreneur from New Delhi. A mentee at the Asian Women Writers programme, her poetry, short fiction and essays have been published in numerous literary journals and an anthology at Oxford University. Deepthi Talwar is the executive editor at Penguin Random House India.  About the book: A scholarly loner and a musical prodigy come to India for answers, over twenty years apart… In 1995, thirty-six-year-old Will arrives in newly liberalized India. Smarting from the collapse of his academic dreams, he finds little fulfilment in his well-paying telecommunications job or the social confines of New Delhi’s expat community. One monsoon night, he encounters young, enigmatic Leela, who blazes into his world and unleashes a storm of passion and devastation that will alter it forever. Twenty-three years later, Aria lands in the city on a quest to find the mother whom she believed to be dead. Estranged from her convalescing father, her journey leads her to unravel the mysteries of her parents’ story and her mother’s life—from her childhood in an orphanage to a doomed love affair and finally, the remote shores of asceticism. As she searches for answers and a sense of belonging, Aria stumbles upon lost worlds, haunting memories, and the explosive secret that torpedoed her father’s life, the reverberations of which will be cataclysmic for her own. You can  RSVP  here.  The details of the event are as follows:  Date and time: 28 July, 6 PM  Venue: Champaca Bookstore      ",
    "url": "https://champaca.in/blogs/events/book-discussion-of-aishwarya-jhas-latest-the-scent-of-fallen-stars-with-deepthi-talwar-28-july-6-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-of-aishwarya-jhas-latest-the-scent-of-fallen-stars-with-deepthi-talwar-28-july-6-pm?variant=40512910229539",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]