[
  {
    "@context": "http://schema.org",
    "@type": "LiteraryEvent",
    "name": "Book Launch of 'Like Being Alive Twice' By Dharini Bhaskar. In conversation with Jahnavi Barua | 20 April 5 PM",
    "startDate": "2024-04-20T17:00:00+05:30",
    "duration": "PT2H",
    "description": "Join us on 20 April at 5 pm for the book launch of 'Like Being Alive Twice' by Dharini Bhaskar. Dharini will be in coversation with Jahnavi Barua.  RSVP  here   Born in Bombay,   Dharini   has at various points also called the UK, Greece, Delhi and Bangalore home.  Her debut novel   These, Our Bodies Possessed by Light   (Hachette India) was shortlisted for the 2020 JCB Prize for Literature, Tata Literature Live! (First Book: Fiction), and the Valley of Words book awards. She has been published in the anthology   Day’s End Stories ; is a columnist for   The Free Press Journal ; and has contributed to   Hindu BLink ,   Arre ,   Firstpost ,   Mint Lounge ,   Vogue , among other publications. \n Dharini   has spent over a decade in publishing, including as editorial director of Simon and Schuster India. When she’s not writing, she enjoys reading, painting, backpacking, and taking long bike rides with her little boy.  \n Jahnavi Barua  is an Indian writer based in Bangalore.  Next Door  (Penguin India, 2008), her debut collection of short stories was longlisted for the Frank O’Connor International Short Story Award. Her next, a novel called  Rebirth  (Penguin India, 2010), was shortlisted for the Man Asian Literary Prize and the Commonwealth Writers’ Prize. The third,  Undertow,  a novel, was published by Penguin Random House India (Viking Books) in February 2020 and was longlisted for the JCB Prize for Literature 2020 and the BLF Atta Galatta Book Prize 2020. It won the Best Fiction Prize in the Auther Award 2021 and the Kalinga Award for Fiction 2021. Her short fiction has been widely anthologized and her work is part of several university syllabi. Jahnavi is a qualified doctor but does not practise medicine. She was born in Guwahati and raised between Assam, Meghalaya, Delhi and Manchester. \n",
    "url": "https://champaca.in/blogs/events/book-launch-of-like-being-alive-twice-by-dharini-bhaskar-in-conversation-with-jahnavi-baruah",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-of-like-being-alive-twice-by-dharini-bhaskar-in-conversation-with-jahnavi-baruah?variant=40336827482147",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "location": {
      "@type": "Place",
      "name": "Champaca Bookstore",
      "address": {
        "@type": "PostalAddress",
        "streetAddress": "7/1 Edward Road, Off Queens Road",
        "addressLocality": "Bengaluru",
        "postalCode": "560051",
        "addressCountry": "India"
      }
    },
    "isAccessibleForFree": true
  },
  {
    "@context": "http://schema.org",
    "@type": "ChildrensEvent",
    "name": "Children's Event with Ashwin Prabhu: Hands on session on \"Sculpted Stones -Mysteries of Mamallapuram\" | 13 April 11:30 AM",
    "startDate": "2024-04-13T11:30:00+05:30",
    "duration": "PT2H",
    "description": "Join us on 13 April at 11:30 for a hands-on session with Ashwin Prabhu on his new book, \" Sculpted Stones - Mysteries of Mamallapuram \".  \n RSVP  here   Thanks to formulaic ways of teaching, children often mistake history to be nothing but a bundle of facts -   years, names, dynasties and battles . Some children who have a flair for memory respond well to this approach, while most others are quite put off by the singular focus on 'knowledge'. In similar fashion, art in school is usually treated as something meant for those who are able to master a particular technique - again ending up being only for the 'talented' few. What if there is a way to introduce children to history and art through a process of learning which uses first-hand observation, description and even a little imagination! What if this means that children can be freed from the fear of being wrong! In a hands-on session, using his book \" Sculpted Stones - Mysteries of Mamallapuram \",   Ashwin   will work with children on a set of exercises which exposes them to this exciting new way of engaging with historical art. Expect stunning visuals projected onto a screen, a few simple worksheets, and lots of dialogue to deepen learning.",
    "url": "https://champaca.in/blogs/events/childrens-event-with-ashwin-prabhu-hands-on-session-on-sculpted-stones-mysteries-of-mamallapuram-13-april-11-30-am",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/childrens-event-with-ashwin-prabhu-hands-on-session-on-sculpted-stones-mysteries-of-mamallapuram?_pos=1&_sid=b4c65464c&_ss=r&variant=40332975276067",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "location": {
      "@type": "Place",
      "name": "Champaca Bookstore",
      "address": {
        "@type": "PostalAddress",
        "streetAddress": "7/1 Edward Road, Off Queens Road",
        "addressLocality": "Bengaluru",
        "postalCode": "560051",
        "addressCountry": "India"
      }
    },
    "isAccessibleForFree": true
  },
  {
    "@context": "http://schema.org",
    "@type": "EducationEvent",
    "name": "Workshop on Painting with Botanical Inks by Sudha Palepu | 21 Apil 10:00 AM",
    "startDate": "2024-04-21T00:00:00+05:30",
    "duration": "PT2H",
    "description": "Join us on 21 April at 10:00 AM for a workshop on painting with botanical inks! An introduction to botanical colours, this workshop brings together elements of everyday science of pigments in nature, towards creating art. It also hopes to bring focus to what we call or consider ‘waste’ in our everyday lives and what we do with it. The workshop is designed in two parts. First half will involve making the botanical inks from kitchen and garden scraps. The second part will give participants the time and space to paint with the inks, on paper. In groups, participants will learn to extract inks from the botanical sources using simple techniques. Using these inks, each participant will get to make individual artworks for them to take home. Best suited for adults (18 years+) No prior experience required. All materials will be provided. RSVP  here Sudha Palepu  is a natural colour artist and exhibition designer. A graduate of NID, Ahmedabad and SOAS, University of London, she works in the culture interpretation sector. In 2020, she started her art practice in creating inks and pigments from natural sources, using which she makes ephemeral art. Sudha conducts natural colour workshops as a way to publicly engage with cultural perceptions around colour and its occurrence in nature as well as in human-made environments",
    "url": "https://champaca.in/blogs/events/workshop-on-painting-with-botanical-inks-by-sudha-palepu-21-apil-11-30-am",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/workshop-on-painting-with-botanical-inks-by-sudha-palepu?_pos=1&_sid=ab30ceb3e&_ss=r&variant=40332978356259",
        "price": "2000",
        "priceCurrency": "INR"
      }
    ],
    "location": {
      "@type": "Place",
      "name": "Champaca Bookstore",
      "address": {
        "@type": "PostalAddress",
        "streetAddress": "7/1 Edward Road, Off Queens Road",
        "addressLocality": "Bengaluru",
        "postalCode": "560051",
        "addressCountry": "India"
      }
    }
  }
]