[
  {
    "@type": "Event",
    "name": "Chauraha: A Meeting Place of Four Poets | 16 June, 5 PM",
    "startDate": "2024-06-16T17:00:00+05:30",
    "description": "Four Bangalore based poets are coming together to celebrate Atreyee Majumder's latest book of poems THE BOOK OF BLUE published by Red River. This evening is all about discussing poems, and what inspires these talented poets to write.  Join us for an interactive evening of poetry reading and conversations with poets Atreyee Majumder, Mani Rao, Tuhin Bhowal and Sourav Roy.  About the poets: Atreyee Majumder Atreyee Majumder is a poet and anthropologist based in Bangalore. Her first book of poems is now out from Red River titled The Book of Blue. Mani Rao Mani Rao is the author of 12 books and chapbooks of poetry and three books in translation. Researching mantra experience in tantric communities, she discovered continuing revelations and new mantras in circulation on-ground for  Living Mantra: Mantra, Deities and Visionary Experience  (Palgrave Macmillan, 2019) Sourav Roy Sourav Roy is a bilingual writer, poet, journalist, and translator. He currently works as a teacher at Head Start Educational Academy, and has been a visiting faculty at Azim Premji University and NIFT Bengaluru in the past. T uhin Bhowal Recipient of the  Deepankar Khiwani Memorial Poetry Prize 2022  and Longlisted for the  TOTO Funds the Arts Award for Poetry 2024 , Tuhin Bhowal's poems and translations appear or are forthcoming in  Redivider, Bad Lilies, Poetry at Sangam , and elsewhere. Here is where you can RSVP.  Details of the event are as follows: Chauraha: A Meeting Place of Four Poets Date: Sunday, 16 June Time: 5 PM Venue: Champaca Bookstore Champaca is only accessible by stairs. ",
    "url": "https://champaca.in/blogs/events/chauraha-a-meeting-place-of-four-poets-16-june-5-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/chauraha-a-meeting-place-of-four-poets-16-june-5pm?variant=40476715089955",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch: The Great Nicobar Betrayal, curated by Pankaj Sekhsaria | 9 June, 5PM at Champaca Bookstore",
    "startDate": "2024-06-09T17:00:00+05:30",
    "description": "Join us for a book launch of THE GREAT NICOBAR BETRAYAL and tune into the discussion between Pankaj Sekhsaria and Samar Halarnkar as they discuss the contemporary issues that threaten to destroy the Andaman and Nicobar Islands. The book is a catalogue of the manmade catastrophe that lurks on the horizon, and the discussion promises to be an insightful one.  THE GREAT NICOBAR BETRAYAL is a Frontline Publication.  About the speakers:  Pankaj Sekhsaria is the author/editor of 6 books on the Andaman and Nicobar islands and has spent 20 years covering the region as a journalist.  Samar Halarnkar an author, founder-editor of Article 14 , and a columnist for Scroll.in. He is also cofounder of the India Love Project.      Details of the event: Date: Sunday, 9 June  Time: 5 PM  Venue: Champaca Bookstore     RSVP here   to confirm your presence. ",
    "url": "https://champaca.in/blogs/events/book-launch-the-great-nicobar-betrayal-curated-by-pankaj-sekhsaria-9-june-5pm-at-champaca-bookstore",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-the-great-nicobar-betrayal-curated-by-pankaj-sekhsaria-9-june-5pm-at-champaca-bookstore?variant=40465677385763",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]