[
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: THE BOOK OF EMPERORS, Ashwitha Jayakumar and Nikhil Gulati in conversation with Vikramajit Ram | 29 September, 12 PM",
    "startDate": "2024-09-29T12:00:00+05:30",
    "endDate": "2024-09-29T14:00:00+05:30",
    "description": "The Book of Emperors  by Ashwitha Jayakumar and Nikhil Gulati is an illustrated book of history that animates the lives and times of the Mughal Emperors, and we're thrilled to have the authors discussing this book at our bookstore! Ashwitha and Nikhil will be in conversation with Vikramajit Ram.  Drop by for this exciting book discussion and get a chance to meet the speakers in person on the 29th of September! Here are the details of the event:  DATE- 29TH SEPTEMBER, SUNDAY TIME- 12 PM- 1 PM  VENUE- CHAMPACA BOOKSTORE  RSVP  here since there will be limited seating.   About the speakers:  Ashwitha Jayakumar  has written and adapted over a dozen books for young readers on history, mythology and science. After graduating with a master’s degree in Literature and Society: 1688–1900 from the University of Edinburgh, she taught English literature to secondary school students and worked in publishing before doing an MA in medieval studies from the University of Leeds entirely for fun. She’s mad about history, fantasy novels, chocolate and dogs. Nikhil Gulati  is an author and illustrator of graphic novels. He is the award winning creator of The People of the Indus, a graphic novel history of the Indus Valley Civilization. He likes telling all kinds of stories through the medium of comics whether it is the histories of long lost civilizations or a ghost story set in his own home. He is a graduate of the University of Texas-Austin and the Indian Institute of Management-Ahmedabad. Vikramajit Ram  is a novelist and non-fiction writer based in Bangalore. A graduate of the National Institute of Design, he formerly practised as a graphic designer. He is the author of Elephant Kingdom: Sculptures from Indian Architecture (2007), Dreaming Vishnus: A Journey through Central India (2008), Tso and La: A Journey in Ladakh (2012), and The Sun and Two Seas (2016). His latest book, Mansur: A Novel, was published in November 2022.   About the book A little over five hundred years ago, a boy sat in a garden, waiting for his story to begin. His name was Babur, and he would soon found an empire that astonished the world. For three hundred years, Babur’s sons and grandsons, alongside their mothers, wives, sisters, and daughters, would wage wars, make art and music, eat a delicious fruit or two, and both shape and be shaped by the land they made their home. History would call them the Mughals.   The Book of Emperors   tells their stories.",
    "url": "https://champaca.in/blogs/events/book-discussion-the-book-of-emperors-ashwitha-jayakumar-and-nikhil-gulati-in-conversation-with-vikramajit-ram-29-september-12-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-the-book-of-emperors-ashwitha-jayakumar-and-nikhil-gulati-in-conversation-with-vikramajit-ram-29-september-12-pm?variant=40582798278691",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]