[
  {
    "@type": "LiteraryEvent",
    "name": "Book discussion: COLD KITCHENS- Caroline Eden in conversation with Vijeta Kumar | 7 February, 6 PM",
    "startDate": "2025-02-07T18:00:00+05:30",
    "endDate": "2025-02-07T20:00:00+05:30",
    "description": "\n We're thrilled to be hosting Caroline Eden at our store for the launch of her latest book COLD KITCHEN. The author is here in India on tour to promote her latest book, and we're so glad we've got this opportunity to be a part of her journey.  \n \n Vijeta Kumar will be joining Caroline on the panel, and they will be discussing COLD KITCHEN along with Caroline's previous books RED SANDS and BLACK SEA.  \n \n \n \n \n \n The details of the event are as follows-  \n \n DAY- Friday \n DATE- 7th February  \n TIME- 6 PM  \n Since here is limited seating, we recommend you to confirm your presence by clicking on this  RSVP  link.  \n \n \n About the book \n A welcoming refuge with its tempting pantry, shelves of books and inquisitive dog, Caroline Eden finds comfort away from the road in her basement Edinburgh kitchen. Join her as she cooks recipes from her travels, reflects on past adventures and contemplates the kitchen's unique ability to tell human stories. This is a hauntingly honest, and at times heartbreaking, memoir with the smell, taste and preparation of food at its heart. From late night baking as a route back to Ukraine to capturing the beauty of Uzbek porcelain, and from the troublesome nature of food and art in Poland to the magic of cloudberries,  ​COLD KITCHEN  celebrates the importance of curiosity and of feeling at home in the world. \n \n A ​bout the speakers  Caroline Eden is a writer, book critic and multi-award winner. Before moving to journalism she completed an MA in Jewish Studies and Diaspora at SOAS (School of Oriental and African Studies), University of London. She has contributed to the Financial Times, the Guardian and the Times Literary Supplement. Her first book, Samarkand: Recipes and Stories from Central Asia & the Caucasus, was a Guardian Book of the Year in 2016 and won the Guild of Food Writers Food and Travel Award in 2017. Black Sea: Dispatches and Recipes – Through Darkness and Light, Caroline's second book, has won numerous awards, including the John Avery Award in 2018 and the Art of Eating Prize in 2020. Her most recent publication, Red Sands: Reportage and Recipes through Central Asia, from Hinterland to Heartland, was a 'book of the year' for The New Yorker and won the prestigious André Simon Award in 2020.  Vijeta Kumar is a writer, and teaches Communicative English and Creative Writing at St. Joseph’s University, Bengaluru. ",
    "url": "https://champaca.in/blogs/events/book-discussion-cold-kitchens-caroline-eden-in-conversation-with-vijeta-vj-7-february-6-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-cold-kitchens-caroline-eden-in-conversation-with-vijeta-vj-7-february-6-pm?variant=40705423966243",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion- AIRPLANE MODE: A PASSIVE-AGGRESSIVE HISTORY OF TRAVEL- Shahnaz Habib in conversation with Rohini Mohan | 30th January, 6 PM",
    "startDate": "2025-01-30T18:00:00+05:30",
    "endDate": "2025-01-30T20:00:00+05:30",
    "description": "​Join Shahnaz Habib in conversation with Rohini Mohan as they discuss AIRPLANE MODE: A PASSIVE-AGGRESSIVE HISTORY OF TRAVEL.  The details of the event are as follows-  DAY- Thursday DATE- 30TH January 2025 TIME- 6 PM The seating will be limited. We request you to  RSVP here  to confirm your presence.  About the book This witty personal and cultural history of travel from the perspective of a Third World–raised woman of colour asks: What does it mean to be a joyous traveller when we live in the ruins of colonialism, capitalism and climate change? The conditions of travel have long been dictated by the colours of passports and the colour of skin. This insightful debut by Shahnaz Habib parses who gets to travel, and who gets to write about the experience. All the while, she threads the historic but ever-evolving dynamics of travel into her personal story as a child on family vacations in India, an adult curious about the world, and an immigrant for whom round trips are an annual fact of life.  Woven throughout the book are inviting and playful analyses of obvious and not-so-obvious travel artefacts: passports, carousels, bougainvilleas, guidebooks, trains, the idea of wanderlust itself. Together, they tell a subversive history of travel as a Euro-American mode of consumerism—but as any traveller knows, travel is more than that.  About the speakers  \n Shahnaz Habib  is the author of the nonfiction book AIRPLANE MODE, and the translator of the novel JASMINE DAYS, for which she and the author Benyamin won the JCB Prize, India's most valuable prize for literature. Her short stories and nonfiction have appeared in The New Yorker online, Creative Nonfiction, Agni, Brevity, The Guardian, and Afar. She has been awarded a New York Foundation for the Arts Artists' Fellowship in Nonfiction Literature, and her work has been cited in the Best American Essays series. She holds a BA from Mahatma Gandhi University, an MA in English Literature from the University of Delhi, and an MA in Media Studies from the New School. \n Rohini Mohan  is a prize-winning political journalist based in Bangalore, India. She has an MA in Political Journalism from Columbia University, New York, where she was a 2009–2010 Presidential Fellow. She has won prestigious awards for her work, including the Charles Wallace Fellowship 2013, London; the ICRC Humanitarian Reporting Award 2012, New Delhi; the Sanskriti-Prabha Dutt Fellowship 2012, New Delhi; and the South Asian Journalists’ Association award 2011, New York. She has written for Tehelka, the Caravan, Outlook, the Hindu and the New York Times.",
    "url": "https://champaca.in/blogs/events/airplane-mode-shahnaz-habib-in-conversation-with-rohini-mohan-30th-january-6-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/airplane-mode-shahnaz-habib-in-conversation-with-rohini-mohan-30th-january-6-pm?variant=40705417838627",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Politics & Culture: A workshop led by V. Geetha from Tara Books | 26 January, 9:45 AM to 12:30 PM",
    "startDate": "2025-01-26T09:45:00+05:30",
    "endDate": "2025-01-26T11:45:00+05:30",
    "description": "Join us at the bookstore this Republic Day and be a part of an engaging workshop led by V. Geetha from Tara Books. At this workshop we will be discussing books on politics and culture. You can buy tickets for the workshop on  this link.  Here is what the morning will look like-  - Kickstarting the event with an introduction of the theme: 9:45 AM - Discuss the theme in the first book- A POTTER'S TALE: 10 AM  - Activity based on the first theme discussed: 10:20 AM - Sharing the activity and exchanging feedback: 10:45 AM \n \n <Break> \n - Discuss the theme in the second book- ANOTHER HISTORY OF THE CHILDREN'S PICTUREBOOK: 11:15 AM  \n - Activity based on the theme discussed: 11:30 AM \n - Sharing the activity and exchanging feedback: 11: 50 AM \n \n - Closing note: 12:10 PM \n \n \n \n \n Things to keep in mind-  \n \n 1. We will be discussing two books- A POTTER'S TALE and ANOTHER HISTORY OF THE CHILDREN'S PICTUREBOOK.  \n 2. We are looking at a maximum number of 20 participants in this workshop.  \n 3. The workshop is priced at 1500 INR.  \n 4. Participants will get a special discount on the books discussed in the workshop.  \n \n Looking forward to seeing you at the workshop! Do purchase a ticket to confirm your presence.  \n",
    "url": "https://champaca.in/blogs/events/politics-culture-a-workshop-led-by-v-geetha-from-tara-books-26-january-9-45-am-to-12-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/politics-culture-a-workshop-led-by-v-geetha-from-tara-books-26-january-9-45-am-to-12-30-pm?variant=40692180058147",
        "price": "1500",
        "priceCurrency": "INR"
      }
    ]
  }
]