[
  {
    "@type": "Event",
    "name": "Film Screening: Worlds of Ursula K. Le Guin by Arwen Curry | 16 NOVEMBER, 7 PM",
    "startDate": "2024-11-16T19:00:00+05:30",
    "endDate": "2024-11-16T21:00:00+05:30",
    "description": "We are thrilled to be screening  Worlds of Ursula K. Le Guin , a documentary by Arwen Curry, at our bookstore this November! Worlds of Ursula K. Le Guin  is a feature documentary exploring the remarkable life and legacy of the late feminist author  Ursula K. Le Guin.  Best known for groundbreaking science fiction and fantasy works such as  A Wizard of Earthsea, The Left Hand of Darkness, and The Dispossessed , Le Guin held her ground on the margin of “respectable” literature until the sheer excellence of her work, at long last, forced the mainstream to embrace fantastic literature. Her fascinating story has never before been captured on film.  Watch the trailer. Produced with Le Guin’s participation over the course of a decade,  Worlds of Ursula K. Le Guin  is a journey through the writer’s career and her worlds, both real and fantastic. Viewers will join the writer on an intimate journey of self-discovery as she comes into her own as a major feminist author, opening new doors for the imagination and inspiring generations of women and other marginalized writers along the way.  The film features stunning animation and reflections by literary luminaries including Margaret Atwood, David Mitchell, Michael Chabon, and more.  Filmmaker Arwen Curry with the author during the production of  Worlds of Ursula K.Le Guin. About the director: Filmmaker Arwen Curry worked with Ursula K. Le Guin for ten years to create  Worlds of Ursula K. Le Guin . She served as Associate Producer and Archivist of the PBS American Masters film   EAMES: The Architect and the Painter ,  and associate-produced both  American Jerusalem: Jews and the Making of San Francisco ,  and the acclaimed HBO film  Regarding Susan Sontag . Arwen is a former chief editor of the seminal punk magazine  Maximum Rocknroll   and has written for print, radio, and film. She is a San Francisco Bay Area native and a graduate of the UC Berkeley Graduate School of Journalism. Event details We will open the event with an introduction and talk about the books and works of Ursula K. Le Guin by our curator and writer Kavya Murthy*. The documentary screening is of 68 minutes and will be followed by an open house to discuss and respond to the film together. Limited seating. Please purchase a  ticket  to confirm your spot. *Kavya Murthy is a writer, editor, reader and curator who has worked with Champaca Bookstore from the very beginning. She likes urban sketching, tango, dragons in fiction and queer writing.  ",
    "url": "https://champaca.in/blogs/events/film-screening-worlds-of-ursula-k-le-guin-by-arwen-curry-16-november-7-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/screening-worlds-of-ursula-k-le-guin-by-arwen-curry-16-november-7-pm?variant=40607185305635",
        "price": "599",
        "priceCurrency": "INR"
      }
    ]
  }
]