[
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion on THE LIVING AIR with Aasheesh Pittie at Champaca Bookstore | 26 May 5:00 PM",
    "startDate": "2024-05-26T17:00:00+05:30",
    "description": "If you’re looking for new ways to engage with birds and birdwatching in particular, you're going to enjoy tuning into this session that we have planned at the bookstore! Aasheesh Pittie and the book's illustrator Sangeetha Kadur will be in conversation with Anita Mani of Indian Pitta Books. They will be discussing his latest book of essays- THE LIVING AIR.  THE LIVING AIR is a book that will make you want to get out and observe your city and surroundings in a whole new light, and offers a fresh perspective into birdwatching. It  is the first book released by Juggernaut and Indian Pitta, India’s first dedicated book imprint for bird lovers, policy makers, and conservationists. RSVP here.   Here are the details of the event- 🌿 TIME : 5:00 PM 🌿DATE : 26 MAY, 2024, SUNDAY 🌿 VENUE : CHAMPACA BOOKSTORE Looking forward to an engaging discussion about the nature we find in city life! ",
    "url": "https://champaca.in/blogs/events/book-discussion-on-the-living-air-with-aasheesh-pittie-at-champaca-bookstore-26-may-5-00-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-on-the-living-air-with-aasheesh-pittie-at-champaca-bookstore-26-may-5-30-pm?variant=40430612938787",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Crime Book Swap at The Biere Club | 16 May at 5:30 PM",
    "startDate": "2024-05-16T17:30:00+05:30",
    "description": "Join us at The Biere Club for a thrilling book swap event tailored for all crime fiction enthusiasts! This time, let's exchange puzzling clues and exciting plot twists, and celebrate the art of storytelling within our community. You can  RSVP  to the event here.    Come by to exchange books, and don't forget to explore our curated collection of Crime Bestsellers. Let's spread the love for crime stories together! Here are the details-  DAY- 16 MAY, THURSDAY TIME- 5:30 PM  VENUE: THE BIERE CLUB  ",
    "url": "https://champaca.in/blogs/events/crime-book-swap-at-the-biere-club-16-may-at-5-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/crime-book-swap-16-may-5-30-pm-the-biere-club?variant=40422794723363",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Build-a-book with Pustakala | 10:30 AM, 19 May, Sunday",
    "startDate": "2024-05-19T10:30:00+05:30",
    "description": "This book-making workshop by   Pustakala   is a carefully crafted, skill-focused experience in the art of book-making. Join us as participants collaborate, experiment, and discover how to repurpose and transform everyday household items into beautifully crafted journals and notebooks! In this workshop you will learn: - How to build basic book structures - Two elaborate ways to stitch your own books - Two fun ways to make folding/sticking books - How to customise notebooks and journals You won't need any materials.  We're looking at a total of 6-8 people, so book your seats before they're sold out! You can  RSVP   here.    Saachi   is an artist, educator, and designer with over 5 years of industry experience.",
    "url": "https://champaca.in/blogs/events/build-a-book-with-pustakala-10-30-am-19-may-sunday",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/build-a-book-with-pustakala-10-30-am-19-may-sunday?variant=40422727581731",
        "price": "2500",
        "priceCurrency": "INR"
      }
    ]
  }
]