[
  {
    "@type": "LiteraryEvent",
    "name": "Book launch: THE SENTENCE by Gautam Bhatia, moderated by Aakar Patel | 22 December, 6 PM",
    "startDate": "2024-12-22T18:00:00+05:30",
    "endDate": "2024-12-22T20:00:00+05:30",
    "description": "Join us for an exciting evening with Gautam Bhatia and Aakar Patel as they discuss Gautam Bhatia's latest book THE SENTENCE. The SENTENCE tells the story of Jagat, an anarchist politician who goes down in history for becoming a martyr and preventing civil war.  A little more about the book:  An impoverished young man, Jagat, is found guilty of murder. For his crime, he is sentenced to the highest form of punishment—the sleep of death for a century, with the promise of revival should his innocence ever be proven. But his act sparks violence in the great city of Peruma, with the Commune, an anarchist collective of workers, revolting against the Council, which has ruled Peruma for four hundred years. Drained by endless conflict, Council and Commune negotiate a hundred-year treaty that is to be enforced by an impartial body: the guardians of the Confederation. And now, a century later, the Charter is a week away from lapsing. Tensions run high in Peruma. As an uncertain future looms, Nila, a young guardian, is approached by a mysterious woman who insists that Jagat’s case be reopened before it’s too late. Drawn by the prospect of undoing a possible historical injustice, Nila agrees. But as she begins to unearth the past, forces, known and unknown, thwart her at every turn. What secrets does the city hold? Who is working in the shadows against her—and why? What is the price of resurrecting a martyr?  The Sentence  raises questions about justice, rights and ethics that will echo in your mind long after you’ve turned the last page. ‘There may be a time, Guardian, when it doesn’t matter whether our peace is founded on the truth or a lie. All that matters is that there is peace.’ Do  RSVP here  to confirm your presence since the seating would be limited.  The event details are as follows:  DATE- 22 DECEMBER, SUNDAY  TIME- 6 PM VENUE- CHAMPACA BOOKSTORE \n \n About the speakers:  \n Gautam Bhatia is an Indian SF writer, reviewer and editor, based in New Delhi. He is the author of the   SF duology, The Wall   (2020) and   The Horizon   (2021), published by HarperCollins India. Both books were on Locus Magazine’s annual recommended reading list, and earned critical praise in Locus, Interzone, Vector, and in mainstream Indian newspapers. He was also long-listed for the Astounding Award for Best New Writer at both the 2021 and the 2022 World Science Fiction Conventions. His short stories have appeared in The Gollancz Book of South Asian Science Fiction, Grimdark Magazine and Indian magazines such as The Mint. \n Gautam is actively involved with genre non-fiction. He is the co-ordinating editor of Strange Horizons, a weekly SF magazine that won the British Fantasy Award in 2021, and the Hugo Award in 2024. For his work with the magazine, he was an individual finalist for the World Fantasy Award in 2022. In 2022, he was on the non-fiction jury for the British Fantasy Award. His reviews and analytical pieces on contemporary SF appear frequently in Indian newspapers, and in Strange Horizons and Interzone, and in 2023, he was a finalist for the British Science Fiction Association (BSFA) award for the best short non-fiction piece (for an essay on world-building in the Bombay Literary Magazine). He is the founder of New Delhi’s first (and so far, only) SF Reading Club, and has been running a fortnightly newsletter focusing on developments in Indian genre fiction for the last three years. \n \n In his other life, he is a constitutional lawyer and public commentator on civil and constitutional rights in India. His SF draws upon his engagement with constitutions, law and justice. \n \n \n Aakar Patel   is an Indian columnist, activist and author.  \n \n",
    "url": "https://champaca.in/blogs/events/book-launch-the-sentence-by-gautam-bhatia-moderated-by-aakar-patel-22-december-5-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-the-sentence-by-gautam-bhatia-moderated-by-aakar-patel-22-december-5-pm?variant=40675686350883",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]