[
  {
    "@type": "LiteraryEvent",
    "name": "Book discussion of Aishwarya Jha's latest THE SCENT OF FALLEN STARS with Deepthi Talwar | 28 JULY, 6 PM",
    "startDate": "2024-07-28T18:00:00+05:30",
    "endDate": "2024-07-28T20:00:00+05:30",
    "description": "Join Aishwarya Jha and Deepti Talwar as they discuss THE SCENT OF FALLEN STARS, Aishwarya's latest book about a  scholarly loner and a musical prodigy  who came to India for  answers, over twenty years apart.  About the speakers: Aishwarya Jha is a writer, designer and entrepreneur from New Delhi. A mentee at the Asian Women Writers programme, her poetry, short fiction and essays have been published in numerous literary journals and an anthology at Oxford University. Deepthi Talwar is the executive editor at @penguinrandomhouseindia  About the book: A scholarly loner and a musical prodigy come to India for answers, over twenty years apart… In 1995, thirty-six-year-old Will arrives in newly liberalized India. Smarting from the collapse of his academic dreams, he finds little fulfilment in his well-paying telecommunications job or the social confines of New Delhi’s expat community. One monsoon night, he encounters young, enigmatic Leela, who blazes into his world and unleashes a storm of passion and devastation that will alter it forever. Twenty-three years later, Aria lands in the city on a quest to find the mother whom she believed to be dead. Estranged from her convalescing father, her journey leads her to unravel the mysteries of her parents’ story and her mother’s life—from her childhood in an orphanage to a doomed love affair and finally, the remote shores of asceticism. As she searches for answers and a sense of belonging, Aria stumbles upon lost worlds, haunting memories, and the explosive secret that torpedoed her father’s life, the reverberations of which will be cataclysmic for her own. You can  RSVP  here.  The details of the event are as follows:  Date and time: 28 July, 6 PM  Venue: Champaca Bookstore      ",
    "url": "https://champaca.in/blogs/events/book-discussion-of-aishwarya-jhas-latest-the-scent-of-fallen-stars-with-deepthi-talwar-28-july-6-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-of-aishwarya-jhas-latest-the-scent-of-fallen-stars-with-deepthi-talwar-28-july-6-pm?variant=40512910229539",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]