[
  {
    "@type": "LiteraryEvent",
    "name": "Hundred Greatest Love Songs: Book Discussion with Biswamit Dwibedy and Pooja Sagar",
    "startDate": "2026-02-28T00:00:00+05:30",
    "endDate": "2026-02-28T02:00:00+05:30",
    "description": "Join us at Champaca, Vasanthnagar for a conversation between Biswamit Dwibedy- author of the book-  Hundred Greatest Love Song s   and Pooja Sagar .   This discussion will then be followed by a book signing.  Here are all the event details: Date: 28th February, Saturday Time: 6PM Venue: Champaca Bookstore, Vasanthnagar. Click here  to Register. About the Book: Hundred Greatest Love Songs  is a genre-bending memoir of a young artist and poet willing to risk his life for his craft. Told in a hundred short chapters and arranged like a playlist, the story is one of transformation—spiritual, sexual and intellectual—as the protagonist, a waiter, carves his path from a greasy diner in small-town Iowa to a prestigious arts college in upstate New York.  At its core, the book is an ode to friendship. It is as much about an artist trying to find his place in the world as it is about the people who help him do so. Ultimately, Hundred Greatest Love Songs serves as a testament to the healing power of poetry and proves that literature, art and music can save lives. About the Author:   Biswamit Dwibedy  was born in Odisha, India and now lives in Paris, France. He lived in Iowa City, Iowa for several years and has an MFA from Bard College, New York. He is the author of  Erode  (Litmus Press),  Ancient Guest  (HarperCollins India),  Hundred Greatest Love Songs  (Penguin Random House),  Hubble Gardener  (Spuyten Duyvil), and the chapbooks  Eirik’s Ocean  (Portable Press),  MC3  (Essay Press),  Ozalid  (1913 Press) and  Film of Dust  (Sputnik & Fizzle). His poems have been published in  Poetry Magazine ,  The Brooklyn Rail ,  Tarpaulin Sky , and  Best American Experimental Poetry  amongst other places. He translates from Hindi and Oriya and his poems have been translated into French. Dwibedy is also a visual artist. He’s been an artist-in-residence in France, India, and Iceland, and directs the MFA in creative writing at The American University of Paris. About the Moderator:  Pooja Sagar  is a writer, educator, and researcher studying the history of medicine and cultures of care in contemporary India. Previously, she was faculty and Head of Studies for Creative Writing and General Studies at Srishti Manipal Institute of Art, Design and Technology, where she developed curriculum and taught across creative writing, editing, and publishing. At the Indian Institute for Human Settlements (IIHS), she heads the Word Lab and Library, leading editorial and publishing initiatives while working across English and Malayalam. She teaches advanced writing for PhD students at IIHS, Longform Writing and runs the multilingual and inclusive Writing Skill Lab for the graduate students. Seats are limited, we recommend you to  RSVP HERE  to save your spot.  ",
    "url": "https://champaca.in/blogs/events/hundred-greatest-love-songs-book-discussion-with-biswamit-dwibedy-and-pooja-sagar-28th-february-6-pm-champaca-vasanthnagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/hundred-greatest-love-songs-book-discussion-with-biswamit-dwibedy-and-pooja-sagar-28th-february-6-pm-champaca-vasanthnagar",
        "price": "0",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/hundred-greatest-love-songs-book-discussion-with-biswamit-dwibedy-and-pooja-sagar-28th-february-6-pm-champaca-vasanthnagar",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Bombay Imagined: An illustrated talk by Robert Stephens",
    "startDate": "2026-02-22T18:00:00+05:30",
    "endDate": "2026-02-22T20:00:00+05:30",
    "description": "What if the cities we live in were shaped not only by what was built, but also by what was imagined and never realised? Bombay Imagined  is an illustrated talk that revisits Mumbai’s unbuilt past to explore what these forgotten ideas can still offer cities like Bangalore today. Drawing from ambitious but unrealised plans for housing, urban parks, water systems, public libraries, and civic infrastructure, the talk brings archival drawings together with contemporary speculation and artistic overlays to reveal alternate urban futures. It suggests that ideas never truly disappear, and that revisiting them can reshape how we think about cities in the present. The session will be led by architect and writer  Robert Stephens , author of  Bombay Imagined: An Illustrated History of the Unbuilt City . Having lived and worked in Mumbai for sixteen years, and now based in Bengaluru, Robert brings a perspective shaped by both cities. He is the founder of Urbs Indis, an architecture practice and publishing studio, and the creator of the Urbs Indis Library & Garden, a publicly accessible collection of rare books on urban India. Here are all the event details: Date:  Sunday, 1 February Time:  6 pm onwards Venue:  Champaca Bookstore, Vasanth Nagar Seats are limited, so we request you to  RSVP here  to save your spot.",
    "url": "https://champaca.in/blogs/events/bombay-imagined-an-illustrated-talk-by-robert-stephens-1-february-sunday-6-pm-onwards-champaca-bookstore-vasanth-nagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/bombay-imagined-an-illustrated-talk-by-robert-stephens-1-february-sunday-6-pm-onwards-champaca-bookstore-vasanth-nagar?variant=41872964190243",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]