[
  {
    "@type": "LiteraryEvent",
    "name": "A Musical Night and Book Launch of I'LL HAVE IT HERE with Jeet Thayil | 30 November, 5 PM",
    "startDate": "2024-11-30T17:00:00+05:30",
    "endDate": "2024-11-30T19:00:00+05:30",
    "description": "Jeet Thayil is back with a new poetry book after 16 long years, and we're so excited to be a part of the launch!  Join us as we celebrate the launch of I'LL HAVE IT HERE with Jeet Thayil and Rahul Soni. This discussion and reading will then be followed by an interactive Q&A with the audience, and a musical performance by Yashas and Hollis!  It's going to be an evening filled with poetry, music and conversations, and since there is limited seating we recommend you book your seat right away! Here is the  RSVP  link.  The details of the event are as follows:  DATE: 30 NOVEMBER 2024 DAY: SATURDAY TIME: 5 PM About the speakers: Jeet Thayil  worked as a journalist for twenty-one years, in Bombay, Bangalore, Hong Kong and New York City. In 2005 he began to write fiction. The first installment of his Bombay Trilogy, Narcopolis, was shortlisted for the Booker Prize and became an unlikely bestseller. His book of poems These Errors Are Correct won the Sahitya Akademi Award (India’s National Academy of Letters), and his musical collaborations include the opera Babur in London. His essays, poetry and short fiction have appeared in the New York Review of Books, Granta, TLS, Esquire, The London Magazine, The Guardian and The Paris Review, among other venues. Jeet Thayil is the editor of The Penguin Book of Indian Poets. Rahul Soni  is a writer and translator. He is currently Editor at Large with HarperCollins Publishers India.",
    "url": "https://champaca.in/blogs/events/a-musical-night-and-book-launch-of-ill-have-it-here-with-jeet-thayil-30-november-5-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/a-musical-night-and-book-launch-of-ill-have-it-here-with-jeet-thayil-30-november-5-pm?variant=40651738710051",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]