[
  {
    "@type": "LiteraryEvent",
    "name": "Book discussion: Urmilla Deshpande, Thiago Pinto Barbosa and Usha Rao on IRU- THE REMARKABLE LIFE OF IRAWATI KARVE | 22 Feb, 5:30 PM",
    "startDate": "2025-02-22T17:30:00+05:30",
    "endDate": "2025-02-22T19:30:00+05:30",
    "description": "We are delighted to host Urmilla Deshpande and Thiago Pinto Barbosa to discuss the book IRU-THE REMARKABLE LIFE OF IRAWATI KARVE. Anthropologist Usha Rao will be joining them on the panel. The details of the event are as follows - DAY - SATURDAY DATE - 22 FEBRUARY TIME - 6 PM Since there is limited seating, we recommend you book your spot  here. \n About the book The book is a biography of Irawati Karve, the first female anthropologist in India. Her pathbreaking research into the Adivasis in Maharashtra, Assam, Kerala, Odisha and Bihar resulted in two seminal works, Kinship Organisation in India and Hindu Society. Her book on the Mahabharata, Yuganta, is a best-selling classic. This is a deeply researched biography, full of hitherto unknown details of Karve’s personal and professional life. Immensely readable, this is a compelling and valuable book for scholars, students and general readers. About the Speakers \n Urmilla Deshpande   writes novels and short fiction. Her published work includes A PACK OF LIES, SLITHER- CARNAL PROSE and BODY AND BLOOD- STORIES ON BREAKING THE TEN COMMANDMENTS.  \n Thiago Pinto Barbosa   is a Brazilian anthropologist based in Leipzig and Berlin. Thiago’s doctoral dissertation, published as   Racializing Caste: Anthropology   between Germany and India and the Legacy of Irawati Karve (1905-1970)   has received multiple awards. Usha Rao  is an anthropologist and media maker. Over a decade she has been trying to make sense of what makes a city and what it means to people who inhabit it.  Her first film  Our Metropolis (2014)  co-directed by Gautam Sonti, is about the transformation of Bangalore and its aftermath. Usha continues to study the footprint of the metro on neighborhoods. She likes to bring together text, sound and images in her work.",
    "url": "https://champaca.in/blogs/events/book-discussion-urmilla-deshpande-thiago-pinto-barbosa-and-usha-rao-on-iru-the-remarkable-life-of-irawati-karve-22-feb-6-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-urmilla-deshpande-thiago-pinto-barbosa-and-usha-rao-on-iru-the-remarkable-life-of-irawati-karve-22-feb-6-pm?variant=40721469669411",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Vanamala Viswanatha in conversation with Anjum Hasan on Kuvempu's Epic Novel- BRIDE IN THE HILLS | 15 February, 5:30 PM",
    "startDate": "2025-02-15T17:30:00+05:30",
    "endDate": "2025-02-15T19:30:00+05:30",
    "description": "Join us at the bookstore to tune into this conversation between Vanamala Viswanatha and Anjum Hasan as they discuss Kuvempu's Epic Novel (Penguin's Modern Classics Series, 2024)  BRIDE IN THE HILLS.  Here are the details of the event-  DAY- Saturday DATE- 15th February  TIME- 5:30 PM Please  RSVP here  to confirm your presence.  BRIDE IN THE HILLS   tells the love stories of young men and women aspiring for a life of freedom, dignity and fulfilment in marriage within a caste-ridden social order. Kuvempu's multi-centred text, with its organic weave of varied narrative strands, much like the Mahabharata, is epic in substance and style. The novel, which is rooted in the regional realities of Malnad, is yet another example of the diversity of modern Indian literature. This epic novel with the sweep of a Tolstoy classic enacts its mission statement: 'Here, nobody is important; nobody is unimportant; nothing is insignificant!' with brilliance, energy and imaginative power. About the speakers  Vanamala Viswanatha has taught English language and literature during the last 40 years.  She is an award-winning translator who works with Kannada and English. She has served as Honorary Director of the Centre for Translation at Sahitya Akademi, Bengaluru, and a member of the Advisory Committee, National Translation Mission. Vanamala has also translated Raghavanka’s medieval epic Harischandra Kavyam for the Murty Classical Library of India, which has been translating the greatest literary works of India from the past two millennia for larger readership in the world.  Anjum Hasan  is the author of the novels THE COSMOPOLITANS, NETI, NETI and LUNATIC IN MY HEAD, and the short story collections A DAY IN THE LIFE AND DIFFICULT PLEASURES. She has also published a book of poems called STREET ON THE HILL. Her latest novel, HISTORY'S ANGEL recently won the Godrej LitLive! Fiction Book of the Year and FICCI Fiction Book of the Year awards. Anjum writes for various publications including the Los Angeles Review of Books and the New York Review of Books.",
    "url": "https://champaca.in/blogs/events/vanamala-viswanatha-in-conversation-with-anjum-hasan-on-kuvempus-epic-novel-bride-in-the-hills-15-february-5-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/bride-in-the-hills?_pos=1&_sid=eb91124e8&_ss=r&variant=40597629468707",
        "price": "799",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/vanamala-viswanatha-in-conversation-with-anjum-hasan-on-kuvempus-epic-novel-bride-in-the-hills-15-february-5-30-pm?variant=40708683464739",
        "price": "0",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/bride-in-the-hills?_pos=1&_sid=eb91124e8&_ss=r&variant=40597629468707",
        "price": "799",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]