[
  {
    "@type": "LiteraryEvent",
    "name": "Bombay Imagined: An illustrated talk by Robert Stephens",
    "startDate": "2026-02-01T00:00:00+05:30",
    "endDate": "2026-02-01T02:00:00+05:30",
    "description": "What if the cities we live in were shaped not only by what was built, but also by what was imagined and never realised? Bombay Imagined  is an illustrated talk that revisits Mumbai’s unbuilt past to explore what these forgotten ideas can still offer cities like Bangalore today. Drawing from ambitious but unrealised plans for housing, urban parks, water systems, public libraries, and civic infrastructure, the talk brings archival drawings together with contemporary speculation and artistic overlays to reveal alternate urban futures. It suggests that ideas never truly disappear, and that revisiting them can reshape how we think about cities in the present. The session will be led by architect and writer  Robert Stephens , author of  Bombay Imagined: An Illustrated History of the Unbuilt City . Having lived and worked in Mumbai for sixteen years, and now based in Bengaluru, Robert brings a perspective shaped by both cities. He is the founder of Urbs Indis, an architecture practice and publishing studio, and the creator of the Urbs Indis Library & Garden, a publicly accessible collection of rare books on urban India. Here are all the event details: Date:  Sunday, 1 February Time:  6 pm onwards Venue:  Champaca Bookstore, Vasanth Nagar Seats are limited, so we request you to  RSVP here  to save your spot.",
    "url": "https://champaca.in/blogs/events/bombay-imagined-an-illustrated-talk-by-robert-stephens-1-february-sunday-6-pm-onwards-champaca-bookstore-vasanth-nagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/bombay-imagined-an-illustrated-talk-by-robert-stephens-1-february-sunday-6-pm-onwards-champaca-bookstore-vasanth-nagar?variant=41872964190243",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "HCCB Hour: The Wild Robot on the Island read-along with Ms. Deepa Ahuja Ramani",
    "startDate": "2026-01-31T11:00:00+05:30",
    "endDate": "2026-01-31T13:00:00+05:30",
    "description": "Join us at  Champaca Indiranagar  for an HCCB Hour read-along of  THE WILD ROBOT   ON THE ISLAND  by Peter Brown, with storyteller  Deepa Ahuja Ramani . This hour-long session for children aged  5–8 years  is designed to help young readers discover a new book, listen together, and start conversations about robots, animals, and what it means to belong. Book:   The Wild Robot   on the Island   by Peter Brown Date:   31st January 2026, Saturday Time:   11:00 AM to 12:00 PM Venue:   Champaca Bookstore, Indiranagar Age group:   5–8 years Fee: INR 599 (Includes the copy of the book) Seats are limited. We request you to  REGISTER HERE  to reserve your spot. For our first session, we are reading   THE WILD ROBOT ON THE ISLAND   by Peter Brown, a warm, adventurous story about Roz, a robot who finds herself on a wild island and must learn how to live with the animals who already call it home. It is a book about friendship, change, and finding your place in a new world, told in simple, engaging language that works beautifully as a read-aloud. The session will be led by   Deepa Ahuja Ramani , a language facilitator, performance storyteller, author, and founder of the award-winning podcast   Bachpan Ke Pitare Se   and   Ripples, Alacritous Learning with Deepa . Her work focuses on helping children connect with stories, language and imagination in playful, attentive ways, through performance, audio and classroom sessions.",
    "url": "https://champaca.in/blogs/events/hccb-hour-the-wild-robot-on-the-island-read-along-with-ms-deepa-ahuja-ramani-31st-january-11-00-am-champaca-indiranagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/hccb-hour-the-wild-robot-on-the-island-read-along-with-ms-deepa-ahuja-ramani-31st-january-11-00-am-champaca-indiranagar?variant=41868155551779",
        "price": "599",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "About the Friend in My Heart: Interactive Reading and Activity with Author Dipna Daryanani",
    "startDate": "2026-01-25T11:00:00+05:30",
    "endDate": "2026-01-25T13:00:00+05:30",
    "description": "Join author and movement artist Dipna Daryanani for an interactive reading and session based on her debut children’s book  About the Friend in My Heart . Through story, reflection, and gentle creative activities, Dipna invites children and caregivers to explore the many ways kindness lives within us. In small acts, simple words, and everyday moments. Here are all the event details: Date:  25 January 2026, Sunday Time:  11AM Venue:  Champaca, Idiranagar Age:  4-7 years (caregivers are encouraged to join the session) Since seats are limited, we request you to  RSVP here  to reserve your spot. About the Book: About the Friend in My Heart  gently introduces children to the idea of kindness as something that already lives within them. Through simple questions and a tender narrative, the book invites young readers to notice their feelings, nurture empathy, and listen to their inner world. It encourages children to open their hearts, stay curious, and recognise kindness in themselves and others. About the Author: Dipna is a Mumbai-based movement artist, early years educator, yoga practitioner, and founder of Move with Joy - a creative movement program for young children that celebrates the body, imagination, and joy of expression. She is also the co-founder of Love the World Today, a sustainable clothing brand that creates thoughtful clothing for children. With over 17 years of experience in early childhood education and more than a decade in contemporary dance and dance-theatre, Dipna's work is grounded in the belief that kindness, curiosity, and imagination are essential to learning, creating, and growing. Whether in classrooms, studios, or on stage, her approach centers on keeping the inner child alive - through presence, play, and listening deeply to the body and the world around it.",
    "url": "https://champaca.in/blogs/events/about-the-friend-in-my-heart-interactive-reading-and-activity-with-author-dipna-daryanani-25-january-2026-11am-champaca-indiranagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/about-the-friend-in-my-heart-interactive-reading-and-activity-with-author-dipna-daryanani-25-january-2026-11am-champaca-indiranagar?variant=41865382920227",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]