[
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch of 'A Nest of Vipers' by Harini Nagendra at Champaca Bookstore | 31 May 6 PM",
    "startDate": "2024-05-31T18:00:00+05:30",
    "description": "Join us on 31 May at 6 PM for the book launch of Harini Nagendra's latest book in The Bangalore Detective Series! Harini will be in conversation with Suresh Jayaram from 1 Shanti Road Studio.  RSVP  here   Harini Nagendra  is a professor of ecology at Azim Premji University, and a well-known public speaker and writer on issues of nature and sustainability. She is internationally recognized for her scholarship on sustainability, with honors that include the 2009 Cozzarelli Prize from the US National Academy of Sciences, the 2013 Elinor Ostrom Senior Scholar award, and the 2017 Clarivate Web of Science award for interdisciplinary research in India. Her non-fiction books include   Nature in the City: Bengaluru in the Past, Present and Future , and three books co-authored with Seema Mundoli –   Shades of Blue: Connecting the Drops in India’s Cities ,   So Many Leaves , and   Cities and Canopies: Trees in Indian Cities , which received the 2020 Publishing Next Awards for best English non-fiction book in India, and was featured on the 2021 Green Literature Festival’s honor list.   The Bangalore Detectives Club   was her first crime fiction novel. The sequel,   Murder Under a Red Moon , was published in 2023, and the third book,   A Nest of Vipers , will be out in May 2024. Harini lives in Bangalore with her family, in a home filled with maps. She loves trees, mysteries, and traditional recipes. Suresh Jayaram  is an artist, art historian, arts administrator, and curator from Bangalore. He is the Founder and director of Visual Art Collective/1.Shanthiroad Studio is an international artist’s residency and alternative art space in Bangalore. India. His keen interest in Bangalore's Urban history has led him to research GH. Krumbiegel resulted in the publication of 'Whatever He Touched, He Adorned', a book accompanied by a curated exhibition on the German horticulturist in 2015. He is also the author of,  'Bangalore's Lalbagh: A Chronicle of the Garden and the City'  in 2021 and is currently working on his next publication, a book on Cubbon Park.  ",
    "url": "https://champaca.in/blogs/events/book-launch-of-a-nest-of-vipers-by-harini-nagendra-at-champaca-bookstore-31-may-6-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-of-a-nest-of-vipers-by-harini-nagendra-at-champaca-bookstore-31-may-6-pm?_pos=2&_sid=3e2874458&_ss=r&variant=40436521566243",
        "price": "0",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/bangalore-s-lalbagh-a-chronicle-of-the-garden-and-the-city",
        "price": "1200",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]