[
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: Invisible Housemates with Deepa Padmanaban and Radha Ranagarajan",
    "startDate": "2025-11-02T18:00:00+05:30",
    "endDate": "2025-11-02T20:00:00+05:30",
    "description": "We are delighted to host a conversation with  Deepa Padmanaban , the author of  Invisible Housemates , at Champaca Bookstore. Join us for an engaging discussion where Deepa will be in conversation with Radha Rangarajan. The event promises a unique opportunity to interact with the author and discover the invisible world within our walls. Mark your calendars and bring your questions and observations. The discussion will be followed by a book signing. Here are the details for the event:  Date:  2 November 2025, Sunday Time:   6:00 PM Venue:  Champaca Bookstore, Vasanth Nagar  Seats are limited, so do  RSVP to save your spot ! About the Book: Invisible Housemates  explores the many unseen but ever-present animals that share our homes and how they shape our lives. The book blends folklore and scientific inquiry, inviting readers to learn about the spiders in the corners, geckos at the windows, and other creatures who quietly cohabit our spaces. It offers insights into their place in local culture, the scientific breakthroughs inspired by them, and their role in everyday lives. About the Speakers:   Deepa Padmanaban  is an independent journalist and author, writing on science, environment, biodiversity, wildlife conservation, public health and climate change. Her stories have been published in The Guardian, Harvard Public Health Magazine, Discover magazine, Scientific American, National Geographic, Mongabay, IndiaSpend, and others. She was awarded a special mention in the Environmental Impact category by the One World Media Awards (UK) in 2023. In a previous avatar, she worked as a biochemistry researcher at the Indian Institute of Science, Bengaluru, and Harvard University, USA.  Radha Rangarajan  works on telling vital stories about the natural world, through photography, filmmaking and writing. She drives media, communications and community building at Black Baza. She was the Editor at Nature inFocus where she commissioned features on environmental issues and curated their annual photography competition and social media communication. She has also curated and edited stories for JLR Explore for over a decade. Radha has written and edited over 15 picture books for children (Pratham Books) and co-authored a book on Indian environmental heroes. ",
    "url": "https://champaca.in/blogs/events/book-discussion-invisible-housemates-with-deepa-padmanaban-and-radha-ranagarajan-2-november-6pm-champaca-vasanth-nagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-invisible-housemates-with-deepa-padmanaban-and-radha-ranagarajan-2-november-6pm-champaca-vasanth-nagar?_pos=2&_sid=7196b51fa&_ss=r&variant=41006975090723",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]