[
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion of HOW TO CLIMB A TREE by Aparna Nori in conversation with Gayatri Ganju and Kaamna Patel",
    "startDate": "2025-06-15T17:30:00+05:30",
    "endDate": "2025-06-15T19:30:00+05:30",
    "description": "Join us on Sunday, 15th June, for a presentation of  How to Climb a Tree,  Aparna Nori’s beautiful and deeply personal photobook. Aparna will be in conversation with Gayatri Ganju and Kaamna Patel. Come to marvel over the stunning photographs and intricate illustrations; stay for a meditation on art, time, belonging, and growing up.  Here are the event details:  Date : 15 June 2025, Sunday Time:   5:30PM Venue:   Champaca Bookstore, Vasanth Nagar Since there is limited seating, we recommend that you confirm your spot soon— RSVP here! About the book:  HOW TO CLIMB A TREE , Aparna's deeply lyrical photobook, is a personal, intuitive image series that episodically documents a timespan when her 10-year-old son was living in a boarding school in Madanapalle, India. What emerges is a collaborative project between mother and son drawn over five years of communication, wherein the images become meditative, introspective traces of places and moments that felt like home for both of them. Interspersed with handwritten letters and illustrations, the book examines how a physical absence or distance can be expressively redrafted through emotional awareness. In this photobook, Aparna creates a safe space - one in which she allows her own vulnerability of the experience of motherhood to slip through while also trying to root her son, giving him a way to return to this time and space again and again.  About the speakers:  Author:   Aparna Nori  is a photographer and visual artist based between Singapore and Bangalore, India. Aparna draws upon personal memory to have a dialogue with the quotidian. Her response is articulated through a range of mediums including alternative photographic processes, installations, video, digital photography and the book form. Aparna is a member of Women Photograph. Moderators:  Gayatri Ganju  (b. 1989) is an artist and documentary photographer from Bangalore. Her personal practice is rooted in a deep and tangled relationship with landscape, while editorially she covers stories about women, the environment and public healthcare. Kaamna Patel  is a photographer born in Mumbai, India. She founded Editions JOJO in 2019 an independent publishing house, photobook library & an artist-led platform based in Mumbai where she embodies numerous roles. She has been an artist in residence at the Cité Internationale des Arts, Paris, in 2022, and at SqW:Lab, Mumbai, in 2024. Her books have entered institutional archives such as the Getty Museum in L.A, the Tate Modern in London, Asia Art Archive in Hong Kong, Arab Image Foundation in Beirut, amongst others.",
    "url": "https://champaca.in/blogs/events/book-discussion-of-how-to-climb-a-tree-by-aparna-nori-in-conversation-with-gayatri-ganju-and-kaamna-patel-champaca-vasanth-nagar-15-june-5-30pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-of-how-to-climb-a-tree-by-aparna-nori-in-conversation-with-gayatri-ganju-and-kaamna-patel-champaca-vasanth-nagar-15-june-5-30pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion of THE MTR STORY - A LABOUR OF LOVE with Pratima Chabbi and Ruth Dsouza Prabhu",
    "startDate": "2025-06-14T17:30:00+05:30",
    "endDate": "2025-06-14T19:30:00+05:30",
    "description": "Join us on Saturday, 14th June, for a discussion on  THE MTR STORY: A LABOUR OF LOVE.  The author, Pratima Chabbi, will be in conversation with  Ruth Dsouza Prabhu . Expect a lively discussion about food and history—you might just see a whole new side to a restaurant you love so much. Here are the Event Details: Date:  14th June 2025, Saturday Time:  5:30 PM Location:  Champaca Bookstore, Vasanth Nagar . Since there is limited seating, we recommend you confirm your spot  here . About the book:   Written to mark the centennial of the iconic restaurant’s founding,  The MTR Story: A Labour of Love  details the origin story of the beloved Mavalli Tiffin Rooms. The book highlights the men and women who have made MTR what it is—and celebrates the restaurant’s many changes in the last century.  About the speakers : Author: Pratima Chabbi  is a food and culture writer based in Bengaluru. Over the past fifteen years, she has worked across various restaurants and media outlets, engaging with the intersections of communication, service, and culinary culture. Her writing has appeared in  Food Lovers ,  Bangalore Mirror ,  BBC Good Food ,  Goya , and  The Established . In addition to  The MTR Story: A Labour of Love,  she has also written  Chakla Makla , a children’s picture book about delicious stories from childhood, and the joy of discovering food. Moderator :  Ruth Dsouza Prabhu  is an independent journalist who specialises in the area of food writing. She has bylines in many renowned publications, including The New York Times, Al Jazeera, The National, Nikkei Asia, Whetstone South Asia, Going Places, and Eaten. She is the author and editor of  India’s Most Legendary Restaurants , published by Aleph Book Co, and has contributed to the B loomsbury Handbook of Indian Cuisine.",
    "url": "https://champaca.in/blogs/events/book-discussion-of-the-mtr-story-a-labour-of-love-with-pratima-chabbi-and-ruth-dsouza-prabhu-14th-june-5-30-pm-champaca-vasanth-nagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-of-the-mtr-story-a-labour-of-love-with-pratima-chabbi-and-ruth-dsouza-prabhu-14th-june-5-30-pm-champaca-vasanth-nagar",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Launch of Eldo and a conversation on Yangdol with Pankaj Singh, Athulya Pillai and Ramya Reddy at champaca bookstore, Vasanth Nagar",
    "startDate": "2025-06-07T17:30:00+05:30",
    "endDate": "2025-06-07T19:30:00+05:30",
    "description": "Join us at Champaca with Pankaj Singh and Athulya Pillai   for the launch of their new book Eldo, and a conversation around their bestselling title Yangdol. The session will be moderated by Ramya Reddy. These are stories that invite you to slow down and notice- whether it’s the Himalayan landscape, or the unfamiliar comfort of darkness. Told through words and illustrations, both Eldo and  Yangdol  open up quiet, intimate worlds. We’re delighted to bring you this evening of storytelling and reflection, surrounded by books and conversation. About the Books: Eldo  is two things at once- an evocative visual essay on darkness and a story about a walk into a storm, in the dead of night. It asks: what does it mean to step out into the dark? Who do we become in the absence of light? What do we notice when our eyes and our senses adjust? This poetic inquiry explores our fading relationship with the night, and how our bodies, once intuitive instruments of perception, are growing distant from it. Eldo is a meditation on stillness, silence, and shadow- an invitation to reimagine darkness not as fearsome, but as full. Their earlier book,  Yangdol , is set in a remote Himalayan village in Ladakh, and follows a young girl’s lifelong yearning to see the elusive snow leopard- the ‘Grey Ghost’. Woven with memory and wonder, Yangdol is a tender reflection on patience, kinship, and growing up close to the wild. More than just a tale of pursuit, it speaks to the values passed down in rural Ladakh- of gentleness, kindness, and the quiet dignity of coexistence. Written for readers aged 7 and above, it has captivated readers of all ages. Here are the Event Details: Date:   May 31, 2025, Saturday Time:    5:30 PM Location:   Champaca Bookstore, Vasanth Nagar Since there is limited seating, we recommend you confirm your spot  here . About the Speakers: Pankaj Singh  is a writer and filmmaker whose work reflects his deep curiosity for the natural world. Through Faraway Originals, a collective he co-founded, he tells stories that lie at the intersection of nature, science, and human connection. His narratives are quiet, immersive, and rooted in simplicity. Athulya Pillai  is an illustrator and storyteller based in Bangalore. Her work is grounded in observation—of creatures, places, and people—and often leans into themes of wildlife conservation and ecological memory. With her delicate lines and thoughtful visual language, Athulya brings the emotional texture of landscapes and lives to the page. Moderating the conversation is Ramya Reddy, visual storyteller, photographer and author of  Soul of the Nilgiris: A Journey through the Mountains . Ramya’s work intimately explores the Nilgiris Biosphere Reserve and its indigenous communities, blending narrative, image, and design. She collaborates closely with Toda women artisans and is deeply committed to cultural and ecological preservation.",
    "url": "https://champaca.in/blogs/events/book-launch-of-eldo-and-a-conversation-on-yangdol-with-pankaj-singh-athulya-pillai-and-ramya-reddy-at-champaca-bookstore-vasanth-nagar-saturday-31st-may-2025-5-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-launch-of-eldo-and-a-conversation-on-yangdol-with-pankaj-singh-athulya-pillai-and-ramya-reddy-at-champaca-bookstore-vasanth-nagar-saturday-31st-may-2025-5-30-pm",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "LiteraryEvent",
    "name": "Champaca x Duckbill Hook Book Festival: Get Hooked to Reading!",
    "startDate": "2025-06-25T00:00:00+05:30",
    "endDate": "2025-06-25T02:00:00+05:30",
    "description": "Join us for a weekend of storytelling, creativity, and hands-on fun at the Champaca x Duckbill Hook Book Festival! This festival is designed to inspire young readers and creators to dive into the world of books like never before. In a world where children’s books often feel cut from the same cloth,  Hook Books  stand out as a vibrant blend of imagination, humour, and heart. Crafted as a bridge between picture books and early chapter books, this series delivers stories that spark joy and wonder, while remaining rooted in age-appropriate learning. Published by Penguin India, the  Hook Books  series features stories by some of the country’s most beloved children's authors and illustrators. These books are designed to spark independent reading in early readers — with short, funny, and engaging stories, filled with delightful characters and vibrant illustrations. At Champaca, we’re thrilled to host  Getting Hooked to Reading , a festival of events celebrating these books through interactive sessions, storytelling, and creativity. Spanning across two weekend mornings, the Hook Book Festival is packed with joyful and engaging experiences for children. From story-building workshops and book cover design to interactive storytelling sessions, origami, and comic-making, there’s something for every kind of young reader and creator. These sessions are not just about books, they’re about building a love for reading, sparking imagination, and making stories come alive in the most hands-on, delightful ways. Here are the details of the festival: Day 1: May 24th, Saturday NARRATIVES IN ACTION: Story building workshop Time:  10:30 AM to 12 Noon Date:   24th May, Saturday Age Group:   10-12 Years Location:   Champaca Bookstore, Indiranagar About the Workshop:  Through an engaging blend of words, art, and puppetry, participants will explore how a single idea can branch into a multitude of narratives. Inspired by Adithi Rao’s book  Boy, Bear , the session will encourage young storytellers to experiment with different forms of creative expression and discover the magic of story-making.  Since there is limited seating, we recommend you confirm your spot  here . THE SWEET SHOP WARS: A Storytelling and Activity Session Time:   12 Noon to   12:30 PM Date:  24th May, Saturday Age Group:  5+ Years Location:  Champaca Bookstore, Indiranagar About the Workshop:  Join author Chatura Rao as she brings to life the tale of Firoza, a young girl determined to save her Grandpa’s beloved sweet shop after a flashy new competitor takes away all his customers. Through this delightful session based on the book  The Sweet Shop Wars , children will not only enjoy an engaging storytelling experience but also take part in a fun activity that sparks their imagination.  Since there is limited seating, we recommend you confirm your spot  here . GOT YOU COVERED: A book cover design workshop Time:   12:30 PM to 1:30 PM Date:  24th May, Saturday Age Group:  10+ Years Location:  Champaca Bookstore, Indiranagar About the Workshop:  Designed for children aged 10 and above, this session offers a unique behind-the-scenes look at what goes into creating a book cover—from initial concepts to final design. Participants will get an insider’s view of the creative process, learning how visuals, layout, and ideas come together to form the first impression of a book.  Since there is limited seating, we recommend you confirm your spot  here . Day 2: May 25th, Sunday WET PAINT: Storytelling and Activity Time:  11:00 AM to 11:45 AM Date:  25th May, Sunday Age Group:  5+ Years Location:  Champaca Bookstore, Indiranagar About the Workshop:  A super-fun and lively storytelling session based on the book Wet Paint! This interactive session promises to keep young listeners engaged with animated narration and plenty of opportunities to participate. Following the story, children will get to enjoy a creative, hands-on activity that brings the tale to life. Since there is limited seating, we recommend you confirm your spot  here . FLIP, FOLD, FLIP: Storytelling and Origami Activity Time:  11:45 AM to 12:30 PM Date:  25th May, Sunday Age Group:  5+ Years Location:  Champaca Bookstore, Indiranagar About the Workshop:  A storytelling and origami activity based on the book Gawa's Bag of Good Regards by Anushka Ravishankar. In this engaging workshop, children will discover the surprises hidden inside Gawa’s bag through an interactive narration, followed by a fun and creative origami folding session led by Canato himself.  Since there is limited seating, we recommend you confirm your spot  here . I WON’T WASH MY HAIR: Storytelling Time:  12:30 AM to 1:00 PM Date:  25th May, Sunday Age Group:  5+ Years Location:  Champaca Bookstore, Indiranagar About the Workshop:  Meet a girl who’s determined never to wash her hair, a dog named Riksha, and even some chilli from Chile in this fun, imaginative tale brought to life through Aparna Kapur’s narration. With its cast of colourful characters and playful premise, this session promises laughter, surprises, and a whole lot of charm. Since there is limited seating, we recommend you confirm your   spot  here .",
    "url": "https://champaca.in/blogs/events/champaca-x-duckbill-hook-book-festival-get-hooked-to-reading-champaca-bookstore-indiranagar-may-24th-25th-10-30-am-to-1-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/narratives-in-action-story-building-workshop",
        "price": "0",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/the-sweetshop-wars-a-storytelling-and-activity-session",
        "price": "0",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/got-you-covered-a-book-cover-design-workshop",
        "price": "0",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/wet-paint-storytelling-and-activity",
        "price": "0",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/flip-fold-flip-storytelling-and-origami-activity",
        "price": "0",
        "priceCurrency": "INR"
      },
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/i-won-t-wash-my-hair-storytelling",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]