[
  {
    "@type": "LiteraryEvent",
    "name": "Bombay Imagined: An illustrated talk by Robert Stephens",
    "startDate": "2026-02-15T18:00:00+05:30",
    "endDate": "2026-02-15T20:00:00+05:30",
    "description": "What if the cities we live in were shaped not only by what was built, but also by what was imagined and never realised? Bombay Imagined  is an illustrated talk that revisits Mumbai’s unbuilt past to explore what these forgotten ideas can still offer cities like Bangalore today. Drawing from ambitious but unrealised plans for housing, urban parks, water systems, public libraries, and civic infrastructure, the talk brings archival drawings together with contemporary speculation and artistic overlays to reveal alternate urban futures. It suggests that ideas never truly disappear, and that revisiting them can reshape how we think about cities in the present. The session will be led by architect and writer  Robert Stephens , author of  Bombay Imagined: An Illustrated History of the Unbuilt City . Having lived and worked in Mumbai for sixteen years, and now based in Bengaluru, Robert brings a perspective shaped by both cities. He is the founder of Urbs Indis, an architecture practice and publishing studio, and the creator of the Urbs Indis Library & Garden, a publicly accessible collection of rare books on urban India. Here are all the event details: Date:  Sunday, 1 February Time:  6 pm onwards Venue:  Champaca Bookstore, Vasanth Nagar Seats are limited, so we request you to  RSVP here  to save your spot.",
    "url": "https://champaca.in/blogs/events/bombay-imagined-an-illustrated-talk-by-robert-stephens-1-february-sunday-6-pm-onwards-champaca-bookstore-vasanth-nagar",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/bombay-imagined-an-illustrated-talk-by-robert-stephens-1-february-sunday-6-pm-onwards-champaca-bookstore-vasanth-nagar?variant=41872964190243",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]