[
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: MOTHER INDIA with Prayaag Akbar and Jeet Thayil | 7 SEPTEMBER, 5:30 PM",
    "startDate": "2024-09-07T17:30:00+05:30",
    "endDate": "2024-09-07T19:30:00+05:30",
    "description": "Join us at the bookstore to tune into this conversation between  Prayaag Akbar  and  Jeet Thayil  as they discuss Prayaag's latest novel,  MOTHER INDIA.  The details of the event are as follows:  DATE: 7 SEPTEMBER  DAY: SATURDAY TIME: 5:30 PM MOTHER INDIA  is the story of two young people living in contemporary Delhi. Plodding away to make a decent living despite a middling education, Mayank is employed in a right-wing content creator’s dingy basement studio. Nisha, recently moved to the city from her small town in the hills, works as a salesgirl for expensive Japanese chocolate in an upscale mall.  When Mayank discovers Nisha beaming off her Instagram like a beacon, he is smitten, and the video clip he devises for his studio ends up having significant consequences for them both. Sparkling and unexpected, Prayaag Akbar’s new novel brilliantly captures what it means to be young and alive in today’s India. The book has been published by Fourth Estate.  Released in July this year, this novel has  already received endorsements and praise from  Amitava Kumar, Meena Kandasamy, Avni Doshi, Vivek Shanbhag, Madhuri Vijay, Mohammed Hanif. Since there is limited seating, we request you to RSVP to confirm your presence.  Prayaag Akbar  is the author of the novel LEILA (2017), winner of the Crossword Jury Prize and the Tata Literature First Book Award. The book was translated into Hindi, Marathi and Turkish and was used as the basis of a Netflix show. Prayaag teaches creative writing at Krea University.   ",
    "url": "https://champaca.in/blogs/events/book-discussion-mother-india-with-prayaag-akbar-and-jeet-thayil-7-september-5-30-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-mother-india-with-prayaag-akbar-and-jeet-thayil-7-september-5-30-pm?variant=40552073429027",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Build-a-book with Pustakala | 8 September, 10 AM",
    "startDate": "2024-09-08T10:00:00+05:30",
    "endDate": "2024-09-08T12:00:00+05:30",
    "description": "Build -A- Book is a carefully curated skill-based workshop about bookmaking. The participants will experiment together and learn how to transform ordinary household objects to repurpose them into journals and notebooks, and experiment with different materials. In this workshop you will learn: - How to build basic book structures - An elaborate way to stitch your own books - How to customise notebooks and journals while repurposing material. You won't need any materials.  We're looking at a total of 8-10 people, so book your seats before they're sold out!  RSVP here.",
    "url": "https://champaca.in/blogs/events/build-a-book-with-pustakala-8-september-10-am",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/build-a-book-with-pustakala-8-september-10-am?variant=40550491095075",
        "price": "2500",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "LiteraryEvent",
    "name": "Book Discussion: SEA ICE? NOW YOU DON'T! with Rohan Chakravarty and Menaka Raman| 24 AUGUST 5 PM",
    "startDate": "2024-08-24T17:00:00+05:30",
    "endDate": "2024-08-24T19:00:00+05:30",
    "description": "Join Rohan Chakravarty and Menaka Raman as they discuss Rohan's latest novel SEA ICE? NOW YOU DON'T! This is the third anthology of the multi-award winning series Green humour comics. From penguins balancing their nests on thin ice to tigers basking in their own glamour whilst worrying about their future, from ghazal-loving bats to whales dumping marine plastic waste right back at us, in SEA ICE? NOW YOU DON'T! you meet an array of wild animals with their own list of concerns, and their own brand of humour. The comics will take you from the high skies to geothermal mines in the very bottom of the ocean, and from sweltering tropical mangroves to the icy poles, engaging you in discussions about ecology, biology, nature conservation, and the politics of governing nature. This is a wild ride for sure, but NOT one which needs you to leave your brains at home! SEA ICE? NOW YOU DON'T!  is the third in the series of Green Humour collections, after ‘Green Humour for a Greying Planet’ and ‘Pugmarks and Carbon Footprints’, and includes comics published in periodic columns with platforms like   DW News ,   The Hindu ,   Roundglass Sustain , and   Gocomics. About the speakers Rohan Chakravarty is the creator of Green Humour, a series of comics and illustrations on wildlife and nature conservation. He lives in Nagpur where he goes on nature trails every day, led by his pet dogs Srishti and Sakshi.  Rohan has authored seven other books, including Green Humour for a Greying Planet, Naturalist Ruddy, and Pugmarks and Carbon Footprints. Although he has won awards by UNDP, Sanctuary Asia, WWF International, the Royal Bank of Scotland and the Green and Bangalore Literature Festivals for his work, a fig that once dropped out of a hornbill’s mouth straight into his palm remains his most cherished prize. His worst nightmare is that the wildlife featured in his comics will read them and gang up on him for revenge some day. Menaka Raman is the author of a number of books for children including HOW TO WIN AN ELECTION (A MOST UNRELIABLE GUIDE), WHAT DO WE NAME THIS DOG and THE FREEDOM SISTERS. Her novel LOKI TAKES GUARD won the Valley of Words Award for Writing for Young Adults. She is a regular contributor to The Hindu Sunday Magazine. Kindly  RSVP here  as there is limited seating.  The details of the events are as follows: DATE- 24 AUGUST 2024 DAY- SATURDAY TIME- 5 PM VENUE- CHAMPACA BOOKSTORE",
    "url": "https://champaca.in/blogs/events/book-discussion-sea-ice-now-you-dont-with-rohan-chakravarty-and-menaka-raman-24-august-5-pm",
    "offers": [
      {
        "@type": "Offer",
        "url": "https://champaca.in/products/book-discussion-sea-ice-now-you-dont-with-rohan-chakravarty-and-menaka-raman-24-august-5-pm?variant=40536818417699",
        "price": "0",
        "priceCurrency": "INR"
      }
    ],
    "isAccessibleForFree": true
  }
]