[
  {
    "name": "NOORIE GIGS",
    "startDate": "2025-07-27T17:30:00",
    "location": {
      "@type": "Place",
      "name": "Sabha Blr",
      "address": "262, Kamaraj Rd, Shivaji Nagar Bangalore 560042 India"
    },
    "endDate": "2025-07-27T19:30:00",
    "keywords": [
      "GOETHE",
      "Adventures of Noorie",
      "Music"
    ],
    "@type": "MusicEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26840899",
    "description": "Noorieis making a pit stop in Bangalore and hosting an evening of music featuring her dear friends and some of the country's most explosive acts. Don't miss your chance to be part of this unforgettable monsoon night!Teesta Troupersfrom Teesta Highway RegionThe Teesta Troupers are acollective of musicians, writers and rappers,that came to life in a jam room situated below a garage on the Teesta highway. 'Sound of Streets', their debut album, reflects the dreams, hustle, longing and desires of young people living and working around the Teesta River and Highway. The album is dedicated to the young people of the Teesta regionDate:Sunday, 27th July 2025Time:5:30 - 6:30 PMVenue:Sabha BlrTickets:Book here for Teesta TroupersPasha Bhai & Demixx Beats (Clan Bokka Phod)from BangalorePrepare for an immersive musical experience as these incredible artists take the stage. Pasha Bhai's unique style combined with Demixx Beats' powerful rhythms promises a performance that will resonate long after the night ends. Both representing the iconicClan Bokka Phod!, This isn't just a concert; it's a celebration of sound, passion, and the vibrant spirit of Bengaluru's urban scene.Date:Sunday, 27th July 2025Time:9:00 PM onwardsVenue:Sabha BlrTickets:Book here for Pasha Bhai & Demixx BeatsAs part of Bangalore-based media collectiveMaraa's years long engagement with music,Nooriewas dreamt up as a creature, who wakes up one morning and finds she can no longer remember anything. All she is left with are the memories in her body: sounds, tastes, smells. She sets out on a raging journey to discover herself.NOORIE GIGS,a series of intimate music performances, is part of this engagement with music. It is a part of a much larger project,Adventures of Nooriewhich is a podcast series and features music and stories from various musical landscapes across India.Adventures of Nooriehas been made possible with the support from theGoethe-Institut / Max Mueller Bhavan Bangalore.",
    "image": "https://www.goethe.de/resources/files/png187/noorie_sabha_square-formatkey-png-w320r.png",
    "offers": {
      "url": "https://blog.urbanaut.app/sabha-bangalores-hottest-new-culture-arts-space/",
      "price": "299+",
      "priceCurrency": "INR"
    }
  }
]