[
  {
    "name": "Free Country by Christian Alvart",
    "startDate": "2025-09-19T15:30:00",
    "location": {
      "@type": "Place",
      "name": "Suchitra Film Society",
      "address": "#36, 9th Main, B V Karanth Road  Near Post Office, Banashankari Stage II Bangalore 560070 India"
    },
    "endDate": "2025-09-19T17:30:00",
    "keywords": [
      "GOETHE",
      "German Kino",
      "Film"
    ],
    "@type": "ScreeningEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26983330",
    "description": "German KinoatSuchitra Film Societybrings to youFree Country (2019),directed byChristian Alvart.Former East Germany, 1992.Patrick SteinandMarkus Bach, two very different police officers, are commissioned to investigate the disappearance of two female teenagers in a remote area of the country. They end up sinking deeper and deeper into the mire of the formerly divided Germany. A thriller with a sense of history.Free Countryby Christian Alvart2019 | colour | 130 min. | German with English subtitlesChristian Alvart (b.1974) is a self-taught film director. He made his feature film debut in 1999 withCuriosity & the Cat, which was nominated for theMax Ophüls Prize. After his second feature filmAntibodies(2005), he moved to Hollywood and directed horror-thrillerFall 39(2007), followed by the sci-fi thrillerPandorum(2008). Back in Germany, Alvart worked as a director for theTatortseries and directed thrillers and comedies. He also directed the Netflix seriesDogs of Berlin.Entry free!",
    "image": "https://www.goethe.de/resources/files/png191/free-country-square-formatkey-png-w320r.png",
    "offers": {
      "price": "Free Entry",
      "priceCurrency": "INR"
    }
  },
  {
    "name": "Café Jazz Sessions in September",
    "startDate": "2025-09-19T17:00:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-09-19T19:00:00",
    "keywords": [
      "GOETHE",
      "Jazz Fusion",
      "Music"
    ],
    "@type": "MusicEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26982643",
    "description": "29thedition ofCafé Jazzat the Bhavan!The jazz guitar sounds like a mini orchestra whether playing a chord melody or playing through changes or just accompanying a vocalist or horn player. Come discover and understand the nuances of jazz and much more at the 29th Edition of Cafe Jazz Sessions onSeptember 19, 2025at theGoethe-Institut / Max Mueller Bhavan Bangalore.Started in 2022 by one of the pioneers of jazz in the city,Jagadeesh M R, Director ofThe Bangalore School of Musicand founder ofMoonArraWorld Fusion Ensemble, this is a monthly event, designed to building a community of jazz musicians in the city and foster a culture of creativity. It is a platform to connect with each other and audiences through jam sessions, lecture demonstrations and performances. The project has fostered a faithful community of musicians who participate and interactfreely with younger jazz aspirants while audiences get a rare opportunity to watch, listen and understand the creative processes in jazz.Free entry for audiences.Musicians to register via Whatsapp +91 9844245577 for a spot.",
    "image": "https://www.goethe.de/resources/files/png191/cjs-29-square-formatkey-png-w320r.png",
    "offers": {}
  },
  {
    "name": "All My Girls by Iris Gusner",
    "startDate": "2025-09-20T16:30:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-09-20T18:30:00",
    "keywords": [
      "GOETHE",
      "Behind the Wall - Films from East Germany",
      "Film"
    ],
    "@type": "ScreeningEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26982919",
    "description": "We invite you to a screening ofAll MyGirls (1980),directed byIris Gusner.A screening in our ongoing film seriesGerman Cinema in Focuscurated byShivani. Currently being shown are a selection ofFilms from East Germany.Despite his lack of enthusiasm, film studentRalfis assigned to make a documentary about a team of six women workers at a light bulb factory in Berlin. At first, the team seems to work and get along together without a hitch. But soon tensions between the women become apparent and they pull Ralf into their conflicts.All My Girlswas filmed on location at the NARVA light bulb factory in Berlin. Director Iris Gusner worked closely with other women on her team to make this film that gives us a real feel for what it was like to be a woman in the GDR.All My GirlsbyIris Gusner1980 | 86 Min. | Colour | German with English subtitlesIris Gusner(b. 1941), one of very few female feature film directors in East Germany, trained in directing at the renownedVGIK film schoolin Moscow underMikhail Romm. After a brief stint with East German television, in 1968 she moved to the DEFA Studio for Feature Films, where she started as assistant director toKonrad Wolfon his 1971 filmGoya, or the Hard Way of Enlightenment.Her much-heralded debut film,The Dove on the Roof, was banned for showing workers “in distress.” She finally achieved acclaim with her lively portrayal of women workers inAll My Girls, which became one of her most successful films. Her unique semi-autobiographical feature film,If the Earth were not round..., was followed by other films focusing on the role and emancipation of women in the GDR.Free Entry!",
    "image": "https://www.goethe.de/resources/files/png191/all-my-girls-square-formatkey-png-w320r.png",
    "offers": {
      "price": "Free Entry",
      "priceCurrency": "INR"
    }
  },
  {
    "name": "Channel Orange by Frank Ocean (OTJF)",
    "startDate": "2025-09-21T16:00:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-09-21T18:00:00",
    "keywords": [
      "GOETHE",
      "Explore Neo-Soul R&B",
      "Music",
      ",Jazz"
    ],
    "@type": "EducationEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26983519",
    "description": "On The Jungle Floor (OTJF),a Bangalore-based Online Record Store & Music Discovery website will transform our Library space into a Listening Room withone of the most iconic records of our time. For the next edition of OTJF Listening Sessions dive intoChannel Orange, the first full length album byFrank Ocean.We’ll listen to the album front-to-back on vinyl, letting its lush, textured soundscapes unfold in full. Along the way, subtle echoes from Frank’s wider world—his other works, collaborations, and moments—will drift through the space like fading light, inviting reflection, memory, and connection.Still images breathe softly on the walls, and attention feels like an act of care. Rooted in a spirit of openness and shared presence, this isn’t about spectacle—it’s about gathering, listening, and being together.Date: Sunday, 21th September 2025Time: 4:00 PM to 7:00 PMVenue: Goethe-Institut /  Max Mueller Bhavan BangalorePresented by: Abhinav Krishnaswamy & On the Jungle FloorAn intimate room. Great sound. Good people.",
    "image": "https://www.goethe.de/resources/files/jpg1409/otjf_seot25_square-v1-formatkey-jpeg-w320r.jpeg",
    "offers": {
      "url": "https://onthejunglefloor.com/products/event-tickets-otjf-listening-sessions-frank-ocean-channel-orange",
      "price": "INR 885 Tickets Available Online",
      "priceCurrency": "INR"
    }
  }
]