[
  {
    "name": "LONO - The Woman Who Had Two Navels",
    "startDate": "2026-02-11T19:30:00",
    "location": {
      "@type": "Place",
      "name": "International Centre (BIC)",
      "address": "No. 7, 4th Main Rd, Stage 2, Domlur Bangalore 560071 India"
    },
    "endDate": "2026-02-11T21:30:00",
    "keywords": [
      "GOETHE",
      "Attakkalari India Biennial",
      "Dance and Theatre"
    ],
    "@type": "Event",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=27217733",
    "description": "In collaboration with Attakkalari Centre for Movement Arts we are happy to present LONO - The Woman Who Had Two Navels at the 12th Attakkalari India Biennial. Coreographed by Sara Angius, the work brings together contemporary dance, puppet theatre and illusion on stage to create a liminal theatrical experience.LONO - The Woman Who Had Two NavelsChoreography: Sara AngiusPerformance: Sara Angius, Stefano RovedaSound & Light Assistance: Vittoria Franchina11 February 2026, 7:30 pmBangalore International CentreFree Entry on a First Come First Served basis onRSVPand availability. | Please note: Strictly no entry once the program has begun.A woman sits at a table. A lamp flickers. And between the two of them, an entire inner world comes alive.Who manipulates whom?What follows is a quiet, unsettling dance between light and shadow, memory and imagination. A dialogue played out without words between a performer and a lamp that refuses to stay in its place. One dominates. Then the other. The rules keep shifting, and the audience is never quite sure who is in control.Through dance and puppetry, LONO offers a reflection on the stories we tell ourselves about who we are. What remains is not stillness but a restless balance: the soul caught somewhere between what was and what is yet to come.Sara Angius is a contemporary dancer and choreographer based in Braunschweig, Germany since 2013. She is part of themanagement team of TANZKOOP, a cooperative of dance artists founded in 2022 to sustainably stabilise the productionand working structures of the independent dance scene in Braunschweig and Lower Saxony. Her research has developed in a multidisciplinary direction, incorporating puppetry, object manipulation and illusion intoher choreographic language.After graduating in Media Studies at the University of Milan with a focus on live performance, Stefano Roveda was selected for the Arsenale della Danza training program of the Venice Biennale, where he studied with some of the most creative dancers and teachers from leading international dance companies.Vittoria Franchina, born in 1994 in Milan, began her professional training at the Susanna Beltrami/Dancehaus Academy, where she graduated in 2016.She has performed works by Susanna Beltrami, Matteo Bittante, Virginia Spallarossa, and Diego Tortelli.Since 2020, she has also been an associate artist of DanceHauspiù, a national dance production center based in Milan, and co-founder of the project Franchina|Leone together with Giovanni Leone.Sara Angius is also facilitating a movement workshop at the Attakkalari Centre for Movement Arts on 9 & 10 February 2026. The workshop explores a body that is unstable, divided, yet highly sensitive and responsive. The work is grounded in the macro-principles of release technique, further elaborated and transformed through movement research oriented toward creation.9 February 2026, 2pm - 5 pm10 February 2026, 10 am - 1 pmAttakkalari Centre for Movement Arts, Wilson GardenEntry free byRSVP. Limited seats.Marking the 25th Anniversary year of Attakkalari, the 12th edition of the Attakkalari India Biennial attends to reconnection, reflection and innovation through dance. This edition foregrounds practices that restore the body to presence, returning it from various forms of alienations that emerge from the contemporary.The Attakkalari India Biennial 2025-26 turns its gaze toward the intricacies of human relationships and the subtle conversations between our bodies and the spaces we move through. Architecture, cities, landscapes, each becomes a living archive of events and memories, shaping our collective conscience as they imprint themselves on us. The performances that this biennial curates are from across the world and trace the paths of bodies travelling through cities, countries and continents, offering evocative testimonies of the crystalised moments where place and person become inseparable. These artistic explorations reveal exquisite insights into the scale, density and rhythm that define dance, embodiment and existence itself.Attakkalari Centre for Movement Arts is a premier contemporary dance institution in India. The centre was instituted in 1992 to facilitate the development of contemporary cultural expressions in India, particularly in performing arts. Today, Attakkalari is recognised internationally as an important educational institution and cultural organization in South Asia.",
    "image": "https://www.goethe.de/resources/files/png203/lono--aib_square-formatkey-png-w320r.png",
    "offers": {
      "price": "Free",
      "priceCurrency": "INR"
    }
  }
]