[
  {
    "name": "Live Syntax with Alexandra Cárdenas",
    "startDate": "2025-10-13T20:00:00",
    "location": {
      "@type": "Place",
      "name": "The ISRO Studio",
      "address": "2nd cross Gundappareddy Layout Chola Nagar, RT Nagar 560032 Bangalore  Transnational"
    },
    "endDate": "2025-10-13T22:00:00",
    "keywords": [
      "GOETHE",
      "Real-time coding",
      "Music",
      ",Jazz"
    ],
    "@type": "EducationEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=27063775",
    "description": "Monday, 13.10.2025 to Thursday, 16.10.2025This is a closed workshop by invitation only.Concert details tbc.A 45-minute audiovisual performance where sound and image are composed live through code. Pulsing rhythms, shifting textures, and luminous geometries unfold in real time, revealing both structure and improvisation. Each performance is unique, shaped by the moment and the place. InIndia, new influences and discoveries will flow into the work, opening space for dialogue between code, sound, and context.© Alexandra CárdenasAlexandra Cárdenasis a composer, live coder, and sound artist from Bogotá, Colombia, based in Berlin. Her work brings together composition, programming, and improvisation to create music with code in real time. As an active member of the global live coding and Algorave communities, she has co-founded nodes such as Toplap Mexico and Toplap Berlin. She teaches and performs worldwide with open-source languages including SuperCollider and TidalCycles, and her work has been presented at international festivals, conferences, and institutions. She is dedicated to makingdigitaltechnology\\ies and art accessible, inspiring diverse communities through workshops, performances, and collaborative projects.",
    "image": "https://www.goethe.de/resources/files/png193/alexandra-v4-formatkey-png-w320r.png",
    "offers": {}
  },
  {
    "name": "Café Jazz Sessions turns 30!",
    "startDate": "2025-10-17T17:00:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-10-17T19:00:00",
    "keywords": [
      "GOETHE",
      "Jazz Fusion",
      "Music"
    ],
    "@type": "MusicEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=27066058",
    "description": "30thedition ofCafé Jazzat the Bhavan!In this 30th landmark edition of Café Jazz Sessions, we celebrate all styles of jazz from Jazz Standards to Latin Jazz to Fusion, the Blues and Contemporary styles.  Experience jazz with seasoned musicians performing and spontaneously mentoring younger musicians in the rhythms, harmonies and improvisation of jazz.Café Jazz Sessions turns 30on October 17, 2025, at theGoethe-Institut / Max Mueller Bhavan Bangalore.Started in 2022 by one of the pioneers of jazz in the city,Jagadeesh M R, Director ofThe Bangalore School of Musicand founder ofMoonArra World Fusion Ensemble, this is a monthly event, designed to building a community of jazz musicians in the city and foster a culture of creativity. It is a platform to connect with each other and audiences through jam sessions, lecture demonstrations and performances. The project has fostered a faithful community of musicians who participate and interact freely with younger jazz aspirants while audiences get a rare opportunity to watch, listen and understand the creative processes in jazz.Free entry for audiences.Musicians to register via Whatsapp +91 9844245577 for a spot.",
    "image": "https://www.goethe.de/resources/files/png195/cms-square-formatkey-png-w320r.png",
    "offers": {}
  },
  {
    "name": "When Hitler Stole Pink Rabbit @ Suchitra",
    "startDate": "2025-10-17T18:30:00",
    "location": {
      "@type": "Place",
      "name": "Suchitra Film Society",
      "address": "#36, 9th Main, B V Karanth Road  Near Post Office, Banashankari Stage II Bangalore 560070 India"
    },
    "endDate": "2025-10-17T20:30:00",
    "keywords": [
      "GOETHE",
      "German Kino",
      "Music"
    ],
    "@type": "ScreeningEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=27071062",
    "description": "German Kinois back this October atSuchitra Film Academywith a screening ofWhen Hitler Stole Pink Rabbit(2019) byCaroline LinkBecause her family is Jewish and her journalist father is an opponent of the National Socialists, little Anna has to flee Germany with her parents and brother in 1933 and leave her beloved stuffed pink rabbit behind in Berlin. A loving, touching and compelling adaptation ofJudith Kerr's classic autobiographical children's book.When Hitler Stole Pink Rabbitby Caroline Link2019 | 119 Min. | German with Englisg subtitlesCaroline Link's career as a director began with immediate success both at the national and international level when her first feature filmBeyond Silence(1996) was nominated for an Academy Award® as Best Foreign Language Film in 1997. After completing her second feature film,Annaluise and Anton(1999), a children’s movie based on the Erich Kästner novel of the same name, she directedNowhere in Africa(2001), which won the Academy Award® for Best Foreign Language Film in 2003. In 2013, she directedExit Marrakech, which premiered as a Special Presentation at the Toronto IFF and won the Gryphon Award for Best Film at the Giffoni IFF.All About Me(2018), telling the childhood story of the German entertainer Hape Kerkeling, was Link’s most successful film so far and received numerous awards.",
    "image": "https://www.goethe.de/resources/files/png195/when-hitler-stole-pink-rabbit-square-formatkey-png-w320r.png",
    "offers": {}
  },
  {
    "name": "Metropolis by Fritz Lang",
    "startDate": "2025-10-18T16:30:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-10-18T18:30:00",
    "keywords": [
      "GOETHE",
      "October Spooky Special",
      "Music"
    ],
    "@type": "ScreeningEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=27066112",
    "description": "This October, descend into the shadows of the future and witness the haunting horrors of late stage capitalism, class divide, and a lack of empathy!Witness the masterpieceMetropolis (1927)by the master directorFritz Langat theGoethe-Institut / Max Mueller Bhavan Bangalore.Metropolis (1927), directed by Fritz Lang, is a groundbreaking German expressionist science fiction film set in a futuristic city sharply divided between wealthy elites living in towering skyscrapers and oppressed workers toiling underground. When Freder, the son of the city’s ruler, discovers the workers’ harsh conditions, he joins forces with Maria, a compassionate visionary who preaches unity. However, their hopes for reconciliation are threatened when a scientist creates a robot duplicate of Maria to incite chaos. The film explores themes of class struggle, industrialization, and humanity, concluding with the message that“the mediator between head and hands must be the heart.”Metropolisby Fritz Lang1927 | 153 Min. | Silent Film | Sci-FiSaturday, 18.10.20254:30 pm onwardsMetropolis has had a profound influence on science fiction and cinema, shaping the visual language of futuristic dystopias for decades. Its towering cityscapes inspired films likeBlade Runner, Star Wars,andThe Matrix,while its themes of class conflict and technology’s dehumanizing power remain timeless.For many years, the film existed only in incomplete versions after large sections were lost following its 1927 premiere. In 2008, a nearly complete 16mm print was discovered in Buenos Aires, allowing a major restoration in 2010. Using digital techniques and the original score, archivists painstakingly reconstructed Metropolis to closely match Fritz Lang’s original vision.Fritz Lang(1890–1976) was an Austrian-German filmmaker and one of the most influential directors of early cinema. Known for his mastery of visual storytelling and psychological depth, Lang helped define German Expressionism with films likeMetropolis (1927)andM (1931).His work often explored themes of fate, power, and moral conflict, marked by striking architecture, shadows, and precision. After fleeing Nazi Germany, Lang continued his career in Hollywood, directing acclaimed noir films such asScarlet StreetandThe Big Heat. His visionary style and social commentary left a lasting legacy on both European and American cinema.",
    "image": "https://www.goethe.de/resources/files/png195/metropolis_spooky-special-2025-square-formatkey-png-w320r.png",
    "offers": {}
  }
]