[
  {
    "name": "Metropolis by Fritz Lang",
    "startDate": "2025-10-18T16:30:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-10-18T18:30:00",
    "keywords": [
      "GOETHE",
      "October Spooky Special",
      "Music"
    ],
    "@type": "ScreeningEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=27066112",
    "description": "This October, descend into the shadows of the future and witness the haunting horrors of late stage capitalism, class divide, and a lack of empathy!Witness the masterpieceMetropolis (1927)by the master directorFritz Langat theGoethe-Institut / Max Mueller Bhavan Bangalore.Metropolis (1927), directed by Fritz Lang, is a groundbreaking German expressionist science fiction film set in a futuristic city sharply divided between wealthy elites living in towering skyscrapers and oppressed workers toiling underground. When Freder, the son of the city’s ruler, discovers the workers’ harsh conditions, he joins forces with Maria, a compassionate visionary who preaches unity. However, their hopes for reconciliation are threatened when a scientist creates a robot duplicate of Maria to incite chaos. The film explores themes of class struggle, industrialization, and humanity, concluding with the message that“the mediator between head and hands must be the heart.”Metropolisby Fritz Lang1927 | 153 Min. | Silent Film | Sci-FiSaturday, 18.10.20254:30 pm onwardsMetropolis has had a profound influence on science fiction and cinema, shaping the visual language of futuristic dystopias for decades. Its towering cityscapes inspired films likeBlade Runner, Star Wars,andThe Matrix,while its themes of class conflict and technology’s dehumanizing power remain timeless.For many years, the film existed only in incomplete versions after large sections were lost following its 1927 premiere. In 2008, a nearly complete 16mm print was discovered in Buenos Aires, allowing a major restoration in 2010. Using digital techniques and the original score, archivists painstakingly reconstructed Metropolis to closely match Fritz Lang’s original vision.Fritz Lang(1890–1976) was an Austrian-German filmmaker and one of the most influential directors of early cinema. Known for his mastery of visual storytelling and psychological depth, Lang helped define German Expressionism with films likeMetropolis (1927)andM (1931).His work often explored themes of fate, power, and moral conflict, marked by striking architecture, shadows, and precision. After fleeing Nazi Germany, Lang continued his career in Hollywood, directing acclaimed noir films such asScarlet StreetandThe Big Heat. His visionary style and social commentary left a lasting legacy on both European and American cinema.",
    "image": "https://www.goethe.de/resources/files/png195/metropolis_spooky-special-2025-square-formatkey-png-w320r.png",
    "offers": {}
  }
]