[
  {
    "name": "Showcase: bangaloREsidency-Expanded 2025",
    "startDate": "2026-02-20T18:00:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2026-02-20T20:00:00",
    "keywords": [
      "GOETHE",
      "Featuring 9 artists and their projects",
      "Visual Arts"
    ],
    "@type": "Event",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=27222120",
    "description": "The projects of 9 Indian artists who were part of thebangaloREsidency-Expandedprogramme in 2025 are on display this weekend. The Showcaseopens on Friday 20 February 2026 at 6 pmwith the play 'The Bathroom Project' by Shashank Rajashekar, followed by 'INTER:FACE', a sound performance by Vineesh Amin.Showcase timings:21 February 2026, 11 am - 8 pm22 February 2026, 11 am - 5 pmLive performances / Screening:20 & 21 February 2026, 6 pm | The Bathroom Project, a play by Shashank Rajashekar20 & 21 February 2026, 7 pm | INTER:FACE, a sound performance by Vineesh Amin22 February 2026, 11 am, 12 pm & 4 pm | Lost & Found: Berlin, a film by Nitya Misra*Entry free. Limited seats. Entry on a first come first serve basis.*Workshop:21 February 2026, 11:15 am - 12:15 pmOR1:15 pm - 2:15 pm | We are all one, a slow stitch circle, facilitated by Shilpa Nayudu.*Entry free. Limited seats.Registration is mandatory.*ThebangaloREsidency-Expandedwas conceptualised to further intensify the reach and sustainability of our highly successful project 'bangaloREsidency', where artists from Germany are invited to residencies with our partners in Bangalore. bangaloREsidency-Expanded was started in 2017 with the aim to establish long-term artistic exchange in a sustainable format that intensifies creative exchange through a novel practice of collaboration. As a bangaloREsident-Expanded, artists living and working in Karnataka, Kerala and Goa get to live and work in Germany with one of our host organisations for 6 to 12 weeks, gain access to the art practice of the other culture and thereby enrich their own creativity. Over 50 artists have experienced the benefits of this programme so far, and the tale continues!Featured Artists:© Willie SchumannAnpu Varkey | bangaloREsident-Expanded @ Teufelsberg, BerlinLittle Exchanges / Transform the SpaceI met Tobi in 2019.He was passing through India with the TFTS collective.They arrived on a bus full of paint.Since then, I’ve been to Berlin twice.Tobi became my way in—showing me the city through walls, streets, shortcuts.Through an urban lens.Through memory.The city feels like a collision.Past bleeding intopresent.The residency at Teufelsberg felt right.A reason to meet again.To keep the conversation going.This time we made a silkscreen print.And a zine.Through the exhibition, we came back to it—another screen print.These little exchanges have been incidental and monumental at the same time.As a muralist,Anpu Varkeyhas been creating large-scale public art across India and internationally for over a decade.© George PanickerGeorge Panicker | bangaloREsident-Expanded @ ZKM / Hertzlab, KarlsruheThe Path Is a NetworkSociety unfolds dialectically, with beings realizing themselves through one another like a self-modulating feedback network. Historical memory is a contested media struggle in which victors rewrite the past and the defeated are pushed toward erasure. Yet erasure is never complete: memory persists in the everyday fabric of a land before time, rising like vapor from archaic stone. In India, this undercurrent presence takes the form of the Buddha and the silent yet influential imprint of Buddhism. The media artist, working with historical archival, reactivates this latent memory by amplifying what has been (intentionally) rendered marginal.The Path Is a Network emerges from my research into emotion, colonialism, spatial music, and new media at ZKM. Composed in SuperCollider with visuals rendered in OpenGL, the work draws the viewer into mindful contemplation of a story still in the process of awakening.George Panickeris a practitioner based in Bangalore whose work spans computational art, New Media and technical design.© Nitya MisraNitya Misra | bangaloREsident-Expanded @ Lichtenberg Studios, BerlinLost & Found: BerlinThis is a personal documentary film which investigates Berlin through the lens of what has been misplaced or left behind. What can lost objects reveal about a city? What can they tell us about the people who move through its spaces?The film celebrates the quiet presence of everyday objects- to see how the mundane becomes meaningful, and how loss can offer unexpected insight into belonging, memory, and identity.Nitya Misrauses the medium of narrative film to examine incidental, and supposedly insignificant moments, as a way to uncover the extraordinary aspects of everyday life in urban spaces.© Payal RajputPayal Rajput | bangaloREsident-Expanded @ Zentralwerk, DresdenBetween the polarities of presence and absenceThis project emerges from an engagement with the permanent collection of objects from the German Colonial period from Grassi Museum für Volkerkunde in Leipzig. The text accompanying the display talks about the collection, ways of acquisition, unresolved questions about prior ownership, makers, and stories behind these objects.While spending time with and observing the types and number of objects, display, arrangements, I began to notice more and more the well-preserved and well-lit nature of these objects, and their accompanying texts. I found myself inclined towards the palpable absence within these frozen objects, ghostly places, and histories carefully outlined for the audience. In response to this contradiction, I then wanted to see the impact these objects have when they come together, just as objects, devoid of their context.The series ‘Between the polarities of presence and absence’ consists of ink drawings and ceramic sculptures. The ceramic sculptures are kept for the audience to engage with (not just visually, but also through touch), moving these objects even further from their encased museumized setting into that of the everyday.Payal Rajputis a visual artist, ceramicist, and art educator based in Bangalore.© Renuka RajivRenuka Rajiv | bangaloREsident-Expanded @ basis e.V., Frankfurtgoose grass goose grass gooooooooseRenuka spent the residency exploring risograph printing and created a couple of bodies of work across the duration of the residency. This happened at Riso Paradiso in Offenbach with the guidance of Katarina Handtke. They also wanted to just draw and took inspiration from their surroundings, namely all the water birds in the vicinity.Renuka Rajivhas had an interest in making things since childhood, exploring drawing, paper-mache, tie-dye and stitching.© Moloko PrintSeljuk Rustum | bangaloREsident-Expanded @ C. Rockefeller Center, DresdenThe Goddess / Die GöttinThis is an audio installation work produced by Seljuk Rustum during his residency. It foregrounds an intimate engagement with the poetry of Louise Landes Levi, a poet, translator, musician, and performer whose practice traverses experimental poetics, ritual sound, and cross-cultural musical traditions woven through personal pilgrimage and deep listening. Known for her extensive travels, her immersion in Indian classical music, and her translations of figures such as René Daumal — as well as her own body of poetry that often invokes threshold experience and embodied sonic ritual — Louise’s work continually reorients language toward lived, resonant presence rather than abstraction.Drawing from a publication by the independent German press Moloko Plus and presented here in the German translation by Florian Vetsch, these poems are rendered not as fixed texts but as lived, auditory experience. Through musical collaborations with Yenting Hsu and Yanung Huang and spoken readings by Tatjana Bikic, the produced tracks offer another way to engage with Landes Levi’s work — a more immediate, intimate listening that foregrounds voice, breath, and the resonances between language and sound. Installed within the library as a continuously unfolding audio environment, the piece reflects on poetry as a shared, sonic encounter that unfolds between presence and attention.Seljuk Rustumis a musician and cultural organiser and the founder of Forplay Society.© Shashank RajashekarShashank Rajashekar | bangaloREsident-Expanded @ Schauburg, MunichThe Bathroom ProjectThisis a theatre play for young audiences that revolves around the theme of making mistakes. The protagonist finds himself in a place of order, a bathroom, until he meets chaos.Is what you can and cannot do inside someone's bathroom political? Especially because you are alone? Do you touch something that is not yours? Do you follow the rules or do you break them? What if you break the rules by mistake? What are the consequences? Invasion of another person's private space - but you are invited - does that blur the boundaries?The Bathroom Project is a story that draws inspiration from the experiences, stories, people and artists in Munich.Shashank Rajashekarhas been an active part of the city’s theatre scene for the last 5 years during which he has donned various roles such as Actor, Writer, Lyricist, Teacher, Set Designer and Festival Manager to name a few.© Shilpa NayuduShilpa Nayudu | bangaloREsident-Expanded @ Weltkunstzimmer, Düsseldorf1. We Are All oneThis is a participatory community artwork that invites collective reflection on the invisible yet fundamental units of human existence: body cells. Through guided stitch sessions, participants engaged with illustrated zines conceived and designed by the artist, learning about different typesof cells before translating this knowledge into stitched cellular motifs on a shared cloth.As hands worked together, the textile gradually evolved into a metaphorical “body”—shaped by many gestures, stories, and moments of attention. Realised through stitch sessions with over 100 participants in Goa, where the artist is based, and in Germany during her residency at Weltkunstzimmer, the work grew into a cross-cultural collective artwork. The fabric weaves together experiences from India and Germany, embodying connection, interdependence, and shared human origins.2. AutonomousThis is an immersive soundscape composed entirely of the body’s involuntary sounds. The composition resists spectacle, instead offering a space for listening and reflection. Here, the body is understood not as a machine to be controlled, but as a living, autonomous symphony—one that sustains, regulates, and remembers, even when we are not aware of it. Drawing attention inward, the work invites listeners to pause and attune themselves to what is constantly at work within us. By isolating and layering these sounds, the artist reveals the body as a self-governing system—alive, attentive, and quietly intelligent.The work has been made in collaboration with Divesh Gadekar, a multidisciplinary artist based in Goa. With support from Miki Yui (Düsseldorf) and various people who generously shared and donated their body sounds for the recordings.Shilpa Nayuduis a visual artist who finds inspiration in the human body, nature and spaces around her and works with various mediums.© Vineesh AminVineesh Amin | bangaloREsident-Expanded @ Experimental Radio, MunichINTER:FACEshapes sound into a live dialogue. Performer ↔ audience merge through noise, rhythm, and feedback, creating a reactive interface where signals intersect and transform. The performance unfolds through continuous interaction between performer and audience, with both influencing and responding to the sonic outcome. As roles blur, the boundary between listening and performing dissolves, inviting collective authorship of the experience. INTER:FACE foregrounds shared agency and rethinks how sound is experienced and shaped in real time.Vineesh Aminworks at the intersection of sound, technology, and performance.",
    "image": "https://www.goethe.de/resources/files/jpg1435/bangaloresidency-expanded-showcase_square-formatkey-jpg-w320r.jpg",
    "offers": {
      "price": "Free",
      "priceCurrency": "INR"
    }
  }
]