[
  {
    "name": "Fade in Fade Out",
    "startDate": "2025-08-01T19:15:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-08-01T21:15:00",
    "keywords": [
      "GOETHE",
      "an Indo-German Theatre project",
      "Society and Current Affairs"
    ],
    "@type": "Event",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26859043",
    "description": "Join us for an evening of children theatre, performed by grade 7 students!When do we fade in or fade out? When someone fades in, do they really belong to the spotlight or is it that the light creates a vision for us to see them in the light? This play is an invitation for us to soak in and ask questions of who occupies the spotlight and becomes a hero.  A hero is someone we have all learnt to worship, admire and remain in awe of but is there an intrinsic figure called the hero or do we have heroes of our own making in our eyes only?Come witness this act of how we make heroes by taking a trip down childhood nostalgia. This play works with the ever popular Panchatantra story \"The Thirsty Crow\" as a point of departure to interrogate the concept of the hero and in turn asks -  who occupies the status of a hero, how and why. Do we really have someone called the hero or is it the public validation that makes heroes for us?Date:Friday, 1 August 2025Venue:Goethe-Institut / Max Mueller Bhavan BangaloreTime:7:15 p.m onwardsTickets:INR 300.Book Here!Children below the age of 5 are not permitted.The audience is requested to beseated by 7:15 PM. Late entries will not be allowed, as they may disrupt the performance.Kindly bring a screenshot of your payment confirmation to the venue.Director:Samta ShikharCo-Director:Prisca Maier NiedenWe look forward to seeing you in the audience!Fade In Fade Outis a project byHead Start Educational Academyin collaboration withDAT - Die Kunstschule BöblingenandGoethe-Institut / Max Mueller Bhavan Bangalore",
    "image": "https://www.goethe.de/resources/files/png187/fade-in-fade-out_square-formatkey-png-w320r.png",
    "offers": {
      "url": "https://pay.jodo.in/pages/nVHbVJjkZd5fQNtT",
      "price": "INR 300",
      "priceCurrency": "INR"
    }
  },
  {
    "name": "Making Friends in Germany",
    "startDate": "2025-08-18T16:15:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-08-18T18:15:00",
    "keywords": [
      "GOETHE",
      "Tips for a Great Start",
      "Media",
      ",Welcome in Germany",
      ",Media",
      ",Welcome in Germany"
    ],
    "@type": "EducationalEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26864008",
    "description": "Would you like to make new friends and settle into life in Germany quickly? Then join our exciting info session! You'll get helpful tips and insights on how to settle into your new surroundings, connect with others, and better understand cultural differences.Don't miss out—we're here to support you in settling in!Date:Monday, 18.08.2025Time:4:15 PM - 6:30 PM ISTPlace:Goethe-Institut / Max Mueller Bhavan BangaloreLanguage of the Event:EnglishRegister hereLimited Seats, Registration will be closed once seats are full.DATA PROTECTIONPlease ensure that you've read and agree to the attached Data Protection Declaration.Data Protection Declaration AMIF(PDF, 218 KB)About the Project:This event is being offered within the framework of the AMIF Project - \"Pre-Integration and Transition Management - Successfully navigating the migration process\". This project supports people, who want to migrate permanently to Germany for professional or private reasons, in preparing for everyday and working life.",
    "image": "https://www.goethe.de/resources/files/jpg1386/artboard-v108-formatkey-jpg-w320r.jpg"
  },
  {
    "name": "Interphew! - Tips and Tricks for Job Interviews in Germany",
    "startDate": "2025-08-20T17:15:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-08-20T19:15:00",
    "keywords": [
      "GOETHE",
      "Learn what makes a great interview",
      "Media",
      ",Welcome in Germany",
      ",Media",
      ",Welcome in Germany"
    ],
    "@type": "EducationalEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26864086",
    "description": "In our workshop, you will learn what a great job interview should look like using real examples. We will look at the preparatory measures, the Dos and Don'ts  and the overall structure of the interrview, including the potential questions, so that you are aware of all the important details when interviewing in the future.Date:Saturday,  20.08.2025Time:5:15 AM - 7:30 PMPlace:Hall, Goethe-Institut / Max Mueller Bhavan BangaloreLanguage:English and German (B2 Level)Participation is free of charge.Seats are limited and you will receive a confirmation one day prior to start of the session.Register hereWe look forward to your participation!Whom is the course aimed at?The project is co-financed by the Asylum, Migration and Integration Fund (AMIF) and is aimed at third-country nationals in Germany and those about to immigrate to Germany. Students are not part of the target group.You can register if you are a third-country national and if you have one of these residence titles:Residence permitto carry out vocational training, search for a training place, recognition of foreign professional qualifications, work, job search, spouse or family reunificationVisaorvisa applicationfor the above-mentioned residence purposesEU Blue CardResidence permit according to § 24 Abs. 1 AufenthGDATA PROTECTIONPlease ensure that you've read and agree to the attached Data Protection Declaration.Data Protection Declaration AMIF(PDF, 218 KB)About the Project:This event is being offered within the framework of the AMIF Project - \"Pre-Integration and Transition Management - Successfully navigating the migration process\". This project supports people, who want to migrate permanently to Germany for professional or private reasons, in preparing for everyday and working life.",
    "image": "https://www.goethe.de/resources/files/png174/untitled-design-1111-formatkey-png-w320r.png"
  }
]