[
  {
    "name": "Unwritten Bodies: Seen & Unseen",
    "startDate": "2026-02-06T19:30:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2026-02-06T21:30:00",
    "keywords": [
      "GOETHE",
      "by Purnendra Meshram and Rebecca Mary Narum",
      "Dance and Theatre"
    ],
    "@type": "Event",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=27213691",
    "description": "Unwritten Bodies: Seen & Unseenis a transcultural dance project that moves along the traces inscribed on our bodies. It follows how bodies are shaped, framed, and perceived across cultural, societal, racial, and economic contexts, and listens to the visible and invisible imprints these contexts leave behind.Developed, created, and performed byPurnendra Meshram(IN) andRebecca Mary Narum(DE/USA), the work emerges from an ongoing dialogue between India and Germany and from the artists’ distinct yet intersecting cultural backgrounds. A “third body” in space – a plastic blanket – moves with the performers as a symbolic skin, carrying the layers we accumulate over time: those we consciously embrace and those we inherit or carry unintentionally. The original sound score by Fiona Combosch (DE) expands this reflection through field recordings from both countries, creating an acoustic landscape where different environments and experiences meet.Originating from the question “What is the body?”, a reflection emerged on how often our attention is placed on difference rather than on shared ground. The piece proposes that difference itself can become a site of connection and mutual enrichment.Unwritten Bodies: Seen & Unseendoes not seek to erase the social imprints that shape us, but to observe them, see through them, and move around them. In this space, unwriting becomes possible – and with it, the chance to write anew, or write differently.Performed in unconventional spaces across multiple locations, the piece includes subtle invitations for the audience to join in. Each performance becomes part of the ongoing artistic research, a shared space for questioning, listening, and reimagining the bodies we inhabit.Unwritten Bodies: Seen & Unseenpremiers in India on6 February 2026, 7:30 pm at the Bhavan, followed by another show on 7 February before touring in other cities.Limited seats.Book your tickets online now.Credits:Music and Sound: Fiona Combosch (DE)Outside Eye: Deepak Kurki Shivaswamy (IN), Lilo Stahl (DE)Choreography and Performance: Purnendra Kumar Meshram (IN), Rebecca Mary Narum (USA/DE)Funded by:International Coproduction Fund of the Goethe-Institut, Friedrich Stiftung, TANZPLUSSÜD, Tanzzentrale der Region Nürberg e.V., kultur.lokal.fürth, Kulturamt Freiburg, Regierungspräsidium Freiburg.Supported by: Goethe-Institut / Max Mueller Bhavan Bangalore, Schopf2 / Kreativpioniere, BLMK, Vinyasa EARTH, Khuli Khirkee.",
    "image": "https://www.goethe.de/resources/files/jpg1432/unwritten-bodies-seen--unseen_poster-formatkey-jpg-w320r.jpg",
    "offers": {
      "price": "INR 300",
      "priceCurrency": "INR"
    }
  }
]