[
  {
    "name": "Bengaluru International Short Film Festival",
    "startDate": "2025-08-16T10:00:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-08-16T12:00:00",
    "keywords": [
      "GOETHE",
      "Film screenings, Masterclass, Discussions",
      "Film"
    ],
    "@type": "ScreeningEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26879134",
    "description": "This year, the ants march in! Tiny. Tenacious. Timeless. Just like your short films!The15thedition of theBengaluru International Short Film Festival (BISFF)will showcase shorts from all over the world, creating a physical space for a great audience experience and bringing together a keen audience for the filmmakers. Like in the past, this edition will be presented in aHybridversion, having both Online and Venue Screenings.Online Screeningsare accessible onlywithin India, whileoffline screeningswill be presented atfivevenues across Bangalore.We are happy to hostBISFF at the Bhavanon16 and 17 August, 2025and screen films from the following sections:Queer Qorner CompetitionWomen's Collective CinemaKarnataka CompetitionIndian CompetitionGerman FilmsThehighlighton16 August,is the Indianpremiereof theGerman Short Filmscurated and presented byMaike Mia Höhne,artistic directorof theHamburg Short film Festival.On17 August, the last day of the festival don't miss the coversation betweenMaike Mia Höhneand the well-known Marathi film director,Umesh Vinayak KulkarnionHow to not enter European Film Festivalsat4:00 pm at Suchitra.We also invite you to be there for the closing ceremony at Suchitra to get to know thegrantees of the Script to Screen 2.0!Following the sucess and recognition of the short films produced from the first edition of Script to Screen, we are delighted to have recieved 3 times as many application this time around.Find the complete schedule here!BISFFwas conceived on a dream-fuelled evening with the idea to create a platform for young and amateur filmmakers to screen their shorts to discerning audiences and, more importantly, find constructive and critical feedback from experts in the field.BISFFis the only film festival in India which is accredited by the Academy Of Motion Picture Arts & Sciences as an official qualifying film festival for Live-Action.The 2025 edition ofBISFFis supported by theGoethe-Institut / Max Mueller Bhavan.",
    "image": "https://www.goethe.de/resources/files/png188/bisff-square-formatkey-png-w320r.png",
    "offers": {
      "url": "https://bisff.in/delegate-registration/"
    }
  },
  {
    "name": "Making Friends in Germany",
    "startDate": "2025-08-18T16:15:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-08-18T18:15:00",
    "keywords": [
      "GOETHE",
      "Tips for a Great Start in Germany",
      "Media",
      ",Welcome in Germany",
      ",Media",
      ",Welcome in Germany"
    ],
    "@type": "EducationEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26864008",
    "description": "Would you like to make new friends and settle into life in Germany quickly? Then join our exciting info session! You'll get helpful tips and insights on how to settle into your new surroundings, connect with others, and better understand cultural differences.Don't miss out—we're here to support you in settling in!Date:Monday, 18.08.2025Time:4:15 PM - 6:30 PM ISTPlace:Goethe-Institut / Max Mueller Bhavan BangaloreLanguage of the Event:EnglishRegister hereLimited Seats, Registration will be closed once seats are full.DATA PROTECTIONPlease ensure that you've read and agree to the attached Data Protection Declaration.Data Protection Declaration AMIF(PDF, 218 KB)About the Project:This event is being offered within the framework of the AMIF Project - \"Pre-Integration and Transition Management - Successfully navigating the migration process\". This project supports people, who want to migrate permanently to Germany for professional or private reasons, in preparing for everyday and working life.",
    "image": "https://www.goethe.de/resources/files/jpg1386/artboard-v108-formatkey-jpg-w320r.jpg",
    "offers": {}
  },
  {
    "name": "Interphew! - Tips and Tricks for Job Interviews in Germany",
    "startDate": "2025-08-20T17:15:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-08-20T19:15:00",
    "keywords": [
      "GOETHE",
      "Learn what makes a great interview",
      "Media",
      ",Welcome in Germany",
      ",Media",
      ",Welcome in Germany"
    ],
    "@type": "EducationEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26864086",
    "description": "In our workshop, you will learn what a great job interview should look like using real examples. We will look at the preparatory measures, the Dos and Don'ts  and the overall structure of the interrview, including the potential questions, so that you are aware of all the important details when interviewing in the future.Date:Saturday, 20.08.2025Time:5:15 PM - 7:30 PMPlace:Hall, Goethe-Institut / Max Mueller Bhavan BangaloreLanguage:English and German (B2 Level)Participation is free of charge.Seats are limited and you will receive a confirmation one day prior to start of the session.Register hereWe look forward to your participation!Whom is the course aimed at?The project is co-financed by the Asylum, Migration and Integration Fund (AMIF) and is aimed at third-country nationals in Germany and those about to immigrate to Germany. Students are not part of the target group.You can register if you are a third-country national and if you have one of these residence titles:Residence permitto carry out vocational training, search for a training place, recognition of foreign professional qualifications, work, job search, spouse or family reunificationVisaorvisa applicationfor the above-mentioned residence purposesEU Blue CardResidence permit according to § 24 Abs. 1 AufenthGDATA PROTECTIONPlease ensure that you've read and agree to the attached Data Protection Declaration.Data Protection Declaration AMIF(PDF, 218 KB)About the Project:This event is being offered within the framework of the AMIF Project - \"Pre-Integration and Transition Management - Successfully navigating the migration process\". This project supports people, who want to migrate permanently to Germany for professional or private reasons, in preparing for everyday and working life.",
    "image": "https://www.goethe.de/resources/files/png174/untitled-design-1111-formatkey-png-w320r.png",
    "offers": {}
  },
  {
    "name": "Flower Tools 2.0 by QRave",
    "startDate": "2025-08-23T14:00:00",
    "location": {
      "@type": "Place",
      "name": "Indiranagar Social",
      "address": "Plot 37, 80 Feet Rd HAL 3rd Stage, New Tippasandra Bangalore 560075 India"
    },
    "endDate": "2025-08-23T16:00:00",
    "keywords": [
      "GOETHE",
      "Music, Community, and Resistance!",
      "Film"
    ],
    "@type": "EducationEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26888026",
    "description": "QRave returns again for Music, Community, and Resistance!FLOWER TOOLSis a series of gatherings byQRaveblending music, community, and shared learning into a space for expression, resistance, and joy. Designed for and by queer folks, it fosters collective flourishing through DJ sets, live performances, workshops, and discussions that empower, educate, and celebrate.The second edition of FLOWER TOOLS features aFREEbeginner-level DJ workshop for anyone who isn’t a straight cis man. Led byChutney Mary, the workshop offers hands-on learning, technical guidance, and a selector showcase by participants.At its heart, FLOWER TOOLS is about reclaiming space—on the dance floor, in music, and within ourselves—through our own unique expression. Preference will be given to queer and trans folks. As slots are limited, we’ll run recurring sessions and get in touch with those who may not get in this time.WorkshopSandbox Collective, Studio 345, Cooke Town23–24 August | 2–7 pmSelector Showcase + After PartyIndiranagar Social24 August | 8 pm onwardsAttendance on all days for participants is compulsory.Chutney Marywas born at the intersection of performance art, queerness and the spirit of experimentation. She is the alter ego of interdisciplinary artist Avril Stormy Unger. Chutney Mary is a DJ, stand-up comic, MC, dancer and pushes boundaries and norms of gender, sexuality, patriarchy and societal norms through a myriad of performances.This event is supported by Goethe-Institut / Max Mueller Bhavan Bangalore.",
    "image": "https://www.goethe.de/resources/files/jpg1404/square-poster-formatkey-jpg-w320r.jpg",
    "offers": {
      "url": "https://docs.google.com/forms/d/e/1FAIpQLSexlqHDjGwWJDCoG7KmZ7pOUNCLWcCUkouj3eU8GL-LpSRfbw/viewform",
      "price": "Free Entry",
      "priceCurrency": "INR"
    }
  },
  {
    "name": "The Flying Dutchman by Joachim Herz",
    "startDate": "2025-08-23T16:30:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-08-23T18:30:00",
    "keywords": [
      "GOETHE",
      "Behind the Wall - Films from East Germany",
      "Film"
    ],
    "@type": "ScreeningEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26879143",
    "description": "We invite you to a screening ofThe Flying Dutchman (1964),directed byJoachim Herz.A screening in our ongoing film seriesGerman Cinema in Focuscurated byShivani. Currently being shown are a selection ofFilms from East Germany.In order to escape her narrow and restrictive life,Senta, the daughter of a rich shipowner, seeks refuge in her fantasies and dreams. In this realm of imagination, a bold and restless sea captain,the Flying Dutchman,who is cursed to wander the seas forever appears to her. In her obsessive dreams, Senta frees this man through her love for him.Centered around the theme of\"redemption through love\",Der fliegende Holländeris a German-language opera with libretto and music byRichard Wagner,who conducted the premiere at the Königliches Hoftheater Dresden in 1843. The opera is based on the myths of a legendary phantom ship (The Flying Dutchman), allegedly never able to make port, but doomed to sail the sea forever.The Flying Dutchman | Der fliegende HolländerJoachim Herz1964 | 101 Min. | B&W | German with English subtitleswith the music ofRichard WagnerJoachim Herz(b. 1924, Dresden), one of the most influential and innovative European musical theater directors of the twentieth century. His 1977 debut at theBerlin Komische Operwas with theBrecht & Weillsatirical operaRise and Fall of the City of Mahagonny, which was also recorded for East German television. His subsequent staging of The Flying Dutchman in 1962, at the invitation of Walter Felsenstein, and following productions in Leipzig (1962) and at Moscow’s Bolshoi Theater (1963) prompted an invitation to make a cinematic adaptation, the only film he ever made. Herz left the Komische Oper in 1981, possibly because of his dealings with the ensemble and GDR officials, and worked in London and Munich.After his death in 2010, the British magazineOpera Nownoted:“His Wagner productions in particular have proved ground-breaking, although his enormous contribution to revolutionary post-war changes in opera production has not always been acknowledged.”Free Entry!!",
    "image": "https://www.goethe.de/resources/files/png188/dutchman-square-formatkey-png-w320r.png",
    "offers": {
      "price": "Free Entry",
      "priceCurrency": "INR"
    }
  }
]