[
  {
    "name": "All My Girls by Iris Gusner",
    "startDate": "2025-09-20T16:30:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-09-20T18:30:00",
    "keywords": [
      "GOETHE",
      "Behind the Wall - Films from East Germany",
      "Film"
    ],
    "@type": "ScreeningEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26982919",
    "description": "We invite you to a screening ofAll MyGirls (1980),directed byIris Gusner.A screening in our ongoing film seriesGerman Cinema in Focuscurated byShivani. Currently being shown are a selection ofFilms from East Germany.Despite his lack of enthusiasm, film studentRalfis assigned to make a documentary about a team of six women workers at a light bulb factory in Berlin. At first, the team seems to work and get along together without a hitch. But soon tensions between the women become apparent and they pull Ralf into their conflicts.All My Girlswas filmed on location at the NARVA light bulb factory in Berlin. Director Iris Gusner worked closely with other women on her team to make this film that gives us a real feel for what it was like to be a woman in the GDR.All My GirlsbyIris Gusner1980 | 86 Min. | Colour | German with English subtitlesIris Gusner(b. 1941), one of very few female feature film directors in East Germany, trained in directing at the renownedVGIK film schoolin Moscow underMikhail Romm. After a brief stint with East German television, in 1968 she moved to the DEFA Studio for Feature Films, where she started as assistant director toKonrad Wolfon his 1971 filmGoya, or the Hard Way of Enlightenment.Her much-heralded debut film,The Dove on the Roof, was banned for showing workers “in distress.” She finally achieved acclaim with her lively portrayal of women workers inAll My Girls, which became one of her most successful films. Her unique semi-autobiographical feature film,If the Earth were not round..., was followed by other films focusing on the role and emancipation of women in the GDR.Free Entry!",
    "image": "https://www.goethe.de/resources/files/png191/all-my-girls-square-formatkey-png-w320r.png",
    "offers": {
      "price": "Free Entry",
      "priceCurrency": "INR"
    }
  },
  {
    "name": "Channel Orange by Frank Ocean (OTJF)",
    "startDate": "2025-09-21T16:00:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-09-21T18:00:00",
    "keywords": [
      "GOETHE",
      "Explore Neo-Soul R&B",
      "Music",
      ",Jazz"
    ],
    "@type": "EducationEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26983519",
    "description": "On The Jungle Floor (OTJF),a Bangalore-based Online Record Store & Music Discovery website will transform our Library space into a Listening Room withone of the most iconic records of our time. For the next edition of OTJF Listening Sessions dive intoChannel Orange, the first full length album byFrank Ocean.We’ll be listening to the album from start to finish while unpacking how Frank crafted an intimate, genre-defying masterpiece that’s as fresh today as it was a decade ago. Along the way, subtle echoes from Frank’s wider world – his other works, including collaborations with influential German photographer Wolfgang Tillmans, amongst many others – drift through the space like fading light, inviting reflection, memory, and connection.Still images breathe softly on the walls, and attention feels like an act of care. Rooted in a spirit of openness and shared presence, this isn’t about spectacle—it’s about gathering, listening, and being together.Date: Sunday, 21th September 2025Time: 4:00 PM to 7:00 PMVenue: Goethe-Institut /  Max Mueller Bhavan BangalorePresented by: Abhinav Krishnaswamy & On the Jungle FloorAn intimate room. Great sound. Good people.",
    "image": "https://www.goethe.de/resources/files/jpg1409/otjf_seot25_square-v1-formatkey-jpeg-w320r.jpeg",
    "offers": {
      "url": "https://onthejunglefloor.com/products/event-tickets-otjf-listening-sessions-frank-ocean-channel-orange",
      "price": "INR 885 Tickets Available Online",
      "priceCurrency": "INR"
    }
  },
  {
    "name": "Beyond Bias - Making AI More Inclusive",
    "startDate": "2025-10-06T14:00:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-10-06T16:00:00",
    "keywords": [
      "GOETHE",
      "Prompt-a-thon",
      "Music",
      ",Jazz"
    ],
    "@type": "EducationEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=27004249",
    "description": "Call for applicationsAre you a curator, independent cultural practitioner or part of a museum, cultural organisation or a community advocate interested in the role of AI in shaping our understanding of global arts and cultures?Join us for a hands-on workshop that explores how artificial intelligence can both reflect and reshape cultural narratives—especially those beyond the Western canon.The project works to reduce representational bias in AI systems, with a focus on the arts and cultural practices of non-Western countries. This workshop introduces a simple AI prototype tool to fine-tune AI image and video creation models on under-represented datasets. Together during the workshop, we will test and critically engage with the tool, assessing and providing feedback on its potential, its limitations, and its implications for curatorial, artistic and cultural work.This project seeks to identify and spread best practices in building inclusive AI tools with key stakeholders from the cultural sectors as partners in the tool-creation process.What to expectParticipate in the workshop to use and give feedback on a prototype AI tool that enables people to create fine-tuned AI models with their own image datasetsDiscuss how AI intersects with curatorial practices, cultural equity, and representationCollaborate with peers across the cultural and technology sectors to actively build more inclusive AI futuresIncredible imagery generated from under-represented datasetsWho should attendCultural practitioners, curators, researchers, and others working at the intersection of technology, culture, social justice and archives—especially those interested in decolonial approaches to digital tools.Let’s challenge the biases of AI together and explore how cultural perspectives can inform more ethical, inclusive technologies.Last date to register is 30.09.2025. Shortlisted candidates will hear from us by 01.10.2025.About the projectThe initiative Beyond Bias – making AI more inclusive is a collaborative effort by the Goethe-Institut in India and Gooey.AI, dedicated to reimagining the way generative AI is built. We follow a proactive, participatory process of actively identifying and addressing embedded biases. Together, we seek to demonstrate how inclusive, value-driven AI tools and models can be created through a collective and transparent process.The initiative led to the drafting of a living manifesto, rooted in principles of equity, transparency, and ethical AI development. Participants collaboratively shaped actionable guidelines, which now serve as the cornerstone for both the manifesto and an early wireframe prototype of an inclusive AI tool.In a series of in-person workshops in October 2025, participants in Bangalore, Delhi and Pune will work with the prototype to fine-tune models that reflect their own aesthetic languages—whether rooted in personal practice or community identity. These workshops will also serve as a space to define essential features of the tool, propose meaningful safeguards, and further enrich the open manifesto.We are thrilled to invite you to be part of this process as a participant or co-host. Join us in co-creating a tool and co-authoring a live manifesto, in a build-in-public and participatory process that aims to begin proactively shaping the future of AI—ethically, inclusively, and together.For more information, visit the project website:Beyond Bias - Goethe-Institut Max Mueller Bhavan | India",
    "image": "https://www.goethe.de/resources/files/png192/mj-survey-square-formatkey-png-w320r.png",
    "offers": {
      "url": "https://forms.office.com/pages/responsepage.aspx?id=VbctA1T2H0OylpOhyHrXXc9ZGg3BlUZArWX3XswP04RUNVhPN1AwMjVUT1FFQ1RYRklPRU5CSEpTVSQlQCN0PWcu&route=shorturl"
    }
  }
]