[
  {
    "name": "Berlin Around the Corner (1966) by Gerhard Klein",
    "startDate": "2025-10-11T16:30:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-10-11T18:30:00",
    "keywords": [
      "GOETHE",
      "Behind the Wall - Films from East Germany",
      "Film"
    ],
    "@type": "ScreeningEvent",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=27054469",
    "description": "We invite you to a screening ofBerlin Around the Corner (1966),directed by Gerhard Klein.A screening in our ongoing film seriesGerman Cinema in Focuscurated byShivani. Currently being shown are a selection ofFilms from East Germany.Berlin in the 1960s. Olaf and Horst are two young metal workers, who provoke their older colleagues with critiques of the antiquated equipment and lack of materials… not to mention their love of leather jackets and motorbikes. Olaf and Horst begin to be targeted in the house newsletter, and the generational conflict escalates.Berlin Around the CornerbyGerhard Klein1966 | 85 Min. | B&W | German with English subtitlesGerhard Kleinwas a native Berliner (b. 1920) whose film work keeps coming back to his fascination for that city. He was arrested during World War II for being part of theResistance against the National Socialists. Klein was self-educated and started working as a cartoonist and documentary filmmaker after WWII. In 1946, he began working for DEFA as a documentary film director and scriptwriter, where his work included writing the script for Joop Huisken’s short documentaryStahl (1950). He joined theDEFAStudio for Feature Films in 1952, where he was instrumental in establishing the production of children’s films. There, he was able to achieve his dream of making films expressing the poetry of daily life and his fascination with his beloved Berlin.Klein produced a series of four films known as theBerlin Films. Although Klein was awarded with national honors, his films were often challenged by dogmatic film officials. They found, for example, that the Italian neo-realist influence evident in the box-office hitBerlin – Ecke Schönhauser,was an aesthetically inappropriate model for a socialist state; and the fourth Berlin film,Berlin um die Ecke,was banned by East German officials in 1966, not to be released until 1987. Officials also faulted his earlier film,Der Fall Gleiwitz, which portrays a central moment of Nazi infamy, because they said its powerful style converged too closely with Nazi aesthetics.Gerhard Klein died in 1970 while working on the crime story,Leichensache Zernik, set in post-WWII Berlin. The film was completed by Klein’s assistant and student, the DEFA director Helmut Nitzschke.Free Entry!",
    "image": "https://www.goethe.de/resources/files/png194/berlin-around-the-corner-square-formatkey-png-w320r.png",
    "offers": {
      "price": "Free Entry",
      "priceCurrency": "INR"
    }
  }
]