[
  {
    "name": "Fade in Fade Out",
    "startDate": "2025-08-01T19:15:00",
    "location": {
      "@type": "Place",
      "name": "Goethe-Institut / Max Mueller Bhavan",
      "address": "716, CMH Road, Indiranagar 1st Stage, Bangalore"
    },
    "endDate": "2025-08-01T21:15:00",
    "keywords": [
      "GOETHE",
      "German Exchange Theatre Production",
      "Society and Current Affairs"
    ],
    "@type": "Event",
    "url": "https://www.goethe.de/ins/in/en/ver.cfm?event_id=26859043",
    "description": "Join us for an evening of children theatre, performed by grade 7 students!When do we fade in or fade out? When someone fades in, do they really belong to the spotlight or is it that the light creates a vision for us to see them in the light? This play is an invitation for us to soak in and ask questions of who occupies the spotlight and becomes a hero.  A hero is someone we have all learnt to worship, admire and remain in awe of but is there an intrinsic figure called the hero or do we have heroes of our own making in our eyes only?Come witness this act of how we make heroes by taking a trip down childhood nostalgia. This play works with the ever popular Panchatantra story \"The Thirsty Crow\" as a point of departure to interrogate the concept of the hero and in turn asks -  who occupies the status of a hero, how and why. Do we really have someone called the hero or is it the public validation that makes heroes for us?Date:Friday, 1 August 2025Venue:Goethe-Institut / Max Mueller Bhavan BangaloreTime:7:15 p.m onwardsTickets:INR 300.Book Here!Children below the age of 5 are not permitted.The audience is requested to beseated by 7:15 PM. Late entries will not be allowed, as they may disrupt the performance.Kindly bring a screenshot of your payment confirmation to the venue.Director:Samta ShikharCo-Director:Prisca Maier NiedenWe look forward to seeing you in the audience!Fade In Fade Outis a project byHead Start Educational Academyin collaboration withDAT - Die Kunstschule BöblingenandGoethe-Institut / Max Mueller Bhavan Bangalore",
    "image": "https://www.goethe.de/resources/files/png187/fade-in-fade-out_square-formatkey-png-w320r.png",
    "offers": {
      "url": "https://pay.jodo.in/pages/nVHbVJjkZd5fQNtT",
      "price": "INR 300",
      "priceCurrency": "INR"
    }
  }
]