[
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/cantt-by-night",
    "@type": "SocialEvent",
    "name": "Cantt by Night",
    "description": "This walk is about different communities that built modern Bangalore. Before the bazaars became popular, Cantonment saw activists, entrepreneurs, and social reformers in the erstwhile British India.What makes this tour specialWe will start the tour at a heritage bungalow and wade through the residential lanes of Shivajinagar, ending it closer to Commercial Street.\n\nWe will explore 100 year old structures, visit different small businesses, and learn about the various historical figures that contributed to education, jobs, and opportunities for the people as well as savour the local favourite snacks and food that are distinct to this part of the city.\n\nThis walk has been specially curated by a local resident, who grew up in the Commercial Street neighbourhood and has lived its rich history.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.Bangalore’s Cantonment areas are extra special. It’s a melting pot of cultures built together by the locals, immigrants, and the British. In Cantt by night, we will be exploring the lesser-known side of Commercial street, which goes beyond the regular street shopping fare. There are houses, shops, institutions and more that carry the legacy of leaders and prominent names in Bangalore’s history. And of course, no legacy is complete without the presence of food. From a family-run dosa joint to a 48-year-old sweet shop and a legacy bakery, there’s a brilliant food mix on the menu as you explore the ruins and reigns of one of Bangalore’s most popular shopping districts.",
    "startDate": "2025-02-22T17:00:00+05:30",
    "endDate": "2025-02-22T20:00:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 12,
    "remainingAttendeeCapacity": 10,
    "offers": [
      {
        "@type": "Offer",
        "price": "1200",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  }
]