[
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/coffee-and-the-cantonment",
    "@type": "SocialEvent",
    "name": "Coffee and the Cantonment",
    "description": "This trail traces the evolution of coffee in Bangalore and takes you to legacy coffee joints to understand what makes Bangalore the cradle of coffee culture in India.We will start at Koshy's on St Marks road exploring the neighborhood that houses several important landmarks, the role of British hangover in the city, and the evolution of the coffee culture in Bangalore.\n\nYou will hear interesting stories and trivia about coffee and local traditions on this tour.\n\nWe will end it at a new-age Coffee shop with one of their signature drinks.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.Bangalore is a cradle of the coffee culture in India. Locals and tourists both swear by it because no day is complete without a cuppa. But how did this African drink become a local favourite? What role did the British play for coffee in Bangalore? What led to the cafe culture in Bangalore? You'll find answers to all these questions on this tour.\n We will explore the history of the Cantonment, how it evolved to support the British establishment in erstwhile India, and how Bangalore went on to become a melting pot of cultures. As we do this, we will look at the evolution of coffee in the city from traditional coffee houses to new age micro-roasters catering to the needs of the ever changing city, and explore neighbourhoods that still hold stories of the British Raj.\n This tour is the perfect coffee date with the city and a must-do if you're in Bangalore or visiting. ",
    "startDate": "2024-10-26T16:30:00+05:30",
    "endDate": "2024-10-26T19:30:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 15,
    "remainingAttendeeCapacity": 12,
    "offers": [
      {
        "@type": "Offer",
        "price": "1200",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  },
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/colonial-crawl",
    "@type": "SocialEvent",
    "name": "Colonial Crawl",
    "description": "In this walk, we will explore how the British sahibs, memsahibs, and royalty left their mark on the garden city.What makes this tour specialWe will start at Cubbon Park, soaking in the freshness in the avenue of trees. Inside the park, we will explore parts that house statues, offices of importance, and landmarks that put Bangalore on the world map. Not to forget, the role of Mark Cubbon in shaping the city, and why the park was named after him.\n\nOnce we’re done with this, we will visit a secret garden as well as stroll along St. Mark’s Road to discover Winston Churchill’s life in the area, and end it with breakfast at an iconic eatery.\n\nBangalore mornings are arguably the best, and we promise to make the walk a memorable one for you with all the area has to offer. All you have to do is join us on the crawl.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.The Colonial Crawl is a taste of history hidden right under your noses. In this walk, we will explore how the British sahibs, memsahibs, and royalty left their mark on the garden city.\n\nThe English influence on the sprawling Cubbon park, the origins of the Cantonment area, and the surrounding architecture are testimony to a lot of events in history. For example, the American War of Independence, the Battle of Waterloo, and the French Revolution had a connection to this region. We will spill more of this tea when you walk with us.\n Whether you are visiting or you are a local, we promise you will see the city in a different light once you learn about the colonial influence on its churches, clubs, parks, and its people.\n\nCubbon mornings are a sight to sore eyes, and the perfect time to discover the Colonial Hangover in one of the older parts of the city.",
    "startDate": "2024-10-19T07:30:00+05:30",
    "endDate": "2024-10-19T10:30:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 15,
    "remainingAttendeeCapacity": 14,
    "offers": [
      {
        "@type": "Offer",
        "price": "999",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  },
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/the-tiffin-trail",
    "@type": "SocialEvent",
    "name": "The Tiffin Trail",
    "description": "This trail is an ode to the tiffin culture of Bangalore and trying out food at all the iconic eateries in Bangalore of the 60s and 70s.What makes this tour specialWe will start at Vidyarthi Bhavan, the OG Bangalore eatery, with dose in typical Bangalorean style. We’ll then venture into different streets and explore old houses in the neighbourhood, visit hotels and cafes that are always ready to serve hot fare in windy, cold evenings of Bangalore.\n\nWe will discover why the menu at these places hasn’t changed in decades, what are some of their best-selling dishes, and uncover some of the lesser-known secrets of the city’s history\n\nThis is a walk for anyone who loves to explore the sleepy, yet vibrant side of Bangalore.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.The trend of tiffins is unique to Bangalore. A local snack soiree that began in the bylanes of Basavanagudi is now quintessential to the Bangalore lifestyle.\n\nIn the tiffin trail, we explore how this story began, people who brought in the tiffin concept and what makes these eateries so special. This South Bangalore trail also takes you on a nostalgia tour of Bangalore in the 60s and 70s, which was the land of playwrights, artists, and authors.\n\nThe eateries where these greats hung out still exist and serve their humble fare to crowds even today, some of whom still serve the same dishes since their inception. But this trail is not just about food. It lets you explore and understand what city planning, local bazaars, and vintage charms feels like.",
    "startDate": "2024-10-20T16:00:00+05:30",
    "endDate": "2024-10-20T19:00:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 12,
    "remainingAttendeeCapacity": 12,
    "offers": [
      {
        "@type": "Offer",
        "price": "999",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  },
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/yulu-midnight-trail",
    "@type": "SocialEvent",
    "name": "Yulu Midnight Trail",
    "description": "Bangalore in the night is a whole new vibe, opening up avenues of food, lights, and beautiful spots in the city that come to life as the sun sets. Explore the chill side of Bangalore on Yulu e-bikes.What makes this tour specialWe will start at Cubbon Park and zoom around the neighbourhood to witness the glory of the beautiful buildings in sight.\n\nWhile pubs and dosas are the quintessential Bengaluru DNA, you also have amazing local fare, which are some of its best-kept local secrets, and we will savour these in eateries on MG Road, Commercial Street, and Shivaji Nagar.\n\nThink of it like a midnight picnic – there are places to see, things to do, and food to belt at eateries that have been running since 1930 and have seen generations and the city grow up with them.\n\nJoin us for a date under the stars and the street lights as we ride around Cubbon and Commercial Street.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.Bangalore in the night is a whole new vibe, opening up avenues of food, lights, and beautiful spots in the city that come to life as the sun sets. Welcome to Gully’s Midnight E-Bike Tour – an exclusive experience around the colonial and heritage parts of town with a late-night street food scene.\n\nWe’ll ride together as a group in the wee hours of the night on super cool e-bikes and explore the nightlife of Bangalore beyond pubs and breweries. Think of it like a famous five adventure but cooler! Together, we will discover hidden gems in the central business district of Bangalore and paint the town green (because you know we’re responsible, eco-friendly, and fun like that).\n\nYou will find yourself eating out at iconic eateries and street food stalls and visit places, which are otherwise closed to the public in and around Cubbon and Cantonment areas.\n\nWe have partnered with Yulu, our mobility partners, so you can be rest assured and ride along without worrying about smaller lanes or traffic, and watch how the city comes alive at night with its night heroes who offer food, trivia, and perspectives of the midnight Uru ",
    "startDate": "2024-10-19T20:30:00+05:30",
    "endDate": "2024-10-19T23:30:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 15,
    "remainingAttendeeCapacity": 15,
    "offers": [
      {
        "@type": "Offer",
        "price": "1500",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  },
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/yulu-midnight-trail",
    "@type": "SocialEvent",
    "name": "Yulu Midnight Trail",
    "description": "Bangalore in the night is a whole new vibe, opening up avenues of food, lights, and beautiful spots in the city that come to life as the sun sets. Explore the chill side of Bangalore on Yulu e-bikes.What makes this tour specialWe will start at Cubbon Park and zoom around the neighbourhood to witness the glory of the beautiful buildings in sight.\n\nWhile pubs and dosas are the quintessential Bengaluru DNA, you also have amazing local fare, which are some of its best-kept local secrets, and we will savour these in eateries on MG Road, Commercial Street, and Shivaji Nagar.\n\nThink of it like a midnight picnic – there are places to see, things to do, and food to belt at eateries that have been running since 1930 and have seen generations and the city grow up with them.\n\nJoin us for a date under the stars and the street lights as we ride around Cubbon and Commercial Street.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.Bangalore in the night is a whole new vibe, opening up avenues of food, lights, and beautiful spots in the city that come to life as the sun sets. Welcome to Gully’s Midnight E-Bike Tour – an exclusive experience around the colonial and heritage parts of town with a late-night street food scene.\n\nWe’ll ride together as a group in the wee hours of the night on super cool e-bikes and explore the nightlife of Bangalore beyond pubs and breweries. Think of it like a famous five adventure but cooler! Together, we will discover hidden gems in the central business district of Bangalore and paint the town green (because you know we’re responsible, eco-friendly, and fun like that).\n\nYou will find yourself eating out at iconic eateries and street food stalls and visit places, which are otherwise closed to the public in and around Cubbon and Cantonment areas.\n\nWe have partnered with Yulu, our mobility partners, so you can be rest assured and ride along without worrying about smaller lanes or traffic, and watch how the city comes alive at night with its night heroes who offer food, trivia, and perspectives of the midnight Uru ",
    "startDate": "2024-10-31T20:30:00+05:30",
    "endDate": "2024-10-31T23:30:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 15,
    "remainingAttendeeCapacity": 15,
    "offers": [
      {
        "@type": "Offer",
        "price": "1500",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  }
]