[
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/coffee-and-the-cantonment",
    "@type": "SocialEvent",
    "name": "Coffee and the Cantonment",
    "description": "This trail traces the evolution of coffee in Bangalore and takes you to legacy coffee joints to understand what makes Bangalore the cradle of coffee culture in India.We will start at Koshy's on St Marks road exploring the neighborhood that houses several important landmarks, the role of British hangover in the city, and the evolution of the coffee culture in Bangalore.\n\nYou will hear interesting stories and trivia about coffee and local traditions on this tour.\n\nWe will end it at a new-age Coffee shop with one of their signature drinks.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.Bangalore is a cradle of the coffee culture in India. Locals and tourists both swear by it because no day is complete without a cuppa. But how did this African drink become a local favourite? What role did the British play for coffee in Bangalore? What led to the cafe culture in Bangalore? You'll find answers to all these questions on this tour.\n We will explore the history of the Cantonment, how it evolved to support the British establishment in erstwhile India, and how Bangalore went on to become a melting pot of cultures. As we do this, we will look at the evolution of coffee in the city from traditional coffee houses to new age micro-roasters catering to the needs of the ever changing city, and explore neighbourhoods that still hold stories of the British Raj.\n This tour is the perfect coffee date with the city and a must-do if you're in Bangalore or visiting. ",
    "startDate": "2025-05-31T16:30:00+05:30",
    "endDate": "2025-05-31T19:30:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 15,
    "remainingAttendeeCapacity": 11,
    "offers": [
      {
        "@type": "Offer",
        "price": "1500",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  }
]