[
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/pete-by-night",
    "@type": "SocialEvent",
    "name": "Pete by Night",
    "description": "Explore the evening vibe of the oldest neighbourhood of the city. While the business hubs thrive during the day, an insane food scene erupts at nightWhat makes this tour specialWe will start on Avenue Road, followed by pit stops at jewellery polishing shops, stroll through a 150 year old heritage structure and experience a different kind of nightlife comes alive here with the street food vendors, small businesses and shops. We will end the walk on Avenue Road at Rice Memorial.\n\nThis is the only walk that brings you the best of a local market, history, and street food in one.\n\nWalk with us through the lanes of the ever-bustling Chickpete and understand the rich cultural and heritage history of the space.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.Chickpete is popularly known as a bustling market. But did you know, it doubles up as a food street at night with carts serving everything from piping hot jalebis to pan-made badam milk?\n\nExplore the evening vibe of the oldest neighbourhood of the city. While the business hubs thrive during the day, an insane food scene erupts at night, right in the heart of Bengaluru’s most thriving, busiest market.\n\nSavour Bangalore’s best half pudi dosa, a secret vada pav joint straight from Maharashtra, patli jalebi on the cart, and the 365 day thandai service from the town’s best juice maker. This is the only walk that brings you the best of a marketplace, history, and street food in one.",
    "startDate": "2025-04-26T18:00:00+05:30",
    "endDate": "2025-04-26T21:00:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 10,
    "remainingAttendeeCapacity": 9,
    "offers": [
      {
        "@type": "Offer",
        "price": "1500",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  },
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/the-tiffin-trail",
    "@type": "SocialEvent",
    "name": "The Tiffin Trail",
    "description": "This trail is an ode to the tiffin culture of Bangalore and trying out food at all the iconic eateries in Bangalore of the 60s and 70s.What makes this tour specialWe will start at Vidyarthi Bhavan, the OG Bangalore eatery, with dose in typical Bangalorean style. We’ll then venture into different streets and explore old houses in the neighbourhood, visit hotels and cafes that are always ready to serve hot fare in windy, cold evenings of Bangalore.\n\nWe will discover why the menu at these places hasn’t changed in decades, what are some of their best-selling dishes, and uncover some of the lesser-known secrets of the city’s history\n\nThis is a walk for anyone who loves to explore the sleepy, yet vibrant side of Bangalore.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.The trend of tiffins is unique to Bangalore. A local snack soiree that began in the bylanes of Basavanagudi is now quintessential to the Bangalore lifestyle.\n\nIn the tiffin trail, we explore how this story began, people who brought in the tiffin concept and what makes these eateries so special. This South Bangalore trail also takes you on a nostalgia tour of Bangalore in the 60s and 70s, which was the land of playwrights, artists, and authors.\n\nThe eateries where these greats hung out still exist and serve their humble fare to crowds even today, some of whom still serve the same dishes since their inception. But this trail is not just about food. It lets you explore and understand what city planning, local bazaars, and vintage charms feels like.",
    "startDate": "2025-04-27T16:00:00+05:30",
    "endDate": "2025-04-27T19:00:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 14,
    "remainingAttendeeCapacity": 13,
    "offers": [
      {
        "@type": "Offer",
        "price": "1500",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  }
]