[
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/colonial-crawl",
    "@type": "SocialEvent",
    "name": "Colonial Crawl",
    "description": "In this walk, we will explore how the British sahibs, memsahibs, and royalty left their mark on the garden city.What makes this tour specialWe will start at Cubbon Park, soaking in the freshness in the avenue of trees. Inside the park, we will explore parts that house statues, offices of importance, and landmarks that put Bangalore on the world map. Not to forget, the role of Mark Cubbon in shaping the city, and why the park was named after him.\n\nOnce we’re done with this, we will visit a secret garden as well as stroll along St. Mark’s Road to discover Winston Churchill’s life in the area, and end it with breakfast at an iconic eatery.\n\nBangalore mornings are arguably the best, and we promise to make the walk a memorable one for you with all the area has to offer. All you have to do is join us on the crawl.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.The Colonial Crawl is a taste of history hidden right under your noses. In this walk, we will explore how the British sahibs, memsahibs, and royalty left their mark on the garden city.\n\nThe English influence on the sprawling Cubbon park, the origins of the Cantonment area, and the surrounding architecture are testimony to a lot of events in history. For example, the American War of Independence, the Battle of Waterloo, and the French Revolution had a connection to this region. We will spill more of this tea when you walk with us.\n Whether you are visiting or you are a local, we promise you will see the city in a different light once you learn about the colonial influence on its churches, clubs, parks, and its people.\n\nCubbon mornings are a sight to sore eyes, and the perfect time to discover the Colonial Hangover in one of the older parts of the city.",
    "startDate": "2026-01-04T07:30:00+05:30",
    "endDate": "2026-01-04T10:30:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 12,
    "remainingAttendeeCapacity": 6,
    "offers": [
      {
        "@type": "Offer",
        "price": "1500",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  },
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/colonial-crawl",
    "@type": "SocialEvent",
    "name": "Colonial Crawl",
    "description": "In this walk, we will explore how the British sahibs, memsahibs, and royalty left their mark on the garden city.What makes this tour specialWe will start at Cubbon Park, soaking in the freshness in the avenue of trees. Inside the park, we will explore parts that house statues, offices of importance, and landmarks that put Bangalore on the world map. Not to forget, the role of Mark Cubbon in shaping the city, and why the park was named after him.\n\nOnce we’re done with this, we will visit a secret garden as well as stroll along St. Mark’s Road to discover Winston Churchill’s life in the area, and end it with breakfast at an iconic eatery.\n\nBangalore mornings are arguably the best, and we promise to make the walk a memorable one for you with all the area has to offer. All you have to do is join us on the crawl.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.The Colonial Crawl is a taste of history hidden right under your noses. In this walk, we will explore how the British sahibs, memsahibs, and royalty left their mark on the garden city.\n\nThe English influence on the sprawling Cubbon park, the origins of the Cantonment area, and the surrounding architecture are testimony to a lot of events in history. For example, the American War of Independence, the Battle of Waterloo, and the French Revolution had a connection to this region. We will spill more of this tea when you walk with us.\n Whether you are visiting or you are a local, we promise you will see the city in a different light once you learn about the colonial influence on its churches, clubs, parks, and its people.\n\nCubbon mornings are a sight to sore eyes, and the perfect time to discover the Colonial Hangover in one of the older parts of the city.",
    "startDate": "2026-01-17T07:30:00+05:30",
    "endDate": "2026-01-17T10:30:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 12,
    "remainingAttendeeCapacity": 12,
    "offers": [
      {
        "@type": "Offer",
        "price": "1500",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  },
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/death-by-dosa",
    "@type": "SocialEvent",
    "name": "Death by Dosa",
    "description": "History and food walk in the oldest neighbourhood of Bangalore, we have 3 dosa stops and 3 non food stopsYou should do this trial becauseWe will start on Avenue Road with a cup of coffee from a unique coffee truck, walk through tiny alleys of erstwhile Pete that power industries from jewellery to food to textiles.\n\nWe’ll visit discover what stories the 150-year-old majestic structure hides and find our way back to Avenue Road where we end the walk.\n\nWhether you have lived in Bangalore all your life or you are new to the city, we would love to host you at our secret Dosa spots and explore the streets more. Do come with an appetite as you may want to cancel your lunch plans after this gastronomic affair in the bylanes of Chickpete.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.Death by Dosa is a food + history walk in the oldest neighbourhood of Bangalore, Chickpete.\n\nEveryone in Bengaluru swear by dosas and each has their own favourite joint. On this walk we’ll take you to what we believe are some of the finest dosa joints in town that have stood the test of time. You will savour three different kinds of dosas and explore chickpete through its narrow alleyways and learn about the history of the city.\n\nWe will meet master saree weavers, learn more about Kempegowda’s grand vision for town planning, and belt some hot, hot masala dosas on the way. We’ll also explore a 150+ yrs old heritage mansion that has stories for almost every decade, filled with characters as well as visit Bangalore's oldest antique shop.\n Whether you are a local or a visitor, our Death by Dosa walk is a great way to explore Bengaluru with a dash of dosa and a dollop of history!",
    "startDate": "2026-01-03T08:30:00+05:30",
    "endDate": "2026-01-03T11:30:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 15,
    "remainingAttendeeCapacity": 5,
    "offers": [
      {
        "@type": "Offer",
        "price": "1500",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  },
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/death-by-dosa",
    "@type": "SocialEvent",
    "name": "Death by Dosa",
    "description": "History and food walk in the oldest neighbourhood of Bangalore, we have 3 dosa stops and 3 non food stopsYou should do this trial becauseWe will start on Avenue Road with a cup of coffee from a unique coffee truck, walk through tiny alleys of erstwhile Pete that power industries from jewellery to food to textiles.\n\nWe’ll visit discover what stories the 150-year-old majestic structure hides and find our way back to Avenue Road where we end the walk.\n\nWhether you have lived in Bangalore all your life or you are new to the city, we would love to host you at our secret Dosa spots and explore the streets more. Do come with an appetite as you may want to cancel your lunch plans after this gastronomic affair in the bylanes of Chickpete.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.Death by Dosa is a food + history walk in the oldest neighbourhood of Bangalore, Chickpete.\n\nEveryone in Bengaluru swear by dosas and each has their own favourite joint. On this walk we’ll take you to what we believe are some of the finest dosa joints in town that have stood the test of time. You will savour three different kinds of dosas and explore chickpete through its narrow alleyways and learn about the history of the city.\n\nWe will meet master saree weavers, learn more about Kempegowda’s grand vision for town planning, and belt some hot, hot masala dosas on the way. We’ll also explore a 150+ yrs old heritage mansion that has stories for almost every decade, filled with characters as well as visit Bangalore's oldest antique shop.\n Whether you are a local or a visitor, our Death by Dosa walk is a great way to explore Bengaluru with a dash of dosa and a dollop of history!",
    "startDate": "2026-01-24T08:30:00+05:30",
    "endDate": "2026-01-24T11:30:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 15,
    "remainingAttendeeCapacity": 15,
    "offers": [
      {
        "@type": "Offer",
        "price": "1500",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  },
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/malleshwaram-hogona",
    "@type": "SocialEvent",
    "name": "Malleshwaram Hogona",
    "description": "This street art walk featuring 13 Indian artists and 12 artworks is an initiative by the Bengaluru Moving Campaign in association with the artist collective Geechugalu and several other partners to make the neighbourhood of Malleshwaram safe and friendly for women mobility. Gully Tours was the official partner to design the walking tour.What makes this tour specialWe’ll start this walk by relishing some legendary dosa at Shri Sagar CTR. From there we’ll visit the conservancy lanes that are adorned with art. We’ll explore the Malleshwaram market, seva sadan, sampige road, and end it at the BMTC bus stand.\n\nMalleswaram is like a warm hug from a handmade shawl on a cold winter day. It’s a modern-day Malgudi with the goodness of history and the excitement of new-age quirks.\n\nStreet art captures the stories of people, their lives, and their neighbourhoods. Show some love to your local artists and let us go to Malleswaram.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.13 Indian artists came together to create 12 walls filled with art through the secret lanes of Malleswaram to reclaim spaces for pedestrians and women. The Malleswaram Hogona (Eng: Let’s go to Malleswaram) street art project wants to make streets safer for women. Conceived by the Bengaluru moving project, this street art walk is an initiative to make neighbourhoods safe, friendly, and full of character.\n\nApart from being one of the oldest planned neighbourhoods in the city, it houses a flower market, many institutions and lanes adorned with trees. Each work of art tells you the artist’s inspiration and their connection to the landscape, and we’d love to host you here.\n\nLet’s go to Malleswaram to witness modern day murals painted on old world lanes, starting with a legendary breakfast at CTR.",
    "startDate": "2026-01-11T07:30:00+05:30",
    "endDate": "2026-01-11T10:30:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 18,
    "remainingAttendeeCapacity": 18,
    "offers": [
      {
        "@type": "Offer",
        "price": "1500",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  },
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/pete-by-night",
    "@type": "SocialEvent",
    "name": "Pete by Night",
    "description": "Explore the evening vibe of the oldest neighbourhood of the city. While the business hubs thrive during the day, an insane food scene erupts at nightWhat makes this tour specialWe will start on Avenue Road, followed by pit stops at jewellery polishing shops, stroll through a 150 year old heritage structure and experience a different kind of nightlife comes alive here with the street food vendors, small businesses and shops. We will end the walk on Avenue Road at Rice Memorial.\n\nThis is the only walk that brings you the best of a local market, history, and street food in one.\n\nWalk with us through the lanes of the ever-bustling Chickpete and understand the rich cultural and heritage history of the space.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.Chickpete is popularly known as a bustling market. But did you know, it doubles up as a food street at night with carts serving everything from piping hot jalebis to pan-made badam milk?\n\nExplore the evening vibe of the oldest neighbourhood of the city. While the business hubs thrive during the day, an insane food scene erupts at night, right in the heart of Bengaluru’s most thriving, busiest market.\n\nSavour Bangalore’s best half pudi dosa, a secret vada pav joint straight from Maharashtra, patli jalebi on the cart, and the 365 day thandai service from the town’s best juice maker. This is the only walk that brings you the best of a marketplace, history, and street food in one.",
    "startDate": "2026-01-10T18:00:00+05:30",
    "endDate": "2026-01-10T21:00:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 10,
    "remainingAttendeeCapacity": 8,
    "offers": [
      {
        "@type": "Offer",
        "price": "1500",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  },
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/the-tiffin-trail",
    "@type": "SocialEvent",
    "name": "The Tiffin Trail",
    "description": "This trail is an ode to the tiffin culture of Bangalore and trying out food at all the iconic eateries in Bangalore of the 60s and 70s.What makes this tour specialWe will start at Vidyarthi Bhavan, the OG Bangalore eatery, with dose in typical Bangalorean style. We’ll then venture into different streets and explore old houses in the neighbourhood, visit hotels and cafes that are always ready to serve hot fare in windy, cold evenings of Bangalore.\n\nWe will discover why the menu at these places hasn’t changed in decades, what are some of their best-selling dishes, and uncover some of the lesser-known secrets of the city’s history\n\nThis is a walk for anyone who loves to explore the sleepy, yet vibrant side of Bangalore.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.The trend of tiffins is unique to Bangalore. A local snack soiree that began in the bylanes of Basavanagudi is now quintessential to the Bangalore lifestyle.\n\nIn the tiffin trail, we explore how this story began, people who brought in the tiffin concept and what makes these eateries so special. This South Bangalore trail also takes you on a nostalgia tour of Bangalore in the 60s and 70s, which was the land of playwrights, artists, and authors.\n\nThe eateries where these greats hung out still exist and serve their humble fare to crowds even today, some of whom still serve the same dishes since their inception. But this trail is not just about food. It lets you explore and understand what city planning, local bazaars, and vintage charms feels like.",
    "startDate": "2026-01-25T16:00:00+05:30",
    "endDate": "2026-01-25T19:00:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 14,
    "remainingAttendeeCapacity": 14,
    "offers": [
      {
        "@type": "Offer",
        "price": "1500",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  },
  {
    "@context": "https://schema.org",
    "url": "https://www.gully.tours/tours/cantt-by-night",
    "@type": "SocialEvent",
    "name": "Cantt by Night",
    "description": "This walk is about different communities that built modern Bangalore. Before the bazaars became popular, Cantonment saw activists, entrepreneurs, and social reformers in the erstwhile British India.What makes this tour specialWe will start the tour at a heritage bungalow and wade through the residential lanes of Shivajinagar, ending it closer to Commercial Street.\n\nWe will explore 100 year old structures, visit different small businesses, and learn about the various historical figures that contributed to education, jobs, and opportunities for the people as well as savour the local favourite snacks and food that are distinct to this part of the city.\n\nThis walk has been specially curated by a local resident, who grew up in the Commercial Street neighbourhood and has lived its rich history.You can add your images, videos and itinerary route in lightbox for each itinerary as shown below, simply by changing the src path of each media.Bangalore’s Cantonment areas are extra special. It’s a melting pot of cultures built together by the locals, immigrants, and the British. In Cantt by night, we will be exploring the lesser-known side of Commercial street, which goes beyond the regular street shopping fare. There are houses, shops, institutions and more that carry the legacy of leaders and prominent names in Bangalore’s history. And of course, no legacy is complete without the presence of food. From a family-run dosa joint to a 48-year-old sweet shop and a legacy bakery, there’s a brilliant food mix on the menu as you explore the ruins and reigns of one of Bangalore’s most popular shopping districts.",
    "startDate": "2026-01-24T17:00:00+05:30",
    "endDate": "2026-01-24T20:00:00+05:30",
    "eventAttendanceMode": "OfflineEventAttendanceMode",
    "maximumAttendeeCapacity": 12,
    "remainingAttendeeCapacity": 12,
    "offers": [
      {
        "@type": "Offer",
        "price": "1500",
        "priceCurrency": "INR"
      }
    ],
    "organizer": {
      "@type": "Organization",
      "name": "Gully Tours"
    },
    "keywords": [
      "GULLYTOURS"
    ]
  }
]