[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "901@map-india.org",
    "name": "Draw with Penciljam",
    "startDate": "2025-06-22T10:30:00+05:30",
    "endDate": "2025-06-22T13:00:00+05:30",
    "description": "The Museum is your studio! For artists of all skill levels that find joy in observational sketching, we invite you to be a part of this creative and relaxed live sketching session with PencilJam. Set against the vibrant backdrop of MAP’s current exhibits, this session offers a blend of quiet observation and creative expression. \n\nWhether you're looking to unwind through sketching, discover new perspectives, or simply enjoy the act of creating in a shared environment, this is a chance to slow down and truly observe the world around you. Connect with fellow art lovers, exchange ideas, and share your own masterpiece in an informal setting that celebrates creativity in all its forms.\n\nYou’ll need to carry your own:\n\n-Sketchbook or A4 paper\n\n-Pencil (wood or mechanical) and eraser\n\n-Gel pens or fineliners for outlining\n\n-Colour brush pens, sketch pens, or colour pencils (no wet media)",
    "url": "https://map-india.org/map-events/sketch-with-penciljam-2/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-09T100756.847.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "868@map-india.org",
    "name": "Training Course in Conservation of Photographs in Museums, Archives, and Collections",
    "startDate": "2025-06-16T09:00:00+05:30",
    "endDate": "2025-09-13T17:30:00+05:30",
    "description": "Don’t let history disappear–or discolour–or fade! Discover the science of photography conservation and learn the art of restoring historic photograph collections. This hands-on, intensive training course is designed for practising conservators, archivists and custodians of historic photograph collections to learn preventive collection care measures, remedial conservation processes, and restoration techniques.\n\nThis three month course will be followed by a one month internship. The course will be instructed by leading specialists from India and overseas and includes topics such as: \n\n -Development, materials and techniques of historic photographic processes\n\n -Identification and understanding of deterioration processes in photograph collections\n\n -Inspection and survey methodologies\n\n -Condition report preparation and preservation prioritisation decisions\n\n -Emergency treatment measures\n\n -Conservation of film and glass plate negatives\n\n -Conservation and restoration of photographs\n\n -Archival protocols of housing, display, and storage of photographic materials\n\n -Disaster management",
    "url": "https://map-india.org/map-events/training-course-in-conservation-of-photographs-in-museums-archives-and-collections/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-12T161452.615.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "922@map-india.org",
    "name": "IMMATERIAL: SPATIAL AFFAIRS",
    "startDate": "2025-06-21T11:00:00+05:30",
    "endDate": "2025-06-22T18:00:00+05:30",
    "description": "Join us for this special showcase of SPATIAL AFFAIRS - Extended Reality Experiences, a collaborative artist residency programme between MAP, HEK (House of Electronic Arts) in Basel, Switzerland, Tabakalera International Center for Contemporary Culture in San Sebastián, Spain.\n\nArtists Géraldine Honauer, Juan Ferrer, Natalia Cabrera, and Ìfẹ́olúwa Ọ̀ṣúnkọ̀yà, developed new XR-based projects during the six-week residencies in the summer of 2024. With the support of technology partners iart and TEKNIKER, and research partner metaLSB (at) Basel, the residency artists created site-specific installations that explore the boundaries between physical and digital spaces.\n\nSymbiotica Vol 2\nBy: Juan Ferrer and Natalia Cabrera (MAP, Bengaluru)\n\nSymbiotica vol. 2: The Webs of Coordination is an Augmented Reality interactive installation that gathers multiple players to weave symbiosis into each other and become a lichen, a pioneering organism made out of green algae, fungal mycelium, and cyanobacteria. Primarily based on the research of biologist Lynn Margulis, the work highlights the collaboration between species from different Kingdoms of life to generate a new being that performs a pioneering symbiosis. Lichens not only allowed plants and animals to populate the Earth but also emerge as a metaphoric figure for a new understanding of the ‘individual’.\n\nAgents of Èṣù's Quantum World\nBy: Ifẹ́olúwa Ọ̀ṣúnkọ̀yà (HEK Switzerland)\n\nAgents of Èṣù’s Quantum World (2024) is a multiplayer VR experience where participants assume the role of quantum bits (qubits), collaboratively forming a quantum circuit through their interactions. This circuit is processed, and its outcomes reshape the performer’s environment. In this project, participants embody Èṣù, the orisha (deity) of crossroads and non-determinism, becoming creators of quantum algorithms. Like Èṣù, they navigate endless possibilities before making a choice. The project delves into the individual’s role as an active agent in a sea of possibilities, influencing the world around them. In a society driven by hustle culture, it poses the question: what happens when the ‘performance’ of life no longer guarantees future rewards? Can insights from the orisha Èṣù and Ifá texts provide guidance for navigating uncertainties in emerging technologies? By extending performance beyond the stage into daily life, the project explores how quantum processing might shape the future, with our actions influencing technological progress.\n\nCurrents\nBy: Géraldine Honauer\n\nThe project “Currents” focuses on an augmented reality (AR) experience that allows users to interact with live environmental data, such as air pollution and air flows, through body tracking and motion capture technologies. This AR environment aims to dynamically visualise in response to human movement, enhancing user engagement with critical environmental issues.\n\nCurrents is an immersive extended reality experience where environmental data becomes a sensory performance. Real-time CO₂ emissions and air flows are transformed into interactive virtual ecosystems through VR headsets. This living digital world reacts to your movement — bioluminescent plankton light up as you engage with the invisible forces around you.\n\nZWEI is supported by the “Film and Media Art” committee of the Canton of Basel-Stadt and Basel-Landschaft (Switzerland).\n\nZwei (Two)\nBy: Beat Brogle &amp; iart\nAt the centre of the mixed reality work Zwei are two virtual “bubbles” - amorphous, algorithmically controlled beings that react in real time to their environment and the behaviour of visitors. Their behaviour is based on a structure of biological stimulus-response patterns, from which individual characteristics develop in the course of interaction. As part of a long-term media art project, Zwei explores the relationship between virtual beings and their environment – from simple algorithmic processes to the perspective of artificial intelligence.\n\nZwei is supported by the “Film and Media Art” committee of the Canton of Basel-Stadt and Basel-Landschaft (Switzerland).",
    "url": "https://map-india.org/map-events/immaterial-spatial-affairs/",
    "keywords": [
      "MAP",
      "Showcase"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2020/12/1440-X-810-Widget-06.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "918@map-india.org",
    "name": "Intersections: Art & Tech Weekend",
    "startDate": "2025-06-21T11:00:00+05:30",
    "endDate": "2025-06-22T19:00:00+05:30",
    "description": "A Weekend of Art, Technology, and Critical Play\n\nHow do we live with our machines? How do we listen to data, or make a sound-map of a street? What does resistance or re-imagination look like in a world saturated by code?\n\nThis weekend-long gathering brings together artists, technologists, and curious thinkers to explore the layered relationships between art and technology. Not as a celebration of innovation for its own sake — but as an invitation to pause and reflect: How does technology shape the ways we move, make, feel, and relate? What forms of labour, story, or care are embedded in our digital environments?\n\nAcross workshops, conversations, and film, we’ll explore how artistic practices can help us sense, question, and reimagine the technologies that surround us. Whether you're an artist, coder, student, or simply curious — join us to listen, learn, and experiment together.\n\nSaturday &amp; Sunday, 21st June &amp; 22nd June\n\n- IMMATERIAL: SPATIAL AFFAIRS\n\nSaturday, 21st June\n\n\n- Sound is a Place Too\n\n- Living With Machines: A Critical Approach to Technology in Art\n\nSunday, 22nd June\n\n- The Human in the Data, the Data in the Human\n\n- Taak\n\n&nbsp;\n\n&nbsp;",
    "url": "https://map-india.org/map-events/intersections-art-tech-weekend/",
    "keywords": [
      "MAP",
      "Showcase"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2021/09/1440-X-810-Widget-02.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "903@map-india.org",
    "name": "My Summer Storybook",
    "startDate": "2025-06-28T11:00:00+05:30",
    "endDate": "2025-06-28T14:00:00+05:30",
    "description": "Is your child still reminiscing about their summer vacation? Help them relive their memories at our bookmaking workshop. Join Aishwarya Arumbakkam, one of the artists featured in the Vaanyerum Vizhuthugal exhibition, in making books! The workshop is tailored for children aged between 8 to 12, and guides them to make books based on the summer vacation they just had.\n\nParents can help children in collecting some of the images from recent, or favourite vacations. Once you register, we will share an email ID with you to share the images with us so we can get it printed for your child. Please arrive at least 45 minutes before the workshop begins.\n\nAll materials, except for the images, will be provided.\n\nPlease note: This workshop is only for children aged 8-12",
    "url": "https://map-india.org/map-events/my-summer-storybook/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/09/Make-at-MAP.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "915@map-india.org",
    "name": "The Human in the Data, the Data in the Human",
    "startDate": "2025-06-22T11:00:00+05:30",
    "endDate": "2025-06-22T16:00:00+05:30",
    "description": "This workshop offers conceptual and practical tools for working with both large and small datasets. Through collective thinking, role-based exercises, and playful scenario-building, we’ll simulate a high-stakes techno-political situation from multiple perspectives — algorithmic, ecological, institutional, and embodied.\nTogether, we’ll explore how art can intervene in, visualize, or reshape data systems across different scales and timelines. No technical background required — just bring your curiosity (and your laptop).\n\nParticipants should bring a laptop to the workshop",
    "url": "https://map-india.org/map-events/the-human-in-the-data-the-data-in-the-human/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/4-2.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "921@map-india.org",
    "name": "Rewriting Identity",
    "startDate": "2025-06-21T17:00:00+05:30",
    "endDate": "2025-06-21T18:00:00+05:30",
    "description": "For our upcoming session of Reader’s Bloc, we’ll be reading two texts - Hijab Butch Blues by Lamya H, a memoir that follows the journey of a queer, Muslim, South Asian individual navigating their identity, and Jeanette Winterson’s Oranges Are Not the Only Fruit, a novel about a young girl who grew up in a strict pentecostal community.\n\nThese texts will start the conversation on queer identity - what it means to come of age in a setting that denies or suppresses queerness, how one might rewrite their identity and how we locate and create spaces of acceptance, resistance, love and joy.\n\nThe session begins with a walkthrough of VISIBLE/INVISIBLE: Representation of Women in the MAP Collection.\n\nReader’s Bloc is an online/IRL group of readers taking part in reading, listening and sharing exercises around texts that help us learn more about ourselves, the identities we share and the communities we live in.\n\nThis programme is exclusively for 18–25 year olds.\n\nThis session is conducted as part of our engagements for the MAP Youth Collective. The MAP Youth Collective is a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.",
    "url": "https://map-india.org/map-events/readers-bloc-2/",
    "keywords": [
      "MAP",
      "Youth Engagement"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/3-3.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "917@map-india.org",
    "name": "Living With Machines: A Critical Approach to Technology in Art",
    "startDate": "2025-06-21T16:00:00+05:30",
    "endDate": "2025-06-21T18:00:00+05:30",
    "description": "This series of talks brings together artists Manuel Beltran, Chinar Shah, Mithu Sen, and Anisha Baid, each exploring technology from a distinct vantage point. Ranging from bio-hacking to myth-making to acts of appropriation, their practices reflect diverse ways of living in — and thinking against — a hyper-technological world. The conversation will close with a discussion on the shifting landscape of art and tech today: What does it mean to make art about technology, and what does it take to make art through it?\n\nComputer as Woman - Anisha Baid\n\nThis presentation will trace a body of work across performance, sculpture, and video that explores the feminized labor histories embedded in the computer interface. These works look at the computer as not simply a tool, but a surface of work haunted by histories of work, capital and habit. Through these works, I approach technology not as an inevitable outcome, but as a culturally and politically contingent reality—shaped by specific histories, decisions, and omissions - and one that, in turn, continues to shape us and mold us - how we sit, how we talk, and how we work.\n\nScreenshots - Chinar Shah\n\nIn this talk, I reflect on my practice as a screenshot photographer through the intertwined histories of documentary photography and family albums. As I navigate my digital life by making images, I am drawn to visual practices that are on the peripheries of networked culture—images created to circulate as information but exceed their intended meaning. By situating screenshot photography within the documentary impulse, I explore how such images complicate established understandings of photographic indexicality, and how they contribute to evolving forms of image-making within the online space.\n\nHammers in the Server Room - Manuel Beltran\n\nIn this talk I will offer some thoughts about the Luddite movement to reflect upon how the current contestations we face in AI and Big Tech aren't completely new, and how they connect with similar conditions that the Luddites were challenging during the Industrial Revolution. With this in mind, and through the lens of the project Institute of Human Obsolescence (IoHO), I will present questions about the role of AI in automation, and the exploitation of data as a form of invisible labour. The IoHO stages a series of installations and interventions that propose a different framework through which to reorganise our relationship with contemporary technologies.\"\n\nDigital Un-native - Mithu Sen\n\nI navigate the digital world with deliberate discomfort—refusing fluency, embracing glitches, and reclaiming virtual space as a site of resistance, care, and feminist untranslatability.",
    "url": "https://map-india.org/map-events/living-with-machines-a-critical-approach-to-technology-in-art/",
    "keywords": [
      "MAP",
      "Panel Discussion"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/macqiaruim3-1-scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "914@map-india.org",
    "name": "Sound is a Place Too",
    "startDate": "2025-06-21T11:00:00+05:30",
    "endDate": "2025-06-21T14:00:00+05:30",
    "description": "Mapping space, story, and presence through sound &amp; code\n\nWhat if space could be heard instead of seen?\nThis beginner-friendly workshop led by Nanditi (cofounder, Ajaibghar) explores sound as a way of mapping our surroundings. Combining dérive, deep listening, and creative coding with Sonic Pi, participants will translate their sensory impressions into ambient compositions — sonospheres — that hold memory, presence, and narrative.\nA slow, reflective space for listening, experimenting, and working playfully with sound and code. No prior experience required.\n\nParticipants will need:\n– Laptop\n– Wired headphones or earphones\n– Paper &amp; pen\n– Sonic Pi installed on computer\n– Dolby On app installed on phone",
    "url": "https://map-india.org/map-events/sound-is-a-place-too/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/code.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "923@map-india.org",
    "name": "Gossip After Hours: A Storytelling Workshop with Museum Objects",
    "startDate": "2025-06-27T10:00:00+05:30",
    "endDate": "2025-06-29T17:00:00+05:30",
    "description": "Have you ever wondered what museum objects gossip about after closing time? Join this playful storytelling workshop to imagine conversations and other lives of artworks and artefacts at MAP. Together, we’ll craft stories that blur the lines between fact and fiction, inspired by the objects’ histories and your imagination. No writing experience needed - just curiosity and a love for stories! Come let your curiosity run wild!\n\nPlease Note:\n- Limited seats are available. Deadline to register via Google Form: 24 June\n- Selected participants will be notified by 25th June",
    "url": "https://map-india.org/map-events/gossip-after-hours-a-storytelling-workshop-with-museum-objects/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-Image-1440-x-810.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "920@map-india.org",
    "name": "Image, Memory and The Internet",
    "startDate": "2025-06-20T17:00:00+05:30",
    "endDate": "2025-06-20T18:30:00+05:30",
    "description": "Do you remember that not too long ago, we were writing emails to our friends and family, sending SMSes or leaving them notes on Facebook \"Walls\"? It's this habit that Steevez Rodriguez, one of the 12 artists whose works are on display at Vaanyerum Vizhuthugal: Roots that Reach for the Sky, has immortalised in his book Last Seen, bringing together correspondences he had with his late father.\n\nSince opening day, Last Seen has rarely left a dry eye. The complicated or easy relationships one has with their father has been brought to the fore. The role that technology can play in preserving what might otherwise be lost is also visible.\n\nThis Friday, join Steevez as he reflects on the process of making (or finding) images, the centrality of the Internet, and the book as a malleable object which enables narrative experimentation. Take this opportunity to connect with the artist and discuss with those who have experienced and been moved by Last Seen.\n\n&nbsp;\n\n&nbsp;",
    "url": "https://map-india.org/map-events/image-memory-and-the-internet/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/1-5.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "916@map-india.org",
    "name": "Taak",
    "startDate": "2025-06-22T17:00:00+05:30",
    "endDate": "2025-06-22T19:00:00+05:30",
    "description": "Taak explores surveillance, technology, and human dignity in Delhi’s nightlife. When smartwatches are enforced on the nightclub staff, promising efficiency but raising safety concerns, Shalini and her colleagues face dehumanisation. They’re reduced to data points.\n\nThe smartwatch becomes a symbol of control, and Shalini must fight to retain her and her colleagues’ humanity. Rooted in observations of women in patriarchal systems, “Taak” questions the normalisation of surveillance and its ethical costs.\n\n&nbsp;",
    "url": "https://map-india.org/map-events/taak/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Taak"
    },
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-Image-1440-x-810-1-1.png"
  }
]