[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "744@map-india.org",
    "name": "Lettering workshop",
    "startDate": "2025-02-16T14:00:00+05:30",
    "endDate": "2025-02-16T17:00:00+05:30",
    "description": "Explore the intersection of language and art in our upcoming lettering workshop!  Held in conjunction with the Sasken Story Rangin Akshar exhibition, this session will guide you through the basics of lettering, including freehand exercises, briefly, multiscript logos.  Discover inspiring examples from MAP's collection and a walkthrough of our digital exhibition Rangin Akshar at the Sasken Gallery.  \n\nRegister now to secure your spot!\n\nWe are committed to making this event accessible to everyone. Please contact us at hello@map-india.org if you have any specific accessibility needs, and we will make the necessary arrangements.\n\nPhoto credits: Letterbox India, Ek Type",
    "url": "https://map-india.org/map-events/lettering-workshop/",
    "keywords": [
      "Collections programming",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-22.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "741@map-india.org",
    "name": "Fruits, Flags and Floral Patterns: A Workshop on Contemporary Chintz",
    "startDate": "2025-02-15T14:00:00+05:30",
    "endDate": "2025-02-15T15:30:00+05:30",
    "description": "In contemporary print design, designers have continued to explore kalamkari or chintz by drawing inspiration from historical patterns. In this workshop, Shambhavi T delves into MAP’s collection to uncover ideas and reinterpret historical patterns for modern use. \n\nParticipants will paint an artwork, using unique motifs such as fruit, floral, bird or animal patterns seen in Indian and Sri Lankan textiles. While the designs will be inspired by and closely crafted to mimic the appearance of such motifs on cloth, workshop participants will reproduce them on paper to create unique hand-made pieces that they can carry back with them as souvenirs. ",
    "url": "https://map-india.org/map-events/fruits-flags-and-floral-patterns-a-workshop-on-contemporary-chintz/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-20.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "706@map-india.org",
    "name": "Dastan-e-Alif Layla by Kafeel Jafri",
    "startDate": "2025-02-12T18:30:00+05:30",
    "endDate": "2025-02-12T19:45:00+05:30",
    "description": "Dastan-e-Alif Layla is a performance based on the tales from Arabian Nights, adapted into Dastangoi form by Kafeel Jafri. This is Kafeel’s first attempt at telling the story of Arabian Nights in Dastangoi medium. The performance consists of a mix of storytelling and poetry. This Urdu performance has been curated for the Arabian Nights in the Sasken Multimedia Gallery.",
    "url": "https://map-india.org/map-events/dastangoi-by-kafeel-jafri/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "ur",
    "image": "https://map-india.org/wp-content/uploads/2025/01/Dastangoi-image-by-Maitreyee-Joshi.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "718@map-india.org",
    "name": "Colcha Conversations",
    "startDate": "2025-02-13T17:00:00+05:30",
    "endDate": "2025-02-13T18:00:00+05:30",
    "description": "Join us for a delightful talk that unravels the enchanting world of ‘Colchas,’ exquisite embroidered textiles from the MAP collection! Colchas are decorative textiles, often characterized by elaborate embroidery or stitching, that originated in Portugal and were later embraced and transformed in Latin America. The term \"colcha\" translates to \"bedspread\" or \"coverlet,\" and these textiles were traditionally used as bed coverings or wall hangings. \n\nGuided by textile collector Jeevak Parpia, this session promises to take you on a journey through the intricate visual storytelling that defines these extraordinary artifacts. Discover the unique motifs woven into each ‘colcha’, and their deep cultural and historical resonance. \n\nWith his wealth of expertise, Mr. Parpia will talk on the artistic traditions and cross-cultural exchanges that shaped these textiles, tracing their roots from Portugal to Latin America, how colchas became a canvas for storytelling, reflecting the lives, beliefs, and aspirations of their makers.",
    "url": "https://map-india.org/map-events/colcha-conversations/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/Website-cover-images-new-9.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "731@map-india.org",
    "name": "The Forgotten Souvenir/ ನೆನಪಳಿದ ಸ್ಮರಣಿಕೆ",
    "startDate": "2025-02-11T15:30:00+05:30",
    "endDate": "2025-02-11T16:30:00+05:30",
    "description": "Explore MAP's exhibition, The Forgotten Souvenir, through a guided walk and discover how  the art of mica paintings, created during the East India Company’s heyday. These paintings, both art and historical documents, showcase professions, societal roles, and colonial India's rigid caste and class systems and thus, offer unique insights into everyday life under colonial rule.  \n\nThese delicate works, painted on thin sheets of muscovite mica from Murshidabad, Patna, and Trichinopoly, reflect the adaptation of Indian artists as royal patronage declined. They served as easily portable, attractive souvenirs for British travellers, bridging the gap between traditional miniature painting and the rise of photography.  \n\nAccompanied by Amit Dutta’s short film Moments before Mutiny and an interactive game, this guided walk invites you to journey deeper into this nearly forgotten chapter of Indian art.\n\nThis guided walk will be conducted in Kannada by Rajesh K from the MAP Team.\n\nMAP ನ ಇತ್ತೀಚಿನ ಪ್ರದರ್ಶನ, ‘ನೆನಪಳಿದ ಸ್ಮರಣಿಕೆ’ಯನ್ನು ಮಾರ್ಗದರ್ಶಿ ನಡಿಗೆಯ ಮೂಲಕ ಅನ್ವೇಷಿಸಿ ಮತ್ತು ಈಸ್ಟ್ ಇಂಡಿಯಾ ಕಂಪನಿಯ ಉತ್ತುಂಗದ ದಿನಗಳಲ್ಲಿ ಆಭ್ರಕ ಬಳಸಿ (ಮೈಕಾ) ರಚಿಸಲಾದ ವರ್ಣಚಿತ್ರಗಳ ಕಲೆ ಹೇಗೆ ಅರಳಿತು ಎಂದು ಅನ್ವೇಷಿಸಬಹುದು. ಕಲೆ ಮತ್ತು ಐತಿಹಾಸಿಕ ದಾಖಲೆಗಳೆರಡೂ ಆಗಿರುವ ಈ ವರ್ಣಚಿತ್ರಗಳು, ವೃತ್ತಿಗಳು, ಸಾಮಾಜಿಕ ಪಾತ್ರಗಳು ಮತ್ತು ವಸಾಹತುಶಾಹಿ ಭಾರತದ ದಿನಗಳಲ್ಲಿ ಜಾತಿ ಮತ್ತು ವರ್ಗ ವ್ಯವಸ್ಥೆಗಳು ಎಷ್ಟು ಕಠಿಣವಾಗಿ ವರ್ಗೀಕರಿಸಲ್ಪಟ್ಟಿದ್ದವು ಎಂಬ ವಿಷಯಗಳ ಮೇಲೆ ಬೆಳಕು ಚೆಲ್ಲುತ್ತದೆ. ಅಷ್ಟೇ ಅಲ್ಲದೆ ಈ ಚಿತ್ರಗಳು ವಸಾಹತುಶಾಹಿ ಆಳ್ವಿಕೆಯ ಸಮಯದಲ್ಲಿ ಜನರ ದೈನಂದಿನ ಜೀವನಗಳು ಹೇಗಿದ್ದವು ಎನ್ನುವ ಬಗ್ಗೆ ಅನನ್ಯ ಒಳನೋಟಗಳನ್ನು ನೀಡುತ್ತವೆ.\n\nಮುರ್ಷಿದಾಬಾದ್, ಪಾಟ್ನಾ ಮತ್ತು ಟ್ರಿಚಿನೋಪೊಲಿಯ ಮಸ್ಕೊವೈಟ್ ಅಭ್ರಕದ ತೆಳುವಾದ ಪದರಗಳ ಮೇಲೆ ಚಿತ್ರಿಸಲಾದ ಈ ಸೂಕ್ಷ್ಮ ಕೃತಿಗಳು, ರಾಜಮನೆತನದ ಬೆಂಬಲ ಹಾಗೂ ಪ್ರೋತ್ಸಾಹ ಕಡಿಮೆಯಾದಂತೆ ಭಾರತೀಯ ಕಲಾವಿದರು ಅವುಗಳನ್ನು ರೂಪಾಂತರಿಸಿದ ಬಗೆಯನ್ನು ಪ್ರತಿಬಿಂಬಿಸುತ್ತವೆ. ಬ್ರಿಟಿಷ್ ಪ್ರಯಾಣಿಕರು ಸುಲಭವಾಗಿ ಸಾಗಿಸಬಹುದಾದ, ಆಕರ್ಷಕವಾದ ಸ್ಮಾರಕಗಳಾಗಿ ಅವುಗಳು ಬಳಕೆಯಾದವು. ಸಾಂಪ್ರದಾಯಿಕ ಚಿಕಣಿ ಚಿತ್ರಕಲೆ ಮತ್ತು ಛಾಯಾಗ್ರಹಣದ ಉದಯದ ನಡುವಿನ ಅಂತರದಲ್ಲಿ ಕಾಣಿಸಿಕೊಂಡವು.\n\nಅಮಿತ್ ದತ್ತ ಅವರ ಕಿರುಚಿತ್ರ \"ಮೊಮೆಂಟ್ಸ್ ಬಿಫೋರ್ ಮ್ಯುಟಿನಿ\" ಮತ್ತು ಸಂವಾದಾತ್ಮಕ ಕ್ರೀಡೆಯೊಂದಿಗೆ, ಈ ಮಾಹಿತಿಯುಕ್ತ ನಡಿಗೆಯು ಕಾಲದಲ್ಲಿ ಕರಗಿಹೋದ ಈ ಭಾರತೀಯ ಕಲೆಯ ಅಧ್ಯಾಯದ ಬಗ್ಗೆ ತಿಳಿಯಲು ನಿಮ್ಮನ್ನು ಆಹ್ವಾನಿಸುತ್ತದೆ.\n\nMAP ತಂಡದ ರಾಜೇಶ್ ಕೆ ಅವರು ಈ ಮಾಹಿತಿಯುಕ್ತ ನಡಿಗೆಯನ್ನು ಕನ್ನಡದಲ್ಲಿ ನಡೆಸಿಕೊಡಲಿದ್ದಾರೆ.",
    "url": "https://map-india.org/map-events/the-forgotten-souvenir-11/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/01/forgotten-souvenir-website-banner-.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "743@map-india.org",
    "name": "Chay Reds, Ferrous Black — Curator Walkthrough",
    "startDate": "2025-02-15T17:00:00+05:30",
    "endDate": "2025-02-15T17:30:00+05:30",
    "description": "Join us for a guided walk of our latest exhibition, “Chay Reds, Ferrous Black” with curator Yash Sanhotra. This exhibition reveals the untold stories of Indian textiles found in Sri Lanka. Featuring exquisite Palampores and textile fragments, dating back to the 18th century, they once graced humble homes as well as sacred temples. Today, they serve as storytellers, weaving together the rich and intricate history shared between two ancient cultures.\nWhether you are fascinated by history, drawn to myths and legends, or a lover of textile craftsmanship, “Chay Reds, Ferrous Black” offers an evocative look into the ties that have bound India and Sri Lanka together for generations. Be a part of this interactive session and learn more about textiles and the tales they tell.",
    "url": "https://map-india.org/map-events/chay-reds-ferrous-black-curator-walkthrough/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/12/chay-reds-website-banner-.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "739@map-india.org",
    "name": "Anaïs in Love / Les Amours d'Anaïs",
    "startDate": "2025-02-16T15:00:00+05:30",
    "endDate": "2025-02-16T17:00:00+05:30",
    "description": "Is love a whirlwind of confusion, restlessness, and desire?  Anaïs certainly thinks so.  Join us this Valentine's Week for a special screening of the charming French romantic comedy, Anaïs in Love (Les Amours d'Anaïs), and experience love's ups and downs through Anaïs's eyes.\n\nThis event is in collaboration with The Alliance Française de Bangalore.\n\n",
    "url": "https://map-india.org/map-events/anais-in-love-les-amours-danais/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Anaïs in Love / Les Amours d'Anaïs"
    },
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-18.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "740@map-india.org",
    "name": "Petals, Peels and Pigments: A Workshop on Dyeing Processes",
    "startDate": "2025-02-15T11:30:00+05:30",
    "endDate": "2025-02-15T12:45:00+05:30",
    "description": "The iconic block-printed or hand-painted textiles historically produced for the Indian and Sri Lankan markets were traditionally characterised by bold red and black dyes on a white cotton background. \n\nIn this workshop, Harshitha from Gida Living Colours will guide participants through the process of creating these striking red and black pigments using plant-based dyes and inks. Participants will gain hands-on knowledge of transforming plants into vibrant pigments, exploring various natural processes along the way.\n\nLimited spots available. Register for the workshop to secure your place.",
    "url": "https://map-india.org/map-events/petals-peels-and-pigments-a-workshop-on-dyeing-processes/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-19.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "742@map-india.org",
    "name": "Evoking the Unsayable - Jayant Kaikini's Take on Art",
    "startDate": "2025-02-11T17:30:00+05:30",
    "endDate": "2025-02-11T18:30:00+05:30",
    "description": "“In Marathi, there is an expression called ghadat aahe, which means, ‘It is happening’. I am interested in that which is happening….. The art I create is an antidote to what is happening around us.” - poet Jayant Kaikini.\n\nThis event is a chance to hear from and learn about poet Jayant Kaikini in conversation with Pratibha Nandakumar from Ananya Dhrishya. Jayant Kaikini’s poetry is characterised by subtle imagism, a minute documentation of the seemingly commonplace, a colloquial idiom, and a conscientious refusal to engage in any poeticising.\n\nHis stories often depict the richness of urban life, particularly in Mumbai, and reflect his own experience with multiple languages (Kannada, Konkani, Hindi, Marathi, and Gujarati). He's fascinated by fleeting moments of experience, the \"happening\" as he calls it, rather than focusing on the consequences of those moments. He sees his art as a way to counter the often overwhelming nature of the world.\n\nThis event offers an opportunity to explore a unique perspective of art and poetry.",
    "url": "https://map-india.org/map-events/evoking-the-unsayable-a-poets-take-on-art/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "gu",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-21.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "738@map-india.org",
    "name": "Roots & Routes: Exploring historic and contemporary textile practices",
    "startDate": "2025-02-15T09:00:00+05:30",
    "endDate": "2025-02-15T18:30:00+05:30",
    "description": "Join us for a multidisciplinary all day symposium held in conjunction with the MAP’s ongoing exhibition Chay Reds, Ferrous Black: The untold stories of Indian trade textiles in Sri Lanka.\n\nCurated by Vaishnavi Kambadur, the symposium explores the history of textile trade through the lens of textile languages, practices and contemporary adaptations; situating them within a social and cultural context derived from regions including, but not limited to, India, Sri Lanka, Europe and Indonesia. Exploring the narratives within the exhibition such as lifestyle, commerce, costume and spirituality, it brings together diverse voices from not only the field of art history, but also sustainability studies, contemporary design, textile sciences, fashion and liberal arts.\n\nReflecting the process of textile creation, the symposium’s activities through the day aim to evolve new patterns, providing insight into the shared sentiments and histories of textile production. Moving between the past and present, it sets the stage for a deeper exploration of how textiles both root us to place, and connect us to a wider world.\nProgramme Schedule\n9:00 to 10:00 am — Registrations\n10:00 to 10:15 am — Opening remarks\n10:15 to 11:00 am — Inaugural Lecture: Cross Cultural Connections in Kalamkari\n11:15 am to 12:15 pm — Panel 1: From Khadi to Kalamkari: Textile Making Processes\n11:30 to 12:45 pm — Workshop 1: Petals, Peels and Pigments: A Workshop on Dyeing Processes\n12:30 to 1:00 pm — Inspired, Imagined and Interpreted: A Student-led Exhibition Walkthrough\n\n1:00 to 2:00 pm — Lunch\n\n2:00 to 3:00 pm — Panel 2: From Cotton Seeds to Chay Root: The Role of the ‘Local’\n2:00 to 3:30 pm — Workshop 2: Fruits, Flags and Floral Patterns: A Workshop on Contemporary Chintz\n3:15 to 4:15 pm — Panel 3: From Fabric to Fashion: ‘Hybrid’ Practices\n4:30 to 5:00 pm — Closing Remarks\n5:00 to 5:30 pm — Curator led Walkthrough\n\n5:00 to 6:30 pm — High Tea\n\nDownload a pdf version of the detailed schedule and speaker list by clicking on this link.\n\n\n\nPlease write to ritsika.kulkarni@map-india.org for general queries related to the symposium.\n\nFor Information on accessibility support:\nWrite to mounika.nallani@map-india.org. You can refer to the accessibility features mentioned here.",
    "url": "https://map-india.org/map-events/roots-routes-exploring-historic-and-contemporary-textile-practices/",
    "keywords": [
      "MAP",
      "Symposium"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/11/WhatsApp-Image-2024-11-04-at-3.48.53-PM.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "719@map-india.org",
    "name": "Framing the Archive",
    "startDate": "2025-02-15T09:00:00+05:30",
    "endDate": "2025-02-16T17:00:00+05:30",
    "description": "Join us for an essay filmmaking workshop with Falana Films, where they will introduce you to the essay film format and guide you in developing a short film (one to three minutes) while working with an archive.\n\nIn making your essay film, you will have access to a curated set of artworks from the MAP Collection, as well as a resource list of museum and other institutional archives available in the public domain. Additionally, you will be prompted to bring your own archival material–found footage, home videos, family photographs, long-lost audio recordings, and any A/V material you feel is at the cusp of telling a story. You will also be encouraged to film additional footage throughout the workshop.\n\nThis four-day workshop extends across two weekends–February 15–16 &amp; 22–23. Teams of four will be selected based on themes chosen by participants when they register for the workshop. These teams alongside the Falana team will work together to make the film.\n\nThe focus of this workshop is not as much on the technical aspects of filmmaking as it is on the meaning one can make from scattered archives when thematically exploring them. \n\nExpanding on the thematic concerns of MAP’s permanent exhibition, VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection you can find the list of themes for the workshop below:\n\n&nbsp;\n\n- Body as Landscape: Gender Identity, Sexuality and Body-politics\n\n- Home and Away: Memory, Migration and Nostalgia\n\n- No Person’s Land: Cities and Spaces \n\n- ‘Mad or What?’: Mental Health and the City\n\n&nbsp;\n\nRegister soon as seats are limited.\n\nRead this document to find out more about the workshop, FAQs and a tentative schedule.",
    "url": "https://map-india.org/map-events/framing-the-archive/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/Website-cover-images-new-10.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "732@map-india.org",
    "name": "Up, Close & Centre",
    "startDate": "2025-02-21T16:30:00+05:30",
    "endDate": "2025-02-21T17:00:00+05:30",
    "description": "Join us for a session of Up, Close &amp; Centre at our exhibition, The Forgotten Souvenir. \n\nThe mica paintings in this exhibition from Murshidabad, Patna and Trichinopoly (present day Tiruchirapalli) represent a nearly forgotten chapter in Indian art, bridging the gap between the decline of traditional miniature painting and the rise of photography. \n\nShubhasree Purkayastha from the MAP team will be speaking about the Ramlila festival artwork by Sewak Ram in detail and focusing on the details as well as context within the exhibition.\n\nDon’t miss this unique chance to engage with the exhibition on a more personal level. \n\nThis is a drop-in session. No pre-registration required.",
    "url": "https://map-india.org/map-events/up-close-centre-11/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/forgotten-souvenir-website-banner-1.png"
  }
]