[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "868@map-india.org",
    "name": "Training Course in Conservation of Photographs in Museums, Archives, and Collections",
    "startDate": "2025-06-16T09:00:00+05:30",
    "endDate": "2025-09-13T17:30:00+05:30",
    "description": "Don’t let history disappear–or discolour–or fade! Discover the science of photography conservation and learn the art of restoring historic photograph collections. This hands-on, intensive training course is designed for practising conservators, archivists and custodians of historic photograph collections to learn preventive collection care measures, remedial conservation processes, and restoration techniques.\n\nThis three month course will be followed by a one month internship. The course will be instructed by leading specialists from India and overseas and includes topics such as: \n\n -Development, materials and techniques of historic photographic processes\n\n -Identification and understanding of deterioration processes in photograph collections\n\n -Inspection and survey methodologies\n\n -Condition report preparation and preservation prioritisation decisions\n\n -Emergency treatment measures\n\n -Conservation of film and glass plate negatives\n\n -Conservation and restoration of photographs\n\n -Archival protocols of housing, display, and storage of photographic materials\n\n -Disaster management",
    "url": "https://map-india.org/map-events/training-course-in-conservation-of-photographs-in-museums-archives-and-collections/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-12T161452.615.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "940@map-india.org",
    "name": "Sip & Paint- A Queer Mixer",
    "startDate": "2025-07-05T15:30:00+05:30",
    "endDate": "2025-07-05T17:00:00+05:30",
    "description": "Try a fun cocktail, pick up a brush, and let your creativity flow!\n\nIn this special evening of Sip &amp; Paint, come and unwind at our rooftop restaurant where you can catch a gorgeous sunset against the lush greenery of Cubbon Park. Enjoy drinks as you draw inspiration from the MAP collection, unleash your painting prowess, all while you meet new people in a fun and relaxed space.\n\n- All painting materials will be provided .\n\n- Alcoholic beverages are available for those aged 21 and above.\n\n- Please carry ID for age proof.\n\n- One coupon gives you free access to all galleries at MAP on the date of the event, as well as two cocktails at the Cumulus restaurant.\n\nPlease note: This mixer is exclusively for queer folks.",
    "url": "https://map-india.org/map-events/sip-paint-a-queer-mixer/",
    "keywords": [
      "MAP",
      "Sip & Paint"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-Image-1440-x-810-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "934@map-india.org",
    "name": "Textiles in Focus - A Hands-on Workshop in Archiving & Documenting",
    "startDate": "2025-07-05T10:00:00+05:30",
    "endDate": "2025-07-05T16:00:00+05:30",
    "description": "Calling all design students, professionals and enthusiasts to take part in museum practices in textile documentation!\n\nJoin this full day hands-on workshop to learn about procedures for documenting textiles, an integral part of creating a complete archive and exhibition. You’ll be able to shadow and assist professionals from the Haveli team in the steps involving textile documentation including research, photographing, digitisation, cataloguing and writing, ending the day with a collaborative discussion on the collection.\n\nPlease note:\n\n- Last date for registration: June 29, 2025\n\n- Limited seats available. Selected participants will be notified by July 2, 2025\n\n- This workshop, though created especially for students, is open to everyone\n\nAbout Haveli \n\nFounded in the 1980s by Poornima Jain, Haveli was a pioneering boutique that celebrated the richness of Indian craftsmanship through timeless clothing and accessories. Blending traditional craft and studio techniques into contemporary design, the brand explored diverse silhouettes using hand-woven fabrics and materials deeply rooted in India’s heritage and philosophy of sustainable livelihoods.\n\nHaveli at MAP\n\nThe present-day Haveli collection at MAP includes over 2,800 textile objects and 2,000 ephemera items, featuring costumes, accessories and home textiles from Asian and African craft traditions, design studio developments along with archival materials like printing blocks, design sheets, and student projects that document the workings of a textile and fashion design studio.",
    "url": "https://map-india.org/map-events/textiles-in-focus-a-hands-on-workshop-in-archiving-documenting/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-Image-1440-x-810-2.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "939@map-india.org",
    "name": "Queer Open Mic",
    "startDate": "2025-07-05T18:00:00+05:30",
    "endDate": "2025-07-05T21:00:00+05:30",
    "description": "Join us for an unforgettable evening celebrating queer expression and resistance at our open mic. Step up to the mic or cheer from the audience as we share stories, music, poetry, comedy, and more. Allies are invited to support from the audience, while performing space and time is reserved for LGBTQIA+ folks.\n\nConnect with new friends, share your stories and be part of a vibrant community.",
    "url": "https://map-india.org/map-events/queer-open-mic/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/1-12.png"
  }
]