[
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "984@map-india.org",
    "name": "Livelihood and Living Traditions",
    "startDate": "2025-08-30T11:00:00+05:30",
    "endDate": "2025-08-30T13:00:00+05:30",
    "description": "Image Credits: Tailor Made City, Nagari 2021\nWhen livelihoods disappear and become stigmatised, what happens?\n\nJoin us for a screening of Nagari films that look at various ways in which communities' livelihoods and living traditions are stripped, held against, or deemed obsolete.  This will be followed by a talk by the Assistant Director Tanvi Karia from Charles Correa Foundation.\n\nAbout the films\n\n01. Olam I Chennai\n\nDirected by Priyadharshan Anand, Nagendran Arumugam, Arunmani Vasu and Dishon C Prince, the film explores the tale of the Kosasthalai river. It is narrated by Kumaresan, a native fisherman, voicing for the land, the people, its flora and fauna.\n\n&nbsp;\n\n02. The Bhavi Project I Bangalore\n\nBy Rajeev G Malagi and Smruti Balvalli\n\nThe ‘Bhavi project’ documents the changing narrative of open wells as physical systems of water storage and their association with communities. The film is developed on a fundamental premise: ‘What is the future of cities without open wells?’ \n\n&nbsp;\n\n03. The Many Journeys of Water I Tiruchirapalli\n\nBy Niki Nirvikalpa, Sugantha Priscilla and Prasanth Kumar K\n\nThe journey of water doesn’t end at the toilet when you flush it. The journey of ‘wastewater’ or sewage, as it is now known, begins here. \n\n&nbsp;\n\n04. Tailor Made City I Bangalore\n\nBy Purna, Himadri Das, Arvind Dev, Montry Thaalavattam, Karthik Murali and Ravikumar A.S \n\nThree tailors who operate in very different spaces of the city, yet they share the same set of skills. They have found ingenious ways to survive. This film traces those stories of self-respect and pride. The tailors are a tribe which contributes to the maintenance of the city and its people. They are omnipresent.\n\n&nbsp;\n\n05. Darudi I Ahmedabad\n\nBy Atish Indrekar and Ruchika Chhara\n\n'दारुडी' (Darudi) is a word in the Bhantu language, meaning 'liquor'. This film is about the Chhara community, who are stigmatised as \"criminals'' due to their tainted colonial history. Because of this existing historical stigma in society, women of the Chhara tribe have to brew liquor as a part of their livelihood, which is an act of prohibition/crime in the dry state of Gujarat. However, there is a negligible section of the Chhara society which is involved with small businesses and is trying to emerge from their stigmatised life.\n\n&nbsp;\n\n06. Cycle of Life I Nagpur\n\nBy Swanand Kottewar, Rahul Jambhulkar, Aniket Kolarkar &amp; Sanket Ray\n\nThe cycle, is often dismissed as a relic of the past, has been an important means of mobility and livelihood for over a century. Cycle of Life is an intimate exploration of change witnessed through the life of Umesh Sarate, an age-old cycle customer of Shinde Cycle Store, in Nagpur. He travels to the city to buy wholesale goods from the local market, as he rents a cycle from the store. ",
    "url": "https://map-india.org/map-events/livelihood-and-living-traditions/",
    "keywords": [
      "CBD",
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Livelihood and Living Traditions"
    },
    "image": "https://map-india.org/wp-content/uploads/2025/08/Website-cover-images-new-10.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "981@map-india.org",
    "name": "Draw with PencilJam",
    "startDate": "2025-08-24T10:30:00+05:30",
    "endDate": "2025-08-24T13:00:00+05:30",
    "description": "View the museum with new eyes as you make your way through various exhibitions with a sketchbook in hand. You don’t need to be a professional to join as, as we share prompts for a drawing session led by PencilJam. \n\nAll you need is an open mind and: \n\n-Sketchbook or A4 paper\n\n-Pencil (wood or mechanical) and eraser\n\n-Gel pens or fineliners for outlining\n\n-Colour brush pens, sketch pens, or colour pencils (no wet media)",
    "url": "https://map-india.org/map-events/draw-with-penciljam-2/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/10/Penciljam.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "989@map-india.org",
    "name": "The Giacomettis",
    "startDate": "2025-08-24T11:00:00+05:30",
    "endDate": "2025-08-24T13:00:00+05:30",
    "description": "Image credit: Filmstill IG_ Giovanni Giacometti, Selbstbildnis im Schnee 1899©Vincafilm_02\nThe rugged, mysterious Swiss mountain valley of Bergell brought forth an extraordinary artistic dynasty: The Giacomettis. Alberto revolutionised the world of art with his slender sculptures. Before him, his father Giovanni, was one of the foremen of the impressionist movement. All the Giacometti children–Alberto, Diego, Otilia and Bruno–were endowed with varied and impressive artistic talent.\n\nJoin us for a screening of Susanna Fanzun's intimate portrait of the extraordinary Giacometti family. Through masterful paintings, personal letters, and stunning alpine landscapes, the film traces the artistic legacy of this remarkable dynasty.",
    "url": "https://map-india.org/map-events/the-giacomettis/",
    "keywords": [
      "CBD",
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "The Giacomettis"
    },
    "image": "https://map-india.org/wp-content/uploads/2025/08/Website-cover-images-new-14.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "990@map-india.org",
    "name": "Make at MAP",
    "startDate": "2025-08-31T11:30:00+05:30",
    "endDate": "2025-08-31T15:30:00+05:30",
    "description": "Create a miniature gratitude box in this hands-on workshop. Inspired by MAP's matchbox collection, craft your own small gratitude box dedicated to someone who taught you something meaningful - a teacher, friend, family member, or unexpected mentor.\n\nSession timings:\n\n11.30am to 1pm &amp; 2pm to 3.30pm",
    "url": "https://map-india.org/map-events/make-at-map-22/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/08/Website-cover-images-new.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "986@map-india.org",
    "name": "Stories Between the Lines",
    "startDate": "2025-08-31T16:00:00+05:30",
    "endDate": "2025-08-31T18:00:00+05:30",
    "description": "A dancing elephant. A woman emerging from an egg. These aren't fairy tale illustrations, they're actual textile trademarks from early 20th century India that make you wonder: what were brands thinking back then?\n\nJoin storyteller Vikram Sridhar as he unravels the mysteries behind these wonderfully strange labels from Ticket Tika Chaap: The Art of the Trademark in Indo-British Textile Trade. Through captivating 20-minute performances, he transforms curious imagery into compelling human stories.\n\nIn a series of engaging 20-minute storytelling sessions, he explores the cultural, personal, and historical threads embedded in each label. Blending theatre with narrative, Vikram takes on different characters, using each label as a prompt to craft compelling, thought-provoking short stories.",
    "url": "https://map-india.org/map-events/stories-between-the-lines/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/4-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "983@map-india.org",
    "name": "NeuroQueer Brain Box",
    "startDate": "2025-08-23T15:00:00+05:30",
    "endDate": "2025-08-23T17:00:00+05:30",
    "description": "A warm invitation to all Neuroqueers!\n\nJoin us for another edition of NeuroQueer Brain Box facilitated by Mani Agarwal who is a NeuroQueer therapist. For this session, we’ll come  together to reimagine art and write letters of care and affirmation.\n\nWe’ll begin by moving through Shape of a Thought: Letters from Ram Kumar at your own pace, in your own way. As you journey through the exhibition, hold close three words of affirmation; let them sit with you, and bring them to the huddle.\n\nThrough shared exploration and queer perspectives, we’ll shape those thoughts into community letters and collaborative art celebrating neuroqueer creativity and building a space where others can feel seen, safe, and held.\n\nPlease note: This is a free session exclusively for individuals who identify as LGBTQIA+ with ADHD/Autism/AuDHD.",
    "url": "https://map-india.org/map-events/neuroqueer-brain-box/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/08/Website-cover-images-new-9.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "979@map-india.org",
    "name": "Calling Up and Coming Photographers",
    "startDate": "2025-08-23T11:00:00+05:30",
    "endDate": "2025-08-23T13:00:00+05:30",
    "description": "Image Credits: 'Cooler' from the Town Boy series\nWant a professional review of your photography portfolio? Then this session is for you! Join professional photographer Sathish Kumar, whose work has featured in Chennai’s Photo Biennale and MAP’s Vaanyerum Vizhuthugal exhibition for an expert review. \n\nGain a fresh perspective on your craft, identify strengths and areas of improvement, and connect with fellow photographers who share your passion. \n\nPlease note: Participants must bring printed copies of their work or upload their portfolio during registration. The deadline to register is August 17th",
    "url": "https://map-india.org/map-events/calling-up-and-coming-photographers/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/08/Website-cover-images-new-7.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "980@map-india.org",
    "name": "Art in Motion: Girish Kasaravalli on the Centrality of Women in his Cinema",
    "startDate": "2025-08-23T17:00:00+05:30",
    "endDate": "2025-08-23T18:00:00+05:30",
    "description": "Legendary filmmaker Girish Kasaravalli engages in a deep and wide-ranging conversation on the women who anchor his cinematic narratives, with cultural critic Suresh Jayaram. The talk will focus on quiet revolutions which unfold in Kasaravalli’s films—Ghatashraddha, Thaayi Saheba, Dweepa and Kanasemba Kudureyaneri—where women are never peripheral but central to the narrative. \n\nTogether, Kasaravalli and Jayaram will explore how these stories are crafted not just through dialogue, but through silence, visual metaphor, and a cinematic grammar that draws from literature, theatre, and the visual arts. The event is being hosted in collaboration with Ananya Drushya.",
    "url": "https://map-india.org/map-events/art-in-motion-girish-kasaravalli-on-the-centrality-of-women-in-his-cinema/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2020/12/1440-X-810-Widget-06.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "988@map-india.org",
    "name": "Cantt Jothege",
    "startDate": "2025-08-30T16:00:00+05:30",
    "endDate": "2025-08-30T18:00:00+05:30",
    "description": "Image Credits: Kirtana Kumar\nJoin us for an intimate talk featuring stories from women who shaped and experienced Bangalore’s music scene in the 80s and 90s - from church choirs and local bands, to street performances and listening circles. \n\nIn conversation with younger artists led by Kirtana Kumar, this session reflects on musical practices of women in Bangalore’s Cantonment across generations. This conversation will be accompanied by archival material from the city’s rock and music history. ",
    "url": "https://map-india.org/map-events/cantt-jothege/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/08/Website-cover-images-new-13.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "985@map-india.org",
    "name": "Lal Bhi Udhaas Ho Sakta Hai",
    "startDate": "2025-08-31T15:30:00+05:30",
    "endDate": "2025-08-31T17:00:00+05:30",
    "description": "Join us for a rare screening of acclaimed filmmaker Amit Dutta's contemplative masterpiece 'Lal Bhi Udhaas Ho Sakta Hai' (Even Red Can Be Sad).\n\nExperience his poetic exploration of color, memory, and emotion in an intimate cinema setting.",
    "url": "https://map-india.org/map-events/lal-bhi-udhaas-ho-sakta-hai/",
    "keywords": [
      "CBD",
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Lal Bhi Udhaas Ho Sakta Hai"
    },
    "image": "https://map-india.org/wp-content/uploads/2025/08/Website-cover-images-new-11.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "982@map-india.org",
    "name": "Coffee & Yap!",
    "startDate": "2025-08-24T14:30:00+05:30",
    "endDate": "2025-08-24T17:30:00+05:30",
    "description": "Join our casual Coffee and Yap! artsy workshop, where we teach you how you can turn your camera roll into matchbox-sized photo-books. Spend an afternoon learning a new skill and turning your memories into miniature masterpieces.",
    "url": "https://map-india.org/map-events/coffee-yap/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/08/Website-cover-images-new-8.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "978@map-india.org",
    "name": "Memory Keepers: A guide to photo conservation",
    "startDate": "2025-08-14T18:30:00+05:30",
    "endDate": "2025-08-14T19:30:00+05:30",
    "description": "We've all been there, finding that old family photo tucked away in a drawer, only to discover it's starting to fade, crack, or yellow. Those irreplaceable moments with loved ones, and memories captured are slowly disappearing.\nThe truth is, photographs are fragile. Heat, humidity, light, and even the way we store them can cause damage that sometimes can't be undone. But here's the good news, you don't need to be a professional to protect your photo collection!\n\nIn this talk, Chloe Lucas, a professional conservator will inform us of some preventive conservation actions that can be easily taken and implemented in a personal and private context to improve the long-term preservation of private photographic collections.",
    "url": "https://map-india.org/map-events/memory-keepers-a-guide-to-photo-conservation/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-cover-images-new-6.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "987@map-india.org",
    "name": "Sonic Picnics",
    "startDate": "2025-08-17T10:00:00+05:30",
    "endDate": "2025-08-17T14:00:00+05:30",
    "description": "Image credits: Karthika Sakthivel\nExperience Cubbon Park…no no actually, listen to Cubbon Park! Join a listening workshop led by Sonic Picnics where you can draw from audio stories and sonic impressions of Cubbon Park and create your own interactive fabric patches.\n\nThis workshop emerges from Sonic Picnics, a year-long public art project that collected voices, sounds, and stories from Cubbon Park and stitched them into an interactive picnic blanket. This Foundation Project was implemented by India Foundation for the Arts (IFA) under the Project 560 programme, made possible with support from  BNP Paribas India.",
    "url": "https://map-india.org/map-events/sonic-picnics/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/08/Website-cover-images-new-12.png"
  }
]