[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "856@map-india.org",
    "name": "Scrappy puppet tales- Summer at MAP",
    "startDate": "2025-05-19T11:00:00+05:30",
    "endDate": "2025-05-24T16:00:00+05:30",
    "description": "Summer holidays are here, and are the kids already chanting \"I'm bored?\"! Get them over to MAP for an exciting summer camp filled with art, learning and group activities facilitated by professional artists. Give your kids a summer to remember at the museum.\n\nGet ready for some fun storytelling! In the Scrappy Puppet Tales workshop, kids will become puppet creators using all sorts of cool scrap and junk. It's a hands-on adventure where imagination takes center stage. Guided by renowned actress  and puppeteer Padmavati Rao, children will bring their wacky puppet characters to life. The grand finale? A showcase where each young artist gets to present their puppet creations!\n\nAge group- 9-12 year olds. Registration fees is ₹1050. Number of participants are limited so please register to confirm your spot.",
    "url": "https://map-india.org/map-events/scrappy-puppet-tales-summer-at-map/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-2025-04-26T144806.943.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "825@map-india.org",
    "name": "Printmaker's Perspective: Ticket Tika Chaap",
    "startDate": "2025-04-27T17:30:00+05:30",
    "endDate": "2025-04-27T18:00:00+05:30",
    "description": "From dancing elephants and beloved deities, to the surprising sight of steamships, textile labels showcased a variety of captivating imagery.\n\nTextile labels arrived in Indian markets in the thousands, stuck on yards upon yards of cotton fabric manufactured in the mills of Britain (and India), and sold in Indian and global markets. They wove desire, memory, and meaning into the act of purchase. \n\nOur latest exhibition, Ticket Tika Chaap, explores these textile labels, and their art-historical and commercial significance, as perhaps the earliest forms of branding and advertisement, in India. Join us for an exciting walkthrough of Ticket, Tika, Chaap with artist and printmaker Jayasimha Chandrasekhar where he shares his unique insights as a printmaker. This will be followed by an in-depth presentation on the same.",
    "url": "https://map-india.org/map-events/printmakers-perspective-ticket-tika-chaap/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-81.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "853@map-india.org",
    "name": "Weaving Words- A Poetry Workshop",
    "startDate": "2025-05-03T11:30:00+05:30",
    "endDate": "2025-05-03T16:30:00+05:30",
    "description": "From the loom to the line: What poetic threads will you weave from the art of the trademark?\n\nThis poetry workshop explores poetry as a tool of expression and transformation across languages and cultures. Following the workshop, participants will engage in a poetry recital. They will use artworks featured in the Ticket Tika Chaap: The Art of the Trademark in Indo-British Textile Trade, exhibition to inspire new kinds of poems and writing. We'll use visual art and performance to explore words and ideas in creative ways. This workshop will be followed by a performance.\n\nThis multilingual workshop is open to participants from any linguistic background. Medium of the facilitation will be English.  \n\nThis workshop is the first in the series, Responding to Art through the Arts.\n\nOnly for 18-25 year olds.",
    "url": "https://map-india.org/map-events/weaving-words-workshop/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-2025-04-25T121600.337.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "850@map-india.org",
    "name": "We don’t end at our edges",
    "startDate": "2025-04-27T13:00:00+05:30",
    "endDate": "2025-04-27T14:00:00+05:30",
    "description": "Join us for a guided walk of our exhibition We don’t end at our edges. It is an immersive exhibition featuring artworks by Bengaluru-based artist, writer and educator Ravikumar Kashi. He uses paper to ‘paint’ letters from the Kannada alphabet, transforming language itself into a metaphor for the permeability of human connection, suggesting that while physical forms may fade, the bonds we share as individuals and as a community remain.\n\n&nbsp;",
    "url": "https://map-india.org/map-events/we-dont-end-at-our-edges-9/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/03/5-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "846@map-india.org",
    "name": "Age of Panic/La Bataille de Solférino",
    "startDate": "2025-04-27T15:00:00+05:30",
    "endDate": "2025-04-27T17:00:00+05:30",
    "description": "Do you sometimes feel like everything is happening all at once and there’s no better way to describe it other than absolute chaos? That's how Laetitia felt on 6 May 2012, the day of the second round of the French presidential election. Join us for a film screening of Age of Panic/La Bataille de Solférino, a french comedy film directed by Justine Triet. The film is about a frazzled young mother who navigates the homefront during a pivotal moment in French politics. This screening will be followed by a discussion.\n\nThis film is in collaboration with the Alliance Francaise Bangalore and part of our series Femme: Beneath the surface, which aims to spotlight an emerging generation of French storytellers, each dissecting characters that embody the idea of the woman - layered, disoriented and probing. Set against the backdrop of contemporary France - where questions of class, identity, and belonging remain urgent and unresolved - these films trace the quiet resistance and raw introspection of women thrown into complex situations. This series aims to engage with younger audiences who see through facades, question structure, and crave stories that don’t look away from the fractures beneath the surface.\n\nThis film will be screened in French with English subtitles.",
    "url": "https://map-india.org/map-events/age-of-panic-la-bataille-de-solferino/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Age of Panic/La Bataille de Solférino"
    },
    "subtitleLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-98.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "855@map-india.org",
    "name": "The Mural Of The Story- Summer at MAP",
    "startDate": "2025-05-12T10:00:00+05:30",
    "endDate": "2025-05-17T16:00:00+05:30",
    "description": "Summer holidays are here, and are the kids already chanting \"I'm bored?\"! Get them over to MAP for an exciting summer camp filled with art, learning and group activities facilitated by professional artists. Give your kids a summer to remember at the museum.\n\nLearn about the art of mural painting, what goes on behind the planning of a mural, famous mural artists, etc. Facilitated by artist Deepa Juliana and inspired by the works of Bhuri Bai, kids will discover the fascinating process behind creating these large-scale artworks. Children will also get to paint their own mural at MAP! And the best part? We'll provide all the colours, brushes, and everything else they need to bring their vision to life.\n\nSo join this workshop and make this summer a colourful and creative one!\n\nAge group- 13-16 year olds. Registration fees is ₹1050. Number of participants are limited so please register to confirm your spot.",
    "url": "https://map-india.org/map-events/the-mural-of-the-story-summer-at-map/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-2025-04-26T142358.568.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "824@map-india.org",
    "name": "Poetry in Stone: Ticket Tika Chaap",
    "startDate": "2025-04-27T18:00:00+05:30",
    "endDate": "2025-04-27T18:30:00+05:30",
    "description": "Following the Printmaker’s Perspective, a guided walk led by artist Jayasimha Chandrasekhar, there will be an in-depth presentation on printmaking and its relevance in textile labels. In 'Poetry in Stone,' you will learn about the printing technique of chromolithography and discover the inherent artistry that brought these colorful designs to life.\n\nThis event is in relation to our exhibition, Ticket Tika Chaap: The Art of the Trademark in Indo-British Textile Trade.",
    "url": "https://map-india.org/map-events/poetry-in-stone-ticket-tika-chaap/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-94.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "852@map-india.org",
    "name": "Vaanyerum Vizhuthugal",
    "startDate": "2025-04-27T16:00:00+05:30",
    "endDate": "2025-04-27T17:00:00+05:30",
    "description": "Join us for a guided walk of Vaanyerum Vizhuthugal: Roots that Reach for the Sky. \n\nInitially exhibited as part of the Chennai Photo Biennale 2024-2025, for MAP this is the first ever group exhibition dedicated to contemporary photography and lens-based practices. Vaanyerum Vizhuthugal (translating to “Roots that Reach for the Sky”), curated by Jaisingh Nageswaran, brings together the works of twelve lens-based artists of Tamil origin who push the boundaries of photography and visual storytelling.\n\nThis exhibition is a project by Goethe-Institut Chennai and Chennai Photo Biennale. \n\nThe programming is in collaboration with the Goethe Institute/Max Mueller Bhavan Bangalore.\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/vaanyerum-vizhuthugal-3/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-96.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "845@map-india.org",
    "name": "Make at MAP",
    "startDate": "2025-04-27T11:30:00+05:30",
    "endDate": "2025-04-27T15:30:00+05:30",
    "description": "Many of us have seen the captivating art of kalamkari as familiar motifs on a dupatta or saree or the prints adorning a pencil pouch. Learn more about this ancient art form and create your own kalamkari souvenir to take home with you.\n\nPlease note that this is a drop-in session with no registration required. There will be two sessions for the same: 11:30 AM – 1:00 PM and 2:00 PM – 3:30 PM.",
    "url": "https://map-india.org/map-events/make-at-map-19/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-95.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "854@map-india.org",
    "name": "Weaving Words (Performance)",
    "startDate": "2025-05-03T16:30:00+05:30",
    "endDate": "2025-05-03T17:30:00+05:30",
    "description": "Following the poetry workshop, Weaving Words, this session will be a poetry performance by poet Mamta Sagar. She will be using artworks in the exhibition, Ticket, Tika, Chaap: The Art of the Trademark in Indo-British Textile Trade as a reference in her poetry. \n\nThis performance is the first in the series, Responding to Art through the Arts.\n\nOnly for 18-25 year olds.",
    "url": "https://map-india.org/map-events/weaving-words-performance/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-2025-04-25T120651.312.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "823@map-india.org",
    "name": "How to Dream a Rasa Machine",
    "startDate": "2025-04-27T16:30:00+05:30",
    "endDate": "2025-04-27T18:00:00+05:30",
    "description": "An immersive techno-ritual unlike any other. Join us for a performance by Dominique Savitri Bonarjee as she presents \"How to Dream a Rasa Machine,\" a sensuous journey into sound, movement, and the subtle energies of our world. Structured as an electrifying jam session, blending electronic and acoustic textures with embodied dance, this performance is deeply inspired by the intricacies of Indian rasa. At its heart lies a handcrafted copper sound suit, a revolutionary instrument that translates the performer’s every motion and environmental nuances – gravity, air, humidity – into a rich sonic landscape.\n\nIn Indian aesthetics, rasa refers to the spiritual pleasure of deep immersion in experience. Here, the audience encounters rasa through the sensuous materiality of the instrument, and a spectral soundscape that induces a collective dream-space. \n\nThis is followed by ‘Butoh, as Heard by a Dancer’, book presentation.",
    "url": "https://map-india.org/map-events/how-to-dream-a-rasa-machine/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-80.png"
  }
]