[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1110@map-india.org",
    "name": "Beyond Headcount Diversity - MAP's 3rd Inclusion Conference, 2026",
    "startDate": "2026-02-14T09:00:00+05:30",
    "endDate": "2026-02-14T18:30:00+05:30",
    "description": "Click here for the schedule.\nRegistrations for this event are now closed.\nIf we imagine inclusion in the arts and cultural sector as a landscape we have been mapping intuitively—sometimes through deliberation and by asking important questions such as: Did we do our best to make access equal for all? Did we push through collaboratively? Did we slow down to listen and evolve? And when did we realise that the map itself needed to be redrawn?\n\nThe Inclusion Conference has always been MAP’s attempt to ask these questions openly. What began in 2023 as a gathering to think about accessibility in cultural organisations, has grown into an annual space where practitioners, educators, activists, artists, and community leaders convene to reflect on inclusive practices that shape the art &amp; cultural spaces. Not merely as a value, but also a practice informed by the unique perspectives of historically marginalised and underrepresented communities.\n\nYear after year, MAP’s Inclusion conference has examined these questions from different vantage points: First, through the lens of funding, then through the systems and structures that enable or restrict those opportunities. In this third edition, we turn our attention to measurement not as a checkbox, but as a way of understanding whether our intentions translate into meaningful change.\n\nTo explore this, the conference brings together voices who work at the intersections of justice, care, community organising, and cultural practice:\n- Through fireside conversations, we unpack how identities shape our understanding of culture and belonging.\n- Workshops guide participants through nuances of recognising unconscious bias, navigating conflict, and cinema poster politics of caste and gender.\n- Case study labs offer a closer look at community-led art &amp; cultural collectives, accessible practice, multilingual engagement, and grassroots education, urging us to reflect on what works, and what must evolve.\n\nThrough the day, participants are encouraged to question their assumptions and biases, as well as rethink and reimagine their roles. The conference culminates with a performance rooted in lived histories at the margins, through a Song of Ghetto by Jangama Collective.\n\nMAP’s aim is to continuously evolve, learn and bring forth innovative, inclusive practices. This conference is a gathering of those who believe that cultural spaces can be more inclusive, more imaginative, and more equitable and those who are willing to walk the talk of shaping that future together.\n\nThis year’s MAP’s 3rd Inclusion conference, Beyond Headcount Diversity at MAP is supported by:\n\n&nbsp;\n\n\n\n&nbsp;\n\nMAP’s Accessibility Partner \n\n\n\n&nbsp;\n\nInclusion Conference 2023\n\nInclusion Conference 2024",
    "url": "https://map-india.org/map-events/inclusion-conference-2026-beyond-headcount-diversity/",
    "keywords": [
      "CBD",
      "Conferences",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/12/BHDC_1440X810.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1162@map-india.org",
    "name": "In Celestial Company",
    "startDate": "2026-02-15T12:00:00+05:30",
    "endDate": "2026-02-15T13:00:00+05:30",
    "description": "Join us for a guided walk of our exhibition, In Celestial Company, led by Vineet Kajrolkar. Shift your focus from the deities and move it to their grand procession of divine helpers, wondrous animals and mythic beings and their fascinating stories.",
    "url": "https://map-india.org/map-events/in-celestial-company/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/Website-cover-images-new-2026-02-10T170309.052.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1174@map-india.org",
    "name": "Listening to Images",
    "startDate": "2026-02-28T11:30:00+05:30",
    "endDate": "2026-03-01T16:00:00+05:30",
    "description": "Join this two-day workshop of creative inquiry and narrative experimentation where you engage with MAP’s latest exhibition, Beneath the Turning Sky. In the workshop, you will make your own short video works, responding to the exhibition through close looking, interpretation and poetic translation. Led by writer and sound researcher Mishika Goel, the workshop offers the space to reflect on how art can be re-encountered, re-imagined, and articulated through new narrative forms.\n\nDrawing from her experiences in France and her creative process behind Prochaine Station: Aristide Briand, Mishika reflects on narrative as both method and medium. The workshop, situated at the intersection of language, moving image, and curatorial encounter, explores how artworks generate meaning beyond the visual- prompting stories, gestures, and varied forms of response..\n\nThis workshop is part of the ongoing series, Responding to Art through the Arts. Facilitated by arts practitioners, it aims to activate MAP’s galleries through a series of workshops that hold space for young people’s responses to artwork on display. \n\nIt is conducted as part of our engagements for the MAP Youth Collective - a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.\n\nWorkshop requirements: Open to all skill levels, any phone camera/professional camera can be used.",
    "url": "https://map-india.org/map-events/listening-to-images/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/Website-cover-images-new-2026-02-13T113554.241.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "1171@map-india.org",
    "name": "Visual Vernacular & Poetry",
    "startDate": "2026-02-22T16:30:00+05:30",
    "endDate": "2026-02-22T17:30:00+05:30",
    "description": "Image Courtesy: SAF, Goa \nJoin us for a Visual Vernacular (VV) performance by Deaf performer Benin, followed by an ISL poetry session by Hardeep Singh from the MAP team.\n\nVisual Vernacular (VV) is a dynamic form of visual storytelling used in deaf culture. It involves expressive body movements and facial expressions to convey complex narratives and emotions, emphasising dramatic and artistic elements. Unlike traditional sign language, which focuses on factual communication, VV creates vivid, engaging, and multi-dimensional stories. \n\nISL Poetry is a visual form of expression that uses handshapes, movement, facial expressions, and space instead of spoken words. Meaning is created through rhythm, repetition, and emotion in the body. Rather than being translated from spoken language, ISL poetry is composed in the language itself, celebrating Deaf culture and the expressive power of Indian Sign Language.\n\nThis performance is held in conjunction with our exhibition, mild tooth of milk, currently on display at the Dutch Warehouse in Fort Kochi.\n\nThis series of programs is hosted in collaboration with the Kerala Museum.",
    "url": "https://map-india.org/map-events/visual-vernacular-poetry/",
    "keywords": [
      "CBD",
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/IMG-20260210-WA0030-scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "1167@map-india.org",
    "name": "Song of the Ghetto",
    "startDate": "2026-02-14T17:30:00+05:30",
    "endDate": "2026-02-14T19:30:00+05:30",
    "description": "Join us for a theatre performance by Jangama Collective as part of our Inclusion Conference.\n\nArt looks at life through a framework. As it happens a lot of our lives fall outside of it, as does ‘Song of the Ghetto’ which is an unscripted, de-structured piece. The form and practice of theatre blossoms organically, responds to the times it is created in and takes its own unique form. Similarly this performance is a curation of vignettes that defies formal structure and brings to the fore a harmony of the culture that the performers embody. It is a retelling of their lives through song and storytelling; celebrating their lifestyles including the adversities they face.\n\nThis piece was created by the initiative of the Savithribai Phule Women’s Co-operative Group, Dingdur in collaboration with Jangama Collective, Bangalore and Guild of the Goat, New Delhi.\n\nಕಲೆಯು ಜೀವನವನ್ನು ಒಂದು ಚೌಕಟ್ಟಿನಿಂದ ನೋಡುತ್ತದೆ. ನಮ್ಮ ಜೀವನದ ಬಹುಪಾಲು 'ಕೇರಿ ಹಾಡು' ನಾಟಕದಂತೆ ಈ ಚೌಕಟ್ಟಿನ ಹೊರಗಿದೆ - ಇದೊಂದು ಸಾಮೂಹಿಕ ಪ್ರಜಾಪ್ರಭುತ್ವ ಪ್ರಕ್ರಿಯೆಯ ಮೂಲಕ ರೂಪುಗೊಂಡ ನಾಟಕ. ಇದರಲ್ಲಿ ರಂಗದ ಮೇಲೆ ಅಭಿನಯಿಸುವ ಕಲಾವಿದರ ನೈಜ ಜೀವನ ಅನುಭವಗಳು ಮತ್ತು ಕಥೆಗಳೇ ಅಡಕವಾಗಿವೆ. ರಂಗಭೂಮಿಯ ರೂಪ ಮತ್ತು ಅಭ್ಯಾಸ ನೈಸರ್ಗಿಕವಾಗಿ ಬೆಳೆಯುತ್ತದೆ, ತನ್ನ ಕಾಲಘಟ್ಟಕ್ಕೆ ಅನುಗುಣವಾಗಿ ಪ್ರತಿಕ್ರಿಯಿಸುತ್ತದೆ ಮತ್ತು ವಿಶಿಷ್ಟ ರೂಪ ಪಡೆಯುತ್ತದೆ. ಹಾಗೆಯೇ, ಈ ಪ್ರದರ್ಶನವೂ ಸಾಂಪ್ರದಾಯಿಕ ರಚನೆಯನ್ನು ಮೀರಿದ ಚಿತ್ರಣಗಳ ಸಂಕಲನವಾಗಿದ್ದು, ಕಲಾವಿದರ ಸಂಸ್ಕೃತಿಯ ಸಮಗ್ರತೆಯನ್ನು ಮುನ್ನೆಲೆಗೆ ತರುತ್ತದೆ. ಇದು ಅವರ ಬದುಕನ್ನು ಹಾಡು ಮತ್ತು ಕಥನಗಳ ಮೂಲಕ ಮರುಹೇಳುತ್ತಾ, ಅವರು ಎದುರಿಸುವ ಸವಾಲುಗಳೂ ಸೇರಿದಂತೆ ಅವರ ಜೀವನಶೈಲಿಯನ್ನು ಆಚರಿಸುತ್ತದೆ.\n\nಈ ಕಲಾಕೃತಿಯು ಸಾವಿತ್ರಿಬಾಯಿ ಫುಲೆ ಮಹಿಳಾ ಸಹಕಾರ ಸಂಘ, ದಿಂಡಗೂರು ಇವರ ಚಾಲನೆಯಲ್ಲಿ, ಜಂಗಮ ಕಲೆಕ್ಟಿವ್, ಬೆಂಗಳೂರು ಮತ್ತು ಗಿಲ್ಡ್ ಆಫ್ ದಿ ಗೋಟ್, ನವದೆಹಲಿ ಇವರ ಸಹಯೋಗದಿಂದ ರೂಪುಗೊಂಡಿದೆ.\nಹಿನ್ನೆಲೆ: ಬೆಂಗಳೂರಿನಿಂದ ಸುಮಾರು ೧೪೦ ಕಿಲೋಮೀಟರ್ ದೂರದಲ್ಲಿರುವ ದಿಂಡಗೂರು ಗ್ರಾಮವಿದೆ. ದೇಶದ ಇತರ ಹಲವು ಗ್ರಾಮಗಳಂತೆಯೇ, ಇಲ್ಲಿಯೂ ಊರ ಮಿತಿಯೊಳಗೆ ಒಂದು ಗಡಿ ಇದೆ - ಅದರಾಚೆಗೆ ದಲಿತರ ಕೇರಿ ಪ್ರಾರಂಭವಾಗುತ್ತದೆ. ಇತ್ತೀಚಿನವರೆಗೂ, \"ಅಸ್ಪೃಶ್ಯ\"ರೆಂದು ಪರಿಗಣಿಸಲ್ಪಟ್ಟ ಕಾರಣ ಕೇರಿಯ ಕುಟುಂಬಗಳಿಗೆ ಊರಿನ ದೇವಸ್ಥಾನಗಳಲ್ಲಿ ಅಥವಾ ಹೋಟೆಲುಗಳಲ್ಲಿ ಪ್ರವೇಶವಿರಲಿಲ್ಲ.\n\n೨೦೨೧ರಲ್ಲಿ, ಈ ಕುಟುಂಬಗಳು ಆಡಳಿತ ಯಂತ್ರಕ್ಕೆ ಮನವಿ ಸಲ್ಲಿಸಿ, ಸಾರ್ವಜನಿಕ ಸ್ಥಳಗಳು ಮತ್ತು ದೇವಾಲಯಗಳ ಮೇಲಿನ ತಮ್ಮ ಹಕ್ಕನ್ನು ಸ್ಥಾಪಿಸಲು ದೇವಸ್ಥಾನಗಳನ್ನು ಪ್ರವೇಶಿಸಿದರು. ಈ ಧೈರ್ಯದ ಕೃತ್ಯದಿಂದಾಗಿ ಅವರು ಕೆಲಸ ಕಳೆದುಕೊಂಡರು, ಏಕೆಂದರೆ ಬಹುತೇಕ ಉದ್ಯೋಗದಾತರು ಮೇಲ್ಜಾತಿಗೆ ಸೇರಿದವರಾಗಿದ್ದರು. ಆದರೆ ಈಗ ಈ ಕುಟುಂಬಗಳು ಸಾವಿತ್ರಿಬಾಯಿ ಫುಲೆ ಮಹಿಳಾ ಸಹಕಾರ ಸಂಘದ ಬೆಂಬಲ ಮತ್ತು ತರಬೇತಿಯಿಂದ ಅಣಬೆ ಕೃಷಿಯ ಮೂಲಕ ಸ್ವಾವಲಂಬಿಗಳಾಗಿದ್ದಾರೆ. \"ಕೇರಿ\"ಯ ಜನರ ಈ ಒಕ್ಕೂಟವು ತಮ್ಮ ಕಥೆಗಳನ್ನು ತಮ್ಮದೇ ಧ್ವನಿಯಲ್ಲಿ ಹೇಳಲು ನಿರ್ಧರಿಸಿತು",
    "url": "https://map-india.org/map-events/songs-of-the-ghetto/",
    "keywords": [
      "CBD",
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/Website-cover-images-new-2026-02-12T140314.684.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1164@map-india.org",
    "name": "Say it Like You Meme It",
    "startDate": "2026-02-15T11:00:00+05:30",
    "endDate": "2026-02-15T12:30:00+05:30",
    "description": "Dancing elephants and egg-women? Textile labels weren’t always serious.\n\nExplore the playful branding of 19th and 20th-century textile trade in our exhibition Ticket Tika Chaap. Join us for a meme-making session where we will provide you with materials and historical context, that you can turn into your own creative meme masterpiece!",
    "url": "https://map-india.org/map-events/say-it-like-you-meme-it-2/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/Website-Image-1440-x-810.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1161@map-india.org",
    "name": "Make Your Own Celestial Companion",
    "startDate": "2026-02-15T14:00:00+05:30",
    "endDate": "2026-02-15T16:00:00+05:30",
    "description": "Textile Label Depicting Performers in animal Masks, Unknown, Late 19th–early 20th century, Chromolithograph, POP.08434\nDesign your own mythical creature! Would it be part meerkat, part deer? Would it have wings or claws? In this hands-on workshop, you'll create your very own celestial companion inspired by the divine beings in our current exhibition, In Celestial Company.\n\nThe session begins with a walkthrough of the exhibition, where you'll meet Garuda, Mooshika, and other legendary creatures, before designing and crafting your own unique mythical friend.",
    "url": "https://map-india.org/map-events/make-your-own-celestial-companion/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/Website-cover-images-new-2026-02-10T153530.974.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1173@map-india.org",
    "name": "Hidden in Plain Sight: Clay Sculpture in South Asia",
    "startDate": "2026-02-24T18:00:00+05:30",
    "endDate": "2026-02-24T19:30:00+05:30",
    "description": "Image Credits: Alexander Burnes, Bamiyan Buddhas, print 1834\nAir-dried clay stands among South Asia’s oldest and most widely used mediums for sculpture, along with stone, metal, wood, and fired clay. Typically finished in vivid colour, the medium has been largely overlooked in studies of the region’s arts, often misidentified as stucco and terracotta, or sidelined as too breakable and exuberantly coloured to be “art”’.\n\nThis talk brings together some of the most prominent practices across the subcontinent to consider why painted, air-dried clay has been so valued as a medium for figural sculpture, and what its sidelining reveals about the study of art and visual culture.",
    "url": "https://map-india.org/map-events/hidden-in-plain-sight-clay-sculpture-in-south-asia/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/Website-cover-images-new-2026-02-13T112840.545.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1169@map-india.org",
    "name": "Learn ISL - Kochi Edition",
    "startDate": "2026-02-22T11:00:00+05:30",
    "endDate": "2026-02-22T12:00:00+05:30",
    "description": "Image Courtesy: Ali Monis Naqvi\nJoin us for a deaf-led Indian Sign Language workshop for both hearing and deaf audiences–this session will introduce you to basic signs for beginner-level communication, and in relation to the artworks that will surround you at the Dutch Warehouse. \n\nHardeep Singh from the MAP team will lead this introductory workshop, introducing signs inspired by afra eisma’s work and rooted in emotional worlds. Through sign language, the workshop explores how we can foster safety and connection when gathering for difficult conversations—finding ways to express without voice, using hands, facial expression, and body movement.\n\nThis workshop is held in conjunction with our exhibition, mild tooth of milk, currently on display at the Dutch Warehouse in Fort Kochi.\n\nThis series of programs is hosted in collaboration with the Kerala Museum.",
    "url": "https://map-india.org/map-events/learn-isl-kochi-edition/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/Website-cover-images-new-2026-02-12T093057.404.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1170@map-india.org",
    "name": "mild tooth of milk (ISL)",
    "startDate": "2026-02-22T15:00:00+05:30",
    "endDate": "2026-02-22T16:00:00+05:30",
    "description": "Image Courtesy: Ali Monis Naqvi\nJoin us for a special Indian Sign Language interpreted, Deaf-led guided walk of mild tooth of milk.\n\nLed by Hardeep Singh and Abiraami PS from the MAP team, this session centres on Deaf perspectives, with Indian Sign Language (ISL) as the primary language of engagement, offering a visual-first, inclusive approach to experiencing the exhibition.\n\nThe walkthrough invites us to slow down and experience touch, vulnerability, and connection. Through soft carpets, ceramics, and textiles, eisma creates a space that is both informal and charged with energy, encouraging us to play, gather, and heal.\n\nThis walkthrough is held in conjunction with our exhibition, mild tooth of milk, currently on display at the Dutch Warehouse in Fort Kochi. \n\nThis series of programs is hosted in collaboration with the Kerala Museum.",
    "url": "https://map-india.org/map-events/isl-walkthrough-mild-tooth-of-milk/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/Website-cover-images-new-2026-02-12T094331.091.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1166@map-india.org",
    "name": "The Great Tikat Hunt",
    "startDate": "2026-02-15T11:00:00+05:30",
    "endDate": "2026-02-15T17:00:00+05:30",
    "description": "It’s game time at Ticket Tika Chaap! Come and discover the art of Indo-British textile trademarks through riddles. This exhibition explores textile labels, known as tikats (tickets), tikas or chaaps, and their art-historical and commercial significance, as perhaps the earliest forms of branding and advertisement, in the 19th and 20th century global colonial market.\n\nIntricately designed, these labels carry nuanced stories within them. This is your chance to decode its narrative—the more clues you find, the closer you get to victory.",
    "url": "https://map-india.org/map-events/the-great-tikat-hunt-3/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/6.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "1163@map-india.org",
    "name": "The Archer in the Celestial Court",
    "startDate": "2026-02-15T17:00:00+05:30",
    "endDate": "2026-02-15T18:00:00+05:30",
    "description": "Bharatanatyam is often called the dance of the cosmic god Nataraja in common parlance, but a deeper look into history of the making of Bharatanatyam shows this narrative was engineered to erase the courtly origins of the dance form.\n\nNrithya Pillai's dance is about centering these erased hereditary histories—something she is a part of on account of her identity as being from these families whose performance was criminalised. The most common feature of “hereditary dance” is that the songs are themed around love, and if there is one mythological figure who occupied a significant place in Bharatanatyam repertoire it was the God of Desire—Manmatha, Maaran, Kama, Madhana.\n\nThis performance will showcase pieces from the hereditary repertoire that bring focus onto the themes of love, and the poetic beauty of the imagery of how Manmatha is portrayed in these love songs.",
    "url": "https://map-india.org/map-events/the-archer-in-the-celestial-court/",
    "keywords": [
      "CBD",
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/3.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1175@map-india.org",
    "name": "Recasting the Archive",
    "startDate": "2026-02-21T10:30:00+05:30",
    "endDate": "2026-02-22T17:00:00+05:30",
    "description": "This immersive, two-day workshop invites participants to intersect their artistic practice with the museum’s collection, using popular culture and horror film ephemera as a starting point. Participants will be introduced to a diverse selection of artworks from the collection and guided by Anusha Vikram and Aadithya S from our collections team, through various creative methodologies for developing new artistic responses, interpretations, and collaborative experiments.\n\nThrough discussions, hands-on exercises, and shared reflections, the workshop fosters a highly interactive and participatory environment. Participants will exchange ideas, present their practices, and work in teams to ideate and develop draft outputs across a range of formats.\n\nThis workshop is designed for art students and participants who are actively pursuing an artistic practice.",
    "url": "https://map-india.org/map-events/recasting-the-archive/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2021/01/1440-X-810-Widget-04.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "1172@map-india.org",
    "name": "Tinctures // According To The Tides",
    "startDate": "2026-02-20T18:00:00+05:30",
    "endDate": "2026-02-20T19:00:00+05:30",
    "description": "Image Credits: Tinctures\nLeading up to the release of their third album According To The Tides, the duo, Nishad Pandey (guitar) and Aman Mahajan (piano), perform in India this February—and we're thrilled to host them at MAP. \n\nCome experience the magic of their 2021 album, Heads and Tales, live alongside breathtaking improvisations that reveal the beautiful interplay between piano and guitar.",
    "url": "https://map-india.org/map-events/tinctures-according-to-the-tides/",
    "keywords": [
      "CBD",
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/Tinctures-at-Natakvalas-15-1-scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1168@map-india.org",
    "name": "Crochet Circle @ mild tooth of milk",
    "startDate": "2026-02-21T14:00:00+05:30",
    "endDate": "2026-02-21T17:00:00+05:30",
    "description": " Image Courtesy: Ali Monis Naqvi\nCrochet Circle is a community-based creative initiative by the Kerala Museum, Kochi.  Aiming to be inclusive and accessible, the programme invites individuals of all ages, abilities, and skill levels to explore the art of crochet. Created as a welcoming space for beginners, hobbyists, students, educators, and anyone seeking mindful group activities, it encourages creativity, learning, and connection through hands-on craft in a supportive environment.\n\nWith a focus on mindfulness, experimentation in materials and design, and adaptable teaching approaches, Crochet Circle prioritizes accessibility and participation at every level. The programme fosters a calm, encouraging atmosphere where participants can work at their own pace, express themselves freely, and build a sense of belonging and community through the shared joy of crocheting.\n\nThis programme is facilitated by and hosted in collaboration with the Kerala Museum.\n\nLimited spots available!\n\nThis workshop is held in conjunction with our exhibition, mild tooth of milk, currently on display at the Dutch Warehouse in Fort Kochi.",
    "url": "https://map-india.org/map-events/crochet-circle-mild-tooth-of-milk/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "location": {
      "@type": "Place",
      "name": "Fort Kochi  Dutch Warehouse  First Floor, Fort Kochi  Dutch Warehouse  First Floor, Kochi, Kerala, India"
    },
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/Ali-08357-1-scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1165@map-india.org",
    "name": "Ticket Tika Chaap",
    "startDate": "2026-02-15T15:00:00+05:30",
    "endDate": "2026-02-15T16:00:00+05:30",
    "description": "From dancing elephants and beloved deities to the surprising sight of steamships, textile labels showcased a variety of captivating imagery.\n\nTextile labels arrived in Indian markets in their thousands, stuck on yards upon yards of cotton fabric manufactured in the mills of Britain (and India), and sold in Indian and global markets. They wove desire, memory, and meaning into the act of purchase. Join us for a guided walk of  our exhibition, Ticket Tika Chaap, to explore these textile labels, their art-historical and commercial significance, as perhaps the earliest forms of branding and advertisement, in India.\n\n&nbsp;",
    "url": "https://map-india.org/map-events/ticket-tika-chaap-17/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/5.png"
  }
]