[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "901@map-india.org",
    "name": "Sketch with Penciljam",
    "startDate": "2025-06-22T10:30:00+05:30",
    "endDate": "2025-06-22T13:00:00+05:30",
    "description": "The Museum is your studio! For artists of all skill levels that find joy in observational sketching, we invite you to be a part of this creative and relaxed live sketching session with PencilJam. Set against the vibrant backdrop of MAP’s current exhibits, this session offers a blend of quiet observation and creative expression. \n\nWhether you're looking to unwind through sketching, discover new perspectives, or simply enjoy the act of creating in a shared environment, this is a chance to slow down and truly observe the world around you. Connect with fellow art lovers, exchange ideas, and share your own masterpiece in an informal setting that celebrates creativity in all its forms.\n\nYou’ll need to carry your own:\n\n-Sketchbook or A4 paper\n\n-Pencil (wood or mechanical) and eraser\n\n-Gel pens or fineliners for outlining\n\n-Colour brush pens, sketch pens, or colour pencils (no wet media)",
    "url": "https://map-india.org/map-events/sketch-with-penciljam-2/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-09T100756.847.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "913@map-india.org",
    "name": "Vaanyerum Vizhuthugal",
    "startDate": "2025-06-15T15:00:00+05:30",
    "endDate": "2025-06-15T16:00:00+05:30",
    "description": "Join us for a guided walk of our latest exhibition Vaanyerum Vizhuthugal: Roots that reach the sky.\n\nInitially exhibited as part of the Chennai Photo Biennale 2024-2025, this is the first group exhibition dedicated to contemporary photography and lens-based practices at MAP. Vaanyerum Vizhuthugal (translating to “Roots that Reach for the Sky”), curated by Jaisingh Nageswaran, brings together the works of twelve lens-based artists of Tamil origin who push the boundaries of photography and visual storytelling. \n\nThis will provide a richer understanding of their contributions to contemporary photography and the diverse narratives they present.\n\nThis exhibition is a project by Goethe-Institut Chennai and Chennai Photo Biennale.\nThe programming is in collaboration with the Goethe Institute/Max Mueller Bhavan Bangalore.",
    "url": "https://map-india.org/map-events/vaanyerum-vizhuthugal-9/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-13T112014.545.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "868@map-india.org",
    "name": "Training Course in Conservation of Photographs in Museums, Archives, and Collections",
    "startDate": "2025-06-16T09:00:00+05:30",
    "endDate": "2025-09-13T17:30:00+05:30",
    "description": "Don’t let history disappear–or discolour–or fade! Discover the science of photography conservation and learn the art of restoring historic photograph collections. This hands-on, intensive training course is designed for practising conservators, archivists and custodians of historic photograph collections to learn preventive collection care measures, remedial conservation processes, and restoration techniques.\n\nThis three month course will be followed by a one month internship. The course will be instructed by leading specialists from India and overseas and includes topics such as: \n\n -Development, materials and techniques of historic photographic processes\n\n -Identification and understanding of deterioration processes in photograph collections\n\n -Inspection and survey methodologies\n\n -Condition report preparation and preservation prioritisation decisions\n\n -Emergency treatment measures\n\n -Conservation of film and glass plate negatives\n\n -Conservation and restoration of photographs\n\n -Archival protocols of housing, display, and storage of photographic materials\n\n -Disaster management",
    "url": "https://map-india.org/map-events/training-course-in-conservation-of-photographs-in-museums-archives-and-collections/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-12T161452.615.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "908@map-india.org",
    "name": "Ink Narratives",
    "startDate": "2025-06-15T11:00:00+05:30",
    "endDate": "2025-06-15T14:00:00+05:30",
    "description": "Step into the serene world of ink drawing in this immersive workshop led by artist Rizwan. Inspired by the natural world around us, this session invites you to observe, feel, and translate nature’s quiet details onto paper using the expressive medium of ink.\n\nThis hands-on workshop is a chance to slow down, reconnect with your surroundings, and discover the beauty of nature through an artist’s eye.\n\nNo prior experience needed. All materials will be provided.\n\nCome as you are — and leave with your own nature-inspired ink artwork.\n\nImage credits: Untitled, Ink on paper, Gopal Ghose, 1913-1980, MAC.03037\n\nEntry to all exhibitions and digital experiences at the museum is free on the closing weekend of We don’t end at our edges (14 &amp; 15 June).",
    "url": "https://map-india.org/map-events/ink-narratives/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-cover-images-new-2025-06-09T164432.226.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "907@map-india.org",
    "name": "Meet the Artist",
    "startDate": "2025-06-15T16:00:00+05:30",
    "endDate": "2025-06-15T17:00:00+05:30",
    "description": "Join us for a guided walk of the exhibition We don’t end at our edges with the artist Ravikumar Kashi.\n\nWe don’t end at our edges is an immersive exhibition featuring artworks by Bengaluru-based artist, writer and educator Ravikumar Kashi. He uses paper to ‘paint’ letters from the Kannada alphabet, transforming language itself into a metaphor for the permeability of human connection, suggesting that while physical forms may fade, the bonds we share as individuals and as a community remain.\n\nThis event is followed by a meet and greet with the artist. \n\nEntry to all exhibitions and digital experiences at the museum is free on the closing weekend of We don’t end at our edges (14 &amp; 15 June, 2025).",
    "url": "https://map-india.org/map-events/artist-led-guided-walk-2/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-73.png"
  }
]