[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "901@map-india.org",
    "name": "Sketch with Penciljam",
    "startDate": "2025-06-22T10:30:00+05:30",
    "endDate": "2025-06-22T13:00:00+05:30",
    "description": "The Museum is your studio! For artists of all skill levels that find joy in observational sketching, we invite you to be a part of this creative and relaxed live sketching session with PencilJam. Set against the vibrant backdrop of MAP’s current exhibits, this session offers a blend of quiet observation and creative expression. \n\nWhether you're looking to unwind through sketching, discover new perspectives, or simply enjoy the act of creating in a shared environment, this is a chance to slow down and truly observe the world around you. Connect with fellow art lovers, exchange ideas, and share your own masterpiece in an informal setting that celebrates creativity in all its forms.\n\nYou’ll need to carry your own:\n\n-Sketchbook or A4 paper\n\n-Pencil (wood or mechanical) and eraser\n\n-Gel pens or fineliners for outlining\n\n-Colour brush pens, sketch pens, or colour pencils (no wet media)",
    "url": "https://map-india.org/map-events/sketch-with-penciljam-2/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-09T100756.847.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "868@map-india.org",
    "name": "Training Course in Conservation of Photographs in Museums, Archives, and Collections",
    "startDate": "2025-06-16T09:00:00+05:30",
    "endDate": "2025-09-13T17:30:00+05:30",
    "description": "Don’t let history disappear–or discolour–or fade! Discover the science of photography conservation and learn the art of restoring historic photograph collections. This hands-on, intensive training course is designed for practising conservators, archivists and custodians of historic photograph collections to learn preventive collection care measures, remedial conservation processes, and restoration techniques.\n\nThis three month course will be followed by a one month internship. The course will be instructed by leading specialists from India and overseas and includes topics such as: \n\n -Development, materials and techniques of historic photographic processes\n\n -Identification and understanding of deterioration processes in photograph collections\n\n -Inspection and survey methodologies\n\n -Condition report preparation and preservation prioritisation decisions\n\n -Emergency treatment measures\n\n -Conservation of film and glass plate negatives\n\n -Conservation and restoration of photographs\n\n -Archival protocols of housing, display, and storage of photographic materials\n\n -Disaster management",
    "url": "https://map-india.org/map-events/training-course-in-conservation-of-photographs-in-museums-archives-and-collections/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-12T161452.615.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "913@map-india.org",
    "name": "Vaanyerum Vizhuthugal",
    "startDate": "2025-06-15T15:00:00+05:30",
    "endDate": "2025-06-15T16:00:00+05:30",
    "description": "Join us for a guided walk of our latest exhibition Vaanyerum Vizhuthugal: Roots that reach the sky.\n\nInitially exhibited as part of the Chennai Photo Biennale 2024-2025, this is the first group exhibition dedicated to contemporary photography and lens-based practices at MAP. Vaanyerum Vizhuthugal (translating to “Roots that Reach for the Sky”), curated by Jaisingh Nageswaran, brings together the works of twelve lens-based artists of Tamil origin who push the boundaries of photography and visual storytelling. \n\nThis will provide a richer understanding of their contributions to contemporary photography and the diverse narratives they present.\n\nThis exhibition is a project by Goethe-Institut Chennai and Chennai Photo Biennale.\nThe programming is in collaboration with the Goethe Institute/Max Mueller Bhavan Bangalore.",
    "url": "https://map-india.org/map-events/vaanyerum-vizhuthugal-9/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-13T112014.545.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "907@map-india.org",
    "name": "Meet the Artist",
    "startDate": "2025-06-15T16:00:00+05:30",
    "endDate": "2025-06-15T17:00:00+05:30",
    "description": "Join us for a guided walk of the exhibition We don’t end at our edges with the artist Ravikumar Kashi.\n\nWe don’t end at our edges is an immersive exhibition featuring artworks by Bengaluru-based artist, writer and educator Ravikumar Kashi. He uses paper to ‘paint’ letters from the Kannada alphabet, transforming language itself into a metaphor for the permeability of human connection, suggesting that while physical forms may fade, the bonds we share as individuals and as a community remain.\n\nThis event is followed by a meet and greet with the artist. \n\nEntry to all exhibitions and digital experiences at the museum is free on the closing weekend of We don’t end at our edges (14 &amp; 15 June, 2025).",
    "url": "https://map-india.org/map-events/artist-led-guided-walk-2/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-73.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "906@map-india.org",
    "name": "Artist + Curator led Guided Walk",
    "startDate": "2025-06-14T16:00:00+05:30",
    "endDate": "2025-06-14T17:00:00+05:30",
    "description": "Join us for a guided walk of the exhibition We don’t end at our edges with the artist Ravikumar Kashi and curator Khushi Bansal. \n\nWe don’t end at our edges is an immersive exhibition featuring artworks by Bengaluru-based artist, writer and educator Ravikumar Kashi. He uses paper to ‘paint’ letters from the Kannada alphabet, transforming language itself into a metaphor for the permeability of human connection, suggesting that while physical forms may fade, the bonds we share as individuals and as a community remain.\n\nThis event is followed by a meet and greet with the artist. \n\nEntry to all exhibitions and digital experiences at the museum is free on the closing weekend of We don’t end at our edges (14 &amp; 15 June, 2025).",
    "url": "https://map-india.org/map-events/artist-curator-led-guided-walk-2/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Khushi-Guided-Walk-event.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "900@map-india.org",
    "name": "Kavya Sanje - An Evening of Kannada poetry",
    "startDate": "2025-06-14T18:00:00+05:30",
    "endDate": "2025-06-14T19:00:00+05:30",
    "description": "Kavya Sanje (poetry evening) presents an evocative evening of poetry celebrating young voices in Kannada literature. Featuring emerging poets who explore themes of identity, resistance, love, and belonging, this gathering creates a space where language, rhythm, and emotion meet. \n\nPoets of the evening:\n\nRumi Harish, Chandini, Bharath Savitri Diwakar, Manini, Shreenidhi Prahlad, Dileep Shivgouri, Haajira Khanum.\n\nJoin us for an intimate evening of spoken word that resonates with the spirit of the exhibition, We don’t end at our edges—pushing boundaries, reclaiming space, and celebrating expression.\n\nImage credits: Awaiting the Lover’s arrival, A folio from a Satsai by the poet Matiram, late 18th century, Opaque watercolour, gold, silver, and ink on paper, Datia, Bundelkhand, India, Pre-Modern Art, PTG.00639",
    "url": "https://map-india.org/map-events/kavya-sanje-an-evening-of-kannada-poetry/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-cover-images-new-2025-06-03T124058.742.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "912@map-india.org",
    "name": "Ticket Tika Chaap",
    "startDate": "2025-06-14T16:00:00+05:30",
    "endDate": "2025-06-14T17:00:00+05:30",
    "description": "From dancing elephants and beloved deities to the surprising sight of steamships, textile labels showcased a variety of captivating imagery.\n\nTextile labels arrived in Indian markets in their thousands, stuck on yards upon yards of cotton fabric manufactured in the mills of Britain (and India), and sold in Indian and global markets. They wove desire, memory, and meaning into the act of purchase. \n\nOur latest exhibition, Ticket Tika Chaap, explores these textile labels, known as tikats (tickets), tikas or chaaps, and their art-historical and commercial significance, as perhaps the earliest forms of branding and advertisement, in India.\n\nJoin us for a guided walk of this exhibition.",
    "url": "https://map-india.org/map-events/ticket-tika-chaap-15/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-92.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "908@map-india.org",
    "name": "Ink Narratives",
    "startDate": "2025-06-15T11:00:00+05:30",
    "endDate": "2025-06-15T14:00:00+05:30",
    "description": "Step into the serene world of ink drawing in this immersive workshop led by artist Rizwan. Inspired by the natural world around us, this session invites you to observe, feel, and translate nature’s quiet details onto paper using the expressive medium of ink.\n\nThis hands-on workshop is a chance to slow down, reconnect with your surroundings, and discover the beauty of nature through an artist’s eye.\n\nNo prior experience needed. All materials will be provided.\n\nCome as you are — and leave with your own nature-inspired ink artwork.\n\nImage credits: Untitled, Ink on paper, Gopal Ghose, 1913-1980, MAC.03037\n\nEntry to all exhibitions and digital experiences at the museum is free on the closing weekend of We don’t end at our edges (14 &amp; 15 June).",
    "url": "https://map-india.org/map-events/ink-narratives/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-cover-images-new-2025-06-09T164432.226.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "905@map-india.org",
    "name": "Molkarin",
    "startDate": "2025-06-14T16:30:00+05:30",
    "endDate": "2025-06-14T17:30:00+05:30",
    "description": "Join us for a screening of Molkarin (1981) by the film collective Yugantar. The screening will be followed by a conversation between Deepa Dhanraj, independent documentary filmmaker and co-founder of Yugantar, and Geeta Menon, co-founder of Stree Jagruti Samiti—an organisation based in Bangalore that works with domestic workers to advocate for their labour rights and employment benefits.\n\nMolkarin exposes the oppressive working conditions of thousands of domestic workers in Pune. Through re-enactments of significant moments of the original process of unionising, the film narrates the coming together of women workers and union activists to form the Pune Shahar Molkarin Sanghatana (Pune City Domestic Workers Union) to fight for their rights. Their unionising process, reflections on their work conditions and the myriad new questions raised that went beyond issues of work and payment drew the attention of many. Feminist activists from different backgrounds were inspired, joined and supported the struggle. \n\nThe Yugantar collective, too, recognised this as a moment that allowed deeper explorations of feminist consciousness across class and caste. As Yugantar’s first film, Molkarin inaugurates the group’s focus on the power of processes of collectivisation, through gathering on the streets, spontaneous strike actions, organised assemblies and long meetings - sitting together sharing experiences, debating, strategising, arguing and laughing. Domestic workers, mainly Dalit and rural migrants to the city, reflect on their low payment, their lack of security and the normalised humiliating behaviour of their employers, exposing also the participation of middle-class women in working-class women’s oppression.\n\nThis film is part of the programme for Naam Mera Kaam ka Nahi, a digital story from the series Frames of Struggle: Tracing a Movement, a collaboration between the Museum of Art &amp; Photography (MAP) and Zubaan that activates the Poster Women archive.\n\nImage Credit: Navroze Contractor",
    "url": "https://map-india.org/map-events/molkarin/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Molkarin"
    },
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-cover-images-new-2025-06-09T162503.685.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "911@map-india.org",
    "name": "VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection",
    "startDate": "2025-06-14T13:00:00+05:30",
    "endDate": "2025-06-14T14:00:00+05:30",
    "description": "Join us on a guided walk of the exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.  Featuring over 130 diverse artworks, this exhibition redefines the portrayal of women in art through sculptures, textiles, paintings, and photographs. that challenge traditional notions of femininity and gender as social constructs.  \n\nDivided into four sections—Goddess and Mortal, Sexuality and Desire, Power and Violence, Struggle and Resistance—the exhibition highlights themes of sacrifice, desire, aggression, and empowerment.\n\nIn this guided walk, you will have the unique opportunity to engage with groundbreaking perspectives and compelling stories that provoke reflection and dialogue about women’s lives and the spaces they occupy in the Indian subcontinent. Don’t miss this opportunity to explore the intersection of art, gender, and history.\n\n&nbsp;\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/visible-invisible-representation-of-women-in-art-through-the-map-collection-27/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/12/VIV-website-banner-2.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "904@map-india.org",
    "name": "Naam Mera Kaam ka Nahi",
    "startDate": "2025-06-14T16:00:00+05:30",
    "endDate": "2025-06-14T16:30:00+05:30",
    "description": "How has the invisible labour of women been made visible over the past four decades? \n\nWomen’s reproductive, emotional and care labour as well as productive labour at home, on the farm, and in the factory continue to be unacknowledged, uncounted and underpaid. Alongside the demand to recognise women’s work in the household, feminists challenged the rigid sexual division of labour, especially within the home. The third digital story of MAP’s collaboration with Zubaan’s Poster Women archive, titled Naam Mera Kaam ka Nahi (No Name for My Work), is centred around the processes by which women’s movements in India were shaped through the on-ground mobilisation of working-class and middle-class women. \n\nJoin us for a guided walk of  Naam Mera Kaam ka Nahi, a digital story, led by curator Laxmi Murthy, where she takes you through this selection of posters looking at women’s labour. \n\nThis is the third digital story from the series Frames of Struggle: Tracing a Movement, a collaboration between the Museum of Art &amp; Photography (MAP) and Zubaan that activates the Poster Women archive.\n\nImage Courtesy: Poster Women archive, Zubaan",
    "url": "https://map-india.org/map-events/naam-mera-kaam-ka-nahi/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-cover-images-new-2025-06-09T161953.048.png"
  }
]