[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "638@map-india.org",
    "name": "Written in Dance",
    "startDate": "2024-12-05T18:30:00+05:30",
    "endDate": "2024-12-05T19:30:00+05:30",
    "description": "How do the arts inspire and illuminate each other? Discover the answer to this question through an engaging conversation with acclaimed author Shoba Narayan and celebrated dancer Madhu Nataraj as they both delve into the dynamic intersections of art and dance. Exploring the syncretic magic that emerges from the cross-illumination of the arts, this discussion will reveal how the spacio-temporality of dance becomes a canvas for collaborations, sparking innovations in art, literature, and beyond.\n\nShoba Narayan, a James Beard Award-winning author and journalist, brings her deep insights from three decades of storytelling, global lecturing, and creative ventures. Madhu Nataraj, known for her groundbreaking choreography and interdisciplinary work, adds a dancer’s perspective to this creative dialogue. Together, they illuminate the threads that weave art forms together across time and space.\n\nMAP is delighted to be a part of BLR Hubba 2024, a city-wide arts and culture festival.\n\n",
    "url": "https://map-india.org/map-events/written-in-dance-2/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/11/Website-Image-1440-x-810-33.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "637@map-india.org",
    "name": "Physical Poetry",
    "startDate": "2024-12-03T19:00:00+05:30",
    "endDate": "2024-12-03T20:00:00+05:30",
    "description": "Have you ever wondered what poetry would look like if it could transcend words and take form as sculptures? Jaume Plensa, the celebrated visual artist and sculptor, invites you to explore this unique concept through his remarkable works. From Dream (2009) to the Crown Fountain (2004) and Together (2015), Plensa's creations transform physical and visual art into a language of poetry—art that speaks volumes about itself without words.  \n\nJoin us for a special evening at MAP to meet and hear from Jaume Plensa, whose work is seen in museums and public spaces across the world from installations in London and New York to Taipei and Dubai. Discover what drives his practice, his approach to art and the role he imagines it plays in the world.\n\n&nbsp;\n\nMAP is delighted to be a part of BLR Hubba 2024, a city-wide arts and culture festival.\n\n\n\n&nbsp;",
    "url": "https://map-india.org/map-events/physical-poetry/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/11/Physical-poetry-website-banner-.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "639@map-india.org",
    "name": "Louis Kahn's Tiger City",
    "startDate": "2025-01-25T17:00:00+05:30",
    "endDate": "2025-01-25T19:30:00+05:30",
    "description": "Join us for the screening of Louis Kahn’s Tiger City in conjunction with the exhibition Eckart Muthesius and Manik Bagh: Pioneering Modernism in India curated by Raffael Dedo Gadebusch, travelling from the Museum of Asian Art, Berlin. In this film, art historian and filmmaker Sundaram Tagore retraces the footsteps of architect Louis Kahn,  uncovering how he built the iconic and monumental parliamentary complex in war-torn Bangladesh. \n\nBuilt for the Maharaja of Indore, Yashwant Rao Holkar II, Manik Bagh (or the ‘Gem Garden’) was a residential palace designed by his friend and architect Eckart Muthesius. The exhibition marks a first in a series of shows planned on architecture, focusing on plural interpretations on the idea of “home” through 3 exhibitions planned through 2025-2026. \n\nThe screening will feature an introduction by the director, Sundaram Tagore, and conclude with a Q&amp;A session with the audience.",
    "url": "https://map-india.org/map-events/louis-kahns-tiger-city/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Louis Kahn's Tiger City"
    },
    "image": "https://map-india.org/wp-content/uploads/2024/11/jan-25-website-banner-.png"
  }
]