[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "956@map-india.org",
    "name": "Traces and Threads of Personal Archives",
    "startDate": "2025-07-19T11:00:00+05:30",
    "endDate": "2025-07-19T14:00:00+05:30",
    "description": "Image Credits: Untitled (Seated Portrait of Three Siblings), Suresh Punjabi, India, 1985-1986, Celluloid negative, PHY.12217\n\nDo you have a photograph of your grandparents you can’t stop looking at? A coin that was passed down to you? A handwritten letter from a loved one?\n\nBring an object (letter, photograph, etc) and join us for a discussion on how to care for, and preserve them. Then, participate in a fun exercise and a mapping session where we exchange stories and memories inspired by each object. Facilitated by our summer interns, Jyestha and Rihana, this session starts with a walkthrough of our Sasken digital exhibition, Museum of Memories.\n\nDo note: Please do not bring hazardous or high-risk objects.\n\nThis session is conducted as part of our engagements for the MAP Youth Collective. The MAP Youth Collective is a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.",
    "url": "https://map-india.org/map-events/traces-and-threads-of-personal-archives/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "pa",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-Image-1440-x-810-15-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "953@map-india.org",
    "name": "Petite Fille/‘Little Girl’",
    "startDate": "2025-07-13T13:30:00+05:30",
    "endDate": "2025-07-13T15:30:00+05:30",
    "description": "Image Credits: IF Cinema\n\n\"When I grow up, I’ll be a girl.\" — Sasha\n\nSasha, a 7-year-old boy who has lived as a little girl since the age of 3, stands at the heart of Petite Fille, Sébastien Lifshitz’s intimate and unflinching portrait of identity in transition. Through Sasha’s daily life and the fierce love of his mother Karine, the film traces a family's emotional journey against the tide of societal misunderstanding. With gentle observation and unwavering empathy, the film reveals the courage it takes to be seen — and to be loved — as who you truly are.\n\nThe film screening will be followed by a discussion facilitated by artist Nat Francis.\n\nThis event is in collaboration with the Alliance Française Bangalore and part of their series ‘Femme: Beneath the surface’, which aims to spotlight an emerging generation of French storytellers, each dissecting characters that embody the idea of a woman – layered, disoriented and probing.\n\nSet against the backdrop of contemporary France – where questions of class, identity, and belonging remain urgent and unresolved – these films trace the quiet resistance and raw introspection of women thrown into complex situations.\nThis film is in French with English subtitles\n\nThis session is conducted as part of our engagements for the MAP Youth Collective. The MAP Youth Collective is a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.",
    "url": "https://map-india.org/map-events/petite-fille-little-girl/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Petite Fille/‘Little Girl’"
    },
    "subtitleLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-Image-1440-x-810-12-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "949@map-india.org",
    "name": "Draw with PencilJam",
    "startDate": "2025-07-20T10:30:00+05:30",
    "endDate": "2025-07-20T13:00:00+05:30",
    "description": "If you find joy in drawing intricate patterns or practicing observational sketching, we invite you to be part of this relaxed and inspiring session. Set against the backdrop of the museum’s vibrant exhibits, this gathering offers an open, creative space for artists of all skill levels. Whether you're looking to unwind through sketching, discover new perspectives, or simply enjoy the act of drawing in a shared environment, this is a chance to slow down and truly observe the world around you. Connect with fellow art lovers, exchange ideas, and share your work in an informal, supportive setting that celebrates creativity in all its forms.\n\nYou will need to carry your own:\n- Sketchbook or A4 paper\n- Pencil (wood or mechanical) and eraser\n- Gel pens or fineliners for outlining\n- Colour brush pens, sketch pens, or colour pencils (no wet media)",
    "url": "https://map-india.org/map-events/draw-with-penciljam/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-Image-1440-x-810-13.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "950@map-india.org",
    "name": "Maadathy - An Unfairy Tale",
    "startDate": "2025-07-20T16:00:00+05:30",
    "endDate": "2025-07-20T18:00:00+05:30",
    "description": "India is a land of Subaltern deities, where each deity has a unique legend and these legends are often interwoven with socio-historic tropes of India.\n\nThe Puthirai vannaar  are a Dalit caste group known as the 'unseeable', in southern India. Their forced-occupation is to wash the clothes of other Dalits, the dead, and menstruating women. This film explores the tale of a young girl who grew up in the Puthirai vannaar caste group and how she came to be immortalised as their local deity, Maadathy.\n\nDo note: This is a Tamil language film and is subtitled in English.",
    "url": "https://map-india.org/map-events/maadathy-an-unfairy-tale/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "ta",
    "workPresented": {
      "@type": "Movie",
      "name": "Maadathy - An Unfairy Tale"
    },
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-Image-1440-x-810-14.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "962@map-india.org",
    "name": "Led by Curator",
    "startDate": "2025-07-27T16:00:00+05:30",
    "endDate": "2025-07-27T17:00:00+05:30",
    "description": "Join Arnika Ahldag, Director-Exhibitions &amp; Curation at MAP, as she takes you through a guided walk of our newest exhibition, Shape of a Thought: Letters from Ram Kumar. An artist who felt deeply, Ram Kumar was shaped by the world around him. From an economist, to a writer, to an artist — his methods of expression were as layered and manifold as the emotions his art inspires.\n\nWe invite you to come, linger, and contemplate through the mesmerising artworks of one of India’s most renowned modernists on the occasion of his centenary year.",
    "url": "https://map-india.org/map-events/led-by-curator/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/5-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "958@map-india.org",
    "name": "Shape of a Thought: Letters from Ram Kumar in ISL",
    "startDate": "2025-07-26T11:00:00+05:30",
    "endDate": "2025-07-26T12:00:00+05:30",
    "description": "Join us for a special Indian Sign Language interpreted walkthrough of Shape of a Thought: Letters from Ram Kumar. The exhibition invites visitors to pause and reflect, observe and be inspired. Come on a journey of introspection through the mesmerising artworks and evocative letters of Ram Kumar, one of India’s most renowned modernists on the occasion of his centenary year.\n\nThe exhibition is accompanied by two activities that create a deeper engagement with the art on display. The Writing Table gives audiences a chance to write a letter to themselves, loved ones, strangers, or even a city through a set of prompts. Family Label facilitates an exploration of abstract art by allowing visitors to look at artworks and creating a label on what they think the artwork means, or what they see or feel when faced with an abstract artwork.\n\nShape of a Thought also features the film ‘The Spaces in Between’ by Naveed Mulki. The film explores letter exchanges between Ram Kumar and his friend and the many conversations they have on life, art and the world.",
    "url": "https://map-india.org/map-events/shape-of-a-thought-letters-from-ram-kumar/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/1-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "946@map-india.org",
    "name": "Putul Katha",
    "startDate": "2025-07-05T10:00:00+05:30",
    "endDate": "2025-07-13T10:00:00+05:30",
    "description": "Enter a world steeped in tradition, shaped by a craft that dates back thousands of years!\n\nPutul Katha is a special showcase that invites audiences to explore the practice of doll-making in West Bengal and the cultural heritage of this unique art form. While the display mainly highlights one-of-a-kind hand-pressed clay dolls and some other variations, the region has had a rich history of dolls being made from almost every natural material —from seeds, leaves and wood, to metal, glass, fabric, and more. The makers’ of these artefacts were not just limited to individual artists, but included families and even entire villages or communities, each with their own creative expression and heritage.\n\nKnown as putul in Bengali, these dolls not only serve as objects of play, worship and decoration, but also as bearers of stories. They carry their makers’ beliefs, histories, cultural knowledge and reflections of their everyday lives.\n\nJoin us to discover the unique history of these objects and the rich stories they tell.\n\nPutul Katha is accompanied by the following events:\n- Clay Doll-Making with Sunderbans Doll Artists\n- Maati Katha (Earth Stories) – An Object &amp; Material Theatre Performance\n\nThis showcase is based on ongoing research by the Tram Arts Trust on the stories surrounding the doll arts of West Bengal.",
    "url": "https://map-india.org/map-events/putul-katha/",
    "keywords": [
      "MAP",
      "Showcase"
    ],
    "inLanguage": "bn",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-Image-1440-x-810-10.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "948@map-india.org",
    "name": "Ticket Tika Chaap",
    "startDate": "2025-07-15T16:30:00+05:30",
    "endDate": "2025-07-15T17:30:00+05:30",
    "description": "From dancing elephants and beloved deities, to steamships and radiators, textile labels showcased a variety of captivating imagery. These labels arrived in Indian markets in the thousands, stuck on yards upon yards of cotton fabric manufactured in the mills of Britain (and India), and sold in Indian and global markets. They wove desire, memory, and meaning into the act of purchase.\n\nThe exhibition, Ticket Tika Chaap, explores these textile labels known as tikats (tickets), tikas or chaaps, and their art-historical and commercial significance, as perhaps the earliest forms of branding and advertisement, in India.\n\nPlease note: This guided walk, will be conducted in Kannada by Rajesh from the MAP Team.\n\n&nbsp;",
    "url": "https://map-india.org/map-events/ticket-tika-chaap-16/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-Image-1440-x-810-17.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "960@map-india.org",
    "name": "Descriptive Label-Making",
    "startDate": "2025-07-26T14:00:00+05:30",
    "endDate": "2025-07-26T16:00:00+05:30",
    "description": "Ram Kumar’s abstract forms are rooted in emotion, memory, and his journey as one of India’s foremost modernists. They offer a canvas not just to look, but to feel and imagine. This label-making workshop invites you to bridge the distance between artwork and viewer, fostering a personal dialogue with his art.\n\nCome and uncover the layered meanings within abstraction. Join us for a journey of observation, reflection and creative expression.\n\n&nbsp;",
    "url": "https://map-india.org/map-events/descriptive-label-making/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/3-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "961@map-india.org",
    "name": "Led by MAP Founder",
    "startDate": "2025-07-27T11:00:00+05:30",
    "endDate": "2025-07-27T12:00:00+05:30",
    "description": "Join us for a special walkthrough of Shape of a Thought: Letters from Ram Kumar led by MAP’s Founder, Abhishek Poddar. In this reflective walkthrough, he shares personal insights into the life and work of Ram Kumar, drawing from his own close relationship with the artist.\n\nCome and discover how Ram Kumar’s evocative letters and stirring paintings come together in the exhibition, and how his legacy lives on.",
    "url": "https://map-india.org/map-events/led-by-map-founder/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/4-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "954@map-india.org",
    "name": "Paper Mixtapes",
    "startDate": "2025-07-13T15:00:00+05:30",
    "endDate": "2025-07-13T17:00:00+05:30",
    "description": "Image Credits: Vivek Shetty\n\nLed by Steevez, the workshop blends music, memory, and identity into a 16-page book. Using MAP’s digital collections as raw material, along with your own digital content, you can design and bind your own “mixtape”—on paper.\n\nThe workshop draws from Steevez’s own practice, especially his photobook Last Seen, which reimagines the form of a photograph through digital remnants—emails, Facebook chats, and Orkut messages exchanged with his late father. The book becomes both a personal archive and a meditation on how we hold onto relationships in the digital age. Music, among other inspirations, plays a key role in shaping this narrative.\n\nThis session is conducted as part of our engagements for the MAP Youth Collective. The MAP Youth Collective is a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.\n\nThis event is in conjunction with Pulse: MAP’s online quarterly journal. Pulse, as part of MAP’s Youth Engagement Initiatives, serves as a digital collaborative platform for young voices wherein young, creative minds share their work and practice. Entries are now open for Vol. V: Soundscapes.",
    "url": "https://map-india.org/map-events/paper-mixtapes/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-Image-1440-x-810-13-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "951@map-india.org",
    "name": "Reclaiming Rest: A Workshop on the Politics of Care and Resistance",
    "startDate": "2025-07-13T11:00:00+05:30",
    "endDate": "2025-07-13T14:00:00+05:30",
    "description": "Have we ever truly seen our mothers rest? Why does their labour so often go unnoticed? How do acts of care and resistance shape the lives of women across generations?\n\nJoin us for a workshop that holds space to explore these questions, the politics of rest, and everyday resistance. Through collaborative exercises and open dialogue, we will share experiences, reimagine dominant narratives, and reflect on the invisible labour that sustains communities. Together, we will examine the role of community and feminist solidarity in fostering connection and inspiring collective action.\n\nThe session includes a walkthrough of the Sasken digital exhibition, Mindscapes: In the company of others.\n\n&nbsp;",
    "url": "https://map-india.org/map-events/reclaiming-rest-a-workshop-on-the-politics-of-care-and-resistance/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-Image-1440-x-810-15.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "947@map-india.org",
    "name": "As Nature Intended: Improv Theatre Workshop",
    "startDate": "2025-07-13T11:00:00+05:30",
    "endDate": "2025-07-13T14:00:00+05:30",
    "description": "Image Credits: Rajesh PI\n\nThis workshop, facilitated by Anshul Jhambani, offers an immersive journey into improvisational theatre, specially designed for the LGBTQIA+ community members. Theatre is built on many elements, but at its core lies the actor’s greatest resources: Their own body, voice, and imagination.\n\nExplore how storytelling and improvisation come alive, not just through words, but through gestures, expressions, and movement. This experience nudges the boundaries of observation and emotional response, inviting us to transform true stories into spontaneous performances. Come, play with us, and discover the many ways we see ourselves reflected in art and in each other.\n\nThis workshop is presented in conjunction with MAP’s ongoing exhibition, VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.\n\nThis workshop is the second in the series, Responding to Art through the Arts.\n\nThis session is conducted as part of our engagements for the MAP Youth Collective. The MAP Youth Collective is a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.",
    "url": "https://map-india.org/map-events/as-nature-intended-improv-theatre-workshop/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-Image-1440-x-810-11.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "959@map-india.org",
    "name": "Shape of a Thought: Letters from Ram Kumar with Curator",
    "startDate": "2025-07-26T16:00:00+05:30",
    "endDate": "2025-07-26T17:00:00+05:30",
    "description": "Led by Priya Chauhan, curator of Shape of a Thought: Letters from Ram Kumar, this guided walk gives audiences a peek into the curatorial process of the exhibition. Join us to gain a deep understanding of the artist and his journey to becoming one of India’s most iconic modernist voices\n\nThe exhibition invites visitors to pause and reflect, observe and be inspired. Experience the profound inner world of Ram Kumar, as we mark the centenary this extraordinary artist.",
    "url": "https://map-india.org/map-events/shape-of-a-thought-letters-from-ram-kumar-with-curator/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/2-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "944@map-india.org",
    "name": "From Archive to Activism: Queer & Trans* Cultural Work",
    "startDate": "2025-07-13T17:00:00+05:30",
    "endDate": "2025-07-13T19:00:00+05:30",
    "description": "Image Credits: Sorting through the Queer Legal Collection at Queer Archive for Memory, Reflection, and Activism (QAMRA), Bengaluru. Image courtesy of Marc Ohrem-Leclef (2018).\n\nThis event brings community organisers, academics, and activists together in conversation about how the worlds of queer-and-trans community-building, knowledge production and information dissemination, and progressive social change, intersect. The panelists share a unique connection with QAMRA (Queer Archive for Memory, Reflection, and Activism), an autonomous community archive at the National Law School of India University in Bengaluru. Through their lightning talks and a moderated roundtable, they will reflect on the past, present, and future of queer and trans* cultural organising, involving distinct forms of resistance and joy.\n\n*(*) In Trans acknowledges the diversity of gender identities and expressions beyond the binary, reflecting the inclusive scope of this conversation.",
    "url": "https://map-india.org/map-events/from-archive-to-activism-queer-trans-cultural-work/",
    "keywords": [
      "MAP",
      "Panel Discussion"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-Image-1440-x-810-7.png"
  }
]