[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "756@map-india.org",
    "name": "Up Close & Centre",
    "startDate": "2025-03-01T17:00:00+05:30",
    "endDate": "2025-03-01T17:30:00+05:30",
    "description": "It's the last week to visit our exhibition Chay Reds, Ferrous Black! Don’t miss this opportunity to visit the exhibition that reveals the untold stories of Indian textiles found in Sri Lanka. \n\nPriya Lewis from the collections team will be speaking about her favourite palampores and motifs featured in them. She will also cover the role of the collections team in curating an exhibition.",
    "url": "https://map-india.org/map-events/up-close-centre-12/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-42.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "758@map-india.org",
    "name": "Rites of Algorithms",
    "startDate": "2025-03-02T11:00:00+05:30",
    "endDate": "2025-03-02T12:00:00+05:30",
    "description": "In this workshop, Mara Oscar Cassiani invites participants to engage in a collective experience that merges digital and physical realms, exploring how algorithms typically used to shape online content and interactions can be repurposed as prompts for rituals to create moments of shared reflection and connection.\n\nAt the heart of the workshop is a series of gifs and memes created by the artist herself, and presented as tarot cards inspired by ritual female archetypes—universal symbols that evoke shared narratives and collective identities. These digital elements act as catalysts for group rituals that move fluidly between augmented reality and real-life interactions. \n\nThe workshop draws on Mara Oscar Cassiani’s research into 'expanded rituals'—rituals that emerge from the algorithmic bubbles shaping our online experiences. These bubbles generate personalised digital environments through suggested content. The artist explores how traditional rituals, often linked to specific cultural and social practices, are being reshaped and influenced by these algorithmic currents on the internet.\n\nThis workshop offers a participatory experience where digital art and ritual converge, revealing how technology shapes our shared human stories. Participants will explore how algorithmic influences extend beyond the screen, evolving into tangible and communal practices.\n\nNotes for the participants: The workshop involves light physical activity. Please wear comfortable sneakers and sportswear, and bring a mat to sit on if desired.",
    "url": "https://map-india.org/map-events/rites-of-algorithms/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-44.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "755@map-india.org",
    "name": "Digital Art Dialogues: A conversation with artists Mara Oscar Cassiani and Ginevra Petrozzi",
    "startDate": "2025-02-27T18:30:00+05:30",
    "endDate": "2025-02-27T19:30:00+05:30",
    "description": "Join us for a presentation and discussion with Italian artists Mara Oscar Cassiani (MOC) and Ginevra Petrozzi, currently artists in residence in Bangalore as part of Silicon Plateau— a research project and publishing series edited by Marialaura Ghidini and Tara Kelton. \n\nThe event will begin with an overview of the project, followed by presentations by the artists on their creative practices. It will also explore the theme of Silicon Plateau’s forthcoming Volume 3: exploring the intersections of technology, magic and ritual, and how folklore and cultural traditions can challenge dominant digital narratives, inspiring alternative pathways for human–algorithm collaboration.\n\nThrough distinct approaches, Cassiani and Petrozzi engage with digital cultures, alternative perspectives and the role of technology in shaping contemporary society. Petrozzi focuses on themes of care, the future and algorithmic governance. Embracing the role of a “digital witch,” she reimagines mysticism and the occult within the context of technology and politics. Cassiani, working across performance, choreography, digital media and club culture, explores the margins of both online and offline worlds. She examines how digital platforms shape collective experience and reflects on the loss of local identity in an increasingly globalised age. \n\nJoin us as each artist draws upon ritual, myth and digital aesthetics to question our relationship with technology and envision new possibilities for our shared realities.\n\nImage credits: Tara Kelton\n\nThis event and the artist-in-residence programme are supported by The Consulate General of Italy in Bengaluru.\n\n\n\n&nbsp;",
    "url": "https://map-india.org/map-events/silicon-plateau-a-conversation-with-artists-mara-oscar-cassiani-and-ginevra-petrozzi/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-45.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "757@map-india.org",
    "name": "Nostalgia for the Future",
    "startDate": "2025-03-02T15:00:00+05:30",
    "endDate": "2025-03-02T17:00:00+05:30",
    "description": "Join us for a compelling screening and discussion that delves into the utopian ideals shaping post-independence India. \n\nNostalgia for the Future (2017) by Avijit Mukul Kishore and Rohan Shivkumar is a film essay exploring Indian modernity, citizenship, and the architecture of homes over a century. Weaving together 16mm and digital footage, archival propaganda films, and mainstream cinema, the film examines four iconic spaces—the royal palace in Baroda, Le Corbusier’s Villa Shodhan, Sabarmati Ashram, and Delhi’s public housing—reflecting on the aspirations and contradictions of a nation.\n\nAcclaimed at Documenta 14, Sharjah Architecture Triennial, and the Chicago Architecture Biennial, the film won Best Documentary (IDSFFK, 2017) and Best Experimental Documentary (Signs Festival, 2018).\n\nFollowing the screening, the filmmakers will be in conversation with Ashish Rajadhyaksha, discussing the intersections of cinema, memory, and built environments.\n\nThis film is part of the Eckart Muthesius and Manik Bagh exhibition programming.",
    "url": "https://map-india.org/map-events/nostalgia-for-the-future/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Nostalgia for the Future"
    },
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-43.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "754@map-india.org",
    "name": "Handpainting kalamkari",
    "startDate": "2025-03-01T11:00:00+05:30",
    "endDate": "2025-03-01T14:00:00+05:30",
    "description": "Discover the ancient art of Kalamkari with master artist K. Siva Prasad Reddy, in this hands-on workshop presented by MeMeraki. Join us to celebrate the closing weekend of Chay Reds, Ferrous Black  and immerse yourself in the vibrant tradition of this art form.  Learn the basics of Kalamkari motifs, practice sketching and painting with traditional bamboo pens, and create your own unique piece.  \n\nSiva Prasad Reddy will guide you through the process, from initial sketches to the final vibrant colours, including a demonstration of the crucial boiling technique.  He will also share insights on how to recognise authentic Kalamkari and offer tips for continued practice.  The workshop ends with a Q&amp;A session with the artist.\n\nImage credits: Krishna with Cows Kalamkari Painting by Siva Reddy\n\n",
    "url": "https://map-india.org/map-events/handpainting-kalamkari/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-38.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "759@map-india.org",
    "name": "POV: Time To Influence Your Targeted Ads",
    "startDate": "2025-03-02T13:00:00+05:30",
    "endDate": "2025-03-02T14:00:00+05:30",
    "description": "Are your devices listening to you? This question, while often dismissed as an urban myth, has deeply influenced how we perceive and interact with algorithmic systems. The artist uses this ambiguity as a starting point for a collective experiment in which participants are encouraged to disrupt their phones’ usual flow of suggested content, rewriting their algorithmic realities to explore new narratives and potential futures.\n\nIn this workshop, artist and social designer Ginevra Petrozzi invites participants to explore the intersection of magical thinking and surveillance technologies. She draws inspiration from Italy’s folkloric traditions and heritage, reviving knowledge that was preserved in secret and passed down clandestinely through generations of women. \n\nCentral to the workshop is the collaborative creation of a \"Perfect Futures\" script—an exercise in crafting counter-narratives that stand in contrast to the prepackaged stories curated by our devices. Participants will work with Petrozzi to transform these scripts into a form of digital enchantment, playfully subverting the predictive logic of algorithms through whispered incantations. The workshop will culminate in a collective performance, where the \"Perfect Futures\" are recited as a “spell” into participants’ devices, mirroring a popular TikTok trend that involves whispering keywords and phrases into an unguarded phone to influence its algorithm.\n\nIn this participatory experience, the artist encourages participants to rethink their relationship with technology, experimenting with the idea that language and intention might hold the power to enchant not only the digital sphere but also our collective futures.",
    "url": "https://map-india.org/map-events/pov-time-to-influence-your-targeted-ads/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/02/2-7.png"
  }
]