[
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "1065@map-india.org",
    "name": "Laal Aasmaan, Hara Gulaab, Neeli Dharti",
    "startDate": "2025-11-02T17:30:00+05:30",
    "endDate": "2025-11-02T18:30:00+05:30",
    "description": "Fragments of unfinished verses swirl in an orbit, finding their way to each other, bewitched. They dance for a while, hand in hand, and then drop to the ground- to catch a breath, a smile, a moment in time; to sit together. Content. Then they get up to dance again before they say their goodbyes.\n\nImages from the past, present and future, all collide to construct wild imaginations. Colors form, hide and show. Pass through images, like shadows of clouds. Fleeting. They meet each other in dark alleys, and kiss, and melt. Like a flirt with the mysticism of cinema.\n\nUsing two 16mm projectors with a live projectionist-performer, this performance explores visual juxtapositions and photochemical experiments, blending theatre, mechanics, and chemistry into a playful exploration of what film can be.\n\nPerformed by Karan Suri Talwar\nMusic by Baan\n\nHarkat Crew for Sound and Additional Visuals: Tanvi Chitre, Keyuri Bhogale \nOriginally devised with Namrata and Simran, Harkat Lab.",
    "url": "https://map-india.org/map-events/laal-aasmaan-hara-gulaab-neeli-dharti/",
    "keywords": [
      "CBD",
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/Website-cover-images-new-22.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1062@map-india.org",
    "name": "Found Footage Film Workshop",
    "startDate": "2025-11-01T10:00:00+05:30",
    "endDate": "2025-11-01T17:00:00+05:30",
    "description": "Work hands-on with 16mm film in this tactile exploration of analog cinema. Using found footage as your raw material, you'll learn to cut, splice, and manipulate existing imagery to create something entirely new.\n\nThis workshop introduces fundamental analog techniques—from physical film editing to creative projection methods—while exploring how appropriation and abstraction can breathe new life into archival images. You'll experiment with projection as both a screening method and a creative tool in its own right.\n\nThe workshop culminates in a collaborative expanded cinema performance, where all participants will present their collective 16mm work.\n\nThis workshop is part of Collection (film ephemera) programming",
    "url": "https://map-india.org/map-events/found-footage-film-workshop/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/Website-cover-images-new-19.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1058@map-india.org",
    "name": "Scents of Memory",
    "startDate": "2025-10-25T17:00:00+05:30",
    "endDate": "2025-10-25T18:30:00+05:30",
    "description": "In this session of Reader’s Bloc, we’ll explore two texts—The Book of Everlasting Things by Aanchal Malhotra and Smell by Radhika Jha—both exploring smell as not just a sense, but as a conduit for memory, love, identity and belonging. \n\nMalhotra’s The Book of Everlasting Things follows a perfume maker in pre-partition India, where different scents become the legacy passed through generations, carrying with it familial love and a lot of history; while Jha’s Smell, tells the story of a young brown woman who navigates identity and alienation in postcolonial, diasporic France. \n\nThis session is conducted as part of our engagements for the MAP Youth Collective. The Collective is a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.",
    "url": "https://map-india.org/map-events/scents-of-memory/",
    "keywords": [
      "CBD",
      "MAP",
      "Youth Engagement"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/Website-cover-images-new-14.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1064@map-india.org",
    "name": "Odissi Odyssey",
    "startDate": "2025-11-02T16:00:00+05:30",
    "endDate": "2025-11-02T18:00:00+05:30",
    "description": "Let celestial stories move through you. Join Surupa Sen from Nrityagram as she guides you through the processional movements of Odissi, where mythology and motion become one.\n\nThis programme is in conjunction with the exhibition In Celestial Company.\n\nFacilitated by arts practitioners, Responding to Art through the Arts aims to activate our galleries through a series of workshops that hold space for young people’s personal and creative responses to artworks on display.",
    "url": "https://map-india.org/map-events/odissi-odyssey/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/Website-cover-images-new-21.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1061@map-india.org",
    "name": "Shape of a Thought: Letters from Ram Kumar",
    "startDate": "2025-10-25T16:15:00+05:30",
    "endDate": "2025-10-25T17:00:00+05:30",
    "description": "This guided walk of the exhibition Shape of a Thought: Letters from Ram Kumar, gives audiences a peek into the making of the exhibition. Join us to gain a deep understanding of the artist and his journey to becoming one of India’s most iconic modernist voices\n\nThe exhibition invites visitors to pause and reflect, observe and be inspired. Experience the profound inner world of Ram Kumar, as we mark the centenary this extraordinary artist.",
    "url": "https://map-india.org/map-events/shape-of-a-thought-letters-from-ram-kumar-2/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/DSC09453-1-e1759128755566.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1057@map-india.org",
    "name": "Memory Maps",
    "startDate": "2025-10-25T10:30:00+05:30",
    "endDate": "2025-10-25T16:30:00+05:30",
    "description": "Inspired by Ram Kumar’s works and the city of Bangalore, this workshop reflects on personal and collective memories - exploring themes of belonging, migration and the urban experience.\n\nLed by Arzu Mistry and Aliyeh Rizvi, co-founders of The Memory Maps Project, this interactive workshop invites you to create your own personal Map of Memories. Following a walkthrough of the exhibition - Ram Kumar and You, participants will be guided to reflect, share, map and draw their responses to the city.\n\nThis performance is in conjunction with the exhibition Shape of a Thought: Letters from Ram Kumar.",
    "url": "https://map-india.org/map-events/memory-maps/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/08/Website-cover-images-new-2.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1054@map-india.org",
    "name": "The Art of Language",
    "startDate": "2025-10-24T17:00:00+05:30",
    "endDate": "2025-10-24T18:00:00+05:30",
    "description": "Poet, playwright, and academic Mamta Sagar joins Arundhati Ghosh for an intimate conversation on poetry, translation, and the intersections of word and image. Exploring her creative process and her forays into visual art, Mamta reflects on how language transforms into texture, rhythm, and form, offering audiences a rare glimpse into the evolving journey of her work.\n\nThis talk is in collaboration with Ananya Dhrishya.",
    "url": "https://map-india.org/map-events/the-art-of-language/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/Website-cover-images-new-12.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1063@map-india.org",
    "name": "Hand-drawn Film Workshop",
    "startDate": "2025-11-02T10:00:00+05:30",
    "endDate": "2025-11-02T14:00:00+05:30",
    "description": "The possibilities of cinema are endless, and one of the most liberating roads one can take is to make moving images without cameras, lenses, or editing programs.\n\nWe invite you to step into a world where you interact with the materiality of film directly—where images are made using craft materials, plants, and photochemistry. In this workshop, you will get hands-on knowledge of tinting and toning film, scratching and frame-by-frame animation, phytograms, collage-making with film, and more.\n\nWatch your short creations on a 16mm projector and take home a little souvenir!\n\nThis workshop is part of Collection (film ephemera) programming",
    "url": "https://map-india.org/map-events/hand-drawn-film-workshop/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/Website-cover-images-new-20.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1059@map-india.org",
    "name": "Make at MAP",
    "startDate": "2025-10-26T11:30:00+05:30",
    "endDate": "2025-10-26T15:30:00+05:30",
    "description": "Boo! Did we scare you—Good! This Halloween-themed Make at MAP session is all about facing your fears. Taking cues from classic Bollywood horror film posters, create your very own poster starring your deepest fears.\n\nMake @ MAP is a series that allows you to explore our collection in an engaging and hands-on manner. These sessions allow you to create and take home a special souvenir of your visit. It is perfect for all ages — so bring your friends and family and get ready to make some art! No experience is necessary, just a willingness to have fun and experiment with new materials.",
    "url": "https://map-india.org/map-events/make-at-map-4/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/Website-cover-images-new-17.png"
  }
]