[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1110@map-india.org",
    "name": "Beyond Headcount Diversity - MAP's 3rd Inclusion Conference, 2026",
    "startDate": "2026-02-14T09:00:00+05:30",
    "endDate": "2026-02-14T18:30:00+05:30",
    "description": "Click here for the schedule.\n\nIf we imagine inclusion in the arts and cultural sector as a landscape we have been mapping intuitively—sometimes through deliberation and by asking important questions such as: Did we do our best to make access equal for all? Did we push through collaboratively? Did we slow down to listen and evolve? And when did we realise that the map itself needed to be redrawn?\n\nThe Inclusion Conference has always been MAP’s attempt to ask these questions openly. What began in 2023 as a gathering to think about accessibility in cultural organisations, has grown into an annual space where practitioners, educators, activists, artists, and community leaders convene to reflect on inclusive practices that shape the art &amp; cultural spaces. Not merely as a value, but also a practice informed by the unique perspectives of historically marginalised and underrepresented communities.\n\nYear after year, MAP’s Inclusion conference has examined these questions from different vantage points: First, through the lens of funding, then through the systems and structures that enable or restrict those opportunities. In this third edition, we turn our attention to measurement not as a checkbox, but as a way of understanding whether our intentions translate into meaningful change.\n\nTo explore this, the conference brings together voices who work at the intersections of justice, care, community organising, and cultural practice:\n- Through fireside conversations, we unpack how identities shape our understanding of culture and belonging.\n- Workshops guide participants through nuances of recognising unconscious bias, navigating conflict, and cinema poster politics of caste and gender.\n- Case study labs offer a closer look at community-led art &amp; cultural collectives, accessible practice, multilingual engagement, and grassroots education, urging us to reflect on what works, and what must evolve.\n\nThrough the day, participants are encouraged to question their assumptions and biases, as well as rethink and reimagine their roles. The conference culminates with a performance rooted in lived histories at the margins, through a Song of Ghetto by Jangama Collective.\n\nMAP’s aim is to continuously evolve, learn and bring forth innovative, inclusive practices. This conference is a gathering of those who believe that cultural spaces can be more inclusive, more imaginative, and more equitable and those who are willing to walk the talk of shaping that future together.\n\nThis year’s MAP’s 3rd Inclusion conference, Beyond Headcount Diversity at MAP is supported by:\n\n&nbsp;\n\n\n\n&nbsp;\n\nMAP’s Accessibility Partner \n\n\n\n&nbsp;\n\nInclusion Conference 2023\n\nInclusion Conference 2024",
    "url": "https://map-india.org/map-events/inclusion-conference-2026-beyond-headcount-diversity/",
    "keywords": [
      "CBD",
      "Conferences",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/12/BHDC_1440X810.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1152@map-india.org",
    "name": "Fotobook Shāla",
    "startDate": "2026-02-07T14:30:00+05:30",
    "endDate": "2026-02-07T17:30:00+05:30",
    "description": "The Fotobook Shāla is a community reading room designed as a space for slow reading, shared inquiry and open conversation. A small selection of titles from Asia and beyond are presented thematically by artist Aparna Nori, inviting participants to encounter the books with care, engage with the tactility and material presence of books, identify resonances and reflect on regional solidarities. \n\nIn this iteration of the reading room, Aparna turns to the photobook as a site of the personal, bringing together a small curation of ten photobooks by artists from across Asia. Responding to the ongoing exhibition at MAP, Beneath the Turning Sky, this selection of visual narratives draws attention to intimate, everyday experiences that unfold beneath moments of social, political, and generational change. ",
    "url": "https://map-india.org/map-events/fotobook-shala/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/01/Website-cover-images-new-2026-01-27T094537.573.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1151@map-india.org",
    "name": "Family Day - Fourth Edition",
    "startDate": "2026-02-08T10:00:00+05:30",
    "endDate": "2026-02-08T17:30:00+05:30",
    "description": "Sunday, Fun Day, Family Day—A day at the museum where families can play board games, get messy making clay pots, experience immersive art, and more.\n\nThe year has just begun, and we're celebrating with events the whole family will love. Join us for the fourth edition of Family Day and kick off 2026 with joy, laughter, and creativity!\n\n&nbsp;\n\nLong, long ago... (Open for all age groups)\n\n10:00 AM - 02:30 PM\n\nBangalore Storytelling Society are taking us across time to different lands through stories that bring the museum artworks to life.\n\n&nbsp;\n\nShells Out, Game On (Open for all age groups)\n\n10:00 AM - 12:00 PM\n\nReady for an energetic morning of aata with Kavade? Re-live your childhood memories and start new traditions with young ones with ancient board games open for all ages.\n\n&nbsp;\n\nPottery (5+)\n\n11:00 AM - 01:00 PM\n\nGet creative. Get messy. Make pots with Lokesh, the potter, and take home your masterpiece made with clay.\n\n&nbsp;\n\nPurr-Fect Pages! (8+)\n\n11:30 AM - 12:30 PM (Session 1)\n\n02:00 PM - 03:00 PM (Session 2)\n\nCreate a handmade zine using your own cat tales with Samyukta Rao’s help.\n\n&nbsp;\n\nThe Great Tikat Hunt (8-16)\n\n10:00 AM - 03:00 PM\n\nUnleash your inner detective as you embark on a thrilling quest to find hidden clues scattered throughout the Ticket Tika Chaap exhibition. Are you ready to take on the challenge? Let the hunt begin!\n\n&nbsp;\n\nScavenger Hunt: Museum-Wide Adventure! (8-16)\n\n12:00 PM - 03:00 PM\n\nTurn the museum into your playground with our lively scavenger hunt! Perfect for all ages, this adventure will lead you through galleries and hidden corners using clever clues and fun challenges.\n\n&nbsp;\n\nImmersive Experiences (Open for all age groups)\n\n01:00 PM - 02:00 PM (Session 1)\n\n04:30 PM - 05:30 PM (Session 2)\n\nExperience the immersive, digital experiences at the museum. Step into a painting, interact with MF Hussain, or turn your favourite image into an engaging digital artwork!\n\n&nbsp;\n\nArt Through Touch (6+)\n\n12:00 PM - 01:30 PM\n\nLet the child(ren) create an animal or bird using craft and their imagination. In this workshop facilitated by Poongodi Mathiarasu, children will make hands-on work inspired by Beneath the Turning Sky.\n\n&nbsp;\n\nInteraction with Play (5+)\n\n02:00 PM - 03:30 PM\n\nYou and your children can become climate heroes! Work together on this thrilling board game and find more about the themes in our latest exhibition Beneath the Turning Sky. Who knows, this might just inspire the next generation of climate leaders! This is facilitated by Ujjvala.\n\n&nbsp;\n\nSirocco and the Kingdom of Winds\n\n02:00 PM - 03:30 PM\n\nSisters Juliette and Carmen discover a secret passage to the Kingdom of Air Currents, where they are transformed into cats, separated and must summon their bravery to unite. Watch this film as a family.\n\n&nbsp;\n\nBag Dancing (Open for all age groups)\n\n03:30 PM - 04:30 PM\n\nBag Dancing is a touching, funny, and quietly powerful play about two unlikely companions on the margins of society. It is a celebration of resilience, memory, and the human capacity for joy, even in the most precarious of lives.\n\n&nbsp;\n\nPause &amp; Play (Open for all age groups)\n\n10:00 AM - 02:00 PM\n\nTake a minute to pause and re-energise! Whether you like unleashing your creativity through finger painting or enjoying a pleasant surprise, there's something for you to take home!\n\n&nbsp;\n\nFood Court &amp;  Dining (Open for all age groups)\n\n12:00 PM - 04:00 PM\n\nRest and recoup with an array of healthy and kid-friendly food and drink options.\n\n&nbsp;\n\nPlease note that some events have limited capacity per session. Here is a list of FAQS for the queries you may have.",
    "url": "https://map-india.org/map-events/family-day-fourth-edition/",
    "keywords": [
      "CBD",
      "Kids & Family",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/01/Website-cover-images-new-2026-01-29T103134.027.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1156@map-india.org",
    "name": "Celestial Companions of Kadu Malleshwara Temple",
    "startDate": "2026-02-07T07:00:00+05:30",
    "endDate": "2026-02-07T08:30:00+05:30",
    "description": "Join author and mythology buff Roopa Pai on a walk around the Kadu Malleshwara temple in Malleswaram, and other temples in the vicinity, to engage with the ubiquitous visual imagery and fascinating stories of the animals that walk, fly and crawl with the gods.\n\nSo many gods and goddesses are so closely associated with the animals that are their constant companions, that it is almost impossible for anyone interested in mythology to separate one from the other. For millennia, these celestial companions have been written into literature, celebrated in music and dance, and carved into the walls of temples and homes. Some even have entire shrines to themselves!\n\nThis is part of the programming for the exhibition In Celestial Company.",
    "url": "https://map-india.org/map-events/celestial-companions-of-kadu-malleshwara-temple/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/11/ICC-InstallViews_web-8-scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1153@map-india.org",
    "name": "Make your own Cat-icature!",
    "startDate": "2026-02-07T11:30:00+05:30",
    "endDate": "2026-02-07T15:30:00+05:30",
    "description": "Artwork by Priyankar Gupta\nJoin artist and lecturer Priyankar Gupta for a zine-making workshop inspired by ‘The Political Cat’ in the exhibition, The Many Lives of the Cat. Explore how art and satire merge to reimagine the cat as a keen observer of society and its many contradictions.",
    "url": "https://map-india.org/map-events/make-your-own-cat-icature/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/01/Untitled-design-1-1.png"
  }
]