[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "825@map-india.org",
    "name": "Printmaker's Perspective: Ticket Tika Chaap",
    "startDate": "2025-04-27T17:30:00+05:30",
    "endDate": "2025-04-27T18:00:00+05:30",
    "description": "From dancing elephants and beloved deities, to the surprising sight of steamships, textile labels showcased a variety of captivating imagery.\n\nTextile labels arrived in Indian markets in the thousands, stuck on yards upon yards of cotton fabric manufactured in the mills of Britain (and India), and sold in Indian and global markets. They wove desire, memory, and meaning into the act of purchase. \n\nOur latest exhibition, Ticket Tika Chaap, explores these textile labels, and their art-historical and commercial significance, as perhaps the earliest forms of branding and advertisement, in India. Join us for an exciting walkthrough of Ticket, Tika, Chaap with artist and printmaker Jayasimha Chandrasekhar where he shares his unique insights as a printmaker. This will be followed by an in-depth presentation on the same.",
    "url": "https://map-india.org/map-events/printmakers-perspective-ticket-tika-chaap/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-81.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "837@map-india.org",
    "name": "Talk to Me",
    "startDate": "2025-04-26T18:30:00+05:30",
    "endDate": "2025-04-26T19:30:00+05:30",
    "description": "How do we connect beyond words? Talk to Me is a devised performance using Indian Sign Language, text, images, and silences to discover ways of meaningful interaction. It brings together a deaf performer with non-sign language artists from various fields, including filmmaking, painting, and design, to craft a language beyond speech.\n\nIt blends personal, playful pop culture elements, examining the diverse ways we communicate our stories. At a time where words are excessively used as rhetoric by authoritarian figures, this show asks if we can find a more humane, collective voice.\n\nCredits:\n\nConceived and directed by: Anuja Ghosalkar\nCreated and performed by: Amaldev PR, Bhavana Rajendran, Gavati Wad, Nidhi Mariam Jacob\nAssistant Direction: Gavati Wad\nTechnical Design: Aliasger Dhariwala\nLight Design: Vikrant Thakar\nLight Execution: Akshay Khaire\n\nThis performance is part of the Beyond Theory: Continuing the Work conference happening on 25th and 26th April.",
    "url": "https://map-india.org/map-events/talk-to-me/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Talk-to-me-2.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "849@map-india.org",
    "name": "Ticket Tika Chaap",
    "startDate": "2025-04-26T16:00:00+05:30",
    "endDate": "2025-04-26T17:00:00+05:30",
    "description": "From dancing elephants and beloved deities to the surprising sight of steamships, textile labels showcased a variety of captivating imagery.\n\nTextile labels arrived in Indian markets in their thousands, stuck on yards upon yards of cotton fabric manufactured in the mills of Britain (and India), and sold in Indian and global markets. They wove desire, memory, and meaning into the act of purchase. \n\nJoin us for a guided walk of our latest exhibition, Ticket Tika Chaap, which explores these textile labels, known as tikats (tickets), tikas or chaaps, and their art-historical and commercial significance, as perhaps the earliest forms of branding and advertisement, in India.\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/ticket-tika-chaap-9/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/03/Website-cover-images-new-62.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "850@map-india.org",
    "name": "We don’t end at our edges",
    "startDate": "2025-04-27T13:00:00+05:30",
    "endDate": "2025-04-27T14:00:00+05:30",
    "description": "Join us for a guided walk of our exhibition We don’t end at our edges. It is an immersive exhibition featuring artworks by Bengaluru-based artist, writer and educator Ravikumar Kashi. He uses paper to ‘paint’ letters from the Kannada alphabet, transforming language itself into a metaphor for the permeability of human connection, suggesting that while physical forms may fade, the bonds we share as individuals and as a community remain.\n\n&nbsp;",
    "url": "https://map-india.org/map-events/we-dont-end-at-our-edges-9/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/03/5-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "846@map-india.org",
    "name": "Age of Panic/La Bataille de Solférino",
    "startDate": "2025-04-27T15:00:00+05:30",
    "endDate": "2025-04-27T17:00:00+05:30",
    "description": "Do you sometimes feel like everything is happening all at once and there’s no better way to describe it other than absolute chaos? That's how Laetitia felt on 6 May 2012, the day of the second round of the French presidential election. Join us for a film screening of Age of Panic/La Bataille de Solférino, a french comedy film directed by Justine Triet. The film is about a frazzled young mother who navigates the homefront during a pivotal moment in French politics. This screening will be followed by a discussion.\n\nThis film is in collaboration with the Alliance Francaise Bangalore and part of our series Femme: Beneath the surface, which aims to spotlight an emerging generation of French storytellers, each dissecting characters that embody the idea of the woman - layered, disoriented and probing. Set against the backdrop of contemporary France - where questions of class, identity, and belonging remain urgent and unresolved - these films trace the quiet resistance and raw introspection of women thrown into complex situations. This series aims to engage with younger audiences who see through facades, question structure, and crave stories that don’t look away from the fractures beneath the surface.\n\nThis film will be screened in French with English subtitles.",
    "url": "https://map-india.org/map-events/age-of-panic-la-bataille-de-solferino/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Age of Panic/La Bataille de Solférino"
    },
    "subtitleLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-98.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "824@map-india.org",
    "name": "Poetry in Stone: Ticket Tika Chaap",
    "startDate": "2025-04-27T18:00:00+05:30",
    "endDate": "2025-04-27T18:30:00+05:30",
    "description": "Following the Printmaker’s Perspective, a guided walk led by artist Jayasimha Chandrasekhar, there will be an in-depth presentation on printmaking and its relevance in textile labels. In 'Poetry in Stone,' you will learn about the printing technique of chromolithography and discover the inherent artistry that brought these colorful designs to life.\n\nThis event is in relation to our exhibition, Ticket Tika Chaap: The Art of the Trademark in Indo-British Textile Trade.",
    "url": "https://map-india.org/map-events/poetry-in-stone-ticket-tika-chaap/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-94.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "852@map-india.org",
    "name": "Vaanyerum Vizhuthugal",
    "startDate": "2025-04-27T16:00:00+05:30",
    "endDate": "2025-04-27T17:00:00+05:30",
    "description": "Join us for a guided walk of Vaanyerum Vizhuthugal: Roots that Reach for the Sky. \n\nInitially exhibited as part of the Chennai Photo Biennale 2024-2025, for MAP this is the first ever group exhibition dedicated to contemporary photography and lens-based practices. Vaanyerum Vizhuthugal (translating to “Roots that Reach for the Sky”), curated by Jaisingh Nageswaran, brings together the works of twelve lens-based artists of Tamil origin who push the boundaries of photography and visual storytelling.\n\nThis exhibition is a project by Goethe-Institut Chennai and Chennai Photo Biennale. \n\nThe programming is in collaboration with the Goethe Institute/Max Mueller Bhavan Bangalore.\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/vaanyerum-vizhuthugal-3/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-96.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "848@map-india.org",
    "name": "VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection",
    "startDate": "2025-04-26T13:00:00+05:30",
    "endDate": "2025-04-26T14:00:00+05:30",
    "description": "Join us on a guided walk of the exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.  Featuring over 130 diverse artworks, this exhibition redefines the portrayal of women in art through sculptures, textiles, paintings, and photographs. that challenge traditional notions of femininity and gender as social constructs.  \n\nDivided into four sections—Goddess and Mortal, Sexuality and Desire, Power and Violence, Struggle and Resistance—the exhibition highlights themes of sacrifice, desire, aggression, and empowerment.\n\nIn this guided walk, you will have the unique opportunity to engage with groundbreaking perspectives and compelling stories that provoke reflection and dialogue about women’s lives and the spaces they occupy in the Indian subcontinent. Don’t miss this opportunity to explore the intersection of art, gender, and history.\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/visible-invisible-representation-of-women-in-art-through-the-map-collection-23/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/01/viv-ucc-website.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "845@map-india.org",
    "name": "Make at MAP",
    "startDate": "2025-04-27T11:30:00+05:30",
    "endDate": "2025-04-27T15:30:00+05:30",
    "description": "Many of us have seen the captivating art of kalamkari as familiar motifs on a dupatta or saree or the prints adorning a pencil pouch. Learn more about this ancient art form and create your own kalamkari souvenir to take home with you.\n\nPlease note that this is a drop-in session with no registration required. There will be two sessions for the same: 11:30 AM – 1:00 PM and 2:00 PM – 3:30 PM.",
    "url": "https://map-india.org/map-events/make-at-map-19/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-95.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "823@map-india.org",
    "name": "How to Dream a Rasa Machine",
    "startDate": "2025-04-27T16:30:00+05:30",
    "endDate": "2025-04-27T18:00:00+05:30",
    "description": "An immersive techno-ritual unlike any other. Join us for a performance by Dominique Savitri Bonarjee as she presents \"How to Dream a Rasa Machine,\" a sensuous journey into sound, movement, and the subtle energies of our world. Structured as an electrifying jam session, blending electronic and acoustic textures with embodied dance, this performance is deeply inspired by the intricacies of Indian rasa. At its heart lies a handcrafted copper sound suit, a revolutionary instrument that translates the performer’s every motion and environmental nuances – gravity, air, humidity – into a rich sonic landscape.\n\nIn Indian aesthetics, rasa refers to the spiritual pleasure of deep immersion in experience. Here, the audience encounters rasa through the sensuous materiality of the instrument, and a spectral soundscape that induces a collective dream-space. \n\nThis is followed by ‘Butoh, as Heard by a Dancer’, book presentation.",
    "url": "https://map-india.org/map-events/how-to-dream-a-rasa-machine/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-80.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "838@map-india.org",
    "name": "How to Make and Mend a Keepsake",
    "startDate": "2025-04-26T14:30:00+05:30",
    "endDate": "2025-04-26T16:00:00+05:30",
    "description": "A sharing and making session with sisters Hawa, Maryam, and Heela, as they walk us through the journey of starting Anar Studio—followed by an embroidery lesson to make or mend a personal keepsake.\n\nPlease note: Limited places available, please register to save your spot.\n\nThis workshop is part of the Beyond Theory: Continuing the Work conference happening on 25th and 26th April.",
    "url": "https://map-india.org/map-events/how-to-make-and-mend-a-keepsake/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-91.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "807@map-india.org",
    "name": "Beyond Theory: Continuing the Work",
    "startDate": "2025-04-25T10:00:00+05:30",
    "endDate": "2025-04-26T18:00:00+05:30",
    "description": "“By walking, you make the path ... ”\n–Antonio Machado\n\nIf we imagine our work in the arts as a path we have charted—sometimes in silos and other times together—what moments would we mark as those of great momentum, as roadblocks, as drudgery, and as breathers?\n\nThe Beyond Theory conference, hosted in conjunction with the exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection, was conceptualised as an annual gathering of artists and art workers who employ a feminist lens in practising, curating, organising and more. Here, employing a feminist lens means that their practices expose power hierarchies framed by factors including but not limited to gender– like caste, race, sex, sexuality and more.\n\nThe first iteration of the conference looked at practice and the second at the infrastructure that enabled those practices. Each panel in both the conferences could stand alone, but was bound by a common way of seeing and understanding–how can feminist practices help carve out a less precarious, sustainable and just sector for us? How has it done it before in pockets and niches? How does it continue to do it and how could we scale or replicate it in meaningful ways?\n\nFor the concluding conference, we want to take stock of where we are. Reflecting on the three years of work and conversations we have had under the conference and the permanent exhibition, this year’s iteration will be a sweep–its aim, not to mark success but to be honest about the lay of the land. Since speaking of various concerns–of representation, of precarity, of a crisis of care, of lack of funding, of impunity, of inaccessibility, and exclusion–on a micro level, at this conference, and on a macro level, at many more forums–what have been the shifts and silences that have gotten us here –for better or for worse?\n\nAs we mark the last year of the exhibition, we want to gather artists, art workers, writers, academics and institutions to reflect on the evolution of their work in the sector, speak to each other regarding doubt, success and failure and look back at the blueprints of our work.\n\nFor any queries, please reach out to visible@map-india.org\n\nPlease note: This conference is free to attend. Registration is required for participation.\n\nYou can download a copy of the programme schedule here.\n\n&nbsp;\n\n\nProgramme Schedule\n\n\n\nFriday, April 25, 2025\n&nbsp;\n\n\n\n\n10:00 am–10:05 am Welcome Address by Arnika Ahldag\n\n\n\n\n10:05 am–10:10 am Introductory Remarks by Mehreen Yousaf\n\n\n\n\n10:10 am–10:55 am Keynote by Nishant Shah\n\n&nbsp;\n\n\n\n\nSession 01: Display/Distribute: Shape-Shifting Strategies and Mediated Forms\n\n\n\n\n11:00 am–12:00 pm\n\n\n\n\nSukanya Baskar and Sarasija Subramanian on experimental conditions in exhibition and publishing formats. Focusing on strategies for engaging publics with works, writing, and research by cultural practitioners, the speakers will share notes on formats of presentation, design, curation and their interconnected receptions.\n\n&nbsp;\n\n\n\n\nSession 02: Shared Tools, Shared Time\n\n\n\n\n12:15 pm–01:15 pm\n\n\n\n\nVishaka George in conversation with documentary photographer Palani Kumar on the ways in which his practice expands into educational, curatorial, and programmatic work.\n\n\n\n\n&nbsp;\nLUNCH\n&nbsp;\n\n\n\n\nSession 03\n\n02:30 pm–03:00 pm\n\n\n\n\nWalkthrough of Vaanyerum Vizhuthugal: Roots that Reach for the Sky with curator Jaisingh Nageswaran\n\n&nbsp;\n\n\n\n\nSession 04: On Revolutionary Failure\n\n\n\n\n03:15 pm – 04:15 pm \n\n\n\n\nArushi Vats and Meenakshi Thirukode on the many dimensions of solidarity—what failure and rupture within collective spaces can teach us, and emergent strategies from revisiting historical blueprints.\n\n&nbsp;\n\n\n\n\nSession 05: A Knowledge Ecosystem of Care and Collaboration\n\n\n\n\n04:30 pm - 05:30 pm\n\n\n\n\nSoujanyaa Boruah on participatory research and ethnography in arts and design—drawing from the speaker’s practice—sharing insights from Project Tension, in conversation with Ishita Sharma.\n\n&nbsp;\n\n\n\n\nSession 06: Film screening and Discussion\n\n\n\n\n06:00 - 07:00 pm\n\n\n\n\nA screening of Thokei by Malik Irtiza, followed by the filmmaker in conversation with Amjad Majid.\n\n\n\n&nbsp;\n\n\nSaturday, April 26, 2025\n&nbsp;\n\n\n\n\nSession 7: Forming and Reforming in Shared Labour\n\n10:00 am–11:00 am \n\nAvni Sethi and YSK Prerana in conversation with Arnika Ahldag on the concerns and learnings that marked their successive tenures with the Conflictorium.\n\n\n\n\n&nbsp;\n\n\n\n\nSession 08: A Collective Heart\n\n\n\n\n11:15 am–12:15 pm\n\n\n\n\nA conversation between Priyankar Bahadur Chand from Kalā Kulo, Indu Tharu, and Lavkant Chaudhary on practices of collaboration and co-production, highlighting collective bodies of work—including Tika Chedna Angana, a project that documents the tika body-marking traditions of the Tarai community.\n\n&nbsp;\n\n\n\n\nSession 09: The Whole of Many Roles\n\n\n\n\n12:15 pm - 01:15 pm\n\n\n\n\nAnnalisa Mansukhani and Sukanya Deb on the hyphenated identities of art workers, and the frameworks that 'both/and' associations introduce for interdisciplinary work—being 'unfenced' in practice as necessary to navigate spaces of artistic, educational, and cultural production without having to pause for identification.\n\n&nbsp;\n\n\n\nLUNCH\n&nbsp;\n\n\n\n\nSession 10: How to Make and Mend a Keepsake\n\n02:30 pm–04:00 pm\n\n\n\n\nA sharing and making session with sisters Hawa, Maryam, and Heela, as they walk us through their journey of starting Anar Studio, followed by an embroidery lesson to make or mend a personal keepsake. Limited spots available, register here.\n\n&nbsp;\n\n\n\n\nSession 11: Between Us, A Record\n\n\n\n\n04:00 pm–05:00 pm\n\n\n\n\nNayanTara Gurung Kakshapati of Nepal Picture Library and Ishita Shah of Curating for Culture on archival initiatives that create new ways of accessing our individual and collective experiences; creating a public memory that is multicultural, pluralistic and enables deeper understanding of and engagement with regional histories.\n\n&nbsp;\n\n\n\n\nClosing Remarks \n\n05:00 pm–05:15 pm\n\n\n\n\n&nbsp;\n\n\n\n\nPerformance: Talk to Me\n\n06:30 pm–07:30 pm\n\n\n\n\nA performance by Anuja Ghosalkar, Amaldev PR, Bhavana Rajendran, Gavati Wad and Nidhi Mariam Jacob, Aliasger Dhariwala, Vikrant Thakar and Akshay Khaire. Register for the performance here.\n\n\n",
    "url": "https://map-india.org/map-events/beyond-theory-continuing-the-work/",
    "keywords": [
      "Conferences",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/03/Website-Image-1440-x-810-5.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "851@map-india.org",
    "name": "Vaanyerum Vizhuthugal",
    "startDate": "2025-04-22T16:00:00+05:30",
    "endDate": "2025-04-22T17:00:00+05:30",
    "description": "Join us for a guided walk of Vaanyerum Vizhuthugal: Roots that Reach for the Sky. \n\nInitially exhibited as part of the Chennai Photo Biennale 2024-2025, for MAP this is the first ever group exhibition dedicated to contemporary photography and lens-based practices. Vaanyerum Vizhuthugal (translating to “Roots that Reach for the Sky”), curated by Jaisingh Nageswaran, brings together the works of twelve lens-based artists of Tamil origin who push the boundaries of photography and visual storytelling.\n\nThis exhibition is a project by Goethe-Institut Chennai and Chennai Photo Biennale. \n\nThe programming is in collaboration with the Goethe Institute/Max Mueller Bhavan Bangalore.\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/vaanyerum-vizhuthugal-2/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-86.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "847@map-india.org",
    "name": "VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection",
    "startDate": "2025-04-25T16:00:00+05:30",
    "endDate": "2025-04-25T17:00:00+05:30",
    "description": "Join us on a guided walk of the exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.  Featuring over 130 diverse artworks, this exhibition redefines the portrayal of women in art through sculptures, textiles, paintings, and photographs. that challenge traditional notions of femininity and gender as social constructs.  \n\nDivided into four sections—Goddess and Mortal, Sexuality and Desire, Power and Violence, Struggle and Resistance—the exhibition highlights themes of sacrifice, desire, aggression, and empowerment.\n\nIn this guided walk, you will have the unique opportunity to engage with groundbreaking perspectives and compelling stories that provoke reflection and dialogue about women’s lives and the spaces they occupy in the Indian subcontinent. Don’t miss this opportunity to explore the intersection of art, gender, and history.\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/visible-invisible-representation-of-women-in-art-through-the-map-collection-22/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/12/VIV-website-banner-2.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "844@map-india.org",
    "name": "Up, Close & Centre: We don't end at our edges",
    "startDate": "2025-04-22T17:00:00+05:30",
    "endDate": "2025-04-22T17:30:00+05:30",
    "description": "&nbsp;\n\nAt the upcoming session of Up, Close &amp; Centre, curator Khushi Bansal will elaborate on the process and artistry of Ravikumar Kashi at the exhibition, We don’t end at our edges. Immerse yourself in Kashi’s intricate paper installations and learn more about the artworks.\n\nThis is a drop-in session. There is no registration required.",
    "url": "https://map-india.org/map-events/up-close-centre-we-dont-end-at-our-edges-2/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Khushi-Guided-Walk-event.jpg"
  }
]