[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "749@map-india.org",
    "name": "Readers' Bloc - Hand in Hand",
    "startDate": "2025-02-20T18:30:00+05:30",
    "endDate": "2025-02-20T20:00:00+05:30",
    "description": "“For neither of us reserved anything for himself, nor was anything either his or mine”\n\n - de Montaigne \n\nIn this edition of Reader’s Bloc, we unpack what is at the very core of friendship and love - examining them not only as defining relationships between people, but also as a larger force that makes one confront the Self. Michel de Montaigne’s Of Friendship contemplates the delicate lines between the two - what makes them distinct? Do they inevitably blur? In Two Notches, with Love by Pranav V S, we think about tender youthful love and how it shifts into something more complex over time. How do these experiences etch themselves as ‘notches’ in our lives and what emotions linger unresolved? \n\nOn registration, we will send you the text and the topics/themes we will discuss.\n\nThis programme is exclusively for 18–25 year olds.\n\nReader’s Bloc is an online/IRL group of readers taking part in reading, listening and sharing exercises around texts that help us learn more about ourselves, the identities we share and the communities we live in.\n\nThis session is conducted as part of our engagements for the MAP Youth Collective. The MAP Youth Collective is a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.",
    "url": "https://map-india.org/map-events/readers-bloc-hand-in-hand/",
    "keywords": [
      "MAP",
      "Youth Engagement"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Untitled-design-11-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "750@map-india.org",
    "name": "Yeh Woh Manzil To Nahin",
    "startDate": "2025-02-23T16:30:00+05:30",
    "endDate": "2025-02-23T19:30:00+05:30",
    "description": "In collaboration with Bangalore Film Forum (BFF), MAP is excited to announce the screening of Yeh Woh Manzil To Nahin, followed by a conversation facilitated by Ashish Rajadhyakhsha with Sudhir Mishra.\n\nThe plot follows three old men, who used to be close friends during their school days, embark on a train journey from Bombay to Rajpur to attend the centenary celebration of their boarding school. As they travel, memories of their student activism and past failures flood their minds. Upon reaching their destination, they are confronted by political skirmishes that serve as a stark reminder of the occasions when they had failed to stay true to their conscience.\n\nThis screening is the sixth installment of ‘The Radical Seventies,’ a six-month series curated by Ashish Rajadhyaksha. A collaboration between MAP and Bangalore Film Forum, the series is specially crafted for youth to engage with older classics that resonate with our contemporary times, in familiar and unexpected ways. The Radical Seventies is part of our youth engagement programming for AUD/VID.",
    "url": "https://map-india.org/map-events/yeh-woh-manzil-to-nahin/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Yeh Woh Manzil To Nahin"
    },
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-33.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "752@map-india.org",
    "name": "Retro Reels: Grooves from Indian Cinema",
    "startDate": "2025-02-22T18:30:00+05:30",
    "endDate": "2025-02-22T20:00:00+05:30",
    "description": "Get ready for a sonic journey through the vibrant world of Indian cinema! As part of The Many Lives of Cinema symposium, Nishant Mittal aka Digging In India will be spinning rare and electrifying records from his archives—featuring Hindi disco, Kannada pop, and Tamil funk. Expect some serious grooves, plenty of nostalgia, and a soundtrack that’ll keep your feet tapping!",
    "url": "https://map-india.org/map-events/retro-reels-grooves-from-indian-cinema/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-31.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "751@map-india.org",
    "name": "Cut, Paste, Create!",
    "startDate": "2025-02-22T14:00:00+05:30",
    "endDate": "2025-02-22T15:30:00+05:30",
    "description": "Design your very own iconic movie poster! Join us for a dynamic collage-making workshop led by digital artist, Prashanth C. The session will introduce you to poster art using film stills and posters from the MAP collection. You will learn techniques to layer and blend different elements of the vibrant film posters, songbooks, lobby cards and stills.\n\nAll you need to bring is your imagination, and of course, your best filmy dialogues.",
    "url": "https://map-india.org/map-events/cut-paste-create/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-30.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "747@map-india.org",
    "name": "The Many Lives of Cinema",
    "startDate": "2025-02-22T09:00:00+05:30",
    "endDate": "2025-02-22T20:00:00+05:30",
    "description": "Popular cinema both shapes, and is shaped, by the world we live in; our social realities, our politics, and our perception of ourselves and others. However, what are the stories that we can find outside of the cinematic context itself? Explore the visual culture that surrounds cinematic production, and join us for this Film Ephemera Symposium that focuses on the nature, and possibilities of film ephemera as both object and subject. \n\nFilm ephemera – including posters, lobby stills, lobby cards, and songbooks – were popularly designed in the 20th century as promotional materials. They were meant to communicate information and excite and thrill audiences, giving them a taste of what to expect. What happens when they have ceased to serve their function? What happens when they move from streets and theatres to museums and archives? What can we learn from them about the past and how can we engage with them in the contemporary moment? \n\nThis symposium positions the archive as a living entity—an interactive repository of knowledge that goes beyond preservation to inspire future dialogues. It brings together film historians, museum professionals, archivists, artists and scholars to explore the challenges and opportunities that lie in creating, accessing and working with film ephemera. \n\nFrom the technologies and larger visual histories of the time, to the passion of fandom and embedded identity politics, each encounter with an object from the archive can create fresh meanings and offer new interpretations. By fostering dialogues around this, the symposium aims to bridge academic inquiry and public engagement, encouraging a reimagining of film ephemera as vibrant touch points between memory, materiality and collective identity.\n\nProgramme Schedule\n\n9:00 am to 10:00 am - Registration\n\n10:00 am to 10:15 am - Opening Remarks\n\n10:15 am to 11:00 am - Keynote Address by Ashish Rajadhyaksha \n\n11:15 am to 12:45 pm - Panel 1: Reframing the Image: History, Politics and Art - Amarnath Praful, Rajan Kurai Krishnan and Ranjani Mazumdar. Moderated by S V Srinivas \n\n12:50 pm to 1:00 pm - Screening of “Blueprint of a Pleasure Machine” by Amit Dutta\n\n2:00 pm to 2:45 pm -  Walkthrough at Sasken Multimedia Gallery \n\n2:45 pm to 3:30 pm - Walkthrough at Sasken Multimedia Gallery \n\n2:00 pm to 3:30 pm - Poster-making Workshop by Prashanth C\n\n2:00 pm to 3:30 pm - Ragas in Bollywood by Priya Kanungo\n\n4:00 pm to 5:00 pm - Panel 2: Reframing the Object: Materiality, Memory and the Archive - Iyesha Geeth Abbas, and Murchana Borah. Moderated by: Mandara Vishwanath\n\n5:00 pm to 6:00 pm - Panel 3: Reframing the Story:  Interventions, Interpretations and Imaginations - Balaji Maheshwar and Clare Arni. Moderated by Ritwika Misra\n\n6:30 pm to 8:00 pm - Musical performance by Digging in India\n\n&nbsp;\n\nDownload a pdf version of the detailed schedule and speaker list by clicking on this link.\n\nFor further insight on the panel discussions and speaker details, click on this link.\n\n\n\nPlease write to abiraami.ps@map-india.org for general queries related to the symposium.\n\nFor Information on accessibility support:\nWrite to mounika.nallani@map-india.org. You can refer to the accessibility features mentioned here.",
    "url": "https://map-india.org/map-events/the-many-lives-of-cinema/",
    "keywords": [
      "MAP",
      "Symposium"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-28.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "719@map-india.org",
    "name": "Framing the Archive",
    "startDate": "2025-02-22T09:00:00+05:30",
    "endDate": "2025-02-23T17:00:00+05:30",
    "description": "Join us for an essay filmmaking workshop with Falana Films, where they will introduce you to the essay film format and guide you in developing a short film (one to three minutes) while working with an archive.\n\nIn making your essay film, you will have access to a curated set of artworks from the MAP Collection, as well as a resource list of museum and other institutional archives available in the public domain. Additionally, you will be prompted to bring your own archival material–found footage, home videos, family photographs, long-lost audio recordings, and any A/V material you feel is at the cusp of telling a story. You will also be encouraged to film additional footage throughout the workshop.\n\nThis four-day workshop extends across two weekends–February 15–16 &amp; 22–23. Teams of four will be selected based on themes chosen by participants when they register for the workshop. These teams alongside the Falana team will work together to make the film.\n\nThe focus of this workshop is not as much on the technical aspects of filmmaking as it is on the meaning one can make from scattered archives when thematically exploring them. \n\nExpanding on the thematic concerns of MAP’s permanent exhibition, VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection you can find the list of themes for the workshop below:\n\n&nbsp;\n\n- Body as Landscape: Gender Identity, Sexuality and Body-politics\n\n- Home and Away: Memory, Migration and Nostalgia\n\n- No Person’s Land: Cities and Spaces \n\n- ‘Mad or What?’: Mental Health and the City\n\n&nbsp;\n\nRead this document to find out more about the workshop, FAQs and a tentative schedule.\n\nRegistrations for this workshop is now closed.",
    "url": "https://map-india.org/map-events/framing-the-archive/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/Website-cover-images-new-10.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "732@map-india.org",
    "name": "Up, Close & Centre",
    "startDate": "2025-02-21T16:30:00+05:30",
    "endDate": "2025-02-21T17:00:00+05:30",
    "description": "Join us for a session of Up, Close &amp; Centre at our exhibition, The Forgotten Souvenir. \n\nThe mica paintings in this exhibition from Murshidabad, Patna and Trichinopoly (present day Tiruchirapalli) represent a nearly forgotten chapter in Indian art, bridging the gap between the decline of traditional miniature painting and the rise of photography. \n\nShubhasree Purkayastha from the MAP team will be speaking about the Ramlila festival artwork by Sewak Ram in detail and focusing on the details as well as context within the exhibition.\n\nDon’t miss this unique chance to engage with the exhibition on a more personal level. \n\nThis is a drop-in session. No pre-registration required.",
    "url": "https://map-india.org/map-events/up-close-centre-11/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/forgotten-souvenir-website-banner-1.png"
  }
]