[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "649@map-india.org",
    "name": "Tuesday Tidbits",
    "startDate": "2024-12-17T16:00:00+05:30",
    "endDate": "2024-12-17T16:30:00+05:30",
    "description": "“The objective of this exhibition is to take the unknown and make it known” - Khushi Bansal, Curator of The Forgotten Souvenir.\n\nWe are very excited for the next session of Tuesday Titbits, a series that explores different aspects of working in a museum. \n\nWhen you enter the MAP building on the ground floor, you will come across the new exhibition “The Forgotten Souvenir”. This month’s Tuesday Tidbits features Khushi Bansal, the curator of this exhibition, currently working as a research curator at MAP. Join us as she takes us behind the scenes to explore conceptualisation, research, and development. Khushi will also share her experiences with Museums Without Borders, discussing everything from pairings to scripting and production. Join us for these free, insightful and short sessions on life in a museum, as we look at MAP through the lenses of our team members!\n\nThis is part of our series that seeks to support youth in career research/building and acts as a space for networking for young people.",
    "url": "https://map-india.org/map-events/tuesday-tidbits-8/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/12/jan-25-website-banner-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "639@map-india.org",
    "name": "Louis Kahn's Tiger City",
    "startDate": "2025-01-25T17:00:00+05:30",
    "endDate": "2025-01-25T19:30:00+05:30",
    "description": "Join us for the screening of Louis Kahn’s Tiger City in conjunction with the exhibition Eckart Muthesius and Manik Bagh: Pioneering Modernism in India curated by Raffael Dedo Gadebusch, travelling from the Museum of Asian Art, Berlin. In this film, art historian and filmmaker Sundaram Tagore retraces the footsteps of architect Louis Kahn,  uncovering how he built the iconic and monumental parliamentary complex in war-torn Bangladesh. \n\nBuilt for the Maharaja of Indore, Yashwant Rao Holkar II, Manik Bagh (or the ‘Gem Garden’) was a residential palace designed by his friend and architect Eckart Muthesius. The exhibition marks a first in a series of shows planned on architecture, focusing on plural interpretations on the idea of “home” through 3 exhibitions planned through 2025-2026. \n\nThe screening will feature an introduction by the director, Sundaram Tagore, and conclude with a Q&amp;A session with the audience.",
    "url": "https://map-india.org/map-events/louis-kahns-tiger-city/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Louis Kahn's Tiger City"
    },
    "image": "https://map-india.org/wp-content/uploads/2024/11/jan-25-website-banner-.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "655@map-india.org",
    "name": "Willian Dalrymple’s Golden Road",
    "startDate": "2024-12-16T18:30:00+05:30",
    "endDate": "2024-12-16T19:30:00+05:30",
    "description": "If our recent exhibition, Chay Reds, Ferrous Black: The Untold Stories of Indian Trade Textiles in Sri Lanka, has taught us anything, it is the profound influence of trade routes in shaping cultural practices, materials, and traditions.\n\nWilliam Dalrymple, in his book The Golden Road, takes this concept further, although in a broader context. The book argues that the primary trade route connecting Eurasia from 250 BCE to 1200 CE—referred to as the \"Golden Road\"—was a vital corridor through India. This route facilitated the spread of an Indian sphere of influence, often called the \"Indosphere.\" Over 1,500 years, Indian ideas in music, dance, mathematics, architecture, and sculpture traveled across vast areas of Asia, evolving into local forms while shaping the region's cultural and intellectual history.\n\nJoin us in a conversation with William Dalrymple as he draws from a lifetime of scholarship to shed light on India's often-overlooked position as the heart of ancient Eurasia. Discover how India's ideas and innovations not only spread across the continent but also played a pivotal role in shaping its history and identity.",
    "url": "https://map-india.org/map-events/willian-dalrymples-golden-road/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/12/William-Dalrymple-website-banner-.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "652@map-india.org",
    "name": "MAYA: Kaavad Katha",
    "startDate": "2024-12-13T18:00:00+05:30",
    "endDate": "2024-12-13T19:30:00+05:30",
    "description": "Immerse yourself in the enchanting world of Maya, a contemporary revival of the Kaavad.\n\nExperience the magic of storytelling and puppetry as Maya brings to life a series of captivating tales. Inspired by the ancient \"KathaSaritaSagar\" format, this performance weaves together mythical characters and timeless stories, each leading to the next in a mesmerising narrative. \n\nThe performance will be followed by an engaging Q&amp;A session with the artist, Akshay Gandhi to give audiences more insight into this fascinating traditional art form.\nMAP is delighted to be a part of BLR Hubba 2024, a city-wide arts and culture festival.\n",
    "url": "https://map-india.org/map-events/maya-kaavad-katha/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/12/jan-25-website-banner-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "654@map-india.org",
    "name": "Frames of Struggle: Tracing a Movement",
    "startDate": "2024-12-14T10:00:00+05:30",
    "endDate": "2024-12-15T18:00:00+05:30",
    "description": "News of incidents of sexual assault and other forms of violence hit us on a daily basis - rape, dowry murders, acid attacks and sexual harassment. Do the text and visuals perhaps evoke horror, anger or even frustration at the impunity with which these crimes against women are repeated, with justice hardly ever in sight?\n\nHave you ever wondered how these crimes even began to be thought of as crimes in the first place?\n\nThe Sasken Multimedia Gallery at the Museum of Art &amp; Photography (MAP) is hosting a series of digital stories showcasing the campaigns of the women’s movement as depicted through posters. The first digital story examines key issues raised by the autonomous women's movement in India from the 1980s onwards, beginning with posters from the 1980s, centred on rape, in response to a nationwide movement against the custodial rape of Mathura, a young Adivasi girl.\n\nThe posters reflect the broader discourse of the time, which included dowry murder, domestic violence, and the articulation of patriarchy as an overarching system of oppression. Early posters embody raw, unrefined artistic styles, while later mass-produced ones reflect a more polished aesthetic, associated with NGOs and civil society campaigns, mirroring the shifting nature of people’s movements in post-liberalised India. The exhibition also features posters on child abuse, human trafficking, acid attacks, and witch-hunting, marking them as distinct causes taken up by the women’s movement, many of which resulted in major changes in policy and law. In depicting the power of the collective, some posters showcase articulations of solidarity and hope that characterised resistance during the movement.\n\nThe posters have been curated from the Poster Women archive launched in 2005 by Zubaan, an independent feminist publishing house and NGO based in New Delhi. This is the first of a series of exhibitions on display at the Sasken Multimedia Gallery, along with associated programmes presented by MAP in collaboration with Zubaan as part of our joint effort to activate the Poster Women archive.\n\nAs part of this programme series, we will be hosting:\n\nWalkthrough: Frames of Struggle: Tracing a Movement\nVenue: Sasken Multimedia Gallery, 1st Floor, Museum of Art &amp; Photography\nDate &amp; Time: December 14, 04:00 pm - 04:30 pm\n\nJoin us for a walkthrough of the first digital story launched as part of this collaboration with Urvashi Butalia, Founder of Zubaan and Journalist, Laxmi Murthy.\n\nPanel Discussion: Posters As Record: Understanding the Women’s Movement through its Visuals\nVenue: Mazumdar-Shaw Auditorium, 1st Floor, Museum of Art &amp; Photography\nDate &amp; Time: December 14, 05:00 pm - 06:00 pm\n\nThis conversation examines posters as historical documents, situating them within their specific contexts of production, circulation, and visual communication to trace key milestones in India’s women’s movement. By understanding these posters as part of ongoing negotiations and diverse formulations of women’s issues, the discussion unpacks their significance in shaping public discourse, addressing various forms of violence against women, and influencing related legislation in the country. Notions of punishment and justice that have been vital to feminist campaigns will also be discussed in light of recent incidents of sexual violence.\n\nPanelists:\n\n- Urvashi Butalia co-founded India's first feminist publishing house, Kali for Women in 1984 and now runs Zubaan, another feminist imprint.\n\n- Laxmi Murthy is a journalist and researcher based in Bangalore. She has been associated with the autonomous women’s movement since 1985.\n\n- Yukti Saumya is co-founder of the Centre for Restoration, a non-profit organisation working to mitigate gender-based violence in Indian schools and colleges.\n\nModerator:\n\n- Bidisha Mahanta is the Head of Programmes at Zubaan.\n\nWorkshop: Poster Women: A Making Workshop\nVenue: HDFC Learning Centre, Lower Ground Floor, Museum of Art &amp; Photography\nTime and Date: December 15, 10:00 am - 01:00 pm\n\nJoin us for a workshop where we explore the visualisation of feminist movements across the world through posters, followed by a making session where we guide each other in crafting them—collages, montages, and patchworks of colour and imagery that help communicate the feminist issues of our times.\n\nFacilitated by Maraa Collective, this workshop invites early-career image-makers, illustrators, artists, and photographers who employ a feminist lens in their practice and wish to convene to share thoughts and ideas. Together, participants will contribute to a shared understanding and repository of motifs, techniques, and knowledge surrounding feminist imagery and movements, fostering meaningful exchange.\n\nThis programme is presented in conjunction with MAP’s permanent exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.",
    "url": "https://map-india.org/map-events/frames-of-struggle-tracing-a-movement-2/",
    "keywords": [
      "MAP",
      "Series"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/12/Website-Image-1440-x-810-35.png"
  }
]