[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1058@map-india.org",
    "name": "Scents of Memory",
    "startDate": "2025-10-25T17:00:00+05:30",
    "endDate": "2025-10-25T18:30:00+05:30",
    "description": "In this session of Reader’s Bloc, we’ll explore two texts—The Book of Everlasting Things by Aanchal Malhotra and Smell by Radhika Jha—both exploring smell as not just a sense, but as a conduit for memory, love, identity and belonging. \n\nMalhotra’s The Book of Everlasting Things follows a perfume maker in pre-partition India, where different scents become the legacy passed through generations, carrying with it familial love and a lot of history; while Jha’s Smell, tells the story of a young brown woman who navigates identity and alienation in postcolonial, diasporic France. \n\nThis session is conducted as part of our engagements for the MAP Youth Collective. The Collective is a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.",
    "url": "https://map-india.org/map-events/scents-of-memory/",
    "keywords": [
      "CBD",
      "MAP",
      "OSCH | Youth Engagement"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/Website-cover-images-new-14.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "1055@map-india.org",
    "name": "Love Letters - Ninna Preetiya, Naanu!",
    "startDate": "2025-10-25T17:00:00+05:30",
    "endDate": "2025-10-25T18:30:00+05:30",
    "description": "In an age of instant messages and disappearing stories, the play \"Love Letters: Ninna Preetiya Naanu\" invites you to pause, reflect, and turn the pages of the past—one heartfelt letter at a time.\n\nThis poignant, original Kannada play explores the depth of a lifelong connection between two people bound by nostalgia, affection, and all the words left unsaid. Imagine scrolling through a lifetime of messages—not through DMs, but through yellowing pages, hurried handwriting, and tear-stained notes. From scribbled notes in school notebooks to confessions that arrive too late, the play spans decades of friendship and almost-love.\n\nIt's a journey through innocence, longing, and the quiet ache of missed chances—narrated through letters that become both a timeline and a testament to what was, and what might have been.\n\nThis performance is in conjunction with the exhibition Shape of a Thought: Letters from Ram Kumar.",
    "url": "https://map-india.org/map-events/love-letters-ninna-preetiya-naanu/",
    "keywords": [
      "CBD",
      "MAP",
      "Performances"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2021/06/1440-X-810-Widget-03.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1052@map-india.org",
    "name": "Calling Quiz Nerds",
    "startDate": "2025-10-18T15:00:00+05:30",
    "endDate": "2025-10-18T18:00:00+05:30",
    "description": "Join us for an engaging afternoon of quizzing that celebrates the world of museums, art, and photography! Presented in association with the Karnataka Quiz Association (KQA), this quiz explores subjects that naturally inspire curiosity and discovery, taking participants on a global cultural journey.\n\nYour hosts for the day are KQA veterans Mahendra Balu and Thejaswi Udupa, who bring decades of quizzing expertise to the podium.\n\nCome ready to test your knowledge and discover fascinating stories from the worlds of culture, creativity, and visual storytelling!",
    "url": "https://map-india.org/map-events/calling-quiz-nerds/",
    "keywords": [
      "CBD",
      "MAP",
      "Quiz"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/WhatsApp-Image-2025-10-13-at-15.29.22_d7585084.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1054@map-india.org",
    "name": "The Art of Language",
    "startDate": "2025-10-24T17:00:00+05:30",
    "endDate": "2025-10-24T18:00:00+05:30",
    "description": "Poet, playwright, and academic Mamta Sagar joins Arundhati Ghosh for an intimate conversation on poetry, translation, and the intersections of word and image. Exploring her creative process and her forays into visual art, Mamta reflects on how language transforms into texture, rhythm, and form, offering audiences a rare glimpse into the evolving journey of her work.",
    "url": "https://map-india.org/map-events/the-art-of-language/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/Website-cover-images-new-12.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1051@map-india.org",
    "name": "NeuroQueer Brainbox",
    "startDate": "2025-10-18T15:00:00+05:30",
    "endDate": "2025-10-18T17:00:00+05:30",
    "description": "A warm invitation to all neurodivergent and queer Folks!\nJoin us for the 4th edition of NeuroQueer Brain Box facilitated by Mani Agarwal, a NeuroQueer therapist. This session will celebrate the diversity and stories of our bodies. Together, we will explore how our bodies are integral to our identities.\nWe’ll begin with a guided walk of the exhibition, VISIBLE/INVISIBLE:Representation of Women in Art through the MAP Collection, through a queer lens. As you move through the space, reflect on some words that come up for you; let them resonate with you, and bring them into our group space. Together, through shared reflections and queer perspectives on our bodies, we’ll map our feelings with art. This will be a space to celebrate neuroqueer creativity and build a sense of community, where we spend time with our own bodies to feel seen and affirmed. \nPlease note: This is a free session exclusively for individuals who identify as LGBTQIA+ or are individuals with ADHD/Autism/AuDHD.",
    "url": "https://map-india.org/map-events/neuroqueer-brainbox-3/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/DSC00669-scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1059@map-india.org",
    "name": "Make at MAP",
    "startDate": "2025-10-26T11:30:00+05:30",
    "endDate": "2025-10-26T15:30:00+05:30",
    "description": "Boo! Did we scare you—Good! This Halloween-themed Make at MAP session is all about facing your fears. Taking cues from classic Bollywood horror film posters, create your very own poster starring your deepest fears.\n\nMake @ MAP is a series that allows you to explore our collection in an engaging and hands-on manner. These sessions allow you to create and take home a special souvenir of your visit. It is perfect for all ages — so bring your friends and family and get ready to make some art! No experience is necessary, just a willingness to have fun and experiment with new materials.",
    "url": "https://map-india.org/map-events/make-at-map-4/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/Website-cover-images-new-17.png"
  }
]