[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "580@map-india.org",
    "name": "Tuesday Tidbits",
    "startDate": "2024-10-08T16:00:00+05:30",
    "endDate": "2024-10-08T17:00:00+05:30",
    "description": "Curious about the role of a photographer in a museum? This month’s Tuesday Tidbits features Saikat Das from our collections team who will be focusing on the importance of digitisation and documentation in preserving our cultural heritage. In this session, discover why these practices are essential and the challenges and delights of effectively digitising and documenting varied objects in a museum setting.\n\nIf you’re curious about how a museum digitises a 9 foot long textile, captures the details of a miniature painting or if you’re someone exploring career options in the museum and cultural space, then this session is perfect for you. \n\nTuesday Tidbits is a series that seeks to support youth in career research/building and acts as a space for networking for young people.",
    "url": "https://map-india.org/map-events/tuesday-tidbits-5/",
    "keywords": [
      " Featuring",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/09/Tuesday-tidbits.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "578@map-india.org",
    "name": "Beyond the Gender Beat",
    "startDate": "2024-10-08T18:30:00+05:30",
    "endDate": "2024-10-08T20:00:00+05:30",
    "description": "A report by The Media Rumble and UN Women in early 2019 analysed India’s leading newspapers, magazines, TV channels, and news websites. It found that in a six-month period in 2018, only 8% of content—news reports, features, opinion pieces, and primetime debates—focused on gender issues.\n\nThis is alarmingly low. A sustained focus on understanding the issues, interests and concerns of women and gender minorities is crucial to undoing the patriarchal systems that bind us.  Non-sexist representation that moves beyond outrage cycles and victim shaming is key to reshaping narratives. This requires both a shift in content and the structure of journalistic institutions to address gender issues beyond sensationalism. Sensitive storytelling should centre the voices of women and gender minorities, critically explore widening gender disparities, and adopt new, compassionate ways to present these stories.\n\nJoin us for a panel discussion featuring Priti David from PARI (People’s Archive of Rural India), Laxmi Murthy from Hri Southasian, Priyanka Tupe from Behan Box, and Shabani Hassanwalia from The Third Eye. Each of these institutions, in their distinct ways, have employed a people-first approach in storytelling; allowing to build sensitivity and instances for continued learning around gender.\n\nThis panel discussion is conceptualised under our exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.",
    "url": "https://map-india.org/map-events/beyond-the-gender-beat/",
    "keywords": [
      "MAP",
      "Panel Discussion"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/09/Panel.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "581@map-india.org",
    "name": "Written in Dance",
    "startDate": "2024-10-13T17:30:00+05:30",
    "endDate": "2024-10-13T18:30:00+05:30",
    "description": "The arts have always borrowed from and influenced each other, in both obvious and subtle ways. Join us for a talk by author Shoba Narayan and acclaimed dance choreographer Madhu Nataraj as they discuss the cross illumination of the arts throughout history. \n\nThe discussion will also focus on how the spatio-temporality of dance serves as ground for creative partnerships, inspiring countless works of art and literature.\n\nThis event is in collaboration with Ananya Drishya",
    "url": "https://map-india.org/map-events/written-in-dance/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/10/WhatsApp-Image-2024-10-04-at-4.51.38-PM.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "577@map-india.org",
    "name": "Films Screenings + Discussion by The Third Eye Learning Lab",
    "startDate": "2024-10-06T15:00:00+05:30",
    "endDate": "2024-10-06T17:00:00+05:30",
    "description": "Join us for the screening of three shorts Raat: Night Time in Small Town India, Khushi's Roshni and Kya Hai Yeh Samjhauta? Co-created and worked on in The Third Eye's Learning Lab through varied processes, this screening will be followed by a discussion with The Third Eye Learning Lab team and Hansa Thapliyal.\n\nAbout the films:\n\nRaat (35 min):A documentary exploring the hidden lives and experiences of people in small-town India during the night.\n\nKhushi’s Roshni (7 min): A short film featuring Khushi Bano exploring the complexities of online identity and self-representation among young Muslim women in India.\n\nKyaa hai ye Samjhauta?(Dur. 9 min): A short film exploring women's experiences with domestic violence, and the choices they make in response to it.\n\nNote: All the films will be in Hindi with English subtitles.\n\nCredits\n\nRaat:\n\nMentor: Ruchika Negi, Editor: Abhinava Bhattacharyya, Sound (post production): Abhishek Mathur, Assistance: Madhuri Adwani, Producer (for The Learning Lab): Dipta Bhog, Ruchika Negi, Producer (for The Third Eye): Shabani Hassanwalia, Shivam Rastogi\n\nKhushi's Roshni:\n\nMentor: Ruchika Negi, Editor: Gurleen Grewal, Producer: The Third Eye’s Learning Lab\n\nKyaa hai ye Samjhauta?:\n\nDirection - Hansa Thapliyal, Camera - Nebu George and Pankaj Baral, Sound Design -  Amir Musanna, Sound Final Mix - Shashank Kothari, Art Direction - Koshy Brahmatmaj, Edit - Hansa Thapliyal, Producer: The Third Eye\n\nImage credits: Still from Kyaa hai ye Samjhauta?/ Coming to terms or, Making your Terms? By Hansa Thapliyal",
    "url": "https://map-india.org/map-events/films-by-the-third-eye/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "Films Screenings + Discussion by The Third Eye Learning Lab"
    },
    "subtitleLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/09/Film-screening-website.jpeg"
  }
]