[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "856@map-india.org",
    "name": "Scrappy Puppet Tales - Summer at MAP",
    "startDate": "2025-05-19T11:00:00+05:30",
    "endDate": "2025-05-24T16:00:00+05:30",
    "description": "Summer holidays are here, and are the kids already chanting \"I'm bored?\"! Get them over to MAP for an exciting summer camp filled with art, learning and group activities facilitated by professional artists. Give your kids a summer to remember at the museum.\n\nGet ready for some fun storytelling! In the Scrappy Puppet Tales workshop, kids will become puppet creators using all sorts of cool scrap and junk. It's a hands-on adventure where imagination takes center stage. Guided by renowned actress  and puppeteer Padmavati Rao, children will bring their wacky puppet characters to life. The grand finale? A showcase where each young artist gets to present their puppet creations!\n\nAge group- 9-12 year olds. Registration fees is ₹1000. Number of participants are limited so please register to confirm your spot.",
    "url": "https://map-india.org/map-events/scrappy-puppet-tales-summer-at-map/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-2025-04-26T144806.943.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "858@map-india.org",
    "name": "Vaanyerum Vizhuthugal (Tamil)",
    "startDate": "2025-05-06T16:00:00+05:30",
    "endDate": "2025-05-06T17:00:00+05:30",
    "description": "Join us for a guided walk of Vaanyerum Vizhuthugal: Roots that Reach for the Sky in Tamil led by Abiraami PS from the MAP Team.\n\nInitially exhibited as part of the Chennai Photo Biennale 2024-2025, for MAP this is the first ever group exhibition dedicated to contemporary photography and lens-based practices. Vaanyerum Vizhuthugal (translating to “Roots that Reach for the Sky”), curated by Jaisingh Nageswaran, brings together the works of twelve lens-based artists of Tamil origin who push the boundaries of photography and visual storytelling.\n\nThis exhibition is a project by Goethe-Institut Chennai and Chennai Photo Biennale. \n\nThe programming is in collaboration with the Goethe Institute/Max Mueller Bhavan Bangalore.\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/vaanyerum-vizhuthugal-tamil/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-2025-04-30T115959.949.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "855@map-india.org",
    "name": "The Mural Of The Story-Summer at MAP",
    "startDate": "2025-05-12T10:00:00+05:30",
    "endDate": "2025-05-17T16:00:00+05:30",
    "description": "Summer holidays are here, and are the kids already chanting \"I'm bored?\"! Get them over to MAP for an exciting summer camp filled with art, learning and group activities facilitated by professional artists. Give your kids a summer to remember at the museum.\n\nLearn about the art of mural painting, what goes on behind the planning of a mural, famous mural artists, etc. Facilitated by artist Deepa Juliana and inspired by the works of Bhuri Bai, kids will discover the fascinating process behind creating these large-scale artworks. Children will also get to paint their own mural at MAP! And the best part? We'll provide all the colours, brushes, and everything else they need to bring their vision to life.\n\nSo join this workshop and make this summer a colourful and creative one!\n\nAge group- 13-16 year olds. Registration fees is ₹1000. Number of participants are limited so please register to confirm your spot.",
    "url": "https://map-india.org/map-events/the-mural-of-the-story-summer-at-map/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-2025-04-26T142358.568.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "861@map-india.org",
    "name": "Making Sense of Cinema",
    "startDate": "2025-05-10T10:00:00+05:30",
    "endDate": "2025-05-11T18:30:00+05:30",
    "description": "Calling all film enthusiasts for a two-day, intensive film workshop facilitated by filmmaker Koel Sen! During this, you will learn the basics of video creation, exploring topics like video production, video editing, storytelling and post-production.\n\n\nThe first day will cover the basics of script writing and storytelling, followed by a film screening, courses on cinematography, and group projects. The second day will focus on shooting a film, editing &amp; post-production, and finally ending the workshop with a screening of all the films.\n\nLaptops and smartphones are compulsory for the workshop. Seats are limited so please register soon so secure your spot.",
    "url": "https://map-india.org/map-events/making-sense-of-cinema-a-filmmaking-workshop/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-02T121842.650.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "857@map-india.org",
    "name": "Chittara Art",
    "startDate": "2025-05-24T14:00:00+05:30",
    "endDate": "2025-05-24T17:00:00+05:30",
    "description": "Did you know that chittara in Kannada translates to picture or design? This folk art has geometrical designs featuring everyday life, and is native to the Deevaru community in the Sagar district of Karnataka. Chittara folk art is practiced primarily by the women of the community. They use eco-friendly materials like ground rice paste for white colour, charred rice for black, powdered gurige seeds (Strobilanthes kunthiana) for yellow, and soil/earth for red. \n\nLearn more about this artform and create your own chittara inspired collage on handmade, recycled paper.\n\nThis event will be followed by a book launch.\n\nPhoto credits: CFRIA",
    "url": "https://map-india.org/map-events/chittara-art/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-2025-04-29T171056.075.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "859@map-india.org",
    "name": "Say it like you meme it!",
    "startDate": "2025-05-09T18:00:00+05:30",
    "endDate": "2025-05-09T19:30:00+05:30",
    "description": "Dancing elephants &amp; egg-women? Textile labels weren't always serious. Explore the playful branding of 19th and 20th-century colonial India in Ticket Tika Chaap. Join us for a meme-making workshop where we will provide you with materials and historical context, that  you can turn into your own creative meme masterpiece!",
    "url": "https://map-india.org/map-events/say-it-like-you-meme-it/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-78.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "860@map-india.org",
    "name": "Up, Close & Centre",
    "startDate": "2025-05-27T17:00:00+05:30",
    "endDate": "2025-05-27T17:30:00+05:30",
    "description": "In this session of Up, Close &amp; Centre, Arnika Ahldag (Director - Curation &amp; Exhibition at MAP) will elaborate on an artwork from MAP’s latest exhibition, Vaanyerum Vizhuthugal: Roots that Reach for the Sky.\n\nInitially exhibited as part of the Chennai Photo Biennale 2024-2025, for MAP this is the first ever group exhibition dedicated to contemporary photography and lens-based practices. Curated by Jaisingh Nageswaran, Vaanyerum Vizhuthugal (translating to “Roots that Reach for the Sky”) brings together the works of twelve lens-based artists of Tamil origin who push the boundaries of photography and visual storytelling.\n\nThis is a drop-in session. There is no registration required.",
    "url": "https://map-india.org/map-events/up-close-centre-13/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-02T122341.078.png"
  }
]