[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "972@map-india.org",
    "name": "Zine Lab",
    "startDate": "2025-08-10T11:30:00+05:30",
    "endDate": "2025-08-10T13:30:00+05:30",
    "description": "Zines have long been spaces for reflection, resistance and reclaiming stories. In this workshop with writer-illustrator Preston Olakatu, explore zine-making as a creative act of self-expression — one that holds space for personal narratives, queerness and community.\n\nThe workshop will begin with a short presentation covering the history and cultural significance of zines, tracing their roots from punk and feminist movements to present-day DIY publishing. \n\nWith an emphasis on experimentation, create your own zine exploring different formats while learning techniques such as layering, sequencing and layout structure.",
    "url": "https://map-india.org/map-events/zine-lab-2/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-cover-images-new-2025-07-22T113603.591.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "977@map-india.org",
    "name": "Reader’s Bloc: Soundscapes of War",
    "startDate": "2025-08-02T17:00:00+05:30",
    "endDate": "2025-08-02T18:00:00+05:30",
    "description": "Drummer, Tyeb Mehta, 1988, Oil on canvas, MAC.00459\nThis month, we tune into the unsettling acoustics of conflict. The Drone Eats with Me, a personal diary by Atef Abu Saif offers an intimate, harrowing perspective from Gaza - where the whir of drones and sudden explosions become a permanent soundtrack to daily life. As Palestinians recall lives interrupted, the soundscape of war becomes etched into memory.\n\nBut what about those of us who watch from a distance? In Silence on Trial, Paul Virilio confronts the uncomfortable reality of spectatorship in the age of immersive media. When war becomes another stream in our feed, at what point does our silence become complicity, or worse -  erasure?\n\nJoin us as we examine the acoustics of war, the politics of silence, and what it means to truly listen.\n\nThe Reader’s Bloc is an online/IRL group of readers taking part in reading, listening and sharing exercises around texts that help us learn more about ourselves, the identities we share and the communities we live in.\n\nThis session is conducted as part of our engagements for the MAP Youth Collective. The MAP Youth Collective is a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.",
    "url": "https://map-india.org/map-events/readers-bloc-soundscapes-of-war/",
    "keywords": [
      "MAP",
      "Youth Engagement"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-cover-images-new-5.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "974@map-india.org",
    "name": "A Chaap for Everyone",
    "startDate": "2025-08-03T10:30:00+05:30",
    "endDate": "2025-08-03T13:30:00+05:30",
    "description": "Create your own chaap or label inspired by your personal or social experience of exclusion and challenge common stereotypes creatively. This workshop led by Sparsh encourages you to think about how objects, visuals and stories can foster belonging or alienation, to promote a more thoughtful, inclusive approach to design. Participants will also be given a guided walkthrough of the Ticket, Tika, Chaap exhibition currently open to visitors at MAP. \n\nIf you would like to bring your own device to design digitally, you are free to do so. Materials will be provided if you would like to design on paper.",
    "url": "https://map-india.org/map-events/a-chaap-for-everyone/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-cover-images-new.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "976@map-india.org",
    "name": "A World of Many Loves: 'Polyamory In India'",
    "startDate": "2025-08-09T16:00:00+05:30",
    "endDate": "2025-08-09T18:30:00+05:30",
    "description": "Curious about what lies beyond traditional monogamy? Drop in for a talk helmed by author Arundhati Ghosh about her latest book, 'All our loves' in conversation with Anita Cheria. Try your hand at relationship roleplaying games, to discover the emotional joys, challenges, and questions around loving more than one person at a time. ",
    "url": "https://map-india.org/map-events/a-world-of-many-loves-polyamory-in-india/",
    "keywords": [
      "Book Launch",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-cover-images-new-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "973@map-india.org",
    "name": "The Call of Music: 8 Stories of Hindustani Musicians",
    "startDate": "2025-08-02T18:00:00+05:30",
    "endDate": "2025-08-02T19:30:00+05:30",
    "description": "Image Credits: Anna Thomas/Hachette India\nJoin author Priya Purushothaman as she discusses her latest book, The Call of Music, which traces the layered stories of eight Hindustani musicians keeping classical traditions alive. The session will begin with an introduction by historian Ramachandra Guha, followed by a guided listening and readings from the book.\n\nLearn more about what went into writing the book. And come away with a deeper understanding of how these individual artists are negotiating caste, gender, lineage, faith and demands of their craft, in today’s age.",
    "url": "https://map-india.org/map-events/the-call-of-music-8-stories-of-hindustani-musicians/",
    "keywords": [
      "Book Launch",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-cover-images-new-2025-07-25T150015.038.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "978@map-india.org",
    "name": "Memory Keepers: A guide to photo conservation",
    "startDate": "2025-08-14T18:30:00+05:30",
    "endDate": "2025-08-14T19:30:00+05:30",
    "description": "We've all been there, finding that old family photo tucked away in a drawer, only to discover it's starting to fade, crack, or yellow. Those irreplaceable moments with loved ones, and memories captured are slowly disappearing.\nThe truth is, photographs are fragile. Heat, humidity, light, and even the way we store them can cause damage that sometimes can't be undone. But here's the good news, you don't need to be a professional to protect your photo collection!\n\nIn this talk, Chloe Lucas, a professional conservator will inform us of some preventive conservation actions that can be easily taken and implemented in a personal and private context to improve the long-term preservation of private photographic collections.",
    "url": "https://map-india.org/map-events/memory-keepers-a-guide-to-photo-conservation/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-cover-images-new-6.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "975@map-india.org",
    "name": "Up, Close and Centre",
    "startDate": "2025-08-05T17:00:00+05:30",
    "endDate": "2025-08-05T17:30:00+05:30",
    "description": "Ever admired the vibrant mural outside MAP? This is the work of Bhuri Bai, an extraordinary artist from Madhya Pradesh. She was not only the first artist from her community to work on paper and canvas using synthetic paints but she also brought Pithora art to global recognition.\n\nThis month’s edition of Up, Close and Center will feature Soumyadeep Dasgupta, an Education Officer from the MAP team. He looks at Padmashree Bhuri Bai’s work from our permanent exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.\n\nUp, Close &amp; Centre is a series to help delve deeper into the context, narratives and makings of one artwork from our collection or ongoing exhibition, chosen by our team members.",
    "url": "https://map-india.org/map-events/up-close-and-centre-2/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-cover-images-new-2.png"
  }
]