[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "868@map-india.org",
    "name": "Training Course in Conservation of Photographs in Museums, Archives, and Collections",
    "startDate": "2025-06-16T09:00:00+05:30",
    "endDate": "2025-09-13T17:30:00+05:30",
    "description": "Don’t let history disappear–or discolour–or fade! Discover the science of photography conservation and learn the art of restoring historic photograph collections. This hands-on, intensive training course is designed for practising conservators, archivists and custodians of historic photograph collections to learn preventive collection care measures, remedial conservation processes, and restoration techniques.\n\nThis three month course will be followed by a one month internship. The course will be instructed by leading specialists from India and overseas and includes topics such as: \n\n -Development, materials and techniques of historic photographic processes\n\n -Identification and understanding of deterioration processes in photograph collections\n\n -Inspection and survey methodologies\n\n -Condition report preparation and preservation prioritisation decisions\n\n -Emergency treatment measures\n\n -Conservation of film and glass plate negatives\n\n -Conservation and restoration of photographs\n\n -Archival protocols of housing, display, and storage of photographic materials\n\n -Disaster management\n\nLast day to apply: 25th May, 2025\n\nApply for this programme and we will let you know if you are selected by 31st May, 2025.",
    "url": "https://map-india.org/map-events/training-course-in-conservation-of-photographs-in-museums-archives-and-collections/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-12T161452.615.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "893@map-india.org",
    "name": "Vaanyerum Vizhuthugal",
    "startDate": "2025-06-01T16:00:00+05:30",
    "endDate": "2025-06-01T17:00:00+05:30",
    "description": "Join us for a guided walk of Vaanyerum Vizhuthugal: Roots that Reach for the Sky. \n\nInitially exhibited as part of the Chennai Photo Biennale 2024-2025, for MAP this is the first ever group exhibition dedicated to contemporary photography and lens-based practices. Vaanyerum Vizhuthugal (translating to “Roots that Reach for the Sky”), curated by Jaisingh Nageswaran, brings together the works of twelve lens-based artists of Tamil origin who push the boundaries of photography and visual storytelling.\n\nThis exhibition is a project by Goethe-Institut Chennai and Chennai Photo Biennale. \n\nThe programming is in collaboration with the Goethe Institute/Max Mueller Bhavan Bangalore.\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/vaanyerum-vizhuthugal-6/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-85.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "890@map-india.org",
    "name": "VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection",
    "startDate": "2025-05-31T13:00:00+05:30",
    "endDate": "2025-05-31T14:00:00+05:30",
    "description": "Join us on a guided walk of the exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.  Featuring over 130 diverse artworks, this exhibition redefines the portrayal of women in art through sculptures, textiles, paintings, and photographs. that challenge traditional notions of femininity and gender as social constructs.  \n\nDivided into four sections—Goddess and Mortal, Sexuality and Desire, Power and Violence, Struggle and Resistance—the exhibition highlights themes of sacrifice, desire, aggression, and empowerment.\n\nIn this guided walk, you will have the unique opportunity to engage with groundbreaking perspectives and compelling stories that provoke reflection and dialogue about women’s lives and the spaces they occupy in the Indian subcontinent. Don’t miss this opportunity to explore the intersection of art, gender, and history.\n\n&nbsp;\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/visible-invisible-representation-of-women-in-art-through-the-map-collection-26/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/01/viv-ucc-website.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "895@map-india.org",
    "name": "The Law Otherwise: Feminist Legal Journeys",
    "startDate": "2025-06-03T17:00:00+05:30",
    "endDate": "2025-06-03T18:00:00+05:30",
    "description": "What stories do laws tell—and what stories do they silence? In this walkthrough of MAP’s permanent exhibition, VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection, we follow six striking artworks and artefacts that offer unexpected entry points into the world of law, justice, and feminist resistance.\n\nFrom colonial rule to contemporary protest, these pieces help us ask: Who gets to speak? Who gets seen? And what might it mean to read the law—not as a set of fixed rules, but as an ongoing struggle over power, voice, and visibility?\n\nInspired by the idea that law is not just about order, but about shaping what counts as common sense, this guided walk led by lawyer Shrimoyee Nandini Ghosh, invites you to see legal history differently—with curiosity, care, and imagination.\n\nImage: Citizens (Little Black Drawings series), Rajan M Krishnan, 2003, Compressed charcoal and serigraphy on handmade paper, MAC.01768",
    "url": "https://map-india.org/map-events/the-law-otherwise-feminist-legal-journeys/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-29T143930.361.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "892@map-india.org",
    "name": "We don’t end at our edges",
    "startDate": "2025-06-01T13:00:00+05:30",
    "endDate": "2025-06-01T14:00:00+05:30",
    "description": "Join us for a guided walk of our new exhibition We don’t end at our edges. It is an immersive exhibition featuring artworks by Bengaluru-based artist, writer and educator Ravikumar Kashi. He uses paper to ‘paint’ letters from the Kannada alphabet, transforming language itself into a metaphor for the permeability of human connection, suggesting that while physical forms may fade, the bonds we share as individuals and as a community remain.\n\nDon't miss this opportunity to experience the exhibition firsthand.",
    "url": "https://map-india.org/map-events/we-dont-end-at-our-edges-12/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/03/Website-cover-images-new-65.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "894@map-india.org",
    "name": "Between Faces & Horizon",
    "startDate": "2025-06-01T11:00:00+05:30",
    "endDate": "2025-06-01T14:00:00+05:30",
    "description": "Give your photographs a dramatic flair! Join us for a photography workshop facilitated by Sridhar Balasubramaniyam, one of the artists featured in Vaanyerum Vizhuthugal. The workshop explores constructed portraits and how to view landscapes through a theatrical lens.\n\nSridhar brings in his experience as a theatre artist by using available props and lighting and will guide participants through the art of constructed portraits. The focus of this session is not to create aesthetic images but images with multilayered meanings and masked identities. \n\n&nbsp;\n\nPlease note: \n\nCamera is required for this workshop. Basic photography skills are helpful but not essential.\n\nImage credits: Sridhar Balasubramaniyam",
    "url": "https://map-india.org/map-events/between-faces-horizon/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-27T114654.790.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "891@map-india.org",
    "name": "Ticket Tika Chaap",
    "startDate": "2025-05-31T16:00:00+05:30",
    "endDate": "2025-05-31T17:00:00+05:30",
    "description": "From dancing elephants and beloved deities to the surprising sight of steamships, textile labels showcased a variety of captivating imagery.\n\nTextile labels arrived in Indian markets in their thousands, stuck on yards upon yards of cotton fabric manufactured in the mills of Britain (and India), and sold in Indian and global markets. They wove desire, memory, and meaning into the act of purchase. \n\nJoin us for a guided walk of our latest exhibition, Ticket Tika Chaap, which explores these textile labels, known as tikats (tickets), tikas or chaaps, and their art-historical and commercial significance, as perhaps the earliest forms of branding and advertisement, in India.\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/ticket-tika-chaap-12/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-20T144859.785.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "887@map-india.org",
    "name": "Movement Expression Workshop",
    "startDate": "2025-05-31T16:00:00+05:30",
    "endDate": "2025-05-31T19:00:00+05:30",
    "description": "“SLAE is for every woman who has ever felt overwhelmed, disconnected, or simply in need of a reminder that she is enough - just as she is.”\n\nSLAE (Self-Love Acceptance &amp; Expression) is a movement-based workshop by Priya Agarwal, who invites women to come together into a sacred space to celebrate their bodies. This workshop holds the power to unlock healing and personal growth through the power of dance as a universal language.\n\nAt MAP, SLAE will be a therapeutic session inviting participants to spend an hour going through the exhibition Visible/Invisible and exploring how the artworks make them feel. Following this, the participants will spend two hours reconnecting with their bodies through the power of movement, music, and meditation.\n\nThis event is in conjunction with the exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.\n\nPhoto credits: SLAE",
    "url": "https://map-india.org/map-events/movement-expression-workshop/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-21T120412.666.png"
  }
]