[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "972@map-india.org",
    "name": "Zine Lab",
    "startDate": "2025-08-10T11:30:00+05:30",
    "endDate": "2025-08-10T13:30:00+05:30",
    "description": "Zines have long been spaces for reflection, resistance and reclaiming stories. In this workshop with writer-illustrator Preston Olakatu, explore zine-making as a creative act of self-expression — one that holds space for personal narratives, queerness and community.\n\nThe workshop will begin with a short presentation covering the history and cultural significance of zines, tracing their roots from punk and feminist movements to present-day DIY publishing. \n\nWith an emphasis on experimentation, create your own zine exploring different formats while learning techniques such as layering, sequencing and layout structure.",
    "url": "https://map-india.org/map-events/zine-lab-2/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-cover-images-new-2025-07-22T113603.591.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "981@map-india.org",
    "name": "Draw with PencilJam",
    "startDate": "2025-08-24T10:30:00+05:30",
    "endDate": "2025-08-24T13:00:00+05:30",
    "description": "View the museum with new eyes as you make your way through various exhibitions with a sketchbook in hand. You don’t need to be a professional to join as, as we share prompts for a drawing session led by PencilJam. \n\nAll you need is an open mind and: \n\n-Sketchbook or A4 paper\n\n-Pencil (wood or mechanical) and eraser\n\n-Gel pens or fineliners for outlining\n\n-Colour brush pens, sketch pens, or colour pencils (no wet media)",
    "url": "https://map-india.org/map-events/draw-with-penciljam-2/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/10/Penciljam.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "979@map-india.org",
    "name": "Calling Up and Coming Photographers",
    "startDate": "2025-08-23T11:00:00+05:30",
    "endDate": "2025-08-23T13:00:00+05:30",
    "description": "Image Credits: 'Cooler' from the Town Boy series\nWant a professional review of your photography portfolio? Then this session is for you! Join professional photographer Sathish Kumar, whose work has featured in Chennai’s Photo Biennale and MAP’s Vaanyerum Vizhuthugal exhibition for an expert review. \n\nGain a fresh perspective on your craft, identify strengths and areas of improvement, and connect with fellow photographers who share your passion. \n\nPlease note: Participants must bring printed copies of their work or upload their portfolio during registration. The deadline to register is August 17th",
    "url": "https://map-india.org/map-events/calling-up-and-coming-photographers/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/08/Website-cover-images-new-7.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "980@map-india.org",
    "name": "Art in Motion: Girish Kasaravalli on the Centrality of Women in his Cinema",
    "startDate": "2025-08-23T17:00:00+05:30",
    "endDate": "2025-08-23T18:00:00+05:30",
    "description": "Legendary filmmaker Girish Kasaravalli engages in a deep and wide-ranging conversation on the women who anchor his cinematic narratives, with cultural critic Suresh Jayaram. The talk will focus on quiet revolutions which unfold in Kasaravalli’s films—Ghatashraddha, Thaayi Saheba, Dweepa and Kanasemba Kudureyaneri—where women are never peripheral but central to the narrative. \n\nTogether, Kasaravalli and Jayaram will explore how these stories are crafted not just through dialogue, but through silence, visual metaphor, and a cinematic grammar that draws from literature, theatre, and the visual arts. The event is being hosted in collaboration with Ananya Drushya.",
    "url": "https://map-india.org/map-events/art-in-motion-girish-kasaravalli-on-the-centrality-of-women-in-his-cinema/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2020/12/1440-X-810-Widget-06.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "976@map-india.org",
    "name": "A World of Many Loves: 'Polyamory In India'",
    "startDate": "2025-08-09T16:00:00+05:30",
    "endDate": "2025-08-09T18:30:00+05:30",
    "description": "Curious about what lies beyond traditional monogamy? Drop in for a talk helmed by author Arundhati Ghosh about her latest book, 'All our loves' in conversation with Anita Cheria. Try your hand at relationship roleplaying games, to discover the emotional joys, challenges, and questions around loving more than one person at a time. ",
    "url": "https://map-india.org/map-events/a-world-of-many-loves-polyamory-in-india/",
    "keywords": [
      "Book Launch",
      "CBD",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-cover-images-new-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "982@map-india.org",
    "name": "Coffee & Yap!",
    "startDate": "2025-08-24T14:30:00+05:30",
    "endDate": "2025-08-24T17:30:00+05:30",
    "description": "Join our casual Coffee and Yap! artsy workshop, where we teach you how you can turn your camera roll into matchbox-sized photo-books. Spend an afternoon learning a new skill and turning your memories into miniature masterpieces.",
    "url": "https://map-india.org/map-events/coffee-yap/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/08/Website-cover-images-new-8.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "978@map-india.org",
    "name": "Memory Keepers: A guide to photo conservation",
    "startDate": "2025-08-14T18:30:00+05:30",
    "endDate": "2025-08-14T19:30:00+05:30",
    "description": "We've all been there, finding that old family photo tucked away in a drawer, only to discover it's starting to fade, crack, or yellow. Those irreplaceable moments with loved ones, and memories captured are slowly disappearing.\nThe truth is, photographs are fragile. Heat, humidity, light, and even the way we store them can cause damage that sometimes can't be undone. But here's the good news, you don't need to be a professional to protect your photo collection!\n\nIn this talk, Chloe Lucas, a professional conservator will inform us of some preventive conservation actions that can be easily taken and implemented in a personal and private context to improve the long-term preservation of private photographic collections.",
    "url": "https://map-india.org/map-events/memory-keepers-a-guide-to-photo-conservation/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-cover-images-new-6.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "975@map-india.org",
    "name": "Up, Close and Centre",
    "startDate": "2025-08-05T17:00:00+05:30",
    "endDate": "2025-08-05T17:30:00+05:30",
    "description": "Ever admired the vibrant mural outside MAP? This is the work of Bhuri Bai, an extraordinary artist from Madhya Pradesh. She was not only the first artist from her community to work on paper and canvas using synthetic paints but she also brought Pithora art to global recognition.\n\nThis month’s edition of Up, Close and Center will feature Soumyadeep Dasgupta, an Education Officer from the MAP team. He looks at Padmashree Bhuri Bai’s work from our permanent exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.\n\nUp, Close &amp; Centre is a series to help delve deeper into the context, narratives and makings of one artwork from our collection or ongoing exhibition, chosen by our team members.",
    "url": "https://map-india.org/map-events/up-close-and-centre-2/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-cover-images-new-2.png"
  }
]