[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "913@map-india.org",
    "name": "Vaanyerum Vizhuthugal",
    "startDate": "2025-06-24T16:00:00+05:30",
    "endDate": "2025-06-24T17:00:00+05:30",
    "description": "Join us for a guided walk of our latest exhibition Vaanyerum Vizhuthugal: Roots that reach the sky.\n\nInitially exhibited as part of the Chennai Photo Biennale 2024-2025, this is the first group exhibition dedicated to contemporary photography and lens-based practices at MAP. Vaanyerum Vizhuthugal (translating to “Roots that Reach for the Sky”), curated by Jaisingh Nageswaran, brings together the works of twelve lens-based artists of Tamil origin who push the boundaries of photography and visual storytelling. \n\nThis will provide a richer understanding of their contributions to contemporary photography and the diverse narratives they present.\n\nThis exhibition is a project by Goethe-Institut Chennai and Chennai Photo Biennale.\nThe programming is in collaboration with the Goethe Institute/Max Mueller Bhavan Bangalore.",
    "url": "https://map-india.org/map-events/vaanyerum-vizhuthugal-9/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-13T112014.545.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "909@map-india.org",
    "name": "Vaanyerum Vizhuthugal",
    "startDate": "2025-06-29T16:00:00+05:30",
    "endDate": "2025-06-29T17:00:00+05:30",
    "description": "Join us for a guided walk of our latest exhibition Vaanyerum Vizhuthugal: Roots that reach the sky.\n\nInitially exhibited as part of the Chennai Photo Biennale 2024-2025, this is the first group exhibition dedicated to contemporary photography and lens-based practices at MAP. Vaanyerum Vizhuthugal (translating to “Roots that Reach for the Sky”), curated by Jaisingh Nageswaran, brings together the works of twelve lens-based artists of Tamil origin who push the boundaries of photography and visual storytelling. \n\nThis will provide a richer understanding of their contributions to contemporary photography and the diverse narratives they present.\n\nThis exhibition is a project by Goethe-Institut Chennai and Chennai Photo Biennale.\nThe programming is in collaboration with the Goethe Institute/Max Mueller Bhavan Bangalore.",
    "url": "https://map-india.org/map-events/vaanyerum-vizhuthugal-8/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-85.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "910@map-india.org",
    "name": "Ticket Tika Chaap",
    "startDate": "2025-06-28T16:00:00+05:30",
    "endDate": "2025-06-28T17:00:00+05:30",
    "description": "From dancing elephants and beloved deities to the surprising sight of steamships, textile labels showcased a variety of captivating imagery.\n\nTextile labels arrived in Indian markets in their thousands, stuck on yards upon yards of cotton fabric manufactured in the mills of Britain (and India), and sold in Indian and global markets. They wove desire, memory, and meaning into the act of purchase. \n\nOur latest exhibition, Ticket Tika Chaap, explores these textile labels, known as tikats (tickets), tikas or chaaps, and their art-historical and commercial significance, as perhaps the earliest forms of branding and advertisement, in India.\n\nJoin us for a guided walk of this exhibition.",
    "url": "https://map-india.org/map-events/ticket-tika-chaap-14/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/03/Website-cover-images-new-64.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "903@map-india.org",
    "name": "My Summer Storybook",
    "startDate": "2025-06-28T11:00:00+05:30",
    "endDate": "2025-06-28T14:00:00+05:30",
    "description": "Is your child still reminiscing about their summer vacation? Help them relive their memories at our bookmaking workshop. Join Aishwarya Arumbakkam, one of the artists featured in the Vaanyerum Vizhuthugal exhibition, in making books! The workshop is tailored for children aged between 8 to 12, and guides them to make books based on the summer vacation they just had.\n\nParents can help children in collecting some of the images from recent, or favourite vacations. Once you register, we will share an email ID with you to share the images with us so we can get it printed for your child. Please arrive at least 45 minutes before the workshop begins.\n\nAll materials, except for the images, will be provided.\n\nPlease note: This workshop is only for children aged 8-12",
    "url": "https://map-india.org/map-events/my-summer-storybook/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/1-8.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "935@map-india.org",
    "name": "Community Check-In",
    "startDate": "2025-06-28T17:00:00+05:30",
    "endDate": "2025-06-28T18:30:00+05:30",
    "description": "Sitamgar, Dnyansagar Press, 1985, Bombay (Mumbai), Maharashtra, India, Lithograph on paper\n\nHow do we preserve the melodies that shape our lives? What do our personal playlists say about us, and how might they be remembered years from now?\n\nJoin us at our next Community Check-In, where we dive into vintage song booklets from MAP’s collection—once sold in cinema halls during intermissions, now turned into cherished souvenirs and artefacts. Produced in both portrait and landscape formats, these ephemeral materials featured striking film posters, cast and crew details, plot summaries, and lyrics from the soundtrack—offering a fascinating glimpse into how music and cinema were consumed and remembered.\n\nLet’s get inspired from these retro artefacts, reflect on our own relationships with music and work together to create our own song booklets that capture the soundtrack of our young lives today!\n\nThis event is organised in conjunction with Pulse, MAP’s online youth journal, and offers a sneak peek into the theme of the upcoming Volume V: Soundtrack of Our Lives. \n\nCrafted as part of MAP’s youth engagement initiatives, Pulse serves as a platform for young voices; a collaborative and independent space run by young adults for young adults to share their creative work and practice.\n\nThis session is conducted as part of our engagements for the MAP Youth Collective. The MAP Youth Collective is a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.",
    "url": "https://map-india.org/map-events/community-check-in-9/",
    "keywords": [
      "MAP",
      "Youth Engagement"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-Image-1440-x-810-3.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "928@map-india.org",
    "name": "Scavenger Hunt: Museum-Wide Adventure!",
    "startDate": "2025-06-29T11:30:00+05:30",
    "endDate": "2025-06-29T13:30:00+05:30",
    "description": "Turn the museum into your playground with our lively scavenger hunt! Perfect for all ages, this adventure will lead you through galleries and hidden corners using clever clues and fun challenges. Solve riddles, spot details, and uncover secrets behind artworks as you race to the finish. Keep your eyes sharp — there’s a prize waiting for the winning team.\n\nGather your crew, follow the trail, and have fun!\n\nPlease note: There will be two sessions of this event\n\n- 11:30 am to 12:30 pm\n\n- 5:00 pm to 6:00 pm",
    "url": "https://map-india.org/map-events/scavenger-hunt-museum-wide-adventure/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/4-5.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "925@map-india.org",
    "name": "Ancient Board Games: A Blast from the Past!",
    "startDate": "2025-06-29T11:00:00+05:30",
    "endDate": "2025-06-29T17:00:00+05:30",
    "description": "Image Credits: Ima reCreations\n\nSome games never get old — and neither does the laughter they bring. Take a break from screens and rediscover the simple joy of games that once filled long afternoons and family evenings.\n\nBring your kids, parents, or that uncle who always claims he let you win at Pagade — and challenge them again! Try your hand at classics like Pallankuzhi, Thayam (5 or 7 mane), Goat and Tiger, Gilli Danda, and many more. Swap stories, share tips, and pass down a slice of your childhood while making brand new memories together. After all, some of the best moments happen when generations gather around a game board. Come roll the dice and let the good times play on!\n\nGames You Can Play:\n- Tower of Brahma\n- Star Game\n- Pallankuzhi / Alukuzhi mane\n- Thayam 5 mane / 7 mane\n- Pagade\n- Goat and Tiger\n- County Chess\n- Alignment Strategy Game Navakangari\n- Fox and Geese\n- Alquer or Bhag Bakri",
    "url": "https://map-india.org/map-events/ancient-board-games-a-blast-from-the-past/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/1-9.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "912@map-india.org",
    "name": "Ticket Tika Chaap",
    "startDate": "2025-06-27T16:00:00+05:30",
    "endDate": "2025-06-27T17:00:00+05:30",
    "description": "From dancing elephants and beloved deities to the surprising sight of steamships, textile labels showcased a variety of captivating imagery.\n\nTextile labels arrived in Indian markets in their thousands, stuck on yards upon yards of cotton fabric manufactured in the mills of Britain (and India), and sold in Indian and global markets. They wove desire, memory, and meaning into the act of purchase. \n\nOur latest exhibition, Ticket Tika Chaap, explores these textile labels, known as tikats (tickets), tikas or chaaps, and their art-historical and commercial significance, as perhaps the earliest forms of branding and advertisement, in India.\n\nJoin us for a guided walk of this exhibition.",
    "url": "https://map-india.org/map-events/ticket-tika-chaap-15/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-92.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "937@map-india.org",
    "name": "The Night we Found Magic",
    "startDate": "2025-06-29T17:00:00+05:30",
    "endDate": "2025-06-29T18:30:00+05:30",
    "description": " Image credits: Jugaad Co. \n\nWe go through life oblivious to the wondrous things we do and the magical beings we are. The fact is there’s magic all around us and there’s magic in us. People who love, do things for us, even if it makes them uncomfortable - even though it may be challenging for them, and vice versa. It’s the magic of love.\n\nWe go through obstacles everyday, do things that are difficult, go to sleep, wake up the next morning and we are willing to meet the day again – everyday. What we do is nothing short of magic. We run from one thing to another everyday without really pausing and looking. If we did we’d realize that the world we live in is full of magic. Project Magic is an attempt to stop and rediscover the magic surrounding us and in us.\n\n&nbsp;\n\n&nbsp;\n\n&nbsp;",
    "url": "https://map-india.org/map-events/the-night-we-found-magic/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/1-10.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "934@map-india.org",
    "name": "Textiles in Focus - A Hands-on Workshop in Archiving & Documenting",
    "startDate": "2025-07-05T10:00:00+05:30",
    "endDate": "2025-07-05T16:00:00+05:30",
    "description": "Calling all design students, professionals and enthusiasts to take part in museum practices in textile documentation!\n\nJoin this full day hands-on workshop to learn about procedures for documenting textiles, an integral part of creating a complete archive and exhibition. You’ll be able to shadow and assist professionals from the Haveli team in the steps involving textile documentation including research, photographing, digitisation, cataloguing and writing, ending the day with a collaborative discussion on the collection.\n\nPlease note:\n\n- Last date for registration: June 27, 2025\n\n- Limited seats available. Selected participants will be notified by July 2, 2025\n\n- This workshop, though created especially for students, is open to everyone\n\nAbout Haveli \n\nFounded in the 1980s by Poornima Jain, Haveli was a pioneering boutique that celebrated the richness of Indian craftsmanship through timeless clothing and accessories. Blending traditional craft and studio techniques into contemporary design, the brand explored diverse silhouettes using hand-woven fabrics and materials deeply rooted in India’s heritage and philosophy of sustainable livelihoods.\n\nHaveli at MAP\n\nThe present-day Haveli collection at MAP includes over 2,800 textile objects and 2,000 ephemera items, featuring costumes, accessories and home textiles from Asian and African craft traditions, design studio developments along with archival materials like printing blocks, design sheets, and student projects that document the workings of a textile and fashion design studio.",
    "url": "https://map-india.org/map-events/textiles-in-focus-a-hands-on-workshop-in-archiving-documenting/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-Image-1440-x-810-2.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "931@map-india.org",
    "name": "All Hail The Trail",
    "startDate": "2025-06-29T15:30:00+05:30",
    "endDate": "2025-06-29T16:30:00+05:30",
    "description": "This guided trail of the exhibition VISIBLE/INVISIBLE invites families to see familiar artworks with fresh eyes while exploring the hidden stories behind them. Along the way, you’ll play, hunt for details, and share thoughts and discoveries with each other — all through a hands-on trail designed to spark curiosity and conversation for all ages.\n\nSlow down, look closer, and experience art not just by looking, but by connecting, asking, and imagining together. A fun way to bond as a family while making the galleries come alive!\n\nYou can also sign up for the guided walk of our exhibition Vaanyerum Vizhuthugal: Roots that Reach for the Sky by clicking here.",
    "url": "https://map-india.org/map-events/all-hail-the-trail/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/7-3.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "927@map-india.org",
    "name": "Photo-(p)op: Strike a Pose, Make a Memory!",
    "startDate": "2025-06-29T11:00:00+05:30",
    "endDate": "2025-06-29T17:00:00+05:30",
    "description": "Image Credit: Gallery Sumukha and Claire Arni\n\nReady to dress up and strike a pose? Lens-based artist Claire Arni brings a trunk full of props and costumes for you to mix, match, and transform into whoever you want to be. Gather your gang, pick a costume, and snap a photo to remember the day. If you’d like Claire to click your portrait, swing by between 11:00 am and 1:00 pm. Can’t make it at that time? Don’t worry—we’ve got you covered. No fuss, just fun — and a printed photograph to take home!\n\n&nbsp;",
    "url": "https://map-india.org/map-events/photo-pop-strike-a-pose-make-a-memory/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/3-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "924@map-india.org",
    "name": "NeuroQueer BrainBox",
    "startDate": "2025-06-28T15:00:00+05:30",
    "endDate": "2025-06-28T18:00:00+05:30",
    "description": "Visibility and representation in public spaces is important - especially for queer, neurodivergent Desis. That’s why the NeuroQueer Brain Box exists - a monthly group therapy space for Desi neurodivergent LGBTQIA+ people. Facilitated by Mani Agarwal, NeuroQueer Brain Box is a chance for Desi queer neurodivergent people to come together and work through their lived experiences using art.\n\nCome and meet other LGBTQIA+ neurodivergent (ADHD/Autism/AuDHD) people who vibe with you.\n\nPlease note: This session is exclusively open to individuals from the LGBTQIA+ community",
    "url": "https://map-india.org/map-events/neuroqueer-brainbox/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-Image-1440-x-810-1-2.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "911@map-india.org",
    "name": "VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection",
    "startDate": "2025-06-28T13:00:00+05:30",
    "endDate": "2025-06-28T14:00:00+05:30",
    "description": "Join us on a guided walk of the exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.  Featuring over 130 diverse artworks, this exhibition redefines the portrayal of women in art through sculptures, textiles, paintings, and photographs. that challenge traditional notions of femininity and gender as social constructs.  \n\nDivided into four sections—Goddess and Mortal, Sexuality and Desire, Power and Violence, Struggle and Resistance—the exhibition highlights themes of sacrifice, desire, aggression, and empowerment.\n\nIn this guided walk, you will have the unique opportunity to engage with groundbreaking perspectives and compelling stories that provoke reflection and dialogue about women’s lives and the spaces they occupy in the Indian subcontinent. Don’t miss this opportunity to explore the intersection of art, gender, and history.\n\n&nbsp;\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/visible-invisible-representation-of-women-in-art-through-the-map-collection-27/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/12/VIV-website-banner-2.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "868@map-india.org",
    "name": "Training Course in Conservation of Photographs in Museums, Archives, and Collections",
    "startDate": "2025-06-16T09:00:00+05:30",
    "endDate": "2025-09-13T17:30:00+05:30",
    "description": "Don’t let history disappear–or discolour–or fade! Discover the science of photography conservation and learn the art of restoring historic photograph collections. This hands-on, intensive training course is designed for practising conservators, archivists and custodians of historic photograph collections to learn preventive collection care measures, remedial conservation processes, and restoration techniques.\n\nThis three month course will be followed by a one month internship. The course will be instructed by leading specialists from India and overseas and includes topics such as: \n\n -Development, materials and techniques of historic photographic processes\n\n -Identification and understanding of deterioration processes in photograph collections\n\n -Inspection and survey methodologies\n\n -Condition report preparation and preservation prioritisation decisions\n\n -Emergency treatment measures\n\n -Conservation of film and glass plate negatives\n\n -Conservation and restoration of photographs\n\n -Archival protocols of housing, display, and storage of photographic materials\n\n -Disaster management",
    "url": "https://map-india.org/map-events/training-course-in-conservation-of-photographs-in-museums-archives-and-collections/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-12T161452.615.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "936@map-india.org",
    "name": "Art and Imagination: The Creative Journey of an Author",
    "startDate": "2025-06-28T18:00:00+05:30",
    "endDate": "2025-06-28T19:30:00+05:30",
    "description": "Engagement with various art mediums can profoundly impact one's creative journey. Each medium offers unique possibilities - both personally and professionally - from letting one express themselves to shaping one's perception of the world. The conversation between author Vivek Shanbhag and literary critic S R Vijayshankar takes us through that journey of a writer and his writing; inviting us to take a look at the relationship between writing and art.\n\nTaking inspiration from the folk perforamce art of Yakshagana, Vivek Shanbhag’s works encompass characteristics of painting, dance, music, rhythms and improvisation. The discussion explores how one’s milestones are shaped by their thoughts and different kinds of art forms. Join Vivek Shanbhag and S R Vijayshankar as they delve into how medium could impact one's artistic style, experimenting leading to creative growth, and the emotional resonance it brings about.\n\nThis talk is in collaboration with Ananya Dhrishya.\n\n&nbsp;\n\n&nbsp;",
    "url": "https://map-india.org/map-events/art-and-imagination-the-creative-journey-of-an-author/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/2-9.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "933@map-india.org",
    "name": "Family Day at MAP!",
    "startDate": "2025-06-29T11:00:00+05:30",
    "endDate": "2025-06-29T19:00:00+05:30",
    "description": "Get ready for a day of laughter, discovery, and unforgettable memories at MAP's Family Day – a celebration of all the amazing people who make up your unique family!\n\nBring your kids, parents, grandparents, nieces, nephews, friends–whomever you call family. This is a chance to create unforgettable memories together, across generations. Whether you're young or old, there's curiosity, wisdom, and wonder to share at every age. It's all about having fun together, connecting, and sharing meaningful experiences as a family.\n\nJoin us at MAP for a day packed with captivating stories, thrilling games, and hands-on creative fun. You'll hear tales that bring artworks to life, embark on an exciting scavenger hunt, challenge yourselves with ancient board games, and unleash your creativity at our Make @ MAP workshop. And trust us, that's just the beginning – there's so much more waiting to surprise and delight you!\n\nWrap up your day with a cheerful theatre show and capture those perfect moments at our photo booth. So come on over, hit the slow-mo button, and let us handle all the fun!\n\nFamily Day Programmes:\n\n- Ancient Board Games: A Blast from the Past!\n- Make @ MAP: Craft Your Family Story!\n- Photo-(p)op: Strike a Pose, Make a Memory!\n- Scavenger Hunt: Museum-Wide Adventure!\n- Storytelling with Vikram Sridhar: Stories Between the Lines\n- Conversations That Matter\n- All Hail The Trail\n- The Night we Found Magic",
    "url": "https://map-india.org/map-events/family-day-at-map/",
    "keywords": [
      "Kids & Family",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/5-scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "929@map-india.org",
    "name": "Storytelling with Vikram Sridhar: Stories Between the Lines",
    "startDate": "2025-06-29T14:00:00+05:30",
    "endDate": "2025-06-29T17:00:00+05:30",
    "description": "Image Credit: Vikram Sridhar\n\nIn engaging 20-minute sessions, theatre artist Vikram Sridhar explores the cultural, personal, and historical layers woven into the labels and artefacts of Ticket Tika Chaap. Blending narrative and performance, Sridhar will embody a range of characters bringing forgotten voices and moments to life. Join us for an immersive experience that bridges theatre and storytelling, and leave with a deeper appreciation for the stories waiting to be discovered in the everyday.",
    "url": "https://map-india.org/map-events/storytelling-with-vikram-sridhar-stories-between-the-lines/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/5-3.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "930@map-india.org",
    "name": "Conversations That Matter",
    "startDate": "2025-06-29T14:00:00+05:30",
    "endDate": "2025-06-29T16:00:00+05:30",
    "description": "Inspired by the evocative exhibition Vaanyerum Vizhuthugal: Roots that Reach for the Sky and guided by gentle prompts from our Art for Thought toolkit, we invite families to share wonderful stories, cherished memories, and quiet reflections – conversations you might not often find time for. It's the perfect opportunity to deepen your connections and maybe even discover new things about each other!\n\nThe Art for Thought toolkit is a reflective resource that uses artwork and thought-provoking prompts to spark meaningful conversations and self-discovery. Designed for all ages, it encourages mindful engagement with art to support emotional well-being and deeper dialogue.\n\nYou can also sign up for the guided walk of our exhibition VISIBLE/INVISIBLE by clicking here.",
    "url": "https://map-india.org/map-events/conversations-that-matter/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/6-2.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "926@map-india.org",
    "name": "Make @ MAP: Craft Your Family Story!",
    "startDate": "2025-06-29T11:00:00+05:30",
    "endDate": "2025-06-29T13:00:00+05:30",
    "description": "Who do you call family? Is it your kith and kin, a close-knit group of friends, a caring neighbour who feels like one of your own, or perhaps a loyal furry companion who’s always by your side?\n\nJoin us for a workshop that celebrates all the ways family can look and feel. In this hands-on session, you’ll get to craft popsicle puppets inspired by the people (and pets!) who make up your circle of love and care. Come, create, and carry home a tiny puppet family as unique and warm as your own!\n\nMake @ MAP is a series that allows you to explore our collection in an engaging and hands-on manner. These sessions allow you to create and take home a special souvenir of your visit. It is perfect for all ages — so bring your friends and family and get ready to make some art! No experience is necessary, just a willingness to have fun and experiment with new materials.",
    "url": "https://map-india.org/map-events/make-map-craft-your-family-story/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/2-8.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "923@map-india.org",
    "name": "Gossip After Hours: A Storytelling Workshop with Museum Objects",
    "startDate": "2025-06-27T10:00:00+05:30",
    "endDate": "2025-06-29T17:00:00+05:30",
    "description": "Have you ever wondered what museum objects gossip about after closing time? Join this playful storytelling workshop to imagine conversations and other lives of artworks and artefacts at MAP. Together, we’ll craft stories that blur the lines between fact and fiction, inspired by the objects’ histories and your imagination. No writing experience needed - just curiosity and a love for stories! Come let your curiosity run wild!\n\nPlease Note:\n- Limited seats are available. Deadline to register via Google Form: 24 June\n- Selected participants will be notified by 25th June",
    "url": "https://map-india.org/map-events/gossip-after-hours-a-storytelling-workshop-with-museum-objects/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-Image-1440-x-810.png"
  }
]