[
  {
    "@context": "http://schema.org",
    "@type": "ScreeningEvent",
    "name": "The World is Family",
    "startDate": "2024-07-06T13:30:00+00:00",
    "endDate": "2024-07-06T13:30:00+00:00",
    "description": "Vasudhaiva Kutumbakam, a Sanskrit phrase meaning “the world is family”, is a universalist idea that competes with dominant, exclusivist Hindu notions of caste. The director of the film, Anand Patwardhan, grew up in a milieu that questioned the latter. The family’s elders had fought for India’s Independence, but had rarely spoken about it. ‘Liberty, Equality, Fraternity’, words enshrined in India’s Constitution, were subconsciously internalised.\n\nAs his parents aged, Anand began to film with whatever equipment was at hand. Soon, birthdays and family gatherings gave way to oral history. Revisiting home movie footage a decade after his parents had passed, was a revelation. Today, supremacist ideology has plagued and altered notions of democracy. As they rewrite India’s history, memories of the past and the lessons they present us with have become more precious than mere personal nostalgia.\n\nJoin us for a screening of this award-winning documentary followed by a Q&amp;A with the filmmaker.\n\nCredits:\n\n- Production, Direction, Editing: Anand Patwardhan\n- Camera and Sound: Anand Patwardhan, Simantini Dhuru\n- Production Assistance: Simantini Dhuru, Mohosin Shaikh",
    "url": "https://map-india.org/map-events/the-world-is-family/",
    "keywords": [
      "Film Screenings, MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "The World is Family"
    },
    "image": "https://map-india.org/wp-content/uploads/2024/06/World-is-family-web-image.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "EducationEvent",
    "name": "Curating is Mapping",
    "startDate": "2024-06-30T04:30:00+00:00",
    "endDate": "2024-06-30T11:30:00+00:00",
    "description": "Have you ever wanted to learn how exhibitions are curated for a museum or gallery? Then this hands-on curatorial workshop by Fulbright-Nehru scholar Julia Wintner is the perfect opportunity for you.\n\nCurating Is Mapping is a 6 hour, hands-on curatorial workshop for both aspiring and experienced curators during which you will experience the full arc of the exhibition process: from initial concept and curatorial statement, to digital presentation.\n\nMAP’s permanent exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection (currently on view) will serve as your prompt for curating. Julia will distribute selected images and texts to guide the attendees’ curatorial focus.\n\nWe will examine the range of critical curatorial tasks and how they affect curators’ relationships with both artists and spaces. We will explore these tasks with close attention to current social and cultural events. Once you register for the workshop, we will share the workshop schedule and pre-workshop prompts to get you started!",
    "url": "https://map-india.org/map-events/curating-is-mapping/",
    "keywords": [
      "MAP, Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/06/Website-Image-1440-x-810-20.png"
  },
  {
    "@context": "http://schema.org",
    "@type": "TheaterEvent",
    "name": "The Earthquake",
    "startDate": "2024-06-30T13:00:00+00:00",
    "endDate": "2024-06-30T13:00:00+00:00",
    "description": "Do you ever feel alone, even when surrounded by people? Do you crave connection, even when it cracks a little? This is a performance piece that explores loneliness.\n\nThe Earthquake tells the story of two people. In their story, the meaning of human connection, loneliness, and unspoken words hang heavy in the air.\n\nMathew and Sameer meet every week, their meeting as familiar as the apple they share. Yet, the unspoken words scream louder than their spoken conversations. This story of cycles, of coming together, drifting apart, and all the spaces in between, is an adaptation of “Bhūmikampa – Das Erdbeben” which received the Internationaler Kulturprojekte Grant 2023 from the Landeshauptstadt München Kulturreferat (City of Munich).",
    "url": "https://map-india.org/map-events/the-earthquake/",
    "keywords": [
      "MAP, Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/06/Website-Image-1440-x-810-21.png"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Tuesday Tidbits",
    "startDate": "2024-07-02T10:30:00+00:00",
    "endDate": "2024-07-02T10:30:00+00:00",
    "description": "Have you visited your favourite museum and stopped at the museum shop? Maybe to pick up an art postcard or wander through the aisles of publications, souvenirs, etc.? Have you thought about who makes these things and how they come up with these ideas?\n\nJoin us for the next session of Tuesday Tidbits, a series that explores different aspects of working in a museum. This is a free, drop-in session that’s part of the Tuesday Tidbits.\n\nThis week, Shriya Dinesh, part of the Merchandising team at MAP, will share how she takes inspiration from the existing museum collection. The session will be held at Visible/Invisible: Representation of Women in Art through the MAP Collection where Shriya will share how she ideates and comes up with souvenir and collectible ideas that can take art to a larger audience.",
    "url": "https://map-india.org/map-events/tuesday-tidbits-3/",
    "keywords": [
      "Drop-in Sessions, MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/06/Untitled-design-11.jpg"
  },
  {
    "@context": "http://schema.org",
    "@type": "EducationEvent",
    "name": "Live Sketching at MAP",
    "startDate": "2024-06-29T05:30:00+00:00",
    "endDate": "2024-06-29T05:30:00+00:00",
    "description": "NS Bendre at the painting studio at the Faculty of Fine Arts, MS University, Baroda, Jyoti Bhatt, 1959, DC.00232 \n\nIf you feel inspired by art around you and want to pick up a pencil and draw, come experience this art-inspired facilitated live sketching session. Join Smitha Shivaswamy, founder of Penciljam, at the exhibition, Hello &amp; Goodbye: Postcards from the Early 20th Century, at a guided live sketching session.\n\nThe Live Sketching session will begin with an introduction to sketching and drawing from life. There will be a guided discussion followed by journalling which will explore how postcards make you feel, what the ideas presented in the collection at Hello &amp; Goobye: Postcards from the Early 20th Century, and what they evoke in you. You will immerse yourself in the time period and sketch inspired by the postcard that speaks to you. You can finally post the postcard at our little postbox outside the gallery and it will get sent to your intended reader! Finally, you can finish by sharing and discussing your sketches and observations.\n\nWhether you are an experienced sketcher or looking to begin your live sketching journey, this facilitated session offers an opportunity to learn new skills or hone existing ones, and become part of a community of sketchers! You can bring your own pencils and sketchbook or we will provide the materials for this session.\n\nPlease note: During the course of the day, we will conduct two sessions each lasting one hour. The first session begins at 11 am and the second one begins at 4 pm.",
    "url": "https://map-india.org/map-events/live-sketching-at-map-2/",
    "keywords": [
      "MAP, Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/06/Edited-NS-Bendre-by-Jyoti-Bhatt.jpg"
  }
]