[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1106@map-india.org",
    "name": "Up, Close and Centre",
    "startDate": "2025-12-16T17:00:00+05:30",
    "endDate": "2025-12-16T17:30:00+05:30",
    "description": "Airavata, Indra's divine elephant, draws water from the underworld and creates clouds that become rain. Anand Sachin from the MAP team dives into this story in Up, Close and Centre: In Celestial Company.\n\nMAP is home to a growing collection of over 100,000 artworks. Up, Close &amp; Centre is a series that allows audiences to engage with art in deeper and more meaningful ways by delving into the context, narratives and makings of one artwork from our collection, chosen by our team members.",
    "url": "https://map-india.org/map-events/up-close-and-centre-4/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/11/ICC-InstallViews_web-8-scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1103@map-india.org",
    "name": "Crooked Cats: Beastly Encounters in the Anthropocene",
    "startDate": "2025-12-07T16:30:00+05:30",
    "endDate": "2025-12-07T18:00:00+05:30",
    "description": "Harper Collins India\nBig cats—tigers, leopards, and lions—that make prey of humans are commonly known as “man-eaters.”\nThis book reconceptualizes them as cats that have gone off the straight path to become “crooked.”\n\nJoin us for a talk by author Nayanika Mathur about her book ‘Crooked Cats: Beastly Encounters in the Anthropocene’. Building upon fifteen years of research in India, this book moves beyond both colonial and conservationist accounts to place “crooked cats” at the centre of the question of how we are to comprehend a planet in crisis.\n\nThis programme is in conjunction with the exhibition The Many Lives of the Cat.",
    "url": "https://map-india.org/map-events/crooked-cats-beastly-encounters-in-the-anthropocene/",
    "keywords": [
      "Book Launch",
      "CBD",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/11/Website-cover-images-new-71.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1098@map-india.org",
    "name": "Nine Lives, Nine Stories",
    "startDate": "2025-12-06T16:00:00+05:30",
    "endDate": "2025-12-06T17:30:00+05:30",
    "description": "Experience The Many Lives of the Cat exhibition through an intimate guided walk, followed by a theatrical reading of B.N. Goswamy's The Indian Cat performed by Bangalore Little Theatre.\n\n&nbsp;\n\nThis programme is in conjunction with the exhibition The Many Lives of the Cat",
    "url": "https://map-india.org/map-events/nine-lives-nine-stories/",
    "keywords": [
      "CBD",
      "MAP",
      "Storytelling Session"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/11/Website-cover-images-new-66.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1100@map-india.org",
    "name": "Access Tour: Experiencing MAP's Inclusive Design",
    "startDate": "2025-12-16T16:00:00+05:30",
    "endDate": "2025-12-16T17:00:00+05:30",
    "description": "“Inclusive design” isn't just a buzzword, it's built into our walls.\n\nWhile most of our guided walks focus on exhibitions, this session offers something different—a chance to explore how the MAP building is designed to be inclusive and accessible for everyone. This one-hour walkthrough will be led by Inclusion Manager Shailesh Kulal, who will share firsthand perspectives on accessibility and inclusive design.\n\nThis event is part of our International Day of Persons with Disabilities (IDPD) celebrations, running from December 6, 2025 onwards at MAP. The programme celebrates diverse abilities and aims to raise awareness, promote accessibility, and create inclusive environments in workplaces and communities.",
    "url": "https://map-india.org/map-events/access-tour-experiencing-maps-inclusive-design/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/11/Website-cover-images-new-69.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1105@map-india.org",
    "name": "Shattered Lands: Five Partitions and the Making of Modern Asia",
    "startDate": "2025-12-08T18:00:00+05:30",
    "endDate": "2025-12-08T19:00:00+05:30",
    "description": "Join us for a discussion of the book, Shattered Lands: Five Partitions and the Making of Modern Asia with the author, Sam Dalrymple.\n\nShattered Lands, for the first time, presents the whole story of how the Indian Empire was unmade. How a single, sprawling dominion became twelve modern nations. How maps were redrawn in boardrooms and on battlefields, by politicians in London and revolutionaries in Delhi, by kings in remote palaces and soldiers in trenches.",
    "url": "https://map-india.org/map-events/shattered-lands-five-partitions-and-the-making-of-modern-asia/",
    "keywords": [
      "Book Launch",
      "CBD",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/11/Website-cover-images-new-74.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "1097@map-india.org",
    "name": "Films on Indian Architectural Heritage",
    "startDate": "2025-12-06T15:00:00+05:30",
    "endDate": "2025-12-06T17:00:00+05:30",
    "description": "Photo credits: Manu Rewal\nMAP presents two documentaries by filmmaker Manu Rewal that explore how architecture, landscape, and cultural histories come together in shaping two iconic Indian cities.\n\nMandu, the City of Joy (1996) offers a portrait of the 15th-century hilltop capital where water systems, terrain, and architecture merge in inventive ways. Through miniature paintings and architectural reflections, the film reveals Mandu’s distinctive synthesis of Hindu and Muslim artistic traditions.\n\nUdaipur, a Romance with Nature (1997) traces how the city’s palaces, lakes, and urban form evolved in response to climate and geography. Set in the 16th and 17th centuries, the film highlights Udaipur’s enduring dialogue between architecture and nature, and its influence on later aesthetic visions.\n\nFollowing the screening, join us for a Q&amp;A with writer and director Manu Rewal, offering deeper insights into his research, process, and the making of these films.",
    "url": "https://map-india.org/map-events/films-on-indian-architectural-heritage/",
    "keywords": [
      "CBD",
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Films on Indian Architectural Heritage"
    },
    "image": "https://map-india.org/wp-content/uploads/2025/11/Website-cover-images-new-65.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1094@map-india.org",
    "name": "Family Day - Third Edition",
    "startDate": "2025-12-13T10:00:00+05:30",
    "endDate": "2025-12-13T16:00:00+05:30",
    "description": "The year is wrapping up, and we're celebrating with events the whole family will love. End 2025 on a high note with us! Make memories with your family at our festive lineup of events.\n\nBring your children, nieces and nephews, grandkids and godchildren for a fun-filled day of learning, games, and activities. From hearing stories across the museum and treasure hunts, to playful activities in our exhibitions, the day is packed with events designed especially for children. Wrap up the experience with a delightful theatre performance for young audiences. We’ve got the whole day sorted—all you need is a child (or a few!) to join in. The more, the merrier!\n\n\n\n&nbsp;\n\nQuality Time with Rhythm n Rhyme (Ages 1 to 5)\n\n10:00-11:00 AM  (Session 1)\n1:00-2:00 PM      (Session 2)\n\nBring your toddler or young child (up to 6 years) for an hour of dancing, singing, and interactive fun—parents can join in too!\n\nBob, the Builder with Troy World (Ages 6 to 10)\n\n11:30 AM - 12:30 PM  (Session 1)\n2:30 PM - 3:30 PM    (Session 2)\n\nBuild, stack, create! With Troy World's wooden blocks, kids can construct sky-high giraffes, roaring dinosaurs, or anything their imagination dreams up.\n\nJourney through the Realms (Ages 8 to 12)\n\n11:00 AM - 12:00 PM (Session 1)\n1:00-2:00 PM              (Session 2)\n\nTravel through the five realms of air, land, water, the in-between and the celestial, and discover what each companion reveals about deities, the world, and our lives. \n\nBond Through Sign Language (All ages)\n\n12:00 PM-1:00 PM\n\nJoin our Indian Sign Language session for beginners hosted by Madhur Arora from the MAP team. Learn words in sign language related to family, art, culture and more.\n\nThe Great Tikat Hunt (8 to 15)\n\n10:00 AM - 3:00 PM\n\nUnleash your inner detective as you embark on a thrilling quest to find hidden clues scattered throughout the exhibition Ticket Tika Chaap. Are you ready to take on the challenge? Let the hunt begin!\n\nCrabbby by Ranga Shankara’s AHA! (All ages)\n\n3:00-4:00 PM\n\nDirected by S. Surendranath, this story follows Crabby and Storky, enemies turned friends, as they come together to rescue their pond. When townspeople keep throwing garbage into their home, Crabby comes up with a brilliant idea to save it. From Ranga Shankara's AHA!, this show is for everyone- from cute battanis to cool colony uncles!!\n\nPause and Play (5 to 15)\n\n11:00AM - 3:00PM\n\nA family activity zone to slow down, make, and share time together. Hop between stations for colouring, crafting clay dolls or pebble painting. \n\nFace Art Fun (5 to 15)\n\n11:00AM - 3:00PM\n\nTransform little faces into works of art! Parents and guardians can use skin-safe colors to create designs together at the face painting station.\n\nBringing You Stories! (All ages)\n\n10:15 - 11:00 AM (Session 1)\n12:15 - 1:00 PM   (Session 2)\n2:00 - 2:45 PM   (Session 3)\n\nFollow the voices! Kathalaya Storytellers are scattered across the museum, ready to whisk you away to magical places. Perfect for making new family memories while reliving old ones.\n\nPlease note that some events have limited capacity per session, but multiple time slots are available so everyone has a chance to participate! Here is a list of FAQS for the queries you may have.",
    "url": "https://map-india.org/map-events/family-day-third-edition/",
    "keywords": [
      "CBD",
      "Kids & Family",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/11/FD_Dec13_25_website-02-02-scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1104@map-india.org",
    "name": "Human Library – Featuring Artists with Disabilities",
    "startDate": "2025-12-20T11:00:00+05:30",
    "endDate": "2025-12-20T12:30:00+05:30",
    "description": "Meet artists up close in an intimate setting. The Human Library is a unique format where artists share their practice for a few minutes, then open the floor for your questions and conversation.\n\nThe Human Library invites you to meet artists Gayatri Gupta, Jyoti K Kumar and Nawaz Shaikh, who will share their creative journeys, artistic perspectives, and the stories behind their practice. This is a conversation about art, inspiration, and creative process—foregrounding the work, not the disability.\n\nThis event is part of our International Day of Persons with Disabilities (IDPD) celebrations, running from December 6, 2025 onwards at MAP. The programme celebrates diverse abilities and aims to raise awareness, promote accessibility, and create inclusive environments in workplaces and communities.",
    "url": "https://map-india.org/map-events/human-library-featuring-artists-with-disabilities/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/11/Website-cover-images-new-72.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1099@map-india.org",
    "name": "Sketch with Us",
    "startDate": "2025-12-07T10:30:00+05:30",
    "endDate": "2025-12-07T13:30:00+05:30",
    "description": "We’re back with another sketching session at MAP!\n\nJoin us for a sketching workshop that captures the quiet language shared between people and cats. Participants are invited to sketch moments of closeness and warmth, where art meets affection in line and gesture.",
    "url": "https://map-india.org/map-events/sketch-with-us-2/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/11/Website-cover-images-new-67.png"
  }
]