[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "856@map-india.org",
    "name": "Scrappy Puppet Tales - Summer at MAP",
    "startDate": "2025-05-19T11:00:00+05:30",
    "endDate": "2025-05-24T16:00:00+05:30",
    "description": "Summer holidays are here, and are the kids already chanting \"I'm bored?\"! Get them over to MAP for an exciting summer camp filled with art, learning and group activities facilitated by professional artists. Give your kids a summer to remember at the museum.\n\nGet ready for some fun storytelling! In the Scrappy Puppet Tales workshop, kids will become puppet creators using all sorts of cool scrap and junk. It's a hands-on adventure where imagination takes center stage. Guided by renowned actress  and puppeteer Padmavati Rao, children will bring their wacky puppet characters to life. The grand finale? A showcase where each young artist gets to present their puppet creations!\n\nAge group- 9-12 year olds. Registration fees is ₹1000. Number of participants are limited so please register to confirm your spot.",
    "url": "https://map-india.org/map-events/scrappy-puppet-tales-summer-at-map/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-2025-04-26T144806.943.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "868@map-india.org",
    "name": "Training Course in Conservation of Photographs in Museums, Archives, and Collections",
    "startDate": "2025-06-16T09:00:00+05:30",
    "endDate": "2025-09-13T17:30:00+05:30",
    "description": "Don’t let history disappear–or discolour–or fade! Discover the science of photography conservation and learn the art of restoring historic photograph collections. This hands-on, intensive training course is designed for practising conservators, archivists and custodians of historic photograph collections to learn preventive collection care measures, remedial conservation processes, and restoration techniques.\n\nThis three month course will be followed by a one month internship. The course will be instructed by leading specialists from India and overseas and includes topics such as: \n\n -Development, materials and techniques of historic photographic processes\n\n -Identification and understanding of deterioration processes in photograph collections\n\n -Inspection and survey methodologies\n\n -Condition report preparation and preservation prioritisation decisions\n\n -Emergency treatment measures\n\n -Conservation of film and glass plate negatives\n\n -Conservation and restoration of photographs\n\n -Archival protocols of housing, display, and storage of photographic materials\n\n -Disaster management\n\nLast day to apply: 25th May, 2025\n\nApply for this programme and we will let you know if you are selected by 31st May, 2025.",
    "url": "https://map-india.org/map-events/training-course-in-conservation-of-photographs-in-museums-archives-and-collections/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-12T161452.615.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "884@map-india.org",
    "name": "We don’t end at our edges",
    "startDate": "2025-05-25T13:00:00+05:30",
    "endDate": "2025-05-25T14:00:00+05:30",
    "description": "Join us for a guided walk of our exhibition We don’t end at our edges. It is an immersive exhibition featuring artworks by Bengaluru-based artist, writer and educator Ravikumar Kashi. He uses paper to ‘paint’ letters from the Kannada alphabet, transforming language itself into a metaphor for the permeability of human connection, suggesting that while physical forms may fade, the bonds we share as individuals and as a community remain.\n\nDon't miss this opportunity to experience the exhibition firsthand.",
    "url": "https://map-india.org/map-events/we-dont-end-at-our-edges-11/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Khushi-Guided-Walk-event.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "882@map-india.org",
    "name": "VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection",
    "startDate": "2025-05-24T13:00:00+05:30",
    "endDate": "2025-05-24T14:00:00+05:30",
    "description": "Join us on a guided walk of the exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.  Featuring over 130 diverse artworks, this exhibition redefines the portrayal of women in art through sculptures, textiles, paintings, and photographs. that challenge traditional notions of femininity and gender as social constructs.  \n\nDivided into four sections—Goddess and Mortal, Sexuality and Desire, Power and Violence, Struggle and Resistance—the exhibition highlights themes of sacrifice, desire, aggression, and empowerment.\n\nIn this guided walk, you will have the unique opportunity to engage with groundbreaking perspectives and compelling stories that provoke reflection and dialogue about women’s lives and the spaces they occupy in the Indian subcontinent. Don’t miss this opportunity to explore the intersection of art, gender, and history.\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/visible-invisible-representation-of-women-in-art-through-the-map-collection-25/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2023/08/VIV-Featured-Image.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "877@map-india.org",
    "name": "Make at MAP",
    "startDate": "2025-05-25T11:30:00+05:30",
    "endDate": "2025-05-25T15:30:00+05:30",
    "description": "What’s your favourite animal? A fish, a snake or a three headed cat?\n\nThis edition of Make at MAP draws inspiration from the rich legacy of the various animal themes explored by indigenous communities in India. Let your imagination run wild—paint your favourite animal or invent a whimsical creature of your own, and take it home with you!\n\nSession timings:\n\n11.30am-1pm\n\n2pm-3.30pm",
    "url": "https://map-india.org/map-events/make-at-map-20/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-19T163334.715.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "886@map-india.org",
    "name": "Art in Motion: Girish Kasaravalli on Storytelling and Women in his Cinema",
    "startDate": "2025-05-31T18:00:00+05:30",
    "endDate": "2025-05-31T19:00:00+05:30",
    "description": "Join artist, curator and cultural thinker Suresh Jayaram and renowned Kannada filmmaker Girish Kasaravalli in an insightful conversation on the poetic and profound portrayals of women in Kasaravalli’s films. From Ghatashraddha and Thaayi Saheba, to Dweepa and Kansemba Kudureyaneri, women in his films are never peripheral. Rather, the women play a central and resilient role set against the emotional, social and political background of his films.\n\nThese backgrounds are crafted not just by dialogue, but also through the cinematic language and grammar featuring silences and visual metaphors. Drawing from Jayaram’s background as a visual artist, the talk will discuss how this cinematic grammar draws from other art forms of literature, theatre and the visual arts. Together, Kasaravalli and Jayaram will explore women’s quiet revolutions in his films, discussing how they resist, remember and reimagine the world.\n\nImage credits: S G Vasudev",
    "url": "https://map-india.org/map-events/art-in-motion-girish-kasaravalli-on-storytelling-and-women-in-his-cinema/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-21T114444.237.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "874@map-india.org",
    "name": "Hariva Nadige Maiyella Kaalu | ಹರಿವ ನದಿಗೆ ಮೈಯೆಲ್ಲಾ ಕಾಲು",
    "startDate": "2025-05-30T18:00:00+05:30",
    "endDate": "2025-05-30T20:00:00+05:30",
    "description": "What stories do footsteps tell? \n\nSpend your Friday evening unwinding with a Kannada film screening, followed by a discussion with the filmmaker Babu Eshwar Prasad. Inspired by 12th century Kannada poet Allama Prabhu’s vachana, the title ‘Hariva Nadige Maiyella Kaalu’ (A Running River is all Legs) encapsulates the theme of this film which focuses on the idea of motion and walking. The film is a meditation on the act of walking through the lives of three principal characters: Kumar, a photojournalist disenchanted with his regular job, visits different places seeking new sources of inspiration; Neelu, a salesgirl in a shoe shop with a set routine, is only interested in watching people walk; and Amaresha, an elderly prisoner, alleviates his feelings of confinement by walking to imagined places within his cell. \n\nThe camera follows the gaze of the characters, trained to different directions, in some cases the ground and in others the sky, experiencing how they relate to the world around them, the minute details they observe, and their sense of time and place. Moving between dream and reality, the film is an exploration of the inner and outer landscapes they encounter.\n\nThis screening is in conjunction with the exhibition, We don't end at our edges.\n\nCast: Shrunga BV, M N Swamy, Menaka Neotia, Mohamed Rizvan. Dop B R Viswanath. Editing: M N Swamy\n\nImages courtesy: Moving Focus Pictures.",
    "url": "https://map-india.org/map-events/hariva-nadige-maiyella-kaalu-%e0%b2%b9%e0%b2%b0%e0%b2%bf%e0%b2%b5-%e0%b2%a8%e0%b2%a6%e0%b2%bf%e0%b2%97%e0%b3%86-%e0%b2%ae%e0%b3%88%e0%b2%af%e0%b3%86%e0%b2%b2%e0%b3%8d%e0%b2%b2%e0%b2%be-%e0%b2%95/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "Hariva Nadige Maiyella Kaalu | ಹರಿವ ನದಿಗೆ ಮೈಯೆಲ್ಲಾ ಕಾಲು"
    },
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-23T141549.423.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "883@map-india.org",
    "name": "Ticket Tika Chaap",
    "startDate": "2025-05-24T16:00:00+05:30",
    "endDate": "2025-05-24T17:00:00+05:30",
    "description": "From dancing elephants and beloved deities to the surprising sight of steamships, textile labels showcased a variety of captivating imagery.\n\nTextile labels arrived in Indian markets in their thousands, stuck on yards upon yards of cotton fabric manufactured in the mills of Britain (and India), and sold in Indian and global markets. They wove desire, memory, and meaning into the act of purchase. \n\nOur latest exhibition, Ticket Tika Chaap, explores these textile labels, known as tikats (tickets), tikas or chaaps, and their art-historical and commercial significance, as perhaps the earliest forms of branding and advertisement, in India.\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/ticket-tika-chaap-10/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-20T144859.785.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "879@map-india.org",
    "name": "Readers' Bloc",
    "startDate": "2025-05-24T17:00:00+05:30",
    "endDate": "2025-05-24T18:30:00+05:30",
    "description": "Join us for a reading and discussion session facilitated by two members of the Readers’ Bloc collective - Vidyasagar and Mathew Stefan Thomas.\n\nIn this session of Reader’s Bloc, we will focus on Ajay Navaria’s powerful short story Subcontinent– a deeply personal exploration of caste discrimination set against the backdrop of a bustling metropolis. Its nuanced narrative reflects the protagonist’s inner turmoil as he deals with memories and trauma, juxtaposed with the complexities of his present.\n\nAlongside this, we will examine Mimi Mondal’s short fiction So It Was Foretold, which portrays the layered struggles of a Dalit woman navigating life while carrying the emotional and social weight of her husband. Her rage and guilt create tension between them in this story about a family's hidden past and how a name is carried through generations.\n\nThe Reader’s Bloc is an online/IRL group of readers taking part in reading, listening and sharing exercises around texts that help us learn more about ourselves, the identities we share and the communities we live in.\n\nThis programme is exclusively for 18–25 year olds.\n\nThis session is conducted as part of our engagements for the MAP Youth Collective. The MAP Youth Collective is a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.",
    "url": "https://map-india.org/map-events/readers-bloc/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-19T165600.613.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "876@map-india.org",
    "name": "Annie Colère/Angry Annie",
    "startDate": "2025-05-25T15:00:00+05:30",
    "endDate": "2025-05-25T17:30:00+05:30",
    "description": "“Men have always had the power to decide if we get pregnant. Imagine if we women could choose. It’s a revolution.” (Annie colère, 2022)\n\nTime travel with us to 1974 France and witness the story of Annie, a feisty woman who encounters many challenges in her fights for women's reproductive rights. This is a story of resilience, perseverance and the origins of the women’s liberation group Movement for the Liberation of Abortion and Contraception (MLAC).\n\nThis film screening will be followed by a discussion led by professor and researcher Dr. Sreeparna Chattopadhyay and Anusha Vikram from the MAP team, who will contextualize the film for the Indian audience.\n\nThis film is in collaboration with the Alliance Française Bangalore and part of our series ‘Femme: Beneath the surface’, which aims to spotlight an emerging generation of French storytellers, each dissecting characters that embody the idea of a woman – layered, disoriented and probing.\n\nSet against the backdrop of contemporary France – where questions of class, identity, and belonging remain urgent and unresolved – these films trace the quiet resistance and raw introspection of women thrown into complex situations.\n\nThis film is in French with English subtitles.",
    "url": "https://map-india.org/map-events/annie-colere-angry-annie/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Annie Colère/Angry Annie"
    },
    "subtitleLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-19T160933.942.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "857@map-india.org",
    "name": "Chittara Art",
    "startDate": "2025-05-24T14:00:00+05:30",
    "endDate": "2025-05-24T17:00:00+05:30",
    "description": "Did you know that chittara in Kannada translates to picture or design? This folk art has geometrical designs featuring everyday life, and is native to the Deevaru community in the Sagar district of Karnataka. Chittara folk art is practiced primarily by the women of the community. They use eco-friendly materials like ground rice paste for white colour, charred rice for black, powdered gurige seeds (Strobilanthes kunthiana) for yellow, and soil/earth for red. \n\nLearn more about this artform and create your own chittara inspired collage on handmade, recycled paper.\n\nThis event will be followed by a book launch.\n\nPhoto credits: CFRIA",
    "url": "https://map-india.org/map-events/chittara-art/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-2025-04-29T171056.075.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "885@map-india.org",
    "name": "Vaanyerum Vizhuthugal",
    "startDate": "2025-05-25T16:00:00+05:30",
    "endDate": "2025-05-25T17:00:00+05:30",
    "description": "Join us for a guided walk of our latest exhibition Vaanyerum Vizhuthugal: Roots that reach the sky\n\nInitially exhibited as part of the Chennai Photo Biennale 2024-2025, this is the first group exhibition dedicated to contemporary photography and lens-based practices at MAP. Vaanyerum Vizhuthugal (translating to “Roots that Reach for the Sky”), curated by Jaisingh Nageswaran, brings together the works of twelve lens-based artists of Tamil origin who push the boundaries of photography and visual storytelling. \n\nThis will provide a richer understanding of their contributions to contemporary photography and the diverse narratives they present.\n\n\nThis exhibition is a project by Goethe-Institut Chennai and Chennai Photo Biennale.\n\nThe programming is in collaboration with the Goethe Institute/Max Mueller Bhavan Bangalore.\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.\n\n",
    "url": "https://map-india.org/map-events/vaanyerum-vizhuthugal-4/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-85.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "878@map-india.org",
    "name": "Printed Melodies: Revisiting Hindi Cinema Through Song Booklets",
    "startDate": "2025-05-27T18:00:00+05:30",
    "endDate": "2025-05-27T19:00:00+05:30",
    "description": "Song and dance have been an integral part of Indian cinema following the release of the first ever Indian talkie, Alam Ara (1931). As the talkies caught on, songs were,  more often than not, the primary reason for a film's biggest 'repeat value' factor. Little wonder, then, that producers wanted to highlight the musical aspect of their movies as a marketing tool. These song booklets, costing a few annas, were sold in cinema halls during the intermission and were extremely popular among cinegoers at the time. \n\nSong booklets were nothing less than artworks in their own right. Within their layout, they incorporated the film's poster on their cover, a list of its cast and crew, the synopsis of the story, and the lyrics of all the songs in the film. The talk by Karan Bali will shed light on how song booklets continue to serve as a valuable resource when we revisit Indian cinema history, and aid in filling up many gaps in our archival records and thereby present novel ways of reading the archive.\n\nImage credits: Song Booklet, Kismet (1943). From Richa and Jamshed Chinoy Collection, MAP.",
    "url": "https://map-india.org/map-events/printed-melodies-revisiting-hindi-cinema-through-song-booklets/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-22T121124.481.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "875@map-india.org",
    "name": "Deevara Chittara - The Artform, the People and their Culture",
    "startDate": "2025-05-24T18:00:00+05:30",
    "endDate": "2025-05-24T19:30:00+05:30",
    "description": "Join us for a book launch of Deevara Chittara - The Artform, the People and their Culture. This is the very first book to archive and document Chittara and related depleting eco-friendly handicrafts.\n\nChittara paintings are an intricate geometrical artform practiced by the women of the Deevaru community in Karnataka. This folk art has become an integral part of their daily routines—it was never a profession, but a practice that has artistic and socio-cultural value.\n\nThis book captures the lifestyle, culture, challenges and way forward of the Deevaru community. It talks of the various facets of the artform such as its symbolism, use of natural materials, the role of women in the arts, its link to social customs like marriages and festivals.\n\nThe book launch panel features authors Geetha Bhat and Smita, and Vishwanath in conversation with Sudha, a Chittara artist from the Deevaru community. She will share her personal experiences of learning and practising the art, its place in everyday life, and what it means to uphold a cultural legacy that was never meant to be a profession, but a deeply integral part of womanhood, ritual, and community. \n\nThis event will be in Kannada.",
    "url": "https://map-india.org/map-events/deevara-chittara-the-artform-the-people-and-their-culture/",
    "keywords": [
      "Book Launch",
      "MAP"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-19T160355.238.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "887@map-india.org",
    "name": "Movement Expression Workshop",
    "startDate": "2025-05-31T16:00:00+05:30",
    "endDate": "2025-05-31T19:00:00+05:30",
    "description": "“SLAE is for every woman who has ever felt overwhelmed, disconnected, or simply in need of a reminder that she is enough - just as she is.”\n\nSLAE (Self-Love Acceptance &amp; Expression) is a movement-based workshop by Priya Agarwal, who invites women to come together into a sacred space to celebrate their bodies. This workshop holds the power to unlock healing and personal growth through the power of dance as a universal language.\n\nAt MAP, SLAE will be a therapeutic session inviting participants to spend an hour going through the exhibition Visible/Invisible and exploring how the artworks make them feel. Following this, the participants will spend two hours reconnecting with their bodies through the power of movement, music, and meditation.\n\nThis event is in conjunction with the exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.\n\nPhoto credits: SLAE",
    "url": "https://map-india.org/map-events/movement-expression-workshop/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-21T120412.666.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "860@map-india.org",
    "name": "Up, Close & Centre",
    "startDate": "2025-05-27T17:00:00+05:30",
    "endDate": "2025-05-27T17:30:00+05:30",
    "description": "In this session of Up, Close &amp; Centre, Arnika Ahldag (Director - Curation &amp; Exhibition at MAP) will elaborate on an artwork from MAP’s latest exhibition, Vaanyerum Vizhuthugal: Roots that Reach for the Sky.\n\nInitially exhibited as part of the Chennai Photo Biennale 2024-2025, for MAP this is the first ever group exhibition dedicated to contemporary photography and lens-based practices. Curated by Jaisingh Nageswaran, Vaanyerum Vizhuthugal (translating to “Roots that Reach for the Sky”) brings together the works of twelve lens-based artists of Tamil origin who push the boundaries of photography and visual storytelling.\n\nThis is a drop-in session. There is no registration required.",
    "url": "https://map-india.org/map-events/up-close-centre-13/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-02T122341.078.png"
  }
]