[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "628@map-india.org",
    "name": "Film Poster Making",
    "startDate": "2024-11-30T10:30:00+05:30",
    "endDate": "2024-11-30T13:30:00+05:30",
    "description": "“Picture abhi baaki hai mere dost.”\n\nStep into the colourful world of Bollywood and create your own filmy poster! Join us for a dynamic collage-making workshop led by renowned filmmaker and producer, Anand Tharaney. \n\nYou’ll dive into the rich visual language of Hindi cinema, using iconic film stills and posters from MAP’s collection. You will also learn techniques to layer and blend elements that pay homage to the flamboyant aesthetics of the industry. Come express your love for cinema through art and discover the stories behind the images! \n\nRegistrations for this workshop are now closed. You can join the waitlist here.",
    "url": "https://map-india.org/map-events/film-poster-making/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "hi",
    "image": "https://map-india.org/wp-content/uploads/2024/11/Poster-Making.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "637@map-india.org",
    "name": "Physical Poetry",
    "startDate": "2024-12-03T19:00:00+05:30",
    "endDate": "2024-12-03T20:00:00+05:30",
    "description": "Have you ever wondered what poetry would look like if it could transcend words and take form as sculptures? Jaume Plensa, the celebrated visual artist and sculptor, invites you to explore this unique concept through his remarkable works. From Dream (2009) to the Crown Fountain (2004) and Together (2015), Plensa's creations transform physical and visual art into a language of poetry—art that speaks volumes about itself without words.  \n\nJoin us for a special evening at MAP to meet and hear from Jaume Plensa, whose work is seen in museums and public spaces across the world from installations in London and New York to Taipei and Dubai. Discover what drives his practice, his approach to art and the role he imagines it plays in the world.",
    "url": "https://map-india.org/map-events/physical-poetry/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/11/Physical-poetry-website-banner-.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "636@map-india.org",
    "name": "A Curious Collection",
    "startDate": "2024-11-27T17:00:00+05:30",
    "endDate": "2024-11-27T18:30:00+05:30",
    "description": "Housed in a former World War II telecommunications bunker, transformed by acclaimed British architect John Pawson, The Feuerle Collection is among the most unique art collections worldwide. Juxtaposing contemporary art, Imperial Chinese furniture, Khmer sculptures and other treasures, the space offers a deeply immersive and multi-sensorial journey for visitors through diverse cultures and eras.\n\nGet an insider's perspective on the Feuerle Collection by joining us for a talk with the founder Désiré Feuerle, as he shares the fascinating story behind this one-of-a kind institution founded in 2016. ",
    "url": "https://map-india.org/map-events/a-curious-collection/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/11/Desire-Feuerle-website-banner-.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "629@map-india.org",
    "name": "Conserving Personal Art",
    "startDate": "2024-11-30T11:00:00+05:30",
    "endDate": "2024-11-30T13:00:00+05:30",
    "description": "What goes into art conservation? How can we prolong the life of various objects from our past and present, for future generations to enjoy? Calling out all art enthusiasts and passionate collectors, this workshop will educate you on safeguarding cultural heritage while fostering a deeper appreciation for the art around us. \n\nIn this workshop, you can engage in an enlightening art conservation workshop where you will be introduced to many of the conservation techniques used in museums. Led by the MAP Conservation Team, learn the science behind art conservation and gain valuable insights into how to protect and prolong the life of your own treasured items. \n\nRegistrations for this workshop are now closed. You can join the waitlist here.",
    "url": "https://map-india.org/map-events/conserving-personal-art/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/11/Workshop-Conservation.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "630@map-india.org",
    "name": "Crocheting Away",
    "startDate": "2024-11-30T14:00:00+05:30",
    "endDate": "2024-11-30T16:00:00+05:30",
    "description": "Learn the timeless art of creating beautiful pieces with just a hook and yarn. \n\nOur beginner-friendly workshop, facilitated by Vimala Vignesh and Bangalore's crochet group, Crafty, offers a unique opportunity to connect with fellow crafters, share stories, and learn from skilled instructors. You'll not only master fundamental techniques but also celebrate the rich tradition of crochet and pass it on to future generations. Guided by skilled instructors, you'll create beautiful pieces that honour the legacy of this art form, all while fostering new friendships and nurturing a sense of community. \n\nBring your family, friends, or come solo and be part of a creative lineage. Each stitch you make will weave together tradition, creativity, and connection. \n\nRegistrations for this workshop are now closed. You can join the waitlist here.",
    "url": "https://map-india.org/map-events/crocheting-away/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/11/WhatsApp-Image-2024-11-20-at-3.02.52-PM.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "635@map-india.org",
    "name": "Film Poster Making (1st Dec)",
    "startDate": "2024-12-01T10:30:00+05:30",
    "endDate": "2024-12-01T13:30:00+05:30",
    "description": "“Picture abhi baaki hai mere dost.”\n\nStep into the colourful world of Bollywood and create your own filmy poster! Join us for a dynamic collage-making workshop led by renowned filmmaker and producer, Anand Tharaney. \n\nYou’ll dive into the rich visual language of Hindi cinema, using iconic film stills and posters from MAP’s collection. You will also learn techniques to layer and blend elements that pay homage to the flamboyant aesthetics of the industry. Come express your love for cinema through art and discover the stories behind the images! \n\nRegistrations for this event are now closed. You can join the waitlist here.",
    "url": "https://map-india.org/map-events/film-poster-making-1st-dec/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "hi",
    "image": "https://map-india.org/wp-content/uploads/2024/11/Poster-Making.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "632@map-india.org",
    "name": "Interpreting Contemporary Indian Art",
    "startDate": "2024-12-01T09:00:00+05:30",
    "endDate": "2024-12-01T13:30:00+05:30",
    "description": "Have you been interested in contemporary art from India, but didn't know where to begin? Join this workshop organised by the MAP Academy to explore the rich histories of Indian art from the late 19th century to the present day.\n\nThis hands-on workshop is designed to empower individuals to engage meaningfully with various forms of art. Participants will build essential skills in analysing artworks, exploring significant themes and ideas, and asking meaningful questions. Through collaborative group discussions, a walkthrough of the museum, and an interactive quiz, they will gain practical experience and develop the tools needed to engage thoughtfully with new or unfamiliar works.\n\nThe workshop will build on core concepts covered in the MAP Academy’s free online course Modern and Contemporary Indian Art. Completion of the course is a prerequisite for participating in the workshop. \n\nThis foundational course provides essential insights into key artists, movements, and socio-political contexts that have shaped Indian art, and will serve as a guide for the discussions during the workshop. Click here to enrol for the online course.\n\n Bring your laptop, pens, and notebook for a fully immersive experience.\n\nRegistrations for this workshop are now closed. You can join the waitlist here.",
    "url": "https://map-india.org/map-events/interpreting-contemporary-indian-art-2/",
    "keywords": [
      " Featuring",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/11/MAP-Academy.jpg"
  }
]