[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1081@map-india.org",
    "name": "Language, Listen",
    "startDate": "2025-11-20T15:00:00+05:30",
    "endDate": "2025-11-20T19:30:00+05:30",
    "description": "Photo credits: Jacaranda Literary Agency\nIndia is a country with so much linguistic diversity, where every hundred kilometres, dialects shift. While the world is much more open and yet closer than ever before, linguistic borders feel more divided and divisive, even as they overlap in reality, and in spoken word.\n\nWhile International Translation Day is only one day that celebrates linguistic inclusion and diversity, this Language, Listen reading event will be a meeting of writers, translators, and readers, and in languages from all around India and eventually, the world.\n\nLanguage, Listen prioritises readings over panels and talks, focusing instead on the practice of translation and the sound of languages. Beyond the often-insular discussions at literary festivals, this event is an invitation to all to be part of a more immersive and active experience of linguistic complexity and diversity, through the act of listening. \n\nWith an introduction by Vivek Shanbhag, and translators and writers from across the spectrum—voices that are both fresh and new, as well as those that are leaders in the industry. The line-up includes luminaries such as KR Meera, Arunava Sinha, Sunandini Banerjee, Narasimha Kumar, and Hansda Sowvendra Shekhar, among many others. We aim for this to be a unique literary and linguistic endeavour that brings readers, writers, and translators together in a shared love for and celebration of languages and translation.\n\nThis is presented by Jacaranda Literary Agency in collaboration with MAP and supported by the  New India Foundation. ",
    "url": "https://map-india.org/map-events/language-listen/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/11/Website-cover-images-new-40.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "1083@map-india.org",
    "name": "Journey from A to E",
    "startDate": "2025-11-15T17:00:00+05:30",
    "endDate": "2025-11-15T18:00:00+05:30",
    "description": "Join us for a solo performance exploring a trans man’s evolving singing voice through gender transition.\n\nJourney A to E weaves three strands: The choices that reshaped his artistic path, a fraught relationship with music and the mother figure who insisted he sing, and the pining involved in losing and rebuilding his voice. It engages with the politics of music, gender, caste and devotion while tracing the emotional and technical challenges of voice transition.\n\nPerformed in English with Kannada, Hindi and Malayalam, the piece remains a work-in-progress—growing as the performer’s voice finds its new ground.\n\n&nbsp;\n\nCredits:\nScript, Story and Music - Rumi Harish\nConceptualization and Design - Dadapeer Jyman\nDevising and Direction - James Brunner",
    "url": "https://map-india.org/map-events/journey-from-a-to-e/",
    "keywords": [
      "CBD",
      "MAP",
      "Performances"
    ],
    "inLanguage": "ml",
    "image": "https://map-india.org/wp-content/uploads/2025/11/Website-cover-images-new-41.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1080@map-india.org",
    "name": "The Mandala Lab",
    "startDate": "2025-11-19T16:30:00+05:30",
    "endDate": "2025-11-19T17:30:00+05:30",
    "description": "Photo credits: Filip Wolak\nHow can art transform you as a person? Join a talk by Tim McHenry as he speaks about The Rubin Museum’s playful interactions such as The Dream Over, The Memory Palace, The Game of Life and The Mandala Lab.\n\nDrawing directly from its collection of Himalayan art, the Rubin Museum challenged visitors with profound questions about identity, mortality, and meaning. When confronting life's biggest issues, it helps to approach them with humour or within the safe space of play. The Rubin Museum's unique combination of calm contemplation and playful engagement created openings for deep personal exploration.\n\nDiscover how play can become a powerful tool for transformation and resilience in our daily lives.",
    "url": "https://map-india.org/map-events/the-mandala-lab/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/11/Website-cover-images-new-39.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1085@map-india.org",
    "name": "Up, Close & Centre",
    "startDate": "2025-11-25T17:00:00+05:30",
    "endDate": "2025-11-25T17:30:00+05:30",
    "description": "Ever stood before a painting wondering what stories lie within it? This session of Up, Close and Centre unpacks an 18th century courtly painting from Rajasthan. Join our session where Shubhasree Purkayastha from the MAP Education Team, will reveal stories - both obvious and hidden in the painting.\n\nMAP is home to a growing collection of over 100,000 artworks. Up, Close &amp; Centre is a series that allows audiences to engage with art in deeper and more meaningful ways by delving into the context, narratives and makings of one artwork from our collection, chosen by our team members.",
    "url": "https://map-india.org/map-events/up-close-centre-2/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/11/Website-cover-images-new-43.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "1084@map-india.org",
    "name": "Badai – A Celebration of Blessings and Identity",
    "startDate": "2025-11-16T17:00:00+05:30",
    "endDate": "2025-11-16T18:00:00+05:30",
    "description": "Join us for Badai which highlights a vibrant and historic tradition of the Hijra community, where blessings are offered through song, dance, music, and presence during life’s auspicious moments. Rooted in a lineage that blends spirituality, performance, and social connection, Badai reflects the community’s dignity, resilience, and enduring cultural role.\n\nRecognised for embodying both masculine and feminine energies, Hijras have long been invited to bless births, weddings, house warmings, and other milestones. Their performances—spontaneous songs, rhythmic claps, dholak beats, and expressive dance—create a shared space of joy, storytelling, and celebration. Drawing from folk forms, improvised verses, and contemporary influences, Badai remains a living, adaptive cultural practice.\n\nThis stage programme brings the essence of Badai to contemporary audiences, not as entertainment alone but as an invitation to understand and honour the community’s artistic and social contributions.\n\nBadai is a tribute to the Hijra community’s living heritage — a celebration of blessings, identity, and the joy of shared humanity.",
    "url": "https://map-india.org/map-events/badai-a-celebration-of-blessings-and-identity/",
    "keywords": [
      "CBD",
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/11/Website-cover-images-new-42.png"
  }
]