[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "name": "Art through Touch: A Tactile Workshop",
    "startDate": "2024-07-21T10:00:00+05:30",
    "endDate": "2024-07-21T13:30:00+05:30",
    "description": "This workshop is designed specifically for students with visual impairment between the ages of 14-18. Workshop participants will spend 45 minutes on a tactile walk of the exhibition, Visible/Invisible: Representations of Women in Art through the MAP Collection. They will interact with the 7 artworks up close, and then create tactile pieces of their own — inspired by what they have experienced, as well as ornamentation and ideas of self expression. Materials for the workshop like clay, modelling tools, non-sharp materials that can be used as decorations or embellishments will be provided .\n\nThis will be a 2-hour workshop led by O Aishwarya.",
    "url": "https://map-india.org/map-events/art-through-touch-a-tactile-workshop/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/07/VI-workshop.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "name": "From the Depth of the Mould: The making of the artist Meera Mukherjee",
    "startDate": "2024-07-12T18:00:00+05:30",
    "endDate": "2024-07-12T20:00:00+05:30",
    "description": "One of the most prolific sculptors of late 20th century India, Meera Mukherjee chose a mode of metal sculpting and a life-style that set her apart from most other artists of her time. The momentous turn in her career came with her first journey to Bastar in 1960, followed by a three-year country-wide study of traditional metal crafting communities and techniques. This in turn propelled the radical shift in her choice of sculpting methods and subjects, and more broadly in her notion of art as labour and collective practice.\n\nJoin Tapati Guha-Thakurta for a talk on her just-published edited volume, From the Depth of the Mould: Meera Mukherjee (1923-1998), A Centenary Tribute. It uses the metaphor of Meera Mukherjee’s elaborate mould-making and metal casting process to look closely at the themes of material and technique, individual and community work, struggle and resilience in her life story.",
    "url": "https://map-india.org/map-events/from-the-depth-of-the-mould-the-making-of-the-artist-meera-mukherjee/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/07/Depth-of-the-mould-website-image.jpg"
  }
]