[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "901@map-india.org",
    "name": "Sketch with Penciljam",
    "startDate": "2025-06-22T10:30:00+05:30",
    "endDate": "2025-06-22T13:00:00+05:30",
    "description": "The Museum is your studio! For artists of all skill levels that find joy in observational sketching, we invite you to be a part of this creative and relaxed live sketching session with PencilJam. Set against the vibrant backdrop of MAP’s current exhibits, this session offers a blend of quiet observation and creative expression. \n\nWhether you're looking to unwind through sketching, discover new perspectives, or simply enjoy the act of creating in a shared environment, this is a chance to slow down and truly observe the world around you. Connect with fellow art lovers, exchange ideas, and share your own masterpiece in an informal setting that celebrates creativity in all its forms.\n\nYou’ll need to carry your own:\n\n-Sketchbook or A4 paper\n\n-Pencil (wood or mechanical) and eraser\n\n-Gel pens or fineliners for outlining\n\n-Colour brush pens, sketch pens, or colour pencils (no wet media)",
    "url": "https://map-india.org/map-events/sketch-with-penciljam-2/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-09T100756.847.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "868@map-india.org",
    "name": "Training Course in Conservation of Photographs in Museums, Archives, and Collections",
    "startDate": "2025-06-16T09:00:00+05:30",
    "endDate": "2025-09-13T17:30:00+05:30",
    "description": "Don’t let history disappear–or discolour–or fade! Discover the science of photography conservation and learn the art of restoring historic photograph collections. This hands-on, intensive training course is designed for practising conservators, archivists and custodians of historic photograph collections to learn preventive collection care measures, remedial conservation processes, and restoration techniques.\n\nThis three month course will be followed by a one month internship. The course will be instructed by leading specialists from India and overseas and includes topics such as: \n\n -Development, materials and techniques of historic photographic processes\n\n -Identification and understanding of deterioration processes in photograph collections\n\n -Inspection and survey methodologies\n\n -Condition report preparation and preservation prioritisation decisions\n\n -Emergency treatment measures\n\n -Conservation of film and glass plate negatives\n\n -Conservation and restoration of photographs\n\n -Archival protocols of housing, display, and storage of photographic materials\n\n -Disaster management",
    "url": "https://map-india.org/map-events/training-course-in-conservation-of-photographs-in-museums-archives-and-collections/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-12T161452.615.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "903@map-india.org",
    "name": "My Summer Storybook",
    "startDate": "2025-06-28T11:00:00+05:30",
    "endDate": "2025-06-28T14:00:00+05:30",
    "description": "Back in school but still reminiscing about those glorious summer days? Relive your summer vacation with our workshop. Join Aishwarya Arumbakkam, one of the artists featured in the Vaanyerum Vizhuthugal exhibition, in making books! The workshop is tailored for children aged between 10 to 12, and guides them to make books based on the summer vacation they just had. Parents can help children in printing some of the images from recent, or favourite vacations.\n\nIf you would like to share the images with us and get it printed, please arrive at least 45 minutes before the workshop begins.\n\nAll materials, except for the images, will be provided.\n\nPlease note: This workshop is only for children aged 10-12",
    "url": "https://map-india.org/map-events/my-summer-storybook/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/09/Make-at-MAP.jpeg"
  }
]