[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "590@map-india.org",
    "name": "Generative Art & Cinema",
    "startDate": "2024-10-26T10:00:00+05:30",
    "endDate": "2024-10-26T16:00:00+05:30",
    "description": "Join us for an immersive workshop exploring the intersection of new media, cinema and generative art with artist and filmmaker Koel Sen. This session will provide an overview of historical and contemporary experiments of using new media in film. \n\nThis one-day session is designed to explore how filmmakers and artists utilise film, video, and digital media to push the boundaries of moving images, with a special emphasis on computational art in cinema. Focusing on personal and poetic filmmaking, in this session we will create and deconstruct images with the help of computer software and hardware and incorporate music and sound as catalysts, drawing on memory and perception to guide our creative process. Through collaboration, we will produce video loops that can be seamlessly edited into film and sonic sequences, ultimately expanding our exploration of this dynamic medium.\n\nThis session is perfect for those interested in the convergence of art, technology, and cinema, offering both theoretical insights and practical engagement. Get hands-on with generative art through a beginner’s exercise in coding using \"Gibber,\" a browser-based app that makes generative coding accessible to everyone. Additionally, experience a live demonstration of creative tools like Resolume and MIDI controllers to see how technology is used in contemporary audiovisual performance.\n\nParticipants are welcome to bring along their personal archives in the form of home videos, family photos, mobile phone footage and/or any moving image material of their choice. A prior/basic understanding of filmmaking and film editing will be useful. Participants must carry their laptops with some basic film editing software. (Eg. Adobe Premiere Pro or Da Vinci Resolve). Limited seats are available, please register to secure your spot!",
    "url": "https://map-india.org/map-events/generative-art-cinema/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/10/WhatsApp-Image-2024-10-16-at-9.37.24-AM.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "595@map-india.org",
    "name": "Live Sketching at MAP in Collaboration with Penciljam (4:00PM)",
    "startDate": "2024-10-26T16:00:00+05:30",
    "endDate": "2024-10-26T18:00:00+05:30",
    "description": "View art from a different perspective and rewrite the story! Join us for a sketching workshop at our permanent exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection. \n\nEach of the exhibition’s four sections explores how women’s lives have been portrayed, the spaces that they occupy and the challenges that women have faced in the Indian subcontinent. \n\nThis workshop will extend the ideas embodied in the exhibition through a unique creative activity, in which participants will visually create the many identities that constitute our ideas of the women in our lives, through overlaid layers of artwork.\n\nTo participate in this workshop, you will need the following easily available materials:\n\n* A Black Gel Pen or Black Permanent Marker\n\n* Oil Pastels or thick wax crayons\n\n* A few sheets of translucent butter paper or tracing paper\n\n* A Pad or clipboard to draw on",
    "url": "https://map-india.org/map-events/live-sketching-at-map-in-collaboration-with-penciljam-400pm/",
    "keywords": [
      " Date",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/10/Penciljam.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "592@map-india.org",
    "name": "Make at MAP (2:00PM)",
    "startDate": "2024-10-27T14:00:00+05:30",
    "endDate": "2024-10-27T15:30:00+05:30",
    "description": "There’s no better way to celebrate the Festival of Lights than by making your own beautiful lamp! In this edition of Make at MAP, explore a stunning array of traditional lamps from our collection and take inspiration to create your own unique piece. Learn new techniques, experiment with materials, and take home a beautiful handmade lamp to light up your Diwali celebrations.\n\nMake at MAP is a series that allows you to explore our collection in an engaging and hands-on manner. These sessions allow you to create and take home a special souvenir of your visit.\n\nIt is perfect for all ages — so bring your friends and family and get ready to make some art! No experience is necessary, just a willingness to have fun and experiment with new materials.\n\nWorkshop timings:\n\n11:30 AM-1:00 PM\n\n2:00 PM- 3:30 PM",
    "url": "https://map-india.org/map-events/make-at-map-200pm/",
    "keywords": [
      " Date",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2022/11/PTG.00041-scaled-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "594@map-india.org",
    "name": "Live Sketching at MAP in Collaboration with Penciljam (12:00PM)",
    "startDate": "2024-10-26T12:00:00+05:30",
    "endDate": "2024-10-26T14:00:00+05:30",
    "description": "View art from a different perspective and rewrite the story! Join us for a sketching workshop at our permanent exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection. \n\nEach of the exhibition’s four sections explores how women’s lives have been portrayed, the spaces that they occupy and the challenges that women have faced in the Indian subcontinent. \n\nThis workshop will extend the ideas embodied in the exhibition through a unique creative activity, in which participants will visually create the many identities that constitute our ideas of the women in our lives, through overlaid layers of artwork.\n\nTo participate in this workshop, you will need the following easily available materials:\n\n* A Black Gel Pen or Black Permanent Marker\n\n* Oil Pastels or thick wax crayons\n\n* A few sheets of translucent butter paper or tracing paper\n\n* A Pad or clipboard to draw on",
    "url": "https://map-india.org/map-events/live-sketching-at-map-in-collaboration-with-penciljam-1200pm/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/10/Penciljam.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "591@map-india.org",
    "name": "Make at MAP (11:30AM)",
    "startDate": "2024-10-27T11:30:00+05:30",
    "endDate": "2024-10-27T13:00:00+05:30",
    "description": "There’s no better way to celebrate the Festival of Lights than by making your own beautiful lamp! In this edition of Make at MAP, explore a stunning array of traditional lamps from our collection and take inspiration to create your own unique piece. Learn new techniques, experiment with materials, and take home a beautiful handmade lamp to light up your Diwali celebrations.\n\nMake at MAP is a series that allows you to explore our collection in an engaging and hands-on manner. These sessions allow you to create and take home a special souvenir of your visit.\n\nIt is perfect for all ages — so bring your friends and family and get ready to make some art! No experience is necessary, just a willingness to have fun and experiment with new materials.\n\nWorkshop timings:\n\n11:30 AM -1:00 PM\n\n2:00 PM- 3:30 PM",
    "url": "https://map-india.org/map-events/make-at-map-1130am/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2022/11/PTG.00041-scaled-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "587@map-india.org",
    "name": "27 Down",
    "startDate": "2024-10-26T16:30:00+05:30",
    "endDate": "2024-10-26T19:30:00+05:30",
    "description": "This weekend, travel back to the seventies and enjoy Awtar Krishna Kaul’s 27 Down, a 1974 drama based on the Hindi novel Athara Sooraj Ke Paudhe. The film is centred around Sanjay, a railway employee who is battling between his duty towards his authoritarian father and his desire for freedom. 27 Down is popular for its unique cinematography, themes of societal expectations, pursuit of dreams and self-discovery.\n\nThis film screening is the second in our six-month long series, ‘The Radical Seventies’, a collaboration between MAP and Bangalore Film Forum, co-curated by Ashish Rajadhyaksha. \n\nThis series has been conceptualised as part of MAP’s youth engagement programming.\n\nThe Radical Seventies is a series that is specially crafted for youth to engage with older classics that resonate with our contemporary times, in familiar and unexpected ways. Through the 1970s, Indian cinema saw several major experiments in cinema — often made in direct conversation with radical politics. The decade began in the late 1960s and spilled over into the early 1980s. With 27 Down, we embark on another chapter of this journey, exploring questions around evolving identities, migration, and the push and pull between independence, empowering anonymity and the loneliness of the urban experience.",
    "url": "https://map-india.org/map-events/27-down/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "27 Down"
    },
    "image": "https://map-india.org/wp-content/uploads/2024/10/PHY.07079.jpg"
  }
]