[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1174@map-india.org",
    "name": "Listening to Images",
    "startDate": "2026-02-28T11:30:00+05:30",
    "endDate": "2026-03-01T16:00:00+05:30",
    "description": "Join this two-day workshop of creative inquiry and narrative experimentation where you engage with MAP’s latest exhibition, Beneath the Turning Sky. In the workshop, you will make your own short video works, responding to the exhibition through close looking, interpretation and poetic translation. Led by writer and sound researcher Mishika Goel, the workshop offers the space to reflect on how art can be re-encountered, re-imagined, and articulated through new narrative forms.\n\nDrawing from her experiences in France and her creative process behind Prochaine Station: Aristide Briand, Mishika reflects on narrative as both method and medium. The workshop, situated at the intersection of language, moving image, and curatorial encounter, explores how artworks generate meaning beyond the visual- prompting stories, gestures, and varied forms of response..\n\nThis workshop is part of the ongoing series, Responding to Art through the Arts. Facilitated by arts practitioners, it aims to activate MAP’s galleries through a series of workshops that hold space for young people’s responses to artwork on display. \n\nIt is conducted as part of our engagements for the MAP Youth Collective - a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.\n\nWorkshop requirements: Open to all skill levels, phone camera/professional camera can be used, along with a basic video-editing software on a PC/Mac.",
    "url": "https://map-india.org/map-events/listening-to-images/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/Website-cover-images-new-2026-02-13T113554.241.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1186@map-india.org",
    "name": "Letters Across Time",
    "startDate": "2026-02-28T14:00:00+05:30",
    "endDate": "2026-02-28T18:00:00+05:30",
    "description": "Letters Across Time is a reflective writing workshop that unfolds in dialogue with Beneath the Turning Sky. Beginning with a slow, attentive walk through the exhibition, participants are invited to notice, linger, and respond. From there, we write across time — toward imagined futures and back toward the memories that shape us. Through guided prompts, we explore hope, care, and the ways we choose to show up for one another and for the shared world we inhabit. Midway, the group comes together to imagine a small ritual from the future — something tender, slightly strange, and deeply human. The workshop closes with an anonymous exchange of letters, so each participant leaves carrying a fragment of someone else’s hope. A quiet, intimate space for reflection, imagination, and collective possibility.\n\nThe workshop begins at 2:00 pm, so we recommend having lunch before you arrive, and please bring your earphones as we’ll use them for a short music based reflection exercise.",
    "url": "https://map-india.org/map-events/letters-across-time/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/Website-Image-1440-x-810-2.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1173@map-india.org",
    "name": "Hidden in Plain Sight: Clay Sculpture in South Asia",
    "startDate": "2026-02-24T18:00:00+05:30",
    "endDate": "2026-02-24T19:30:00+05:30",
    "description": "Image Credits: Alexander Burnes, Bamiyan Buddhas, print 1834\nAir-dried clay stands among South Asia’s oldest and most widely used mediums for sculpture, along with stone, metal, wood, and fired clay. Typically finished in vivid colour, the medium has been largely overlooked in studies of the region’s arts, often misidentified as stucco and terracotta, or sidelined as too breakable and exuberantly coloured to be “art”’.\n\nThis talk brings together some of the most prominent practices across the subcontinent to consider why painted, air-dried clay has been so valued as a medium for figural sculpture, and what its sidelining reveals about the study of art and visual culture.\n\nThis event is in collaboration with Art, Resources and Teaching Trust.",
    "url": "https://map-india.org/map-events/hidden-in-plain-sight-clay-sculpture-in-south-asia/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/Website-cover-images-new-2026-02-13T112840.545.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "1185@map-india.org",
    "name": "The Reserved Compartment: An Anti-Caste Love Poetry Showcase",
    "startDate": "2026-02-28T18:00:00+05:30",
    "endDate": "2026-02-28T19:30:00+05:30",
    "description": "Step into a space where voices that were long silenced, now echo with unapologetic power. The Reserved Compartment presents India's first Dalit-Ambedkarite anti-caste English Poetry Showcase—a bold, community-driven revolution redefining mainstream culture through raw, resonant verses and intimate storytelling. Curated for hearts ready to listen and minds eager to shift, this evening at MAP promises to dismantle barriers and ignite conversations that linger long after the lights dim. Join us in honouring resilience, nurturing love, reclaiming narratives, and co-creating a more inclusive tomorrow.",
    "url": "https://map-india.org/map-events/the-reserved-compartment-an-anti-caste-love-poetry-showcase/",
    "keywords": [
      "CBD",
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/Website-Image-1440-x-810-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1187@map-india.org",
    "name": "Ways of Seeing",
    "startDate": "2026-02-26T18:00:00+05:30",
    "endDate": "2026-02-26T19:00:00+05:30",
    "description": "Image Credits: Mallikarjun Katakol \nJoin us as we delve into the experiences of photographer Mallikarjun Katakol, who will be in conversation with Suresh Jayaram, Founder of 1.Shanthiroad Collective. The conversation invites us to join Katakol as he takes us through his journey as a photographer.\nFor over thirty years, his creative spirit and problem-solving ability have helped create compelling images. His experience in graphic design and advertising before becoming a photographer exposed him to the advantages and challenges of different channels. His practice sheds light on his unique approaches to framing and lighting as he works with a variety of themes.\nThis event is in collaboration with Ananya Drishya.",
    "url": "https://map-india.org/map-events/the-ways-of-seeing/",
    "keywords": [
      " Featuring",
      "CBD",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/02/Website-cover-images-new-2026-02-19T154114.499.png"
  }
]