[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1081@map-india.org",
    "name": "Language, Listen",
    "startDate": "2025-11-20T15:00:00+05:30",
    "endDate": "2025-11-20T19:30:00+05:30",
    "description": "Photo credits: Jacaranda Literary Agency\nIndia is a country with so much linguistic diversity, where every hundred kilometres, dialects shift. While the world is much more open and yet closer than ever before, linguistic borders feel more divided and divisive, even as they overlap in reality, and in spoken word.\n\nWhile International Translation Day is only one day that celebrates linguistic inclusion and diversity, this Language, Listen reading event will be a meeting of writers, translators, and readers, and in languages from all around India and eventually, the world.\n\nLanguage, Listen prioritises readings over panels and talks, focusing instead on the practice of translation and the sound of languages. Beyond the often-insular discussions at literary festivals, this event is an invitation to all to be part of a more immersive and active experience of linguistic complexity and diversity, through the act of listening. \n\nWith an introduction by Vivek Shanbhag, and translators and writers from across the spectrum—voices that are both fresh and new, as well as those that are leaders in the industry. The line-up includes luminaries such as KR Meera, Arunava Sinha, Sunandini Banerjee, Narasimha Kumar, and Hansda Sowvendra Shekhar, among many others. We aim for this to be a unique literary and linguistic endeavour that brings readers, writers, and translators together in a shared love for and celebration of languages and translation.\n\nThis is presented by Jacaranda Literary Agency in collaboration with MAP and supported by the  New India Foundation. ",
    "url": "https://map-india.org/map-events/language-listen/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/11/Website-cover-images-new-40.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1077@map-india.org",
    "name": "Crochet a toy for your cat",
    "startDate": "2025-11-09T14:00:00+05:30",
    "endDate": "2025-11-09T17:00:00+05:30",
    "description": "Join us for a hands-on workshop inspired by our latest exhibition, The Many Lives of the Cat. Learn how to create charming, handmade toys your feline friends will adore. Whether you’re a crochet novice or a seasoned maker, you’ll leave with a unique toy and the skills to craft more at home. Just bring your creativity (and your cat’s playful spirit) to the workshop!\n\nThis programme is in conjunction with the exhibition The Many Lives of the Cat",
    "url": "https://map-india.org/map-events/crochet-a-toy-for-your-cat/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/Website-cover-images-new-32.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1080@map-india.org",
    "name": "The Mandala Lab",
    "startDate": "2025-11-19T16:30:00+05:30",
    "endDate": "2025-11-19T17:30:00+05:30",
    "description": "Photo credits: Filip Wolak\nHow can art transform you as a person? Join a talk by Tim McHenry as he speaks about The Rubin Museum’s playful interactions such as The Dream Over, The Memory Palace, The Game of Life and The Mandala Lab.\n\nDrawing directly from its collection of Himalayan art, the Rubin Museum challenged visitors with profound questions about identity, mortality, and meaning. When confronting life's biggest issues, it helps to approach them with humour or within the safe space of play. The Rubin Museum's unique combination of calm contemplation and playful engagement created openings for deep personal exploration.\n\nDiscover how play can become a powerful tool for transformation and resilience in our daily lives.",
    "url": "https://map-india.org/map-events/the-mandala-lab/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/11/Website-cover-images-new-39.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1076@map-india.org",
    "name": "Paws & Sign: ISL Walkthrough",
    "startDate": "2025-11-09T11:30:00+05:30",
    "endDate": "2025-11-09T12:30:00+05:30",
    "description": "How has the most meme’able, memorable, and mischievous animal known to man been represented across art history in the subcontinent? Through Kalighat paintings, miniatures, and popular imagery, our latest exhibition, The Many Lives of the Cat highlights how the cat has served as both muse and mirror — embodying humour, critique, and affection across time.\n\nJoin us for a walkthrough of this exhibition in Indian Sign Language (ISL), led by Senior Exhibitions Manager, Vineet Kajrolkar and discover how this enigmatic animal has captivated artists, storytellers, and audiences for generations.\n\nThis programme is in conjunction with the exhibition The Many Lives of the Cat",
    "url": "https://map-india.org/map-events/paws-sign-isl-walkthrough/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/Website-cover-images-new-31.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "1078@map-india.org",
    "name": "Kedi",
    "startDate": "2025-11-09T17:00:00+05:30",
    "endDate": "2025-11-09T18:30:00+05:30",
    "description": "Thousands of street cats live in Istanbul, the largest city in Türkiye, as they have for centuries. Some are feral and fend for themselves, while others are tamer and are cared for by people. Join us for the film screening of the Turkish film, Kedi which depicts these cats, and includes many interviews of the people who interact with them.\n\nThis programme is in conjunction with the exhibition The Many Lives of the Cat",
    "url": "https://map-india.org/map-events/kedi/",
    "keywords": [
      "CBD",
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Kedi"
    },
    "image": "https://map-india.org/wp-content/uploads/2025/11/Website-cover-images-new-33.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1075@map-india.org",
    "name": "Cat-ch Your Vibe: Tote Printing Session",
    "startDate": "2025-11-09T11:00:00+05:30",
    "endDate": "2025-11-09T17:00:00+05:30",
    "description": "Which cat are you? Mischievous, lazy, political, or fierce? Join our screen printing session inspired by  our latest exhibition, The Many Lives of the Cat and bring your feline personality to life on a tote bag. Learn simple screen printing techniques and take home a custom creation that's uniquely yours.\n\nThis programme is in conjunction with the exhibition The Many Lives of the Cat",
    "url": "https://map-india.org/map-events/cat-ch-your-vibe-tote-printing-session/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/Website-cover-images-new-30.png"
  }
]