[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "744@map-india.org",
    "name": "Lettering Workshop",
    "startDate": "2025-02-16T14:00:00+05:30",
    "endDate": "2025-02-16T17:00:00+05:30",
    "description": "Explore the intersection of language and art in our upcoming lettering workshop!  Held in conjunction with the Sasken Story Rangin Akshar exhibition, this session will guide you through the basics of lettering, including freehand exercises, briefly, multiscript logos.  Discover inspiring examples from MAP's collection and a walkthrough of our digital exhibition Rangin Akshar at the Sasken Gallery.  \n\nWe are committed to making this event accessible to everyone. Please contact us at hello@map-india.org if you have any specific accessibility needs, and we will make the necessary arrangements.\n\nPhoto credits: Letterbox India, Ek Type\n\n&nbsp;\n\nRegistrations for this workshop are now closed.",
    "url": "https://map-india.org/map-events/lettering-workshop/",
    "keywords": [
      "Collections programming",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-22.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "746@map-india.org",
    "name": "Reflections of India",
    "startDate": "2025-02-16T17:30:00+05:30",
    "endDate": "2025-02-16T18:30:00+05:30",
    "description": "Discover a new perspective on the British Raj through the rare and stunning photographs of Raja Deen Dayal.\n\nJoin Dr. Sonya Rhie Mace and Dr. Barbara L. Tannenbaum, curators at the Cleveland Museum of Art, for a conversation about their collaborative exhibitions, including the 2023 exhibition Raja Deen Dayal: The King of Indian Photographers.\n\nDr. Mace and Dr. Tannenbaum have dedicated their careers to exploring the profound interplay between photography and historical Indian art. Their exhibition on Raja Deen Dayal, has shed light on how photographers and artists have presented Indian culture and religion from diverse perspectives.\n\nThrough a series of joint projects, such as, Temples and Worship in Southern Asia (currently on view) and Krishna and the Path of Grace, they have juxtaposed photography with historical Indian paintings, textiles, and artifacts. \n\nThis conversation promises to offer valuable insights into the history of photography in India and its enduring impact on our understanding of art and culture.\n\nImage credits: Royal Elephant Ramkali with a Mahout, c. 1761. Northwestern India, Rajasthan, Rajput kingdom of Mewar, Udaipur, Court of Ari Singh (reigned 1761-73). Gum tempera, ink, and gold on paper; painting: 20.6 x 21.4 cm (8 1/8 x 8 7/16 in.); overall: 24.1 x 25 cm (9 1/2 x 9 13/16 in.). The Cleveland Museum of Art, Gift of Dr. Norman Zaworski 2005.202",
    "url": "https://map-india.org/map-events/reflections-of-india/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-24.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "739@map-india.org",
    "name": "Anaïs in Love / Les Amours d'Anaïs",
    "startDate": "2025-02-16T15:00:00+05:30",
    "endDate": "2025-02-16T17:00:00+05:30",
    "description": "Is love a whirlwind of confusion, restlessness, and desire?  Anaïs certainly thinks so.  Join us this Valentine's Week for a special screening of the charming French romantic comedy, Anaïs in Love (Les Amours d'Anaïs), and experience love's ups and downs through Anaïs's eyes.\n\nThis film will have English subtitles.\n\nThis event is in collaboration with The Alliance Française de Bangalore.\n\n",
    "url": "https://map-india.org/map-events/anais-in-love-les-amours-danais/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Anaïs in Love / Les Amours d'Anaïs"
    },
    "subtitleLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-18.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "719@map-india.org",
    "name": "Framing the Archive",
    "startDate": "2025-02-15T09:00:00+05:30",
    "endDate": "2025-02-16T17:00:00+05:30",
    "description": "Join us for an essay filmmaking workshop with Falana Films, where they will introduce you to the essay film format and guide you in developing a short film (one to three minutes) while working with an archive.\n\nIn making your essay film, you will have access to a curated set of artworks from the MAP Collection, as well as a resource list of museum and other institutional archives available in the public domain. Additionally, you will be prompted to bring your own archival material–found footage, home videos, family photographs, long-lost audio recordings, and any A/V material you feel is at the cusp of telling a story. You will also be encouraged to film additional footage throughout the workshop.\n\nThis four-day workshop extends across two weekends–February 15–16 &amp; 22–23. Teams of four will be selected based on themes chosen by participants when they register for the workshop. These teams alongside the Falana team will work together to make the film.\n\nThe focus of this workshop is not as much on the technical aspects of filmmaking as it is on the meaning one can make from scattered archives when thematically exploring them. \n\nExpanding on the thematic concerns of MAP’s permanent exhibition, VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection you can find the list of themes for the workshop below:\n\n&nbsp;\n\n- Body as Landscape: Gender Identity, Sexuality and Body-politics\n\n- Home and Away: Memory, Migration and Nostalgia\n\n- No Person’s Land: Cities and Spaces \n\n- ‘Mad or What?’: Mental Health and the City\n\n&nbsp;\n\nRegister soon as seats are limited.\n\nRead this document to find out more about the workshop, FAQs and a tentative schedule.",
    "url": "https://map-india.org/map-events/framing-the-archive/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/Website-cover-images-new-10.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "747@map-india.org",
    "name": "The Many Lives of Cinema",
    "startDate": "2025-02-22T09:00:00+05:30",
    "endDate": "2025-02-22T20:00:00+05:30",
    "description": "Popular cinema both shapes, and is shaped, by the world we live in; our social realities, our politics, and our perception of ourselves and others. However, what are the stories that we can find outside of the cinematic context itself? Explore the visual culture that surrounds cinematic production, and join us for this Film Ephemera Symposium that focuses on the nature, and possibilities of film ephemera as both object and subject. \n\nFilm ephemera – including posters, lobby stills, lobby cards, and songbooks – were popularly designed in the 20th century as promotional materials. They were meant to communicate information and excite and thrill audiences, giving them a taste of what to expect. What happens when they have ceased to serve their function? What happens when they move from streets and theatres to museums and archives? What can we learn from them about the past and how can we engage with them in the contemporary moment? \n\nThis symposium positions the archive as a living entity—an interactive repository of knowledge that goes beyond preservation to inspire future dialogues. It brings together film historians, museum professionals, archivists, artists and scholars to explore the challenges and opportunities that lie in creating, accessing and working with film ephemera. \n\nFrom the technologies and larger visual histories of the time, to the passion of fandom and embedded identity politics, each encounter with an object from the archive can create fresh meanings and offer new interpretations. By fostering dialogues around this, the symposium aims to bridge academic inquiry and public engagement, encouraging a reimagining of film ephemera as vibrant touch points between memory, materiality and collective identity.\n\nProgramme Schedule\n\n9:00 am to 10:00 am - Registration\n\n10:00 am to 10:15 am - Opening Remarks\n\n10:15 am to 11:00 am - Keynote Address by Ashish Rajadhyaksha \n\n11:15 am to 12:45 pm - Panel 1: Reframing the Image: History, Politics and Art - Ranjini Mazumdar, Amarnath Praful and Rajan Krishnan. Moderated by Srinivas S V\n\n12:50 pm to 1:00 pm - Screening of “Blueprint of a Pleasure Machine” by Amit Dutta\n\n2:00 pm to 2:45 pm -  Walkthrough at Sasken Multimedia Gallery \n\n2:45 pm to 3:30 pm - Walkthrough at Sasken Multimedia Gallery \n\n2:00 pm to 3:30 pm - Poster-making Workshop by Prashanth C\n\n2:00 pm to 3:30 pm - Ragas in Bollywood by Priya Kanungo\n\n4:00 pm to 5:00 pm - Panel 2: Reframing the Object: Materiality, Memory and the Archive - Iyesha Geet Abbas, and Murchana Bohra. Moderated by: Mandara Vishwanath\n\n5:00 pm to 6:00 pm - Panel 3: Reframing the Story:  Interventions, Interpretations and Imaginations - Clare Arni and Balaji Maheshwaran. Moderated by Ritwika Misra\n\n6:30 pm to 8:00 pm - Musical performance by Digging in India ",
    "url": "https://map-india.org/map-events/the-many-lives-of-cinema/",
    "keywords": [
      "MAP",
      "Symposium"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/02/Website-cover-images-new-28.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "732@map-india.org",
    "name": "Up, Close & Centre",
    "startDate": "2025-02-21T16:30:00+05:30",
    "endDate": "2025-02-21T17:00:00+05:30",
    "description": "Join us for a session of Up, Close &amp; Centre at our exhibition, The Forgotten Souvenir. \n\nThe mica paintings in this exhibition from Murshidabad, Patna and Trichinopoly (present day Tiruchirapalli) represent a nearly forgotten chapter in Indian art, bridging the gap between the decline of traditional miniature painting and the rise of photography. \n\nShubhasree Purkayastha from the MAP team will be speaking about the Ramlila festival artwork by Sewak Ram in detail and focusing on the details as well as context within the exhibition.\n\nDon’t miss this unique chance to engage with the exhibition on a more personal level. \n\nThis is a drop-in session. No pre-registration required.",
    "url": "https://map-india.org/map-events/up-close-centre-11/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/forgotten-souvenir-website-banner-1.png"
  }
]