[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1022@map-india.org",
    "name": "Who Has Got Your Back?",
    "startDate": "2025-10-12T16:00:00+05:30",
    "endDate": "2025-10-12T17:00:00+05:30",
    "description": "Step into the enchanting world of mythical beings with this special trivia session inspired by our exhibition 'In Celestial Company'. Discover the fascinating stories behind divine companions like Garuda, Mooshika, Airavata, and the many other fantastical creatures that journey alongside gods and goddesses.\n\nThis isn't your typical trivia night. The questions are designed to be accessible and engaging, with clues and hints that help you piece together the answers. You don't need to be a mythology scholar—just bring your curiosity and a problem-solving spirit!",
    "url": "https://map-india.org/map-events/who-has-got-your-back/",
    "keywords": [
      " Date",
      "CBD",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1018@map-india.org",
    "name": "It’s Time to Dig Out Antique ISL",
    "startDate": "2025-09-27T16:00:00+05:30",
    "endDate": "2025-09-27T17:00:00+05:30",
    "description": "Language is alive—it breathes, grows, and transforms with each generation. Indian Sign Language (ISL) is no different. But how has the ISL we know today changed from its traditional roots? What stories do these transformations tell?\nJoin us for a captivating panel discussion featuring three Deaf experts from across India as they unveil the fascinating journey of ISL through time. Discover how traditional sign language has evolved, what forces shaped these changes, and why understanding this evolution matters more than ever.\n\nFrom historical roots to modern expressions, this conversation will reveal the cultural significance and rich heritage embedded in every gesture, while exploring how we can honor ISL's legacy in our rapidly changing world.\n\nThis event is part of the International Week of the Deaf, presented in collaboration with MAP and Hear a Million (HAM).",
    "url": "https://map-india.org/map-events/its-time-to-dig-out-antique-isl/",
    "keywords": [
      "CBD",
      "MAP",
      "Panel Discussion"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1015@map-india.org",
    "name": "Journeys with and through Music",
    "startDate": "2025-09-21T17:00:00+05:30",
    "endDate": "2025-09-21T18:30:00+05:30",
    "description": "In this special conversation, singer–composer Bindhumalini and cultural theorist–translator Tejaswini Niranjana reflect on the ways music shapes and accompanies our lives. Together they will explore how voice and song become pathways to listening, dialogue, and discovery",
    "url": "https://map-india.org/map-events/journeys-with-and-through-music/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-36.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1008@map-india.org",
    "name": "Hands-On Art: A Tactile Journey Through the MAP Collection",
    "startDate": "2025-09-27T11:00:00+05:30",
    "endDate": "2025-09-27T13:00:00+05:30",
    "description": "Join Gurjeet Singh for a unique sensory journey through Visible/Invisible: Representations of Women in Art through the MAP Collection.\n\nDesigned for people with visual impairment, this tactile workshop invites participants to explore artworks through touch, then channel their experience into creating personal tactile artworks exploring ornamentation and self-expression. All workshop materials, from textile fragments to modeling tools and decorative elements, are included.\n\nPlease note: This workshop is specifically designed for people with visual disabilities. Participants are welcome to bring a friend or family member to join them.",
    "url": "https://map-india.org/map-events/hands-on-art/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-32.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1012@map-india.org",
    "name": "Deaf Bookwave",
    "startDate": "2025-09-20T14:00:00+05:30",
    "endDate": "2025-09-20T17:00:00+05:30",
    "description": "Join Bengaluru's book club for the Deaf and Hard of Hearing community. Experience literature in a welcoming space designed for meaningful connection and expression through Indian Sign Language (ISL).\n\nThis session offers a safe, friendly environment where members explore books, share perspectives, and engage in rich discussions. We celebrate the power of storytelling while fostering genuine connections within the community.\n\nMore than just a book club—we're building a space where accessibility meets literary passion.",
    "url": "https://map-india.org/map-events/deaf-bookwave-2/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-35.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1005@map-india.org",
    "name": "NeuroQueer BrainBox",
    "startDate": "2025-09-20T15:00:00+05:30",
    "endDate": "2025-09-20T18:00:00+05:30",
    "description": "A warm invitation to all Neuroqueers!\n\nJoin us for another edition of NeuroQueer Brain Box facilitated by Mani Agarwal who is a NeuroQueer therapist. For this session, we’ll come together to reimagine art and write letters of care and affirmation.\nWe’ll begin by moving through Shape of a Thought: Letters from Ram Kumar at your own pace, in your own way. As you journey through the exhibition, hold close three words of affirmation; let them sit with you, and bring them to the huddle.\n\nThrough shared exploration and queer perspectives, we’ll shape those thoughts into community letters and collaborative art celebrating neuroqueer creativity and building a space where others can feel seen, safe, and held.\n\nPlease note: This is a free session exclusively for individuals who identify as LGBTQIA+ with ADHD/Autism/AuDHD.",
    "url": "https://map-india.org/map-events/neuroqueer-brainbox-2/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-27.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1027@map-india.org",
    "name": "ISL Workshop",
    "startDate": "2025-09-28T14:30:00+05:30",
    "endDate": "2025-09-28T15:30:00+05:30",
    "description": "Been wanting to learn ISL but never found the time? Here’s your chance! Join us for an exciting, hands-on workshop led by deaf teachers, where you’ll dive into the world of Indian Sign Language.\n\nWhether you’re starting with the basics, looking to play fun games, or eager to listen and share stories in ISL, this space has it all. Come learn, connect, and experience the joy of communication without barriers!\n\nThis event is part of the International Week of the Deaf, presented in collaboration with MAP and Hear a Million (HAM).",
    "url": "https://map-india.org/map-events/isl-workshop-2/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/09/ISL.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1024@map-india.org",
    "name": "ISL Scavenger Hunt",
    "startDate": "2025-09-27T14:00:00+05:30",
    "endDate": "2025-09-27T18:00:00+05:30",
    "description": "Join an inclusive treasure hunt where deaf and hearing participants team up to solve clues and explore the museum together. Our specially designed brochure features QR codes that unlock ISL videos, making every clue accessible and engaging for all participants.\n\nThis event is part of the International Week of the Deaf, presented in collaboration with MAP and Hear a Million (HAM).",
    "url": "https://map-india.org/map-events/isl-scavenger-hunt/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2021/09/1440-X-810-Widget-02.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1021@map-india.org",
    "name": "Write from Art, Write from Story",
    "startDate": "2025-10-04T11:30:00+05:30",
    "endDate": "2025-10-05T14:30:00+05:30",
    "description": "Explore the multifaceted world of artist and writer Ram Kumar through a unique creative writing workshop, in conjunction with our exhibition Shape of a Thought:Letters from Ram Kumar  - inviting observation, reflection, and profound emotional resonance.\n\nThis workshop draws inspiration from two powerful sources within Ram Kumar's creative universe. Participants will engage with his abstract and cityscape paintings on display, letting their emotional depth spark creative expression, while also exploring his short stories—available in translation within the gallery—with their unflinching social criticism and bold narrative voice.\n\nOver two days, Out of Print founder and editor Indira Chandrasekhar will guide participants through exercises that deepen artistic observation and literary craft, creating a dialogue between visual and written expression.",
    "url": "https://map-india.org/map-events/write-from-art-write-from-story/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-3.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1017@map-india.org",
    "name": "In & Out of the Frame",
    "startDate": "2025-10-07T17:00:00+05:30",
    "endDate": "2025-10-07T18:00:00+05:30",
    "description": "Join us for a walkthrough of our permanent exhibition with Senior Archivist at the Archives at NCBS, Anjali Ramachandran.\n\nWhen we encounter artworks at a museum, we make meaning either through the work itself, its setting, or through labels that accompany them. Another way to read an artwork is to look for what's not in the 'frame'—to explore the circumstances of its creation and the use of the artwork, rather than just the artwork itself.\n\nIn this guided walk, you will get to explore our permanent exhibition, VISIBLE/INVISIBLE: Representation of Women through the MAP Collection, through the lens of an archivist. We will discuss the maker, the purpose, a specific object's relation to others, and the broader social and historical environment in which the artworks were created. In archival sciences, this is called contextualisation, where archivists understand records through the varied ways in which memories (remembered or in recorded acts) have been transmitted over time and space with numerous inscriptions, transmissions, and omissions.\n\nAlthough it sounds technical, the process itself can be disruptive and playful. It involves gossip, peeking behind the curtain, and an understanding of the complex process of making art!",
    "url": "https://map-india.org/map-events/in-out-of-the-frame/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1014@map-india.org",
    "name": "Accessible Art Experience: Tactile Walkthrough",
    "startDate": "2025-09-27T16:00:00+05:30",
    "endDate": "2025-09-27T17:00:00+05:30",
    "description": "Experience art beyond sight in this special walkthrough of VISIBLE/INVISIBLE: Representations of Women in Art through the MAP Collection. Join artist Gurjeet Singh as he guides you through the tactile artworks he created specifically for this exhibition, inviting you to engage with creativity through touch and discover new dimensions of artistic expression.\n\nThis session will focus on the tactile artworks he created for the exhibition, allowing visitors to engage with art through touch and explore new ways of experiencing creativity. Gurjeet will share his inspirations, processes, and the stories behind his tactile pieces, offering audiences a unique perspective into his practice.\n\nJoining him is MAP's Inclusion Manager, Shailesh Kulal, who will explore the accessibility measures thoughtfully integrated throughout the exhibition. From tactile guides to inclusive resources, discover why these considerations are essential for ensuring everyone can experience and enjoy art equally.",
    "url": "https://map-india.org/map-events/tactile-walkthrough/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/WEBSITE.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1011@map-india.org",
    "name": "Art with Code",
    "startDate": "2025-09-20T11:00:00+05:30",
    "endDate": "2025-09-20T14:00:00+05:30",
    "description": "Join us for the \"Art with Code\" programme which introduces coding in an innovative context, teaching it through the lens of interactive art. Participants will start by learning the basics of creating art and incorporating interaction using JavaScript. This program aims to view technology not as the end goal, but as a means to create meaningful digital experiences.\n\nFacilitated by Tanvi Kumar, the program will teach participants p5.js, a JavaScript library created to teach the fundamentals of programming through art. This edition of the program will have a special theme - Ticket Tika Chaap - where participants will generate art using the ticket/chaap images that were a prominent part of the Indo-British textile trade.\n\nThis workshop is beginner-friendly, ideal for those with no coding experience as well as experienced coders.\n\nPlease note: Laptops are mandatory for this event. If you aren't able to bring one, please let us know beforehand at \n\nhello@map-india.org",
    "url": "https://map-india.org/map-events/art-with-code/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-33.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1029@map-india.org",
    "name": "Deaf Theatre in the Hearing World",
    "startDate": "2025-09-28T16:00:00+05:30",
    "endDate": "2025-09-28T17:00:00+05:30",
    "description": "In mainstream theatre, the stage often belongs to those who can hear. For deaf actors, opportunities are rare but that doesn’t mean their voices are silent. On the contrary, deaf performers bring a rich, visual, and deeply expressive language to the stage, challenging traditional ideas of performance and storytelling. Their work pushes us to rethink what theatre can be when sound is not the only tool for connection.\n\nJoin us for a powerful panel discussion where deaf actors, hearing directors, and industry voices come together to share their stories. Discover how they communicate, collaborate, and reimagine inclusion/access in the world of theatre.\n\nThis event is part of the International Week of the Deaf, presented in collaboration with MAP and Hear a Million (HAM).",
    "url": "https://map-india.org/map-events/deaf-theatre-in-the-hearing-world/",
    "keywords": [
      "CBD",
      "MAP",
      "Panel Discussion"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2023/09/islhistoryandart-3-scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "1030@map-india.org",
    "name": "ISL Jam",
    "startDate": "2025-09-28T18:00:00+05:30",
    "endDate": "2025-09-28T19:00:00+05:30",
    "description": "Want to see what happens when Indian Sign Language and art come together and the magic they create? This showcase celebrates the beauty of expression beyond words, where hands, faces, and movement transform into storytelling.\n\nExperience a vibrant line-up of performances, including Visual Vernacular, sign poetry, and innovative ISL creations from playful A-to-Z stories to rhythmic 1-to-10 storytelling and so much more. Come witness how ISL turns into art, and art turns into connection at the ISL JAM.\n\nThis event is part of the International Week of the Deaf, presented in collaboration with MAP and Hear a Million (HAM).",
    "url": "https://map-india.org/map-events/isl-jam/",
    "keywords": [
      "CBD",
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/10/ISL-Jam-2-e1729669268586.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1026@map-india.org",
    "name": "ISL Workshop",
    "startDate": "2025-09-27T14:30:00+05:30",
    "endDate": "2025-09-27T15:30:00+05:30",
    "description": "Been wanting to learn ISL but never found the time? Here’s your chance! Join us for an exciting, hands-on workshop led by deaf teachers, where you’ll dive into the world of Indian Sign Language.\n\nWhether you’re starting with the basics, looking to play fun games, or eager to listen and share stories in ISL, this space has it all. Come learn, connect, and experience the joy of communication without barriers!\n\nThis event is part of the International Week of the Deaf, presented in collaboration with MAP and Hear a Million (HAM).",
    "url": "https://map-india.org/map-events/isl-workshop/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/HP-Slider-Images-Desktop-13.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1019@map-india.org",
    "name": "Make at MAP",
    "startDate": "2025-09-28T11:30:00+05:30",
    "endDate": "2025-09-28T15:30:00+05:30",
    "description": "What would your dream celestial companion look like? In this edition of Make at MAP, come and create your own fantastical being, inspired by our ongoing exhibition - In Celestial Company.\n\nMake @ MAP is a series that allows you to explore our collection in an engaging and hands-on manner. These sessions allow you to create and take home a special souvenir of your visit. It is perfect for all ages — so bring your friends and family and get ready to make some art! No experience is necessary, just a willingness to have fun and experiment with new materials.\n\nPlease note: This is a drop-in session with no registration required. ",
    "url": "https://map-india.org/map-events/make-at-map-3/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-2.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1020@map-india.org",
    "name": "Y2K REWIND",
    "startDate": "2025-09-27T18:00:00+05:30",
    "endDate": "2025-09-27T22:00:00+05:30",
    "description": "Join us as we unveil Pulse Vol 5: Soundscapes—our latest exploration into how sound, music, and silence weave through our lives and identities. This captivating issue features diverse voices expressing their sonic experiences through short films, poetry, photography, and more.\n\nCome Dressed as a Musical Memory from the 2000s! Transform yourself into a moment when music moved you. Channel the iconic imagery of a beloved album cover, embody the colorful energy of a Bollywood dance number, or bring to life that unforgettable childhood jingle that still plays in your head. We want to see how personal musical connections inspire your creative expression.",
    "url": "https://map-india.org/map-events/y2k-rewind/",
    "keywords": [
      "CBD",
      "MAP",
      "OSCH | Youth Engagement"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-7.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1016@map-india.org",
    "name": "Bound Together",
    "startDate": "2025-09-26T15:00:00+05:30",
    "endDate": "2025-09-26T16:00:00+05:30",
    "description": "Join us for a guided walk through our digital textile exhibition, exploring how cloth serves as an expression of human creativity and cultural connection. Textiles are among the oldest human inventions, yet they remain endlessly renewed. To bind, dye, and transform cloth is a shared tradition of creativity—reminding us that making is also a way of becoming.\n\n'Bound Together' is exhibition presents the Haveli collection (1984–2016) by designer Poornima Jain, where influences from India, Japan, and Africa were reimagined into a modern language of abstraction. The works appear in dialogue with the cultural traditions that shaped them—bandhani, leheriya, shibori, and Kuba cloths—tracing connections across geographies while celebrating the singularity of each textile.",
    "url": "https://map-india.org/map-events/bound-together/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-37.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1009@map-india.org",
    "name": "Up, Close & Centre",
    "startDate": "2025-09-30T17:00:00+05:30",
    "endDate": "2025-09-30T17:30:00+05:30",
    "description": "This session of Up, Close and Center looks at one of the artworks by the renowned modernist painter Ram Kumar from the exhibition Shape of a Thought: Letters from Ram Kumar by curator Priya Chauhan.",
    "url": "https://map-india.org/map-events/up-close-centre/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-18.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1006@map-india.org",
    "name": "Rasas & Raagas: Art Inspired Melodies",
    "startDate": "2025-09-20T11:30:00+05:30",
    "endDate": "2025-09-20T14:30:00+05:30",
    "description": "Rasas &amp; Raagas: Art inspired Melodies is an immersive and interactive workshop that invites participants to explore the deep relationship between swar (musical notes), raaga (melodic framework), and rasa (emotional essence). \n\nWhat transforms this experience is its innovative dialogue with visual art. Participants will encounter the evocative modernist paintings of Ram Kumar, allowing his abstract forms and colors to inspire spontaneous musical responses through voice, breath, and sound.\n\nBy placing music in conversation with visual imagery, the workshop opens new pathways to experience both disciplines, designed for musicians, artists, and anyone curious about the emotive power of the arts. No prior training in music is required—just a willingness to listen, respond, and discover the harmony between sound, form, and emotion.\n\nThis event is in conjunction with the exhibition, Shape of a Thought: Letters from Ram Kumar.\n\nFacilitated by arts practitioners, Responding to Art through the Arts aims to activate our galleries through a series of workshops that hold space for young people’s responses to artwork on display. \n\nThis session is conducted as part of our engagements for the MAP Youth Collective. The MAP Youth Collective is a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.",
    "url": "https://map-india.org/map-events/rasas-raagas-art-inspired-melodies/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-28.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1028@map-india.org",
    "name": "Sign or Hands Down and ISL Trivia",
    "startDate": "2025-09-27T18:00:00+05:30",
    "endDate": "2025-09-27T20:00:00+05:30",
    "description": "Think you’ve got the quickest hands in Indian Sign Language (ISL)? Ready to put your knowledge to the test? Join us for an unforgettable event that combines fun, competition, and a whole lot of learning!\n\nSign or Hands Down\n\nFour teams of two will face off in an exciting series of ISL challenges, from ISL Twisters to ISL 1-10, each round will push your quick thinking and reflexes to the limit.\n\nWho will take home the win? The fastest thinkers and most agile signers will reign supreme!\n\nIt’s all about showing off your skills and thinking on your feet!\n\nISL Trivia - Kahoot!\n\nIt’s not just about speed—it’s about knowledge too! Test your ISL expertise in a fast-paced Kahoot quiz where the audience will race to answer questions and claim the top spot. Who will come out on top as the ISL trivia champion? Come join us and see it yourself.\n\nThis event is part of the International Week of the Deaf and a special collaboration between MAP and Hear a Million (HAM).",
    "url": "https://map-india.org/map-events/sign-or-hands-down-and-isl-trivia/",
    "keywords": [
      "CBD",
      "MAP",
      "Quiz"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/09/ISL-trivia.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1025@map-india.org",
    "name": "ISL Scavenger Hunt",
    "startDate": "2025-09-28T14:00:00+05:30",
    "endDate": "2025-09-28T18:00:00+05:30",
    "description": "Join an inclusive treasure hunt where deaf and hearing participants team up to solve clues and explore the museum together. Our specially designed brochure features QR codes that unlock ISL videos, making every clue accessible and engaging for all participants.\n\nThis event is part of the International Week of the Deaf, presented in collaboration with MAP and Hear a Million (HAM).",
    "url": "https://map-india.org/map-events/isl-scavenger-hunt-2/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2020/12/1440-X-810-Widget-06.jpg"
  }
]