[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "709@map-india.org",
    "name": "The Forgotten Souvenir",
    "startDate": "2025-01-24T16:00:00+05:30",
    "endDate": "2025-01-24T17:00:00+05:30",
    "description": "Explore MAP's latest exhibition, The Forgotten Souvenir, through a guided walk and discover how  the art of mica paintings were created during the East India Company’s heyday. These paintings, both art and historical documents, showcase professions, societal roles, and colonial India's rigid caste and class systems and thus, offer unique insights into everyday life under colonial rule.  \n\nThese delicate works, painted on thin sheets of muscovite mica from Murshidabad, Patna, and Trichinopoly, reflect the adaptation of Indian artists as royal patronage declined. They served as easily portable, attractive souvenirs for British travellers, bridging the gap between traditional miniature painting and the rise of photography.  \n\nAccompanied by Amit Dutta’s short film Moments before Mutiny and an interactive game, this guided walk invites you to journey deeper into this nearly forgotten chapter of Indian art.\n\nPhoto Credits: Philippe Calia",
    "url": "https://map-india.org/map-events/the-forgotten-souvenir-8/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/Website-cover-images-new-3.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "710@map-india.org",
    "name": "VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection",
    "startDate": "2025-01-25T13:00:00+05:30",
    "endDate": "2025-01-25T14:00:00+05:30",
    "description": "Join us on a guided walk of the exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.  Featuring over 130 diverse artworks, this exhibition redefines the portrayal of women in art through sculptures, textiles, paintings, and photographs. that challenge traditional notions of femininity and gender as social constructs.  \n\nDivided into four sections—Goddess and Mortal, Sexuality and Desire, Power and Violence, Struggle and Resistance—the exhibition highlights themes of sacrifice, desire, aggression, and empowerment.\n\nIn this guided walk, you will have the unique opportunity to engage with groundbreaking perspectives and compelling stories that provoke reflection and dialogue about women’s lives and the spaces they occupy in the Indian subcontinent. Don’t miss this opportunity to explore the intersection of art, gender, and history.\n\n&nbsp;\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/visible-invisible-representation-of-women-in-art-through-the-map-collection-9/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/01/viv-ucc-website.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "706@map-india.org",
    "name": "Dastangoi by Kafeel Jafri",
    "startDate": "2025-02-12T18:30:00+05:30",
    "endDate": "2025-02-12T19:45:00+05:30",
    "description": "Step into a thousand and one nights of enchantment as Kafeel Jafri presents a captivating Dastangoi performance.\n\nDastangoi is a dramatic form of storytelling in the Hindustani language. Join us for a mesmerising performance by Kafeel Jafri, where he will weave tales of wonder and intrigue, bringing the magic of ancient stories to life. \n\nThis special performance is presented in conjunction with Sasken Story Arabian Nights, offering a unique opportunity to experience the power of storytelling in its most authentic form.",
    "url": "https://map-india.org/map-events/dastangoi-by-kafeel-jafri/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/Website-cover-images-new-6.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "703@map-india.org",
    "name": "Tuesday Tidbits",
    "startDate": "2025-01-28T17:30:00+05:30",
    "endDate": "2025-01-28T18:00:00+05:30",
    "description": "Are you passionate about the arts and curious about the inner workings of the museum world? If you're interested in learning more about development and funding in the arts sector, this drop-in session is for you. Join us for Tuesday Tidbits featuring Shraddha Jadhav, Head of Development at MAP, as she shares her expertise on funding for the arts sector in India. \n\nShe will discuss the current landscape of arts funding, focusing on MAP's support for the exhibition Chay Reds, Ferrous Black, and will offer valuable insights into securing funding for your own projects. Shraddha will also share her personal journey, navigating the transition from art history research to a fulfilling career in development and fundraising. \n\nTuesday Tidbits is a series that explores different aspects of working in a museum through the lens of our team members. Join us for these free, insightful, and short sessions on life in a museum. \n\nThis is part of our series that seeks to support youth in career research/building and acts as a space for networking for young people.",
    "url": "https://map-india.org/map-events/tuesday-tidbits-7/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/12/chay-reds-website-banner-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "639@map-india.org",
    "name": "Louis Kahn's Tiger City",
    "startDate": "2025-01-25T17:00:00+05:30",
    "endDate": "2025-01-25T19:30:00+05:30",
    "description": "Join us for the screening of Louis Kahn’s Tiger City in conjunction with the exhibition Eckart Muthesius and Manik Bagh: Pioneering Modernism in India curated by Raffael Dedo Gadebusch, travelling from the Museum of Asian Art, Berlin. In this film, art historian and filmmaker Sundaram Tagore retraces the footsteps of architect Louis Kahn,  uncovering how he built the iconic and monumental parliamentary complex in war-torn Bangladesh. \n\nBuilt for the Maharaja of Indore, Yashwant Rao Holkar II, Manik Bagh (or the ‘Gem Garden’) was a residential palace designed by his friend and architect Eckart Muthesius. The exhibition marks a first in a series of shows planned on architecture, focusing on plural interpretations on the idea of “home” through 3 exhibitions planned through 2025-2026. \n\nThe screening will feature an introduction by the director, Sundaram Tagore, and conclude with a Q&amp;A session with the audience.",
    "url": "https://map-india.org/map-events/louis-kahns-tiger-city/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Louis Kahn's Tiger City"
    },
    "image": "https://map-india.org/wp-content/uploads/2024/11/jan-25-website-banner-.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "708@map-india.org",
    "name": "Make at MAP",
    "startDate": "2025-01-26T14:00:00+05:30",
    "endDate": "2025-01-26T15:30:00+05:30",
    "description": "This edition of Make at MAP invites participants to dive into the world of Jamini Roy. Drop by to craft your own artwork, inspired by his earthy tones and bold outlines, and take home a unique souvenir!\n\n\nWhether you’re a seasoned artist or a first-time painter, our materials and guidance will help you bring to life your own masterpiece. The session is designed to be relaxed and open-ended, allowing you to drop-in at your own pace, experiment with different techniques, and create a painting that reflects your personal interpretation of Jamini Roy's iconic style.\n\nPlease note that all materials will be provided.",
    "url": "https://map-india.org/map-events/make-at-map-17/",
    "keywords": [
      " Date",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/c48ee092-8f89-4670-ab39-376883876366-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "705@map-india.org",
    "name": "Michael Craig-Martin and Abhishek Poddar",
    "startDate": "2025-01-25T15:00:00+05:30",
    "endDate": "2025-01-25T16:00:00+05:30",
    "description": "Join us for a conversation between renowned contemporary artist Michael Craig-Martin and Abhishek Poddar as they delve into the ideas, inspirations, and creative journey behind Craig-Martin’s groundbreaking works. Known for his vivid, conceptual portrayals of everyday objects, Craig-Martin will share stories and perspectives on his artistic process.",
    "url": "https://map-india.org/map-events/michael-craig-martin-and-abhishek-poddar/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/Website-cover-images-new-5.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "711@map-india.org",
    "name": "Chay Reds, Ferrous Black",
    "startDate": "2025-01-25T16:00:00+05:30",
    "endDate": "2025-01-25T17:00:00+05:30",
    "description": "Step into the rich history of Indian trade textiles in Sri Lanka by joining us on a guided walk of Chay Reds, Ferrous Black, an evocative exhibition at the Museum of Art &amp; Photography. Featuring exquisite Palampores and textile fragments from the 18th century, this collection unravels the ties between the two cultures through vibrant designs that once adorned homes and sacred spaces.  \n\nDiscover how symbols like the pomegranate, elephant, and peacock bridge traditions across India and Sri Lanka, reflecting shared beliefs and evolving local meanings. Hand-painted in striking chay reds and ferrous black, these textiles speak of artistry, craftsmanship, and cultural exchange.  \n\nWhether you're a history enthusiast, a lover of myths, or captivated by textiles, this guided walk invites you to rediscover a shared heritage woven through generations. Don’t miss this unique journey into the artistry and narratives of two interconnected worlds.\n\nThis guided walkthrough will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/chay-reds-ferrous-black-9/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/chay-reds-website-banner-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "707@map-india.org",
    "name": "Make at MAP",
    "startDate": "2025-01-26T11:30:00+05:30",
    "endDate": "2025-01-26T13:00:00+05:30",
    "description": "This edition of Make at MAP invites participants to dive into the world of Jamini Roy. Drop by to craft your own artwork, inspired by his earthy tones and bold outlines, and take home a unique souvenir!\n\n\nWhether you’re a seasoned artist or a first-time painter, our materials and guidance will help you bring to life your own masterpiece. The session is designed to be relaxed and open-ended, allowing you to drop-in at your own pace, experiment with different techniques, and create a painting that reflects your personal interpretation of Jamini Roy's iconic style.\n\nPlease note that all materials will be provided.",
    "url": "https://map-india.org/map-events/make-at-map-jamini/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/c48ee092-8f89-4670-ab39-376883876366-1.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "704@map-india.org",
    "name": "Three-month Training Course in Photograph Conservation for Libraries, Archives and Art Collections",
    "startDate": "2025-03-03T09:00:00+05:30",
    "endDate": "2025-05-23T17:30:00+05:30",
    "description": "Join us for an intensive 3 months training course in photograph conservation for libraries, archives and art collections. This course is designed for people working in libraries, archives and other institutional collections, who work with photographic materials as a part of their professional responsibilities.\n\nOver 12 weeks of on-site instruction, you will learn the fundamentals of photograph conservation: identification of photographic processes, minor conservation treatments, preventive conservation, and disaster salvage for 19th, 20th, and 21st century materials. At the end of the course, you will return to your home institution, and carry out a 4-week conservation project, where you will apply what you have learnt during the course.\n\nThe workshop will be hands-on, where you will spend time in the darkroom reconstructing historical processes to understand the materials, their identification, and deterioration. This will be complemented by sessions in the conservation lab, where you will work on historical and contemporary photographs. In addition to in-person training, you will attend online lectures from art-historians and conservators to understand what we do and why we do it.\n\nApply for this programme and we will let you know if you are selected by February 10th, 2025.\n\nThis training programme is supported by Tata Trusts and conducted by the Museum of Art &amp; Photography, Bengaluru.",
    "url": "https://map-india.org/map-events/3-months-training-course-in-photograph-conservation-for-libraries-archives-and-art-collections/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/1440x810px.jpg"
  }
]