[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1110@map-india.org",
    "name": "Beyond Headcount Diversity - MAP's 3rd Inclusion Conference, 2026",
    "startDate": "2026-02-14T09:00:00+05:30",
    "endDate": "2026-02-14T18:30:00+05:30",
    "description": "If we imagine inclusion in the arts and cultural sector as a landscape we have been mapping intuitively—sometimes through deliberation and by asking important questions such as: Did we do our best to make access equal for all? Did we push through collaboratively? Did we slow down to listen and evolve? And when did we realise that the map itself needed to be redrawn?\n\nThe Inclusion Conference has always been MAP’s attempt to ask these questions openly. What began in 2023 as a gathering to think about accessibility in cultural organisations, has grown into an annual space where practitioners, educators, activists, artists, and community leaders convene to reflect on inclusive practices that shape the art &amp; cultural spaces. Not merely as a value, but also a practice informed by the unique perspectives of historically marginalised and underrepresented communities.\n\nYear after year, MAP’s Inclusion conference has examined these questions from different vantage points: First, through the lens of funding, then through the systems and structures that enable or restrict those opportunities. In this third edition, we turn our attention to measurement not as a checkbox, but as a way of understanding whether our intentions translate into meaningful change.\n\nTo explore this, the conference brings together voices who work at the intersections of justice, care, community organising, and cultural practice:\n- Through fireside conversations, we unpack how identities shape our understanding of culture and belonging.\n- Workshops guide participants through nuances of recognising unconscious bias, navigating conflict, and cinema poster politics of caste and gender.\n- Case study labs offer a closer look at community-led art &amp; cultural collectives, accessible practice, multilingual engagement, and grassroots education, urging us to reflect on what works, and what must evolve.\n\nThrough the day, participants are encouraged to question their assumptions and biases, as well as rethink and reimagine their roles. The conference culminates with a performance rooted in lived histories at the margins, through a Song of Ghetto by Jangama Collective.\n\nMAP’s aim is to continuously evolve, learn and bring forth innovative, inclusive practices. This conference is a gathering of those who believe that cultural spaces can be more inclusive, more imaginative, and more equitable and those who are willing to walk the talk of shaping that future together.\n\nThis year’s MAP’s 3rd Inclusion conference, Beyond Headcount Diversity at MAP is supported by:\n\n\n\n&nbsp;\n\nMAP’s Accessibility Partner \n\n\n\n&nbsp;\n\nInclusion Conference 2023\n\nInclusion Conference 2024",
    "url": "https://map-india.org/map-events/inclusion-conference-2026-beyond-headcount-diversity/",
    "keywords": [
      "CBD",
      "Conferences",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/12/BHDC_1440X810.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1118@map-india.org",
    "name": "One-in-a-million",
    "startDate": "2026-01-10T14:00:00+05:30",
    "endDate": "2026-01-11T17:00:00+05:30",
    "description": "On January 1st, 2026, we're partnering with Hindustan Times to launch the largest print run of any artwork ever produced worldwide. And we want you to be part of it.\n\nJoin us at MAP to collect your unique print, share your personal message of hope, and watch as a calligraphy artist personalises your artwork on the spot.\n\nBegin 2026 with intention, beauty, and a one-of-a-kind piece of art that's truly yours. We can't wait to welcome you.\n\n(Only for the first 500 visitors at MAP)\n\nBe a part of the Bouquet of Hope, add a picture from your garden/balcony, artwork, an embroidered motif, or anything floral and continue this symbol of fellowship. Click here to add.",
    "url": "https://map-india.org/map-events/one-in-a-million/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/12/NL-video-hero-content2-26.gif"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1115@map-india.org",
    "name": "A Short History of Beauty: Pahari Painting Revisited",
    "startDate": "2026-01-09T18:00:00+05:30",
    "endDate": "2026-01-09T19:30:00+05:30",
    "description": "Pahari paintings are among India's most beautiful works of art, yet much about them remains under-explored.\n\nIn this talk, Dr. Debra Diamond uses close observation and new research into the communities where artists lived and worked to explore how diverse styles emerged and coexisted across the region, while offering a clearer historical framework for understanding these remarkable works on paper.\n\nThis event is in collaboration with Art, Resources and Teaching Trust.\n\nImage credits:\n\nThe Poet Sundar Das (1597–1689) Before the Emperor Shah Jahan (r. 1628–58), from a Sundar Shringar (Sundar’s Love Poems)\nAttributed to an artist from the generation (ca. 1725–ca. 1785) after Nainsukh and Manaku\nHimachal Pradesh state, probably Guler, ca. 1750–60\nFreer Gallery of Art Collection\nPurchase from the Catherine and Ralph Benkaim Collection—Charles Lang Freer Endowment\nF2017.13.4",
    "url": "https://map-india.org/map-events/a-short-history-of-beauty-pahari-painting-revisited/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/12/Website-cover-images-new-83.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1124@map-india.org",
    "name": "Draw with PencilJam",
    "startDate": "2026-01-11T10:30:00+05:30",
    "endDate": "2026-01-11T13:00:00+05:30",
    "description": "View the museum with new eyes as you make your way through various exhibitions with a sketchbook in hand. You don’t need to be a professional to join, we’ll share prompts to guide you through this drawing session.\nAll you need is an open mind and:\n-Sketchbook or A4 paper\n-Pencil (wood or mechanical) and eraser\n-Gel pens or fineliners for outlining\n-Colour brush pens, sketch pens, or colour pencils (no wet media)",
    "url": "https://map-india.org/map-events/draw-with-penciljam-4/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/01/live-sketch-mica-website-banner-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1123@map-india.org",
    "name": "An Evening of K V Tirumalesh’s Poetry",
    "startDate": "2026-01-10T17:00:00+05:30",
    "endDate": "2026-01-10T18:00:00+05:30",
    "description": "An intimate evening with K.V. Tirumalesh’s poetry on cats, this gathering invites readers, listeners, and friends of the poet to come together in a shared space of memory and meaning. Through selected poems, personal recollections, and quiet conversation, we will explore how Tirumalesh wrote cats not merely as animals, but as witnesses, companions, and metaphors of everyday life.\n\nSelected guests will share their experiences with the poet, respond to the poems, and reflect on what they feel Tirumalesh was reaching for—his humour, tenderness, distance, and affection—allowing the poetry to unfold through collective listening and conversation.\n\nPlease note: The event is in Kannada.",
    "url": "https://map-india.org/map-events/an-evening-with-k-v-tirumaleshs-poetry/",
    "keywords": [
      "CBD",
      "MAP",
      "Storytelling Session"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2026/01/Website-cover-images-2026-2.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1119@map-india.org",
    "name": "ArtCade Night",
    "startDate": "2026-01-10T17:00:00+05:30",
    "endDate": "2026-01-10T19:00:00+05:30",
    "description": "Artcade Night will take you on an immersive and interactive journey across the narrative and historical contexts of the exhibition Ticket, Tika, Chaap. Explore the intersection of art and play with engaging games and discover the secrets of game design in this event.",
    "url": "https://map-india.org/map-events/artcade-night/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/01/Website-cover-images-2026.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1120@map-india.org",
    "name": "The Fundamentals Of Game Design: An Introductory Workshop",
    "startDate": "2026-01-10T11:00:00+05:30",
    "endDate": "2026-01-10T14:00:00+05:30",
    "description": "The Binary Breaker is a series of games played in person, designed to introduce the fundamentals of game design and show how game design is a medium for authorship. \n\nBased on the works of bell hooks and Judith Butler, the games will remind its participants that gender is not something that should be defined for them, rather, it is something that can be defined by them. While it is a workshop that explores the gender binary, each game also teaches participants something new about game design.",
    "url": "https://map-india.org/map-events/the-fundamentals-of-game-design-an-introductory-workshop/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2026/01/Website-cover-images-2026-1.png"
  }
]