[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1006@map-india.org",
    "name": "Rasas & Raagas: Art inspired Melodies",
    "startDate": "2025-09-20T11:30:00+05:30",
    "endDate": "2025-09-20T14:30:00+05:30",
    "description": "Rasas &amp; Raagas: Art inspired Melodies is an immersive and interactive workshop that invites participants to explore the deep relationship between swar (musical notes), raaga (melodic framework), and rasa (emotional essence). \n\nWhat transforms this experience is its innovative dialogue with visual art. Participants will encounter the evocative modernist paintings of Ram Kumar, allowing his abstract forms and colors to inspire spontaneous musical responses through voice, breath, and sound.\n\nBy placing music in conversation with visual imagery, the workshop opens new pathways to experience both disciplines, designed for musicians, artists, and anyone curious about the emotive power of the arts. No prior training in music is required—just a willingness to listen, respond, and discover the harmony between sound, form, and emotion.\n\nThis event is in conjunction with the exhibition, Shape of a Thought: Letters from Ram Kumar.\n\nFacilitated by arts practitioners, Responding to Art through the Arts aims to activate our galleries through a series of workshops that hold space for young people’s responses to artwork on display. \n\nThis session is conducted as part of our engagements for the MAP Youth Collective. The MAP Youth Collective is a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.",
    "url": "https://map-india.org/map-events/rasas-raagas-art-inspired-melodies/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-28.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1003@map-india.org",
    "name": "Bhuta Kola",
    "startDate": "2025-09-14T17:00:00+05:30",
    "endDate": "2025-09-14T18:30:00+05:30",
    "description": "Experience the vibrant ritualistic tradition of Bootha Kola, a sacred performance practice from the coastal region of Karnataka. This lecture-demonstration opens a window into the world of spirit worship expressed through music, movement, and transformation.\n\nRenowned practitioners Santosh Hosaangadi and Srikar Pana will present a live demonstration on the elaborate process of makeup and dressing, while Professor Purushottam Bilimale will share insights on the evolution of spirit animals in this ritualistic practice.\n\nCurated by Tvarita Arts Collective in association with MAP, this interactive session brings together practitioner knowledge and academic perspective, offering audiences a rare opportunity to understand and engage with this powerful artform.\n\nThis event is in conjunction with In Celestial Company exhibition programming.",
    "url": "https://map-india.org/map-events/bhuta-kola/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-22.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1000@map-india.org",
    "name": "Design Your Own Mythical Creature",
    "startDate": "2025-09-14T14:00:00+05:30",
    "endDate": "2025-09-14T16:00:00+05:30",
    "description": "Design your own mythical creature! Would it be part meerkat, part deer? Would it have wings or claws? In this hands-on workshop, you'll create your very own celestial companion inspired by the divine beings in our current exhibition.\n\nThe session begins with a walkthrough of In Celestial Company, where you'll meet Garuda, Mooshika, and other legendary creatures, before designing and crafting your own unique mythical friend.\n\nThis event is in conjunction with In Celestial Company exhibition programming.",
    "url": "https://map-india.org/map-events/design-your-own-mythical-creature/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-20.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1008@map-india.org",
    "name": "Hands-On Art: A Tactile Journey Through the MAP Collection",
    "startDate": "2025-09-27T11:00:00+05:30",
    "endDate": "2025-09-27T13:00:00+05:30",
    "description": "Join Gurjeet Singh for a unique sensory journey through Visible/Invisible: Representations of Women in Art through the MAP Collection.\n\nDesigned for people with visual impairment, this tactile workshop invites participants to explore artworks through touch, then channel their experience into creating personal tactile artworks exploring ornamentation and self-expression. All workshop materials, from textile fragments to modeling tools and decorative elements, are included.\n\nPlease note: This workshop is specifically designed for people with visual disabilities. Participants are welcome to bring a friend or family member to join them.",
    "url": "https://map-india.org/map-events/hands-on-art/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-32.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1005@map-india.org",
    "name": "NeuroQueer BrainBox",
    "startDate": "2025-09-20T15:00:00+05:30",
    "endDate": "2025-09-20T18:00:00+05:30",
    "description": "A warm invitation to all Neuroqueers!\n\nJoin us for another edition of NeuroQueer Brain Box facilitated by Mani Agarwal who is a NeuroQueer therapist. For this session, we’ll come together to reimagine art and write letters of care and affirmation.\nWe’ll begin by moving through Shape of a Thought: Letters from Ram Kumar at your own pace, in your own way. As you journey through the exhibition, hold close three words of affirmation; let them sit with you, and bring them to the huddle.\n\nThrough shared exploration and queer perspectives, we’ll shape those thoughts into community letters and collaborative art celebrating neuroqueer creativity and building a space where others can feel seen, safe, and held.\n\nPlease note: This is a free session exclusively for individuals who identify as LGBTQIA+ with ADHD/Autism/AuDHD.",
    "url": "https://map-india.org/map-events/neuroqueer-brainbox-2/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-27.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "995@map-india.org",
    "name": "Curator’s Secrets: A special walkthrough by the curator",
    "startDate": "2025-09-13T12:00:00+05:30",
    "endDate": "2025-09-13T13:00:00+05:30",
    "description": "This festive season, Bangalore finds itself In Celestial Company. Only this time, the focus is less on deities and more on their grand procession of divine helpers, wondrous animals, and mythical beings, and their fascinating stories.\n\nJoin us for a walkthrough of our latest exhibition by the curator, Priya Chauhan and Vineet Kajrolkar , to get behind-the-scenes insights of the making of the exhibition In Celestial Company. \n\nThis event is in conjunction with In Celestial Company exhibition programming.",
    "url": "https://map-india.org/map-events/curators-secrets-a-special-walkthrough-by-the-curator/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/08/Website-cover-images-new-6.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1002@map-india.org",
    "name": "ಮಾತು-ಕಥೆ: Guided Walk in Kannada",
    "startDate": "2025-09-13T15:00:00+05:30",
    "endDate": "2025-09-13T16:00:00+05:30",
    "description": "This festive season, Bangalore finds itself In Celestial Company. Only this time, the focus is less on deities and more on their grand procession of divine helpers, wondrous animals, and mythical beings, and their fascinating stories.\n\nJoin us for a walkthrough of our latest exhibition in Kannada to get behind-the-scenes insights of the making of the exhibition In Celestial Company. \n\nThis event is in conjunction with In Celestial Company exhibition programming.",
    "url": "https://map-india.org/map-events/%e0%b2%ae%e0%b2%be%e0%b2%a4%e0%b3%81-%e0%b2%95%e0%b2%a5%e0%b3%86-guided-walk-in-kannada/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/09/WhatsApp-Image-2024-10-07-at-4.57.23-PM.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "997@map-india.org",
    "name": "What Do Our Divine Companions Tell Us?",
    "startDate": "2025-09-13T16:00:00+05:30",
    "endDate": "2025-09-13T17:30:00+05:30",
    "description": "Explore the intriguing world of vāhanas, Ganaas, Gandharvas, Yaazhis, and other celestial companions that flank the divine.\n\nModerated by Professor Asijit Datta, this panel featuring Professor Mrinal Kulkarni, Professor K. Kesava Rajarajan and Author K. Hari Kumar will delve into the posthumanist lens through which we can understand the vahanas and celestial retinues. Exploring themes of decentralization, hybridity, and the blurring of boundaries between human and animal, the discussion will draw from multiple perspectives - literature, art, and architecture.\n\nThis event is in conjunction with the exhibition In Celestial Company.",
    "url": "https://map-india.org/map-events/what-do-our-divine-companions-tell-us/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/08/Website-cover-images-new-23.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1001@map-india.org",
    "name": "Behind-the-scenes: A guided walk led by the curator",
    "startDate": "2025-09-14T15:30:00+05:30",
    "endDate": "2025-09-14T16:30:00+05:30",
    "description": "This festive season, Bangalore finds itself In Celestial Company. Only this time, the focus is less on deities and more on their grand procession of divine helpers, wondrous animals, and mythical beings, and their fascinating stories.\n\nJoin us for a walkthrough of our latest exhibition by the curator, Priya Chauhan and Vineet Kajrolkar, to get behind-the-scenes insights of the making of the exhibition In Celestial Company. \n\nThis event is in conjunction with In Celestial Company exhibition programming.",
    "url": "https://map-india.org/map-events/behind-the-scenes-a-guided-walk-led-by-the-curator/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/4-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "999@map-india.org",
    "name": "Signing Stories: A Guided Walk in Indian Sign Language",
    "startDate": "2025-09-14T11:00:00+05:30",
    "endDate": "2025-09-14T12:00:00+05:30",
    "description": "This festive season, Bangalore finds itself In Celestial Company. Only this time, the focus is less on deities and more on their grand procession of divine helpers, wondrous animals, and mythical beings, and their fascinating stories.\n\nJoin us for a walkthrough of our latest exhibition in Indian Sign Language to get behind-the-scenes insights of the making of the exhibition In Celestial Company. ",
    "url": "https://map-india.org/map-events/signing-stories-a-guided-walk-in-indian-sign-language/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-18.png"
  }
]