[
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "577@map-india.org",
    "name": "Films Screenings + Discussion by The Third Eye Learning Lab",
    "startDate": "2024-10-06T15:00:00+05:30",
    "endDate": "2024-10-06T17:00:00+05:30",
    "description": "Join us for the screening of three shorts Raat: Night Time in Small Town India, Khushi's Roshni and Kya Hai Yeh Samjhauta? Co-created and worked on in The Third Eye's Learning Lab through varied processes, this screening will be followed by a discussion with The Third Eye Learning Lab team and Hansa Thapliyal.\n\nAbout the films:\n\nRaat (35 min):A documentary exploring the hidden lives and experiences of people in small-town India during the night.\n\nKhushi’s Roshni (7 min): A short film featuring Khushi Bano exploring the complexities of online identity and self-representation among young Muslim women in India.\n\nKyaa hai ye Samjhauta?(Dur. 9 min): A short film exploring women's experiences with domestic violence, and the choices they make in response to it.\n\nNote: All the films will be in Hindi with English subtitles.\n\nCredits\n\nRaat:\n\nMentor: Ruchika Negi, Editor: Abhinava Bhattacharyya, Sound (post production): Abhishek Mathur, Assistance: Madhuri Adwani, Producer (for The Learning Lab): Dipta Bhog, Ruchika Negi, Producer (for The Third Eye): Shabani Hassanwalia, Shivam Rastogi\n\nKhushi's Roshni:\n\nMentor: Ruchika Negi, Editor: Gurleen Grewal, Producer: The Third Eye’s Learning Lab\n\nKyaa hai ye Samjhauta?:\n\nDirection - Hansa Thapliyal, Camera - Nebu George and Pankaj Baral, Sound Design -  Amir Musanna, Sound Final Mix - Shashank Kothari, Art Direction - Koshy Brahmatmaj, Edit - Hansa Thapliyal, Producer: The Third Eye\n\nImage credits: Still from Kyaa hai ye Samjhauta?/ Coming to terms or, Making your Terms? By Hansa Thapliyal",
    "url": "https://map-india.org/map-events/films-by-the-third-eye/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "Films Screenings + Discussion by The Third Eye Learning Lab"
    },
    "subtitleLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/09/Film-screening-website.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "579@map-india.org",
    "name": "Kalapini Komkali - Tribute to Pandit Kumar Gandharva",
    "startDate": "2024-10-04T18:30:00+05:30",
    "endDate": "2024-10-04T20:00:00+05:30",
    "description": "On the occasion of his centenary birth anniversary, the Museum of Art &amp; Photography (MAP) is honoured to celebrate the life, legacy, and music of Pandit Kumar Gandharva. As one of the most innovative and visionary artists of the 20th century, he played a pivotal role in shaping the arts in modern India. His unique approach to music and his fearless experimentation with tradition have left a lasting impact on generations of musicians and artists across various disciplines.\n\nThis special celebration is designed to take the audience on an immersive journey into the world of Pandit Kumar Gandharva. The event will seamlessly blend his timeless compositions with deeply personal anecdotes and memories shared by his daughter and disciple Sushri Kalapini Komkali. These stories will provide rare insights into his aesthetic philosophy, approach to creativity, and the way Pandit Kumar Gandharva perceived the world around him. \n\nThe event will be led by his daughter, Sushri Kalapini Komkali, an accomplished vocalist who has dedicated her life to preserving and promoting her father’s musical legacy. Through her narrative, she will offer a glimpse into the remarkable journey of Pandit Gandharva, from his early days as a child prodigy to becoming one of the most respected and revered musicians in India. Her presentation will highlight the challenges he faced, his innovative spirit, and the profound love he had for music and humanity. She will present her father’s original compositions.",
    "url": "https://map-india.org/map-events/kalapini-komkali-tribute-to-pandit-kumar-gandharva/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/09/WhatsApp-Image-2024-09-26-at-12.10.08-PM.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "580@map-india.org",
    "name": "Tuesday Tidbits",
    "startDate": "2024-10-08T16:00:00+05:30",
    "endDate": "2024-10-08T17:00:00+05:30",
    "description": "Curious about the role of a photographer in a museum? This month’s Tuesday Tidbits features Saikat Das from our collections team who will be focusing on the importance of digitisation and documentation in preserving our cultural heritage. In this session, discover why these practices are essential and the challenges and delights of effectively digitising and documenting varied objects in a museum setting.\n\nIf you’re curious about how a museum digitises a 9 foot long textile, captures the details of a miniature painting or if you’re someone exploring career options in the museum and cultural space, then this session is perfect for you. \n\nTuesday Tidbits is a series that seeks to support youth in career research/building and acts as a space for networking for young people.",
    "url": "https://map-india.org/map-events/tuesday-tidbits-5/",
    "keywords": [
      " Featuring",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/09/Tuesday-tidbits.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "576@map-india.org",
    "name": "Reframing the Visual Depiction of Women and Sexual Violence in Southasia",
    "startDate": "2024-10-05T15:00:00+05:30",
    "endDate": "2024-10-05T18:00:00+05:30",
    "description": "Fear, intimidation, objectification and victims are the predominant themes in images used to depict sexual violence against women in the media. Can you visualise images that are more empowering, more nuanced, that show women in all their complexity, that show resilience and resistance? Be a part of challenging and changing this visual discourse\n\nCome, share your talent, share your vision in this workshop facilitated by the Hri Institute for Southasian Research in conjunction to their project Challenging Visual Depiction of Women and Sexual Violence in Southasia which aims to challenge gender insensitive visual and aural depiction of sexual violence against women in Southasia. \n\nThanks to robust women’s movements in the region, the rising incidents and brutality of incidents of sexual violence has been met with strong protests and demands for accountability. Considerable strides forward have been made to improve media reporting of sexual violence, making it less sensational, more based on women’s lived experiences, gender-sensitive and ethical. However, images that accompany news-reports tend to remain stereotypical and even damaging by reinforcing stigma, helplessness, shame and victim-blaming. Join this workshop and learn to create a more empowering and compassionate visual narrative.\n\nSelected works (sketches, paintings, cartoons, photos) will be showcased on the website of the Hri Institute as part of the pool of stock images that exists.",
    "url": "https://map-india.org/map-events/reframing-the-visual-depiction-of-women-and-sexual-violence-in-southasia/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/09/VIV.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "578@map-india.org",
    "name": "Beyond the Gender Beat",
    "startDate": "2024-10-08T18:30:00+05:30",
    "endDate": "2024-10-08T20:00:00+05:30",
    "description": "A report by The Media Rumble and UN Women in early 2019 analysed India’s leading newspapers, magazines, TV channels, and news websites. It found that in a six-month period in 2018, only 8% of content—news reports, features, opinion pieces, and primetime debates—focused on gender issues.\n\nThis is alarmingly low. A sustained focus on understanding the issues, interests and concerns of women and gender minorities is crucial to undoing the patriarchal systems that bind us.  Non-sexist representation that moves beyond outrage cycles and victim shaming is key to reshaping narratives. This requires both a shift in content and the structure of journalistic institutions to address gender issues beyond sensationalism. Sensitive storytelling should centre the voices of women and gender minorities, critically explore widening gender disparities, and adopt new, compassionate ways to present these stories.\n\nJoin us for a panel discussion featuring Priti David from PARI (People’s Archive of Rural India), Laxmi Murthy from Hri Southasian, Priyanka Tupe from Behan Box, and Shabani Hassanwalia from The Third Eye. Each of these institutions, in their distinct ways, have employed a people-first approach in storytelling; allowing to build sensitivity and instances for continued learning around gender.\n\nThis panel discussion is conceptualised under our exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.",
    "url": "https://map-india.org/map-events/beyond-the-gender-beat/",
    "keywords": [
      "MAP",
      "Panel Discussion"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/09/Panel.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "575@map-india.org",
    "name": "A People-First Approach in Reporting by PARI",
    "startDate": "2024-10-05T10:00:00+05:30",
    "endDate": "2024-10-05T13:00:00+05:30",
    "description": "Join us for a workshop by the People’s Archive of Rural India (PARI) that will explore a people-first approach in reporting with a special focus on gender. Designed for early-career professionals, aspiring journalists, and communications practitioners, the session will guide writers on how to craft compelling stories about the lives and livelihoods of everyday Indians.\n\n Conducted by Vishaka George, Senior Editor at PARI, this session will cover finding overlooked stories, obtaining consent, interviewing, photography tips, and crafting compelling narratives, with hands-on exercises to sharpen skills. \n\n&nbsp;\n\nImage Credit - People’s Archive of Rural India (PARI)",
    "url": "https://map-india.org/map-events/a-people-first-approach-in-reporting-by-pari/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/09/OCT-5.jpeg"
  }
]