[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "901@map-india.org",
    "name": "Sketch with Penciljam",
    "startDate": "2025-06-22T10:30:00+05:30",
    "endDate": "2025-06-22T13:00:00+05:30",
    "description": "The Museum is your studio! For artists of all skill levels that find joy in observational sketching, we invite you to be a part of this creative and relaxed live sketching session with PencilJam. Set against the vibrant backdrop of MAP’s current exhibits, this session offers a blend of quiet observation and creative expression. \n\nWhether you're looking to unwind through sketching, discover new perspectives, or simply enjoy the act of creating in a shared environment, this is a chance to slow down and truly observe the world around you. Connect with fellow art lovers, exchange ideas, and share your own masterpiece in an informal setting that celebrates creativity in all its forms.\n\nYou’ll need to carry your own:\n\n-Sketchbook or A4 paper\n\n-Pencil (wood or mechanical) and eraser\n\n-Gel pens or fineliners for outlining\n\n-Colour brush pens, sketch pens, or colour pencils (no wet media)",
    "url": "https://map-india.org/map-events/sketch-with-penciljam-2/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-09T100756.847.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "868@map-india.org",
    "name": "Training Course in Conservation of Photographs in Museums, Archives, and Collections",
    "startDate": "2025-06-16T09:00:00+05:30",
    "endDate": "2025-09-13T17:30:00+05:30",
    "description": "Don’t let history disappear–or discolour–or fade! Discover the science of photography conservation and learn the art of restoring historic photograph collections. This hands-on, intensive training course is designed for practising conservators, archivists and custodians of historic photograph collections to learn preventive collection care measures, remedial conservation processes, and restoration techniques.\n\nThis three month course will be followed by a one month internship. The course will be instructed by leading specialists from India and overseas and includes topics such as: \n\n -Development, materials and techniques of historic photographic processes\n\n -Identification and understanding of deterioration processes in photograph collections\n\n -Inspection and survey methodologies\n\n -Condition report preparation and preservation prioritisation decisions\n\n -Emergency treatment measures\n\n -Conservation of film and glass plate negatives\n\n -Conservation and restoration of photographs\n\n -Archival protocols of housing, display, and storage of photographic materials\n\n -Disaster management",
    "url": "https://map-india.org/map-events/training-course-in-conservation-of-photographs-in-museums-archives-and-collections/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-12T161452.615.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "902@map-india.org",
    "name": "Tuesday Tidbits",
    "startDate": "2025-06-10T17:00:00+05:30",
    "endDate": "2025-06-10T17:30:00+05:30",
    "description": "If you've wandered through our vibrant Ticket Tika Chaap exhibition, you'll know that colour and design aren't just pretty additions, they're at the very heart of the experience. But what role does design really play in bringing an exhibition to life? Is it a factor to be considered from the start or an afterthought once the exhibition is up?\n\nFind out the answers to these questions and more, at the upcoming Tuesday Tidbits led by Cibal Prems from the MAP Design team.\n\nTuesday Tidbits is a series that explores different aspects of working in a museum through the lens of our team members. Join us for these free, insightful, and short sessions on life in a museum.\n\nThis is part of our series that seeks to support youth in career research/building and acts as a space for networking for young people.",
    "url": "https://map-india.org/map-events/tuesday-tidbits-12/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/1-3.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "900@map-india.org",
    "name": "Kavya Sanje - An Evening of Kannada poetry",
    "startDate": "2025-06-14T18:00:00+05:30",
    "endDate": "2025-06-14T19:00:00+05:30",
    "description": "Kavya Sanje (poetry evening) presents an evocative evening of poetry celebrating young voices in Kannada literature. Featuring emerging poets who explore themes of identity, resistance, love, and belonging, this gathering creates a space where language, rhythm, and emotion meet. \n\nPoets of the evening:\n\nChandini, Gowtham Gowda, Dilip Shivagouri, Bharath Savitri Diwakar, Ahaan, Dadapeer Jyman, Rumi Harish, Sowmya A, Uma, Ravi Ranjan, Srinidhi Prahalad\n\nJoin us for an intimate evening of spoken word that resonates with the spirit of the exhibition, We don’t end at our edges—pushing boundaries, reclaiming space, and celebrating expression.",
    "url": "https://map-india.org/map-events/kavya-sanje-an-evening-of-kannada-poetry/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-cover-images-new-2025-06-03T124058.742.png"
  }
]