[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "610@map-india.org",
    "name": "Tuesday Tidbits",
    "startDate": "2024-11-26T16:00:00+05:30",
    "endDate": "2024-11-26T16:30:00+05:30",
    "description": "How do we truly engage with art? Is it simply appreciating its aesthetic beauty, or is there more to it?\n\nThis month's Tuesday Tidbits features Shubhasree Purkayastha from our Education and Outreach team and focuses on looking beyond the surface to foster learning experiences and make meaningful connections with art. She will focus on our latest exhibition, Chay Reds, Ferrous Black, which includes a story trail especially designed for families to use as a fun journey through the show. Discussing the behind-the-scenes process of developing this, she will highlight how the education team uses exhibitions as the foundation to drive greater creative engagement.     \n\nTuesday Tidbits is a series that seeks to support youth in career research/building and acts as a space for networking for young people.",
    "url": "https://map-india.org/map-events/tuesday-tidbits-6/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/10/2-3.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "618@map-india.org",
    "name": "Artist Interaction: Museum of Memories",
    "startDate": "2024-11-17T12:00:00+05:30",
    "endDate": "2024-11-17T12:30:00+05:30",
    "description": "The Museum of Memories by Greenpeace India is a collection of human stories in the face of the climate crisis. Artist Sabari Venu a.k.a Meancurry Comics has created a collage of stories featuring personal objects that shine light on the human impact of extreme weather events affecting the country.\n\nJoin the artist as he takes us through the varied stories and his process of creating this digital experience.\n\nImage Courtesy: Sabari Venu",
    "url": "https://map-india.org/map-events/artist-interaction-museum-of-memories/",
    "keywords": [
      "MAP",
      "Walkthroughs"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/11/WhatsApp-Image-2024-11-08-at-12.59.10-PM.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "615@map-india.org",
    "name": "Creation and Reflection: Visualising Climate’s Quiet Crisis Sensitively",
    "startDate": "2024-11-17T10:00:00+05:30",
    "endDate": "2024-11-17T13:00:00+05:30",
    "description": "This workshop facilitated by Bhumika Saraswati, invites participants to creatively document the subtle but urgent impacts of extreme heat, especially its invisible effects indoors and outdoors. Through visuals and text, we will explore how heat intersects with gender, caste, and identity in our everyday life. We will also reflect on the gendered nature of certain crises and how they exacerbate existing inequalities.\n\nIn Phase 1, we’ll explore the challenge of visually capturing heat, a crisis that lacks visible markers yet shapes lives deeply. Using examples from her work, Bhumika will discuss how to approach sensitive storytelling, whether capturing one’s own experiences or those of others. \n\nIn Phase 2, we’ll move to hands-on creative engagement. Participants will be prompted to represent their personal experiences of heat—whether through photography, drawing, video, or writing. This phase emphasises honest expression and encourages careful, thoughtful observation.\n\nFinally, in Phase 3, we’ll share and reflect on the pieces created. This is an open space for participants to present their work and discuss the diverse ways we perceive and document heat. The workshop will conclude with a discussion on making invisible climate impacts visible, particularly within the contexts of gender and social identity.\n\nLimited spots available. Register to secure your place!\n\nImage Courtesy: Bhumika Saraswati",
    "url": "https://map-india.org/map-events/creation-and-reflection-visualising-climates-quiet-crisis-sensitively/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/11/WhatsApp-Image-2024-11-08-at-2.09.59-PM.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "608@map-india.org",
    "name": "Restless Line in the Art of Seema Kohli",
    "startDate": "2024-11-19T18:30:00+05:30",
    "endDate": "2024-11-19T19:30:00+05:30",
    "description": "Join us for a conversation between visual artist Seema Kohli and Arnika Ahldag, MAP's Head of Curation and Exhibition, as they delve into Kohli’s prolific, four-decade-long artistic journey, documented in her new book, Restless Line in the Art of Seema Kohli.\n\nThrough a curated collection of essays and interviews, each piece in the book attempts to trace the complexities and evolution of the artist’s journey. It establishes her need to play and experiment with form and story-building, with references to her paintings, installations, performances, and works in the written word.\n\nEdited by Annapurna Garimella and Sindhura DM, with Anshika Varma as a consultant, Restless Line features essays by eleven art writers, including Adwait Singh, Amruta Patil, Dipanjali Deka, Katie Lazarowicz, Charty Dugdale, Gauri Parimoo Krishnan, Seema Bawa, Vaishnavi Ramanathan, Sona Datta, and Lina Vincent. These essays are organised into four thematic sections: The Body is her Studio, Our Myths Feed her Fantasies, Her Workshop is her Shrine, and In Continuum.\n\nBe a part of this conversation that will offer an immersive glimpse into Seema Kohli’s layered creative world and the compelling insights offered in her richly composed publication.",
    "url": "https://map-india.org/map-events/restless-line-in-the-art-of-seema-kohli/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/11/WhatsApp-Image-2024-11-06-at-4.42.33-PM.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "617@map-india.org",
    "name": "Story Circles (Sunday)",
    "startDate": "2024-11-17T15:00:00+05:30",
    "endDate": "2024-11-17T16:30:00+05:30",
    "description": "Story Circles are a series of intimate conversations where we hear from members of stakeholder communities who take us behind the direct and indirect impact of the climate crisis on their lives.\n\nThe details of the two sessions are as follows:\n\nStorytelling session with Nethravathi (3:00-3:30pm)- A session featuring, Nethravathi, a garment factory worker from Karnataka, who will be sharing her experiences in the garment industry and discuss how extreme weather conditions disproportionately impact her and her colleagues.\n\nStorytelling session with Devamma(4:00-4:30pm)- A session featuring Devamma who is part of the Domestic Workers Union in the Somasundrapalya area of Bangalore. She works with other Union members on issues related to women in the area, including domestic workers and construction workers. She is also among the three women community leaders currently working on the issue of public buses in the area, as part of a community-led Greenpeace project.\n\n\nClick the link below to register:\n\nhttps://forms.gle/Tvr5qgS3usAoMe1S6",
    "url": "https://map-india.org/map-events/story-circles-sunday/",
    "keywords": [
      " Featuring",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/11/WhatsApp-Image-2024-11-07-at-6.17.34-PM.jpeg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "616@map-india.org",
    "name": "Ward Vision: Shape Your City (Sunday)",
    "startDate": "2024-11-17T14:00:00+05:30",
    "endDate": "2024-11-17T17:00:00+05:30",
    "description": "Join us for an engaging exploration of your ward's urban landscape! In this interactive session, participants will dive into the world of local climate action, discussing everything from water and energy to mobility and waste. Through lively group activities and role-playing, you will reflect on what makes these systems thrive, identify vulnerabilities, and brainstorm creative solutions. \n\nTogether, you will design a hands-on action plan for your chosen system, turning challenges into exciting opportunities for community collaboration and a brighter, more sustainable future for the city!\n\nFacilitated by Ujjvala Krishna and Dr Manan Bhan as part of their project Heat in Bangalore at ATREE.\n\nLink for registration: https://forms.gle/PY7BYHBUWLsddXKm6",
    "url": "https://map-india.org/map-events/ward-vision-shape-your-city/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/11/WhatsApp-Image-2024-11-08-at-12.56.34-PM.jpeg"
  }
]