[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "941@map-india.org",
    "name": "Clay Doll-Making with Sunderbans Doll Artists",
    "startDate": "2025-07-05T10:00:00+05:30",
    "endDate": "2025-07-06T13:00:00+05:30",
    "description": "Image Credits: Tram Theatre Trust\n\nDig your hands into clay, and craft your own clay dolls! Come over to MAP, spend time exchanging stories and experiences with professional clay doll artists from the Sunderbans, and learn more about this indigenous craft form.\n\nHandmade dolls, particularly clay doll-making, have a deep relevance in human life. They strengthen connections with the natural and social environment, reinforce relationships, impart values and skills, fire the creative gene, and build a kinship between the mundane, the mythical and the spiritual. This practice is a deeply relaxing and therapeutic process.\n\nExplore this historic craft form in this guided clay-doll making workshop with Dinesh Mondal and Ranajeet Sarkar from Manmathanagar. Generational and first-generation artists here create dolls that depict everything from fierce man-eating creatures of the Sunderbans, everyday lives of their people, to episodes from local folk-legends like Bonbibi and DokkhinRai. Become a part of this rich world, and take home your own Sunderbans clay doll!\n\nPlease note: There are two sessions of this workshop. Please choose the session you want to attend on the registration link at the top of the page. Here are the dates and timings of the sessions:\n\n- Saturday, July 5 (10:00 am - 1:00pm)\n\n- Sunday, July 6 (10:00 am - 1:00pm)",
    "url": "https://map-india.org/map-events/clay-doll-making-with-sunderbans-doll-artists/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/1-15.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "946@map-india.org",
    "name": "Putul Katha",
    "startDate": "2025-07-05T10:00:00+05:30",
    "endDate": "2025-07-13T10:00:00+05:30",
    "description": "Enter a world steeped in tradition, shaped by a craft that dates back thousands of years!\n\nPutul Katha is a special showcase that invites audiences to explore the practice of doll-making in West Bengal and the cultural heritage of this unique art form. While the display mainly highlights one-of-a-kind hand-pressed clay dolls and some other variations, the region has had a rich history of dolls being made from almost every natural material —from seeds, leaves and wood, to metal, glass, fabric, and more. The makers’ of these artefacts were not just limited to individual artists, but included families and even entire villages or communities, each with their own creative expression and heritage.\n\nKnown as putul in Bengali, these dolls not only serve as objects of play, worship and decoration, but also as bearers of stories. They carry their makers’ beliefs, histories, cultural knowledge and reflections of their everyday lives.\n\nJoin us to discover the unique history of these objects and the rich stories they tell.\n\nPutul Katha is accompanied by the following events:\n- Clay Doll-Making with Sunderbans Doll Artists\n- Maati Katha (Earth Stories) – An Object &amp; Material Theatre Performance\n\nThis showcase is based on ongoing research by the Tram Arts Trust on the stories surrounding the doll arts of West Bengal.",
    "url": "https://map-india.org/map-events/putul-katha/",
    "keywords": [
      "MAP",
      "Showcase"
    ],
    "inLanguage": "bn",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-Image-1440-x-810-10.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "943@map-india.org",
    "name": "Tortoise Under the Earth",
    "startDate": "2025-07-06T16:00:00+05:30",
    "endDate": "2025-07-06T17:30:00+05:30",
    "description": "Image Credits: Shishir Jha\n\nIn an uranium mining area of Jharkhand, India, an indigenous couple copes with the loss of their daughter. For them, the land and forest bear witness to their daughter’s memory. With great sensitivity and beauty, the film explores the deeply intertwined connections between indigenous communities and the forest that is their traditional home. Deftly interweaving the vivid colours of their festivals, folk songs, and the sense of community that binds them together, 'Tortoise Under The Earth' is a poetic elegy to a world that is rapidly disappearing, subsumed by unchecked development and displacement.\n\n&nbsp;",
    "url": "https://map-india.org/map-events/tortoise-under-the-earth/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Tortoise Under the Earth"
    },
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-Image-1440-x-810-6.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "MusicEvent",
    "@id": "939@map-india.org",
    "name": "Queer Open Mic",
    "startDate": "2025-07-05T18:00:00+05:30",
    "endDate": "2025-07-05T21:00:00+05:30",
    "description": "Join us for an unforgettable evening celebrating queer expression and resistance at our open mic. Step up to the mic or cheer from the audience as we share stories, music, poetry, comedy, and more. Allies are invited to support from the audience, while performing space and time is reserved for LGBTQIA+ folks.\n\nConnect with new friends, share your stories and be part of a vibrant community.",
    "url": "https://map-india.org/map-events/queer-open-mic/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/1-12.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "940@map-india.org",
    "name": "Sip & Paint- A Queer Mixer",
    "startDate": "2025-07-05T15:30:00+05:30",
    "endDate": "2025-07-05T17:00:00+05:30",
    "description": "Try a fun cocktail, pick up a brush, and let your creativity flow!\n\nIn this special evening of Sip &amp; Paint, come and unwind at our rooftop restaurant where you can catch a gorgeous sunset against the lush greenery of Cubbon Park. Enjoy drinks as you draw inspiration from the MAP collection, unleash your painting prowess, all while you meet new people in a fun and relaxed space.\n\n- All painting materials will be provided .\n\n- Alcoholic beverages are available for those aged 21 and above.\n\n- Please carry ID for age proof.\n\n- One coupon gives you free access to all galleries at MAP on the date of the event, as well as two cocktails at the Cumulus restaurant.\n\nPlease note: This mixer is exclusively for queer folks.",
    "url": "https://map-india.org/map-events/sip-paint-a-queer-mixer/",
    "keywords": [
      "MAP",
      "Sip & Paint"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-Image-1440-x-810-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "945@map-india.org",
    "name": "Spatial Narratives Through Lens",
    "startDate": "2025-07-12T17:00:00+05:30",
    "endDate": "2025-07-12T18:30:00+05:30",
    "description": "Join artist Vivek Mariappan as he shares insights into his photographic practice, in connection to his work As Close As It Gets. The work explores the emotional resonance of built spaces and how environments shape—and are simultaneously shaped by—personal memory. Tracing a journey that began with a residency in Sweden in 2019 and continues in his hometown of Erode, Tamil Nadu, Mariappan uses photography to map, connect, and make sense of place.\n\nIn this talk, he reflects on how his recent work extends and weaves together two earlier projects into an ongoing exploration of space, distance, and belonging.",
    "url": "https://map-india.org/map-events/spatial-narratives-through-lens/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-Image-1440-x-810-8.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "942@map-india.org",
    "name": "Maati Katha (Earth Stories) - An Object & Material Theatre Performance",
    "startDate": "2025-07-05T17:30:00+05:30",
    "endDate": "2025-07-05T19:00:00+05:30",
    "description": "Image Credits: Prajwal Gowda\n\n“400 islands across a watery world scattered!”\n\nA region of extreme ecological and environmental vulnerability, the Sunderbans is a vast forested delta area in West Bengal and Bangladesh where great rivers combine and split, before merging into the Bay of Bengal. In this dangerous and magical land, living is about a fragile balance between land and water, forest and field, domestic and wild, human and human, human and non-human, calm and storm. As each stakes claim, as each encroaches upon the other’s space, how does life manage to thrive?\n\nStories and beliefs form essential anchors for the people of the Sunderbans, with the ‘Bonbibi’ legend looming large in the popular imagination. Bonbibi is said to have come to the ‘Land of the 18 Tides’ to help the people, the tigers, the deer, the crabs, the trees—all beings that cohabit the land. But, only if we agree to the land's terms. And when she looks away, devastation follows! Episodes from this legend, as well as everyday aspects of Sunderbans life, are depicted by the traditional and contemporary doll-makers of Sunderbans.\n\nMaati Katha (Earth Stories) brings these dolls—originally used for worship, child’s play and display—into the theatre for the first time, combining these art and craft traditions with contemporary object and material theatre practices. The play brings alive the Sunderbans through these clay dolls and the shape-shifting ‘maati’ (clay, mud, soil, earth, land), that not only forms the dolls, but also defines the land and grounds the philosophy of the region. In doing so, Maati Katha invites us to celebrate human resilience in the midst of fragility—a resilience that enables diverse communities to hold together through repeated upheavals of natural calamity and human violence. Bonbibi’s philosophy reigns, “You are all connected: the crocodile, the tiger, water, forest, land, all human beings … All!”\n\n&nbsp;",
    "url": "https://map-india.org/map-events/maati-katha-earth-stories-an-object-material-theatre-performance/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/2-14.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "944@map-india.org",
    "name": "From Archive to Activism: Queer & Trans* Cultural Work",
    "startDate": "2025-07-13T17:00:00+05:30",
    "endDate": "2025-07-13T19:00:00+05:30",
    "description": "Image Credits: Sorting through the Queer Legal Collection at Queer Archive for Memory, Reflection, and Activism (QAMRA), Bengaluru. Image courtesy of Marc Ohrem-Leclef (2018).\n\nThis event brings community organisers, academics, and activists together in conversation about how the worlds of queer-and-trans community-building, knowledge production and information dissemination, and progressive social change, intersect. The panelists share a unique connection with QAMRA (Queer Archive for Memory, Reflection, and Activism), an autonomous community archive at the National Law School of India University in Bengaluru. Through their lightning talks and a moderated roundtable, they will reflect on the past, present, and future of queer and trans* cultural organising, involving distinct forms of resistance and joy.\n\n*(*) In Trans acknowledges the diversity of gender identities and expressions beyond the binary, reflecting the inclusive scope of this conversation.",
    "url": "https://map-india.org/map-events/from-archive-to-activism-queer-trans-cultural-work/",
    "keywords": [
      "MAP",
      "Panel Discussion"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-Image-1440-x-810-7.png"
  }
]