[
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "587@map-india.org",
    "name": "27 Down",
    "startDate": "2024-10-26T17:30:00+05:30",
    "endDate": "2024-10-26T20:00:00+05:30",
    "description": "This weekend, travel back to the seventies and enjoy Awtar Krishna Kaul’s 27 Down, a 1974 drama based on the Hindi novel Athara Sooraj Ke Paudhe. The film is centred around Sanjay, a railway employee who is battling between his duty towards his authoritarian father and his desire for freedom. 27 Down is popular for its unique cinematography, themes of societal expectations, pursuit of dreams and self-discovery.\n\nThis film screening is the second in our six-month long series, ‘The Radical Seventies’, a collaboration between MAP and Bangalore Film Forum, co-curated by Ashish Rajadhyaksha. \n\nThis series has been conceptualised as part of MAP’s youth engagement programming.\n\nThe Radical Seventies is a series that is specially crafted for youth to engage with older classics that resonate with our contemporary times, in familiar and unexpected ways. Through the 1970s, Indian cinema saw several major experiments in cinema — often made in direct conversation with radical politics. The decade began in the late 1960s and spilled over into the early 1980s. With 27 Down, we embark on another chapter of this journey, exploring questions around evolving identities, migration, and the push and pull between independence, empowering anonymity and the loneliness of the urban experience.",
    "url": "https://map-india.org/map-events/27-down/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "hi",
    "workPresented": {
      "@type": "Movie",
      "name": "27 Down"
    },
    "image": "https://map-india.org/wp-content/uploads/2023/01/500-x-400-px-Widget-5.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "586@map-india.org",
    "name": "Memory Keepers and Future Seekers",
    "startDate": "2024-10-19T17:30:00+05:30",
    "endDate": "2024-10-19T19:00:00+05:30",
    "description": "Attend the book launch of 'Memory Keepers and Future Seekers' by Ulka Chauhan and Samira Sheth. \n\nFeaturing six heritage homes, this book explores themes of architecture, culture, heritage, anthropology, identity and belonging. It features photographs by Chauhan and text by Sheth and includes visual and literary portraits of Goa’s 300+ year old heritage homes, attempting to present their untold stories through a series of in-depth interviews with the home owners. A layered narrative, the book brings to light the stories of families and their fragments of memories while touching upon the historical, cultural, political, social and religious moments that shaped Goa. \n\nIn conversation with architect Robert Stephens, the two authors discuss their process, insights from their experience of putting this book together, and the relevance of looking at heritage through multiple lenses; as much personal, as historical and monumental.",
    "url": "https://map-india.org/map-events/book-launch-memory-keepers-and-future-seekers/",
    "keywords": [
      "Book Launch",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/09/Low-file-size.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "585@map-india.org",
    "name": "Guided Walk of Outside In (Kannada)",
    "startDate": "2024-10-15T15:30:00+05:30",
    "endDate": "2024-10-15T16:30:00+05:30",
    "description": "The exhibition, Outside In: Meera Mukherjee and Jaidev Baghel, explores how these two artists pushed the boundaries of metal casting. Foregrounding their sculptures and the metal casting technique of Bastar Dhokra, this exhibition highlights an important moment in the history of modern art in India.\n\nJoin Rajesh K from the MAP team, as he takes you through the exhibition, detailing the labour-intensive process of metal casting and exploring how community-building was part of their practices.\n\nThis walkthrough will be conducted in Kannada",
    "url": "https://map-india.org/map-events/walkthrough-outside-in-kannada/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2024/10/WhatsApp-Image-2024-10-07-at-4.57.23-PM.jpeg"
  }
]