[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "532@map-india.org",
    "name": "How Do I Tell You?",
    "startDate": "2024-07-27T11:00:00+05:30",
    "endDate": "2024-07-27T14:00:00+05:30",
    "description": "Step into a fascinating world of stories and join us for an engaging workshop, “How do I tell you?”  This skill-building session explores the intricate relationship between words and visuals. \n\nFacilitated by Vasudev M Nair, explore the art of storytelling by learning to express your emotions, ideas, and experiences through illustrative narrative.\n\nLearn about artists and illustrators in this field, innovative formats and craft your own unique stories to share with others. Don't miss out on this opportunity to capture special moments and weave them into captivating narratives.",
    "url": "https://map-india.org/map-events/how-do-i-tell-you/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/07/Untitled-design-16.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "531@map-india.org",
    "name": "Give Me a Message, I will Write it for You",
    "startDate": "2024-07-27T12:00:00+05:30",
    "endDate": "2024-07-27T17:30:00+05:30",
    "description": "Do you want to explore the duality of newness that comes from going back to something old?\n\nReplaced largely by technology, paper has become as if something from times past. In this drop in, live performance session, you can walk in and participate with artist Smitha Cariappa to create an experience for yourself. \n\nThe artist will be seated partially blindfolded at the gallery, waiting for visitors to come and relay a message. She will then write it down on a postcard or paper which she will then hand over to you. Through her performance, the artist in tandem with visitors will attempt to reflect on socio-cultural gaps and misconceptions.\n\n",
    "url": "https://map-india.org/map-events/give-me-a-message-i-will-write-it-for-you/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/07/Smitha-Performance.jpg"
  }
]