[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "856@map-india.org",
    "name": "Scrappy Puppet Tales - Summer at MAP",
    "startDate": "2025-05-19T11:00:00+05:30",
    "endDate": "2025-05-24T16:00:00+05:30",
    "description": "Summer holidays are here, and are the kids already chanting \"I'm bored?\"! Get them over to MAP for an exciting summer camp filled with art, learning and group activities facilitated by professional artists. Give your kids a summer to remember at the museum.\n\nGet ready for some fun storytelling! In the Scrappy Puppet Tales workshop, kids will become puppet creators using all sorts of cool scrap and junk. It's a hands-on adventure where imagination takes center stage. Guided by renowned actress  and puppeteer Padmavati Rao, children will bring their wacky puppet characters to life. The grand finale? A showcase where each young artist gets to present their puppet creations!\n\nAge group- 9-12 year olds. Registration fees is ₹1000. Number of participants are limited so please register to confirm your spot.",
    "url": "https://map-india.org/map-events/scrappy-puppet-tales-summer-at-map/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-2025-04-26T144806.943.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "868@map-india.org",
    "name": "Training Course in Conservation of Photographs in Museums, Archives, and Collections",
    "startDate": "2025-06-16T09:00:00+05:30",
    "endDate": "2025-09-13T17:30:00+05:30",
    "description": "Don’t let history disappear–or discolour–or fade! Discover the science of photography conservation and learn the art of restoring historic photograph collections. This hands-on, intensive training course is designed for practising conservators, archivists and custodians of historic photograph collections to learn preventive collection care measures, remedial conservation processes, and restoration techniques.\n\nThis three month course will be followed by a one month internship. The course will be instructed by leading specialists from India and overseas and includes topics such as: \n\n -Development, materials and techniques of historic photographic processes\n\n -Identification and understanding of deterioration processes in photograph collections\n\n -Inspection and survey methodologies\n\n -Condition report preparation and preservation prioritisation decisions\n\n -Emergency treatment measures\n\n -Conservation of film and glass plate negatives\n\n -Conservation and restoration of photographs\n\n -Archival protocols of housing, display, and storage of photographic materials\n\n -Disaster management\n\nLast day to apply: 25th May, 2025\n\nApply for this programme and we will let you know if you are selected by 31st May, 2025.",
    "url": "https://map-india.org/map-events/training-course-in-conservation-of-photographs-in-museums-archives-and-collections/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-12T161452.615.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "862@map-india.org",
    "name": "Tuesday Tidbits",
    "startDate": "2025-05-20T17:00:00+05:30",
    "endDate": "2025-05-20T17:30:00+05:30",
    "description": "Why is a sketch of a mother and child titled Wounds? Why is Venus segmented, and surrounded by an odd assortment of things? Find out the answers to these questions and more, at the upcoming Tuesday Tidbits led by Aayati Sengupta, the content and community coordinator from the MAP Marketing and Communications team.\n\nTuesday Tidbits is a series that explores different aspects of working in a museum through the lens of our team members. Join us for these free, insightful, and short sessions on life in a museum. \n\nThis is part of our series that seeks to support youth in career research/building and acts as a space for networking for young people.",
    "url": "https://map-india.org/map-events/tuesday-tidbits-11/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/12/textile-website-banner-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "874@map-india.org",
    "name": "Hariva Nadige Maiyella Kaalu | ಹರಿವ ನದಿಗೆ ಮೈಯೆಲ್ಲಾ ಕಾಲು",
    "startDate": "2025-05-30T18:00:00+05:30",
    "endDate": "2025-05-30T20:00:00+05:30",
    "description": "What stories do footsteps tell? \n\nSpend your Friday evening unwinding with a Kannada film screening, followed by a discussion with the filmmaker Babu Eshwar Prasad. Inspired by 12th century Kannada poet Allama Prabhu’s vachana, the title ‘Hariva Nadige Maiyella Kaalu’ (A Running River is all Legs) encapsulates the theme of this film which focuses on the idea of motion and walking. The film follows three characters: Kumar, a photojournalist disenchanted with his regular job, who visits different places seeking new sources of inspiration; Neelu, a salesgirl in a shoe shop with a set routine, is only interested in watching people walk; and Amaresha, an elderly prisoner, who alleviates his feelings of confinement by walking to imagined places within his cell. \n\nThe camera follows the gaze of the characters, trained to different directions, in some cases the ground and in others the sky, experiencing how they relate to the world around them, the minute details they observe, and their sense of time and place. Moving between dream and reality, the film is an exploration of the inner and outer landscapes they encounter.",
    "url": "https://map-india.org/map-events/hariva-nadige-maiyella-kaalu-%e0%b2%b9%e0%b2%b0%e0%b2%bf%e0%b2%b5-%e0%b2%a8%e0%b2%a6%e0%b2%bf%e0%b2%97%e0%b3%86-%e0%b2%ae%e0%b3%88%e0%b2%af%e0%b3%86%e0%b2%b2%e0%b3%8d%e0%b2%b2%e0%b2%be-%e0%b2%95/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "kn",
    "workPresented": {
      "@type": "Movie",
      "name": "Hariva Nadige Maiyella Kaalu | ಹರಿವ ನದಿಗೆ ಮೈಯೆಲ್ಲಾ ಕಾಲು"
    },
    "image": "https://map-india.org/wp-content/uploads/2021/01/1440-X-810-Widget-04.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "857@map-india.org",
    "name": "Chittara Art",
    "startDate": "2025-05-24T14:00:00+05:30",
    "endDate": "2025-05-24T17:00:00+05:30",
    "description": "Did you know that chittara in Kannada translates to picture or design? This folk art has geometrical designs featuring everyday life, and is native to the Deevaru community in the Sagar district of Karnataka. Chittara folk art is practiced primarily by the women of the community. They use eco-friendly materials like ground rice paste for white colour, charred rice for black, powdered gurige seeds (Strobilanthes kunthiana) for yellow, and soil/earth for red. \n\nLearn more about this artform and create your own chittara inspired collage on handmade, recycled paper.\n\nThis event will be followed by a book launch.\n\nPhoto credits: CFRIA",
    "url": "https://map-india.org/map-events/chittara-art/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-2025-04-29T171056.075.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "860@map-india.org",
    "name": "Up, Close & Centre",
    "startDate": "2025-05-27T17:00:00+05:30",
    "endDate": "2025-05-27T17:30:00+05:30",
    "description": "In this session of Up, Close &amp; Centre, Arnika Ahldag (Director - Curation &amp; Exhibition at MAP) will elaborate on an artwork from MAP’s latest exhibition, Vaanyerum Vizhuthugal: Roots that Reach for the Sky.\n\nInitially exhibited as part of the Chennai Photo Biennale 2024-2025, for MAP this is the first ever group exhibition dedicated to contemporary photography and lens-based practices. Curated by Jaisingh Nageswaran, Vaanyerum Vizhuthugal (translating to “Roots that Reach for the Sky”) brings together the works of twelve lens-based artists of Tamil origin who push the boundaries of photography and visual storytelling.\n\nThis is a drop-in session. There is no registration required.",
    "url": "https://map-india.org/map-events/up-close-centre-13/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-02T122341.078.png"
  }
]