[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1022@map-india.org",
    "name": "Who Has Got Your Back?",
    "startDate": "2025-10-12T16:00:00+05:30",
    "endDate": "2025-10-12T18:00:00+05:30",
    "description": "Step into the enchanting world of mythical beings with this special trivia session inspired by our exhibition 'In Celestial Company'. Discover the fascinating stories behind divine companions like Garuda, Mooshika, Airavata, and the many other fantastical creatures that journey alongside gods and goddesses.\n\nThis isn't your typical trivia night. The questions are designed to be accessible and engaging, with clues and hints that help you piece together the answers. You don't need to be a mythology scholar—just bring your curiosity and a problem-solving spirit!\n\nThis event is part of the Family Day.",
    "url": "https://map-india.org/map-events/who-has-got-your-back/",
    "keywords": [
      "CBD",
      "MAP",
      "Quiz"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1034@map-india.org",
    "name": "Sign Language 101",
    "startDate": "2025-10-12T11:00:00+05:30",
    "endDate": "2025-10-12T12:00:00+05:30",
    "description": "Learn a new language with your family! \n\nJoin our Indian Sign Language session for beginners hosted by Madhur Arora from the MAP team. Learn words in sign language related to family, art, culture and more. Connect with the deaf community, learn to communicate beyond words, and pick up a valuable skill.\n\nThis event is part of the Family Day.",
    "url": "https://map-india.org/map-events/sign-language-101/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/IMG_5516-scaled-e1759125344774.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1046@map-india.org",
    "name": "Up, Close and Center",
    "startDate": "2025-10-14T17:00:00+05:30",
    "endDate": "2025-10-14T17:30:00+05:30",
    "description": "Get a sneak peek into understanding the processes involved in conserving artworks. This edition of Up, Close and Centre helps you delve deeper into the context, narratives and makings of an artwork from the exhibition In Celestial Company, chosen by Nayanamrutha T S from the MAP Team. \n\nMAP is home to a growing collection of over 100,000 artworks. Up, Close &amp; Centre is a series that  allows audiences to engage with art in deeper and more meaningful ways by delving into the context, narratives and makings of one artwork from our collection, chosen by our team members.",
    "url": "https://map-india.org/map-events/up-close-and-center/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/ICC_Curator-Led-Guided-Walk_140925-18_web-e1759813151188.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1037@map-india.org",
    "name": "The Great Tikat Hunt",
    "startDate": "2025-10-12T11:00:00+05:30",
    "endDate": "2025-10-12T16:00:00+05:30",
    "description": "Unleash your inner detective as you embark on a thrilling quest to find hidden clues scattered throughout the exhibition Ticket Tika Chaap. These intricately designed labels carry stories within them. This is your chance to decode its narrative. The more clues you find, the closer you get to victory. Are you ready to take on the challenge? Let the hunt begin!\n\nThis event is part of the Family Day.",
    "url": "https://map-india.org/map-events/the-great-tikat-hunt-2/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/CopyofDSC04091.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1043@map-india.org",
    "name": "Pause & Play",
    "startDate": "2025-10-12T11:00:00+05:30",
    "endDate": "2025-10-12T16:00:00+05:30",
    "description": "Pause and Play - a family activity zone to slow down, make, and share time together. Hop between stations for colouring, crafting clay creatures, folding origami friends, or playing games. Stay for ten minutes or a few hours, and take home a keepsake from your day!\n\nThis event is a part of the Family Day.",
    "url": "https://map-india.org/map-events/pause-play/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/DSC09616-1-e1759140580446.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1039@map-india.org",
    "name": "Drum Jam",
    "startDate": "2025-10-12T14:00:00+05:30",
    "endDate": "2025-10-12T15:00:00+05:30",
    "description": "Drum up some excitement! Join us for a high-energy Drum Jam session, specially designed for kids aged 10-15. Let loose, make some noise, and groove to the rhythm with fellow young music enthusiasts.  This promises to be a fun-filled experience that will keep your energy pumping and your spirits high. Come drum, dance, and make some unforgettable memories! This event is in collaboration with Beats Guru.\n\nThis event is part of the Family Day.",
    "url": "https://map-india.org/map-events/drum-jam/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/WhatsApp-Image-2025-10-06-at-17.08.53_b8fb8b4a.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1036@map-india.org",
    "name": "Material Matters",
    "startDate": "2025-10-12T15:00:00+05:30",
    "endDate": "2025-10-12T16:00:00+05:30",
    "description": "Come experience an exciting walkthrough of our  exhibition VISIBLE/INVISIBLE where we highlight the many different materials used by artists to bring their artistic vision to life! This session will be followed by a workshop where participants are encouraged to play with a range of materials to create artworks in response to the ones they have seen in the exhibition.\n\nThis event is a part of Family Day.",
    "url": "https://map-india.org/map-events/material-matters/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Material-Matters.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1040@map-india.org",
    "name": "From Fable to Folk",
    "startDate": "2025-10-12T14:00:00+05:30",
    "endDate": "2025-10-12T16:00:00+05:30",
    "description": "Explore a realm of cunning creatures, heroic stories, and fantastical experiences! In this fun and creative workshop, we’ll explore Indian folk stories from the Panchatantra, Jataka Tales, Folktales from India, and more. \n\nWe will act, dance, imagine, and even rewrite them in addition to simply reading them! You'll transform classic stories into brand-new productions by using role-playing, theater activities, and imaginative storytelling. Prepare to think, laugh, and view these old tales in a completely different light. Who knows what you'll discover?\n\nThis event is part of the Family Day.",
    "url": "https://map-india.org/map-events/from-fable-to-folk/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/PTG.0866-e1759139262758.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1017@map-india.org",
    "name": "In & Out of the Frame",
    "startDate": "2025-10-07T17:00:00+05:30",
    "endDate": "2025-10-07T18:00:00+05:30",
    "description": "Join us for a walkthrough of our permanent exhibition with Senior Archivist from the Archives at NCBS, Anjali Ramachandran.\n\nWhen we encounter artworks at a museum, we make meaning either through the work itself, its setting, or through labels that accompany them. Another way to read an artwork is to look for what's not in the 'frame'—to explore the circumstances of its creation and the use of the artwork, rather than just the artwork itself.\n\nIn this guided walk, you will get to explore our permanent exhibition, VISIBLE/INVISIBLE: Representation of Women through the MAP Collection, through the lens of an archivist. We will discuss the maker, the purpose, a specific object's relation to others, and the broader social and historical environment in which the artworks were created. In archival sciences, this is called contextualisation, where archivists understand records through the varied ways in which memories (remembered or in recorded acts) have been transmitted over time and space with numerous inscriptions, transmissions, and omissions.\n\nAlthough it sounds technical, the process itself can be disruptive and playful. It involves gossip, peeking behind the curtain, and an understanding of the complex process of making art!",
    "url": "https://map-india.org/map-events/in-out-of-the-frame/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "1042@map-india.org",
    "name": "Chippi the Chipkali",
    "startDate": "2025-10-12T18:30:00+05:30",
    "endDate": "2025-10-12T19:30:00+05:30",
    "description": "One day, Chippi the baby lizard is shooed away while playing. People think it is scary and ugly. Shocked by this, Chippi loses her tail and everyone starts teasing her by calling her names, as she is now without a tail. She feels very sorry for herself and goes  into a dark corner, crying. She knows that she has to get a tail. So what does she do to get her tail? Will she ever get her tail back? Will she become beautiful again? Find out the rest of Chippi’s story and join us for this performance by Ranga Shankara AHA!\n\nThis event is part of the Family Day.",
    "url": "https://map-india.org/map-events/chippi-the-chipkali/",
    "keywords": [
      "CBD",
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Chippi-the-Chipkali-4-scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1038@map-india.org",
    "name": "Scavenger Hunt",
    "startDate": "2025-10-12T11:00:00+05:30",
    "endDate": "2025-10-12T16:00:00+05:30",
    "description": "Turn the museum into your playground with our lively scavenger hunt! Perfect for all ages, this adventure will lead you through galleries and hidden corners using fun  clues and challenges. Solve riddles, spot details, and uncover secrets behind artworks as you race to the finish.\n\nThis event is part of the Family Day.",
    "url": "https://map-india.org/map-events/scavenger-hunt/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Screenshot-2025-09-29-150134.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1051@map-india.org",
    "name": "NeuroQueer Brainbox",
    "startDate": "2025-10-18T15:00:00+05:30",
    "endDate": "2025-10-18T17:00:00+05:30",
    "description": "A warm invitation to all neurodivergent and queer Folks!\nJoin us for the 4th edition of NeuroQueer Brain Box facilitated by Mani Agarwal, a NeuroQueer therapist. This session will celebrate the diversity and stories of our bodies. Together, we will explore how our bodies are integral to our identities.\nWe’ll begin with a guided walk of the exhibition, VISIBLE/INVISIBLE:Representation of Women in Art through the MAP Collection, through a queer lens. As you move through the space, reflect on some words that come up for you; let them resonate with you, and bring them into our group space. Together, through shared reflections and queer perspectives on our bodies, we’ll map our feelings with art. This will be a space to celebrate neuroqueer creativity and build a sense of community, where we spend time with our own bodies to feel seen and affirmed. \nPlease note: This is a free session exclusively for individuals who identify as LGBTQIA+ or are individuals with ADHD/Autism/AuDHD.",
    "url": "https://map-india.org/map-events/neuroqueer-brainbox-3/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/DSC00669-scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1047@map-india.org",
    "name": "Family Day at MAP",
    "startDate": "2025-10-12T11:00:00+05:30",
    "endDate": "2025-10-12T19:30:00+05:30",
    "description": "They say it takes a village to raise a child. This October, we’re calling that village made up of all the parents, maamas and atthes, daadas and daadis, mom’s best friend and dad’s anna to come over to MAP and celebrate. Bring your children, nieces and nephews, grandkids and godchildren for a fun-filled day of exploration, games, and stories!\n\nFrom exciting quizzes and treasure hunts, to playful walkthroughs of our exhibitions, the day is packed with activities designed especially for children. Pause at special stations to listen, play, and discover together. Wrap up the experience with a delightful theatre performance for young audiences. We’ve got the whole day sorted—all you need is a child (or a few!) to join in. The more, the merrier!\n\nNote: Booking on this page will provide you with a Family Day Pass that gives you access to all the exhibitions and digital experiences. Certain events require separate registrations (see below) as they have limited seats. Please ensure you register for those by clicking the links below.\nFamily Day Events\n\n- Pause &amp; Play\n- Bangalore Storytellers\n- Scavenger Hunt\n- The Great Tikat Hunt\n- Sign Language 101 - Requires Registration\n- Roots and Wings – A LooRoo Morning at MAP Learn with LooRoo - Requires Registration\n- Drum Jam - Requires Registration\n- From Fable to Folk - Requires Registration\n- Wheel of Feelings - Requires Registration\n- Material Matters - Requires Registration\n- Who Has Got Your Back?- Requires Registration\n- Chippi the Chipkali - Requires Registration\n\nCreate core childhood memories this festive season and celebrate with your village at MAP.",
    "url": "https://map-india.org/map-events/family-day-at-map-2/",
    "keywords": [
      "CBD",
      "Kids & Family",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/1440x810-2-1-scaled.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1035@map-india.org",
    "name": "Wheel of Feelings",
    "startDate": "2025-10-12T15:00:00+05:30",
    "endDate": "2025-10-12T16:00:00+05:30",
    "description": "Ever wondered what Blue feels, or Red might say? Step into a world where art meets emotions, and allow colours to tell you their stories. \n\nJoin us for an engaging event where participants will be gently guided by a set of prompts and introduced to the book When The Crayons Quit, allowing them to personally connect with different colours using emotions. This will be followed by a guided walk of MAP’s ongoing exhibition Shape of a Thought: Letters from Ram Kumar to seek inspirations from the use of colours in the artworks on display, before creating an artwork of their own!\n\nThis event is a part of Family Day.",
    "url": "https://map-india.org/map-events/wheel-of-feelings/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/DSC09453-1-e1759128755566.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1044@map-india.org",
    "name": "Roots and Wings - A LooRoo Morning at MAP",
    "startDate": "2025-10-12T11:30:00+05:30",
    "endDate": "2025-10-12T12:30:00+05:30",
    "description": "Some stories glimmer softly at the edges - of winged messengers, moonlit rivers, and gentle guardians who once walked beside the gods. We found them waiting at MAP’s In Celestial Company, and felt quietly drawn into their world of myth and wonder.\n\nThis Family Day at MAP, The LooRoo Club invites you to step into that world, where art meets story and imagination grows through nature’s touch. Together, we’ll listen, create, and dream among celestial beings and timeless legends.\n\nThere will be colours to play with, stories to unfold, and a little magic waiting to be found.\n\nSome things are best discovered slowly, and this morning will be one of them.\n\nThis event is part of Family Day.",
    "url": "https://map-india.org/map-events/roots-and-wings-a-looroo-morning-at-map/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/IMG_0155-scaled-e1759208360969.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "1013@map-india.org",
    "name": "Norma Rae (1979)",
    "startDate": "2025-10-11T16:00:00+05:30",
    "endDate": "2025-10-11T18:00:00+05:30",
    "description": "Norma Rae©️1979 Twentieth Century Fox Film Corporation. All Rights Reserved.\n\nIn collaboration with Bangalore Film Forum (BFF), MAP is excited to announce the screening of Norma Rae directed by Martin Ritt. Based on the true story of a textile worker who becomes involved in union organizing in the American South, Norma Rae is an iconic film about labour struggles. It sheds light on the harsh working conditions of mill workers and the personal cost of organizing. \n\nFollowing the screening, join us for a walkthrough of the exhibition Ticket, Tika, Chaap, which offers a deep dive into the often-overlooked world of textile labels in MAP’s collection.\n\nInspired by the themes of Norma Rae, we will reflect on the labour, craft, and histories embedded in these small yet powerful objects.",
    "url": "https://map-india.org/map-events/norma-rae-1979/",
    "keywords": [
      "CBD",
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Norma Rae (1979)"
    },
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-Image-1440-x-810-21-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1041@map-india.org",
    "name": "Story Corner",
    "startDate": "2025-10-12T11:30:00+05:30",
    "endDate": "2025-10-12T17:00:00+05:30",
    "description": "In collaboration with the Bangalore Storytelling Society, this event is an immersive storytelling experience. Join us to meet the storytellers, dressed in character, as they regale you with stories inspired by our artworks. Don't miss this unique opportunity to bond with your loved ones and get lost in the world of storytelling!\n\nThis is a drop-in session. Registration is not required.\n\nThis event is part of the Family Day.",
    "url": "https://map-india.org/map-events/bangalore-storytellers/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/PXL_20250831_1154347932-scaled-e1759139657100.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1049@map-india.org",
    "name": "Between Word and Image: Reading Ram Kumar",
    "startDate": "2025-10-11T17:00:00+05:30",
    "endDate": "2025-10-11T18:00:00+05:30",
    "description": "This lecture examines the literary and artistic oeuvre of Ram Kumar, one of India’s foremost modernist voices, through an interdisciplinary lens that foregrounds his fiction and correspondence. Focusing primarily on his novels and letters, the presentation traces themes of existential solitude, urban alienation, and moral ambiguity that permeate his prose, revealing a deeply introspective engagement with post-independence India. His letters—especially those displaced at MAP—offer rare insights into his philosophical temperament and creative process. These textual reflections are then juxtaposed with his abstract paintings, not as separate expressions but as silent extensions of the same emotional and intellectual terrain. \n\nBy connecting word and image, the lecture proposes a unified reading of Ram Kumar’s work as a sustained meditation on silence, memory, and the search for meaning.\n\nThis programme is conjunction with Shape of a Thought: Letters from Ram Kumar",
    "url": "https://map-india.org/map-events/between-word-and-image-reading-ram-kumar-2/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/10/MAP_SOT-113-min-scaled.jpg"
  }
]