[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "868@map-india.org",
    "name": "Training Course in Conservation of Photographs in Museums, Archives, and Collections",
    "startDate": "2025-06-16T09:00:00+05:30",
    "endDate": "2025-09-13T17:30:00+05:30",
    "description": "Don’t let history disappear–or discolour–or fade! Discover the science of photography conservation and learn the art of restoring historic photograph collections. This hands-on, intensive training course is designed for practising conservators, archivists and custodians of historic photograph collections to learn preventive collection care measures, remedial conservation processes, and restoration techniques.\n\nThis three month course will be followed by a one month internship. The course will be instructed by leading specialists from India and overseas and includes topics such as: \n\n -Development, materials and techniques of historic photographic processes\n\n -Identification and understanding of deterioration processes in photograph collections\n\n -Inspection and survey methodologies\n\n -Condition report preparation and preservation prioritisation decisions\n\n -Emergency treatment measures\n\n -Conservation of film and glass plate negatives\n\n -Conservation and restoration of photographs\n\n -Archival protocols of housing, display, and storage of photographic materials\n\n -Disaster management",
    "url": "https://map-india.org/map-events/training-course-in-conservation-of-photographs-in-museums-archives-and-collections/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/05/Website-cover-images-new-2025-05-12T161452.615.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "881@map-india.org",
    "name": "VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection",
    "startDate": "2025-06-07T13:00:00+05:30",
    "endDate": "2025-06-07T14:00:00+05:30",
    "description": "Join us on a guided walk of the exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection.  Featuring over 130 diverse artworks, this exhibition redefines the portrayal of women in art through sculptures, textiles, paintings, and photographs. that challenge traditional notions of femininity and gender as social constructs.  \n\nDivided into four sections—Goddess and Mortal, Sexuality and Desire, Power and Violence, Struggle and Resistance—the exhibition highlights themes of sacrifice, desire, aggression, and empowerment.\n\nIn this guided walk, you will have the unique opportunity to engage with groundbreaking perspectives and compelling stories that provoke reflection and dialogue about women’s lives and the spaces they occupy in the Indian subcontinent. Don’t miss this opportunity to explore the intersection of art, gender, and history.\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/visible-invisible-representation-of-women-in-art-through-the-map-collection-24/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/12/VIV-website-banner-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "898@map-india.org",
    "name": "Vaanyerum Vizhuthugal",
    "startDate": "2025-06-08T16:00:00+05:30",
    "endDate": "2025-06-08T17:00:00+05:30",
    "description": "Join us for a guided walk of Vaanyerum Vizhuthugal: Roots that Reach for the Sky. \n\nInitially exhibited as part of the Chennai Photo Biennale 2024-2025, for MAP this is the first ever group exhibition dedicated to contemporary photography and lens-based practices. Vaanyerum Vizhuthugal (translating to “Roots that Reach for the Sky”), curated by Jaisingh Nageswaran, brings together the works of twelve lens-based artists of Tamil origin who push the boundaries of photography and visual storytelling.\n\nThis exhibition is a project by Goethe-Institut Chennai and Chennai Photo Biennale. \n\nThe programming is in collaboration with the Goethe Institute/Max Mueller Bhavan Bangalore.\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/vaanyerum-vizhuthugal-7/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "ta",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-85.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "839@map-india.org",
    "name": "We don’t end at our edges",
    "startDate": "2025-06-08T13:00:00+05:30",
    "endDate": "2025-06-08T14:00:00+05:30",
    "description": "Join us for a guided walk of our exhibition We don’t end at our edges. It is an immersive exhibition featuring artworks by Bengaluru-based artist, writer and educator Ravikumar Kashi. He uses paper to ‘paint’ letters from the Kannada alphabet, transforming language itself into a metaphor for the permeability of human connection, suggesting that while physical forms may fade, the bonds we share as individuals and as a community remain.\n\nJoin this guided walk for a deeper understanding of the exhibition.\n\n&nbsp;",
    "url": "https://map-india.org/map-events/we-dont-end-at-our-edges-7/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/04/Website-cover-images-new-73.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "900@map-india.org",
    "name": "Kavya Sanje - An Evening of Kannada poetry",
    "startDate": "2025-06-14T18:00:00+05:30",
    "endDate": "2025-06-14T19:00:00+05:30",
    "description": "Kavya Sanje (poetry evening) presents an evocative evening of poetry celebrating young voices in Kannada literature. Featuring emerging poets who explore themes of identity, resistance, love, and belonging, this gathering creates a space where language, rhythm, and emotion meet. \n\nPoets of the evening:\n\nChandini, Gowtham Gowda, Dilip Shivagouri, Bharath Savitri Diwakar, Ahaan, Dadapeer Jyman, Rumi Harish, Sowmya A, Uma, Ravi Ranjan, Srinidhi Prahalad\n\nJoin us for an intimate evening of spoken word that resonates with the spirit of the exhibition, We don’t end at our edges—pushing boundaries, reclaiming space, and celebrating expression.",
    "url": "https://map-india.org/map-events/kavya-sanje-an-evening-of-kannada-poetry/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Website-cover-images-new-2025-06-03T124058.742.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "897@map-india.org",
    "name": "Ticket Tika Chaap",
    "startDate": "2025-06-07T16:00:00+05:30",
    "endDate": "2025-06-07T17:00:00+05:30",
    "description": "From dancing elephants and beloved deities to the surprising sight of steamships, textile labels showcased a variety of captivating imagery.\n\nTextile labels arrived in Indian markets in their thousands, stuck on yards upon yards of cotton fabric manufactured in the mills of Britain (and India), and sold in Indian and global markets. They wove desire, memory, and meaning into the act of purchase. \n\nJoin us for a guided walk of our latest exhibition, Ticket Tika Chaap, which explores these textile labels, known as tikats (tickets), tikas or chaaps, and their art-historical and commercial significance, as perhaps the earliest forms of branding and advertisement, in India.\n\nThis guided walk will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/ticket-tika-chaap-13/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/04/3-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "899@map-india.org",
    "name": "World Quizzing Championship",
    "startDate": "2025-06-07T14:00:00+05:30",
    "endDate": "2025-06-07T16:30:00+05:30",
    "description": "Every year the International Quizzing Association (IQA) search for who will be crowned the World Quizzing Champion!\nRun at venues all over the world with thousands of global participants, come over to MAP for the Bengaluru edition! This  240-question quiz for individuals event is open to everyone and, by taking part in a live event, you can earn Quiz Rankings Points. Join us to earn a chance at being the World Quizzing Champion!\n\nRegistration fee: ₹300/participant to be paid online (G Pay/ Phone Pe/ Pay Tm/ Account transfer)\n\nGPay number - +91 9495258436 or UPI- 9495258436@ybl\n\nThe proctor is Mahendra Balu +91 9495258436 -- send screenshot of payment to him for registration confirmation, and also contact for any queries.\n\nPlease note: The deadline for registration is 5:00 PM on June 6 - no on-the-spot registrations will be accepted.",
    "url": "https://map-india.org/map-events/world-quizzing-championship/",
    "keywords": [
      "MAP",
      "Quiz"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/06/Untitled-design-20.png"
  }
]