[
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "706@map-india.org",
    "name": "Dastangoi on Arabian Nights by Kafeel Jafri",
    "startDate": "2025-02-12T18:30:00+05:30",
    "endDate": "2025-02-12T19:45:00+05:30",
    "description": "Dastan-e-Alif Layla is a performance based on the tales from Arabian Nights, adapted into Dastangoi form by Kafeel Jafri. In Dastangoi form, the epic tale of “Tilism-e- Hoshruba” has been told traditionally. This is Kafeel’s first attempt at telling the story of Arabian Nights in Dastangoi medium. The performance consists of a mix of storytelling and poetry. This Urdu performance has been curated for the Arabian Nights in the Sasken Multimedia Gallery.",
    "url": "https://map-india.org/map-events/dastangoi-by-kafeel-jafri/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "ur",
    "image": "https://map-india.org/wp-content/uploads/2025/01/Website-cover-images-new-6.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "718@map-india.org",
    "name": "Colcha Conversations",
    "startDate": "2025-02-13T17:00:00+05:30",
    "endDate": "2025-02-13T18:00:00+05:30",
    "description": "Join us for a delightful talk that unravels the enchanting world of ‘Colchas,’ exquisite embroidered textiles from the MAP collection! Colchas are decorative textiles, often characterized by elaborate embroidery or stitching, that originated in Portugal and were later embraced and transformed in Latin America. The term \"colcha\" translates to \"bedspread\" or \"coverlet,\" and these textiles were traditionally used as bed coverings or wall hangings. \n\nGuided by textile collector Jeevak Parpia, this session promises to take you on a journey through the intricate visual storytelling that defines these extraordinary artifacts. Discover the unique motifs woven into each ‘colcha’, and their deep cultural and historical resonance. \n\nWith his wealth of expertise, Mr. Parpia will talk on the artistic traditions and cross-cultural exchanges that shaped these textiles, tracing their roots from Portugal to Latin America, how colchas became a canvas for storytelling, reflecting the lives, beliefs, and aspirations of their makers.",
    "url": "https://map-india.org/map-events/colcha-conversations/",
    "keywords": [
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/Website-cover-images-new-9.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "731@map-india.org",
    "name": "The Forgotten Souvenir",
    "startDate": "2025-02-11T15:30:00+05:30",
    "endDate": "2025-02-11T16:30:00+05:30",
    "description": "Explore MAP's exhibition, The Forgotten Souvenir, through a guided walk and discover how  the art of mica paintings, created during the East India Company’s heyday. These paintings, both art and historical documents, showcase professions, societal roles, and colonial India's rigid caste and class systems and thus, offer unique insights into everyday life under colonial rule.  \n\nThese delicate works, painted on thin sheets of muscovite mica from Murshidabad, Patna, and Trichinopoly, reflect the adaptation of Indian artists as royal patronage declined. They served as easily portable, attractive souvenirs for British travellers, bridging the gap between traditional miniature painting and the rise of photography.  \n\nAccompanied by Amit Dutta’s short film Moments before Mutiny and an interactive game, this guided walk invites you to journey deeper into this nearly forgotten chapter of Indian art.\n\nThis guided walk will be conducted in Kannada by Rajesh K from the MAP Team.",
    "url": "https://map-india.org/map-events/the-forgotten-souvenir-11/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2025/01/forgotten-souvenir-website-banner-.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "698@map-india.org",
    "name": "Architectural Photography with Maniyarasan Rajendran",
    "startDate": "2025-02-08T11:00:00+05:30",
    "endDate": "2025-02-09T17:00:00+05:30",
    "description": "Discover the art of capturing architecture in this two-day workshop on architectural photography with Maniyarasan Rajendran. Explore the history and significance of the medium while learning essential techniques, including the use of cameras, lenses, lighting, and perspective correction.\n\nThe workshop focuses on compositional principles such as framing, symmetry, and scale through hands-on demonstrations. Gain insight into how photography communicates architectural ideas and cultural heritage, along with an overview of current trends in the field. Open to enthusiasts, beginners, and mid-level photographers, this workshop is designed to inspire and equip anyone with an interest in architecture and photography—no prior experience required.\n\nNote: Feel free to bring along your camera if you have one.\n\nIn case you require accessibility support, please write to access@map-india.org. MAP offers ISL support, hearing loops, and other accessible facilities. Kindly refer to the features mentioned here accordingly. ",
    "url": "https://map-india.org/map-events/architectural-photography-with-maniyarasan-rajendran/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "729@map-india.org",
    "name": "Lords of Earth and Sea – A History of the Chola Empire",
    "startDate": "2025-02-09T18:00:00+05:30",
    "endDate": "2025-02-09T19:00:00+05:30",
    "description": "Join us for a the book launch of historian Anirudh Kanisetti's latest book, Lords of Earth and Sea which explores the fascinating history of the Chola Empire.\n\nEmerging from the Kaveri floodplains in the 9th century CE, the Chola dynasty became a dominant force in South India and beyond. Known for their architectural achievements, such as grand temples, their maritime influence, and cultural contributions, the Cholas left a lasting legacy on India and the wider region.\n\nKanisetti’s work brings to light the lives of not only the rulers but also the everyday people who shaped and lived through this era. Using inscriptions and historical records, he separates fact from legend, offering a nuanced view of this influential dynasty.\n\nThis book was made possible through a research grant provided to the author by the MAP Academy. The MAP Academy develops and provides open-access resources on the art and cultural histories of South Asia. Their digital offerings — including an encyclopedia of art, online courses, and several grants and special projects — encourage greater engagement with the region’s visual arts.",
    "url": "https://map-india.org/map-events/lords-of-earth-and-sea-a-history-of-the-chola-empire/",
    "keywords": [
      "Book Launch",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/Website-cover-images-new-15.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "730@map-india.org",
    "name": "Chay Reds, Ferrous Black",
    "startDate": "2025-02-04T15:30:00+05:30",
    "endDate": "2025-02-04T16:30:00+05:30",
    "description": "Step into the rich history of Indian trade textiles in Sri Lanka by joining us on a guided walk of Chay Reds, Ferrous Black, an evocative exhibition at the Museum of Art &amp; Photography. Featuring exquisite Palampores and textile fragments from the 18th century, this collection unravels the ties between the two cultures through vibrant designs that once adorned homes and sacred spaces.  \n\nDiscover how symbols like the pomegranate, elephant, and peacock bridge traditions across India and Sri Lanka, reflecting shared beliefs and evolving local meanings. Hand-painted in striking chay reds and ferrous black, these textiles speak of artistry, craftsmanship, and cultural exchange.  \n\nWhether you're a history enthusiast, a lover of myths, or captivated by textiles, this guided walk invites you to rediscover a shared heritage woven through generations. Don’t miss this unique journey into the artistry and narratives of two interconnected worlds.\n\nThis guided walk will be conducted in Kannada by Rajesh K from the MAP Team.",
    "url": "https://map-india.org/map-events/chay-reds-ferrous-black-12/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "kn",
    "image": "https://map-india.org/wp-content/uploads/2024/12/chay-reds-website-banner-.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "726@map-india.org",
    "name": "Chay Reds, Ferrous Black",
    "startDate": "2025-02-04T16:30:00+05:30",
    "endDate": "2025-02-04T17:30:00+05:30",
    "description": "Step into the rich history of Indian trade textiles in Sri Lanka by joining us on a guided walk of Chay Reds, Ferrous Black, an evocative exhibition at the Museum of Art &amp; Photography. Featuring exquisite Palampores and textile fragments from the 18th century, this collection unravels the ties between the two cultures through vibrant designs that once adorned homes and sacred spaces.  \n\nDiscover how symbols like the pomegranate, elephant, and peacock bridge traditions across India and Sri Lanka, reflecting shared beliefs and evolving local meanings. Hand-painted in striking chay reds and ferrous black, these textiles speak of artistry, craftsmanship, and cultural exchange.  \n\nWhether you're a history enthusiast, a lover of myths, or captivated by textiles, this guided walk invites you to rediscover a shared heritage woven through generations. Don’t miss this unique journey into the artistry and narratives of two interconnected worlds.\n\nThis guided walkthrough will also give you FREE access to the otherwise ticketed exhibition.",
    "url": "https://map-india.org/map-events/chay-reds-ferrous-black-11/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/Website-cover-images-new-13.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "719@map-india.org",
    "name": "Framing the Archive",
    "startDate": "2025-02-15T09:00:00+05:30",
    "endDate": "2025-02-16T17:00:00+05:30",
    "description": "Join us for an essay filmmaking workshop with Falana Films, where they will introduce you to the essay film format and guide you in developing a short film (one to three minutes) while working with an archive.\n\nIn making your essay film, you will have access to a curated set of artworks from the MAP Collection, as well as a resource list of museum and other institutional archives available in the public domain. Additionally, you will be prompted to bring your own archival material–found footage, home videos, family photographs, long-lost audio recordings, and any A/V material you feel is at the cusp of telling a story. You will also be encouraged to film additional footage throughout the workshop.\n\nThis four-day workshop extends across two weekends–February 15–16 &amp; 22–23. Teams of four will be selected based on themes chosen by participants when they register for the workshop. These teams alongside the Falana team will work together to make the film.\n\nThe focus of this workshop is not as much on the technical aspects of filmmaking as it is on the meaning one can make from scattered archives when thematically exploring them. \n\nExpanding on the thematic concerns of MAP’s permanent exhibition, VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection you can find the list of themes for the workshop below:\n\n&nbsp;\n\n- Body as Landscape: Gender Identity, Sexuality and Body-politics\n\n- Home and Away: Memory, Migration and Nostalgia\n\n- No Person’s Land: Cities and Spaces \n\n- ‘Mad or What?’: Mental Health and the City\n\n&nbsp;\n\nRegister soon as seats are limited.\n\nRead this document to find out more about the workshop, FAQs and a tentative schedule.",
    "url": "https://map-india.org/map-events/framing-the-archive/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/Website-cover-images-new-10.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "732@map-india.org",
    "name": "Up, Close & Centre",
    "startDate": "2025-02-21T16:30:00+05:30",
    "endDate": "2025-02-21T17:30:00+05:30",
    "description": "Join us for a session of Up, Close &amp; Centre at our exhibition, The Forgotten Souvenir. \n\nThe mica paintings in this exhibition from Murshidabad, Patna and Trichinopoly (present day Tiruchirapalli) represent a nearly forgotten chapter in Indian art, bridging the gap between the decline of traditional miniature painting and the rise of photography. \n\nShubhasree Purkayastha from the MAP team will be speaking about the Ramlila festival artwork in detail and focusing on the details as well as context within the exhibition.\n\nDon’t miss this unique chance to engage with the exhibition on a more personal level. \n\nThis is a drop-in session. No pre-registration required.",
    "url": "https://map-india.org/map-events/up-close-centre-11/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/forgotten-souvenir-website-banner-1.png"
  }
]