[
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "name": "The World is Family",
    "startDate": "2024-07-06T19:00:00+05:30",
    "endDate": "2024-07-06T21:00:00+05:30",
    "description": "Vasudhaiva Kutumbakam, a Sanskrit phrase meaning “the world is family”, is a universalist idea that competes with dominant, exclusivist Hindu notions of caste. The director of the film, Anand Patwardhan, grew up in a milieu that questioned the latter. The family’s elders had fought for India’s Independence, but had rarely spoken about it. ‘Liberty, Equality, Fraternity’, words enshrined in India’s Constitution, were subconsciously internalised.\n\nAs his parents aged, Anand began to film with whatever equipment was at hand. Soon, birthdays and family gatherings gave way to oral history. Revisiting home movie footage a decade after his parents had passed, was a revelation. Today, supremacist ideology has plagued and altered notions of democracy. As they rewrite India’s history, memories of the past and the lessons they present us with have become more precious than mere personal nostalgia.\n\nJoin us for a screening of this award-winning documentary followed by a Q&amp;A with the filmmaker.\n\nCredits:\n\n- Production, Direction, Editing: Anand Patwardhan\n- Camera and Sound: Anand Patwardhan, Simantini Dhuru\n- Production Assistance: Simantini Dhuru, Mohosin Shaikh",
    "url": "https://map-india.org/map-events/the-world-is-family/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "The World is Family"
    },
    "image": "https://map-india.org/wp-content/uploads/2024/06/World-is-family-web-image.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "name": "Tuesday Tidbits",
    "startDate": "2024-07-02T16:00:00+05:30",
    "endDate": "2024-07-02T18:00:00+05:30",
    "description": "Have you visited your favourite museum and stopped at the museum shop? Maybe to pick up an art postcard or wander through the aisles of publications, souvenirs, etc.? Have you thought about who makes these things and how they come up with these ideas?\n\nJoin us for the next session of Tuesday Tidbits, a series that explores different aspects of working in a museum. This is a free, drop-in session that’s part of the Tuesday Tidbits.\n\nThis week, Shriya Dinesh, part of the Merchandising team at MAP, will share how she takes inspiration from the existing museum collection. The session will be held at Visible/Invisible: Representation of Women in Art through the MAP Collection where Shriya will share how she ideates and comes up with souvenir and collectible ideas that can take art to a larger audience.",
    "url": "https://map-india.org/map-events/tuesday-tidbits-3/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/06/Untitled-design-11.jpg"
  }
]