[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "703@map-india.org",
    "name": "Tuesday Tidbits",
    "startDate": "2025-01-28T17:30:00+05:30",
    "endDate": "2025-01-28T18:00:00+05:30",
    "description": "Are you passionate about the arts and curious about the inner workings of the museum world? If you're interested in learning more about development and funding in the arts sector, this drop-in session is for you. Join us for Tuesday Tidbits featuring Shraddha Jadhav, Head of Development at MAP, as she shares her expertise on funding for the arts sector in India. \n\nShe will discuss the current landscape of arts funding, focusing on MAP's support for the exhibition Chay Reds, Ferrous Black, and will offer valuable insights into securing funding for your own projects. Shraddha will also share her personal journey, navigating the transition from art history research to a fulfilling career in development and fundraising. \n\nTuesday Tidbits is a series that explores different aspects of working in a museum through the lens of our team members. Join us for these free, insightful, and short sessions on life in a museum. \n\nThis is part of our series that seeks to support youth in career research/building and acts as a space for networking for young people.",
    "url": "https://map-india.org/map-events/tuesday-tidbits-7/",
    "keywords": [
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/12/chay-reds-website-banner-1.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "639@map-india.org",
    "name": "Louis Kahn's Tiger City",
    "startDate": "2025-01-25T17:00:00+05:30",
    "endDate": "2025-01-25T19:30:00+05:30",
    "description": "Join us for the screening of Louis Kahn’s Tiger City in conjunction with the exhibition Eckart Muthesius and Manik Bagh: Pioneering Modernism in India curated by Raffael Dedo Gadebusch, travelling from the Museum of Asian Art, Berlin. In this film, art historian and filmmaker Sundaram Tagore retraces the footsteps of architect Louis Kahn,  uncovering how he built the iconic and monumental parliamentary complex in war-torn Bangladesh. \n\nBuilt for the Maharaja of Indore, Yashwant Rao Holkar II, Manik Bagh (or the ‘Gem Garden’) was a residential palace designed by his friend and architect Eckart Muthesius. The exhibition marks a first in a series of shows planned on architecture, focusing on plural interpretations on the idea of “home” through 3 exhibitions planned through 2025-2026. \n\nThe screening will feature an introduction by the director, Sundaram Tagore, and conclude with a Q&amp;A session with the audience.",
    "url": "https://map-india.org/map-events/louis-kahns-tiger-city/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Louis Kahn's Tiger City"
    },
    "image": "https://map-india.org/wp-content/uploads/2024/11/jan-25-website-banner-.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "704@map-india.org",
    "name": "Three-month Training Course in Photograph Conservation for Libraries, Archives and Art Collections",
    "startDate": "2025-03-03T09:00:00+05:30",
    "endDate": "2025-05-23T17:30:00+05:30",
    "description": "Join us for an intensive 3 months training course in photograph conservation for libraries, archives and art collections. This course is designed for people working in libraries, archives and other institutional collections, who work with photographic materials as a part of their professional responsibilities.\n\nOver 12 weeks of on-site instruction, you will learn the fundamentals of photograph conservation: identification of photographic processes, minor conservation treatments, preventive conservation, and disaster salvage for 19th, 20th, and 21st century materials. At the end of the course, you will return to your home institution, and carry out a 4-week conservation project, where you will apply what you have learnt during the course.\n\nThe workshop will be hands-on, where you will spend time in the darkroom reconstructing historical processes to understand the materials, their identification, and deterioration. This will be complemented by sessions in the conservation lab, where you will work on historical and contemporary photographs. In addition to in-person training, you will attend online lectures from art-historians and conservators to understand what we do and why we do it.\n\nApply for this programme and we will let you know if you are selected by February 10th, 2025.\n\nThis training programme is supported by Tata Trusts and conducted by the Museum of Art &amp; Photography, Bengaluru.",
    "url": "https://map-india.org/map-events/3-months-training-course-in-photograph-conservation-for-libraries-archives-and-art-collections/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/01/1440x810px.jpg"
  }
]