[
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "949@map-india.org",
    "name": "Draw with PencilJam",
    "startDate": "2025-07-20T10:30:00+05:30",
    "endDate": "2025-07-20T13:00:00+05:30",
    "description": "If you find joy in drawing intricate patterns or practicing observational sketching, we invite you to be part of this relaxed and inspiring session. Set against the backdrop of the museum’s vibrant exhibits, this gathering offers an open, creative space for artists of all skill levels. Whether you're looking to unwind through sketching, discover new perspectives, or simply enjoy the act of drawing in a shared environment, this is a chance to slow down and truly observe the world around you. Connect with fellow art lovers, exchange ideas, and share your work in an informal, supportive setting that celebrates creativity in all its forms.\n\nYou will need to carry your own:\n- Sketchbook or A4 paper\n- Pencil (wood or mechanical) and eraser\n- Gel pens or fineliners for outlining\n- Colour brush pens, sketch pens, or colour pencils (no wet media)",
    "url": "https://map-india.org/map-events/draw-with-penciljam/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-Image-1440-x-810-13.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "950@map-india.org",
    "name": "Maadathy - An Unfairy Tale",
    "startDate": "2025-07-20T16:00:00+05:30",
    "endDate": "2025-07-20T18:00:00+05:30",
    "description": "India is a land of Subaltern deities, where each deity has a unique legend and these legends are often interwoven with socio-historic tropes of India.\n\nThe Puthirai vannaar  are a Dalit caste group known as the 'unseeable', in southern India. Their forced-occupation is to wash the clothes of other Dalits, the dead, and menstruating women. This film explores the tale of a young girl who grew up in the Puthirai vannaar caste group and how she came to be immortalised as their local deity, Maadathy.\n\nThe screening will be followed by a conversation with the director of the film, Leena Manimekalai.\n\nSupported by Goethe-Institut / Max Mueller Bhavan.\n\nDo note: This is a Tamil language film and is subtitled in English.\n\n&nbsp;",
    "url": "https://map-india.org/map-events/maadathy-an-unfairy-tale/",
    "keywords": [
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "ta",
    "workPresented": {
      "@type": "Movie",
      "name": "Maadathy - An Unfairy Tale"
    },
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-Image-1440-x-810-14.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "962@map-india.org",
    "name": "Led by Curator",
    "startDate": "2025-07-27T16:00:00+05:30",
    "endDate": "2025-07-27T17:00:00+05:30",
    "description": "Join Arnika Ahldag, Director-Exhibitions &amp; Curation at MAP, as she takes you through a guided walk of our newest exhibition, Shape of a Thought: Letters from Ram Kumar. An artist who felt deeply, Ram Kumar was shaped by the world around him. From an economist, to a writer, to an artist — his methods of expression were as layered and manifold as the emotions his art inspires.\n\nWe invite you to come, linger, and contemplate through the mesmerising artworks of one of India’s most renowned modernists on the occasion of his centenary year.",
    "url": "https://map-india.org/map-events/led-by-curator/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/5-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "958@map-india.org",
    "name": "Shape of a Thought: Letters from Ram Kumar in ISL",
    "startDate": "2025-07-26T11:00:00+05:30",
    "endDate": "2025-07-26T12:00:00+05:30",
    "description": "Join us for a special Indian Sign Language interpreted walkthrough of Shape of a Thought: Letters from Ram Kumar. The exhibition invites visitors to pause and reflect, observe and be inspired. Come on a journey of introspection through the mesmerising artworks and evocative letters of Ram Kumar, one of India’s most renowned modernists on the occasion of his centenary year.\n\nThe exhibition is accompanied by two activities that create a deeper engagement with the art on display. The Writing Table gives audiences a chance to write a letter to themselves, loved ones, strangers, or even a city through a set of prompts. Family Label facilitates an exploration of abstract art by allowing visitors to look at artworks and creating a label on what they think the artwork means, or what they see or feel when faced with an abstract artwork.\n\nShape of a Thought also features the film ‘The Spaces in Between’ by Naveed Mulki. The film explores letter exchanges between Ram Kumar and his friend and the many conversations they have on life, art and the world.",
    "url": "https://map-india.org/map-events/shape-of-a-thought-letters-from-ram-kumar/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/1-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "TheaterEvent",
    "@id": "964@map-india.org",
    "name": "Come Eat With Me",
    "startDate": "2025-07-20T18:30:00+05:30",
    "endDate": "2025-07-20T20:00:00+05:30",
    "description": "Come Eat With Me is a performance piece that explores the relationship between caste and food while sharing a meal together. Focusing on Dalit Cuisine, the piece begins with personal stories and oral histories around food in the performer's household and community and is peppered with existing literature and academic writing around the multilayered, many-flavoured relationships between caste and food. The piece unpacks questions of oppression and solidarity, grief and joy, and the everyday victories of the human spirit in the face of structural injustices.\n\nAudiences are invited to eat together and share their own stories around caste and food. In doing so the form subverts an activity laden with caste hierarchies and hopes to create a space for community building, and now it has sort of evolved into an event that will/has to find its place in the larger anti-caste movement, in the Ambedkarite movement.\n\nSupported by Goethe-Institut / Max Mueller Bhavan\n\nImage credits: Vamsi",
    "url": "https://map-india.org/map-events/come-eat-with-me/",
    "keywords": [
      "MAP",
      "Performances"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-cover-images-new-2025-07-14T151030.157.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "961@map-india.org",
    "name": "Led by MAP Founder",
    "startDate": "2025-07-27T11:00:00+05:30",
    "endDate": "2025-07-27T12:00:00+05:30",
    "description": "Join us for a special walkthrough of Shape of a Thought: Letters from Ram Kumar led by MAP’s Founder, Abhishek Poddar. In this reflective walkthrough, he shares personal insights into the life and work of Ram Kumar, drawing from his own close relationship with the artist.\n\nCome and discover how Ram Kumar’s evocative letters and stirring paintings come together in the exhibition, and how his legacy lives on.",
    "url": "https://map-india.org/map-events/led-by-map-founder/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/4-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "966@map-india.org",
    "name": "Chutney Soca: A Thread Between Bhojpuri and Calypso Music",
    "startDate": "2025-07-20T16:00:00+05:30",
    "endDate": "2025-07-20T18:00:00+05:30",
    "description": "Image Credits: East Indians on a Trinidad cocoa estate, Published in The Food of the Gods: A Popular Account of Cocoa (1903)\n\nChutney Soca is a genre born from the unlikely meeting of Bhojpuri folk traditions and the pulse of Caribbean Calypso and Soca. Rooted in the journey of Indian indentured labourers to Trinidad and Guyana, this session hosted by Focus Group Radio traces the cultural collision and creative fusion that gave rise to Chutney Soca—through music, documentary snippets, and stories. \n\nFrom Bhojpuri folk traditions to Carnival stages, in this session we’ll explore how two distinct worlds came together to create something entirely new, loud, and full of life.\n\n&nbsp;",
    "url": "https://map-india.org/map-events/chutney-soca-a-thread-between-bhojpuri-and-the-calypso-music/",
    "keywords": [
      "Listening Session",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/Website-cover-images-new-2025-07-15T170332.038.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "959@map-india.org",
    "name": "Shape of a Thought: Letters from Ram Kumar with Curator",
    "startDate": "2025-07-26T16:00:00+05:30",
    "endDate": "2025-07-26T17:00:00+05:30",
    "description": "Led by Priya Chauhan, curator of Shape of a Thought: Letters from Ram Kumar, this guided walk gives audiences a peek into the curatorial process of the exhibition. Join us to gain a deep understanding of the artist and his journey to becoming one of India’s most iconic modernist voices\n\nThe exhibition invites visitors to pause and reflect, observe and be inspired. Experience the profound inner world of Ram Kumar, as we mark the centenary this extraordinary artist.",
    "url": "https://map-india.org/map-events/shape-of-a-thought-letters-from-ram-kumar-with-curator/",
    "keywords": [
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/2-4.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "960@map-india.org",
    "name": "Descriptive Label-Making",
    "startDate": "2025-07-26T14:00:00+05:30",
    "endDate": "2025-07-26T16:00:00+05:30",
    "description": "Ram Kumar’s abstract forms are rooted in emotion, memory, and his journey as one of India’s foremost modernists. They offer a canvas not just to look, but to feel and imagine. This label-making workshop invites you to bridge the distance between artwork and viewer, fostering a personal dialogue with his art.\n\nCome and uncover the layered meanings within abstraction. Join us for a journey of observation, reflection and creative expression.\n\n&nbsp;",
    "url": "https://map-india.org/map-events/descriptive-label-making/",
    "keywords": [
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/07/3-4.png"
  }
]