[
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Curating is Mapping",
    "startDate": "2024-06-30T04:30:00+00:00",
    "endDate": "2024-06-30T11:30:00+00:00",
    "description": "Have you ever wanted to learn how exhibitions are curated for a museum or gallery? Then this hands-on curatorial workshop by Fulbright-Nehru winning art curator Julia Wintner is the perfect opportunity for you.\n\nCurating Is Mapping is a 6 hour, hands-on curatorial workshop for both aspiring and experienced curators during which you will experience the full arc of the exhibition process: from initial concept and curatorial statement, to digital presentation.\n\nMAP’s permanent exhibition VISIBLE/INVISIBLE: Representation of Women in Art through the MAP Collection (currently on view) will serve as your prompt for curating. Julia will distribute selected images and texts to guide the attendees’ curatorial focus.\n\nWe will examine the range of critical curatorial tasks and how they affect curators’ relationships with both artists and spaces. We will explore these tasks with close attention to current social and cultural events. Once you register for the workshop, we will share the workshop schedule and pre-workshop prompts to get you started!",
    "url": "https://map-india.org/map-events/curating-is-mapping/",
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/06/Website-Image-1440-x-810-20.png"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Dhrupad through the Ages: Between Music and Naad Yoga",
    "startDate": "2024-06-27T13:00:00+00:00",
    "endDate": "2024-06-27T13:00:00+00:00",
    "description": "We invite you to experience one of the oldest forms of Indian Classical Music from Padmashri winning maestro Pt. Umakant Gundecha and his masterful fellow musicians.\n\nCurated in an interactive style, this concert will take you on a unique and in-depth exploration of Dhrupad, its benefits on the mind and body, and the maestro's journey through the music. Attendees will learn about Naad Yoga and how simple singing techniques can enhance focus, alleviate tension, and cultivate inner stillness.",
    "url": "https://map-india.org/map-events/dhrupad-through-the-ages-between-music-and-naad-yoga/",
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/06/Dhrupad-performance.png"
  },
  {
    "@context": "http://schema.org",
    "@type": "Event",
    "name": "Reader's Bloc: On Caring",
    "startDate": "2024-06-26T12:30:00+00:00",
    "endDate": "2024-06-26T12:30:00+00:00",
    "description": "With Love N. I, 1977, Manjit Bawa\n\nThe Reader's Bloc is an online/IRL group of readers taking part in reading, listening and sharing exercises around texts that help us learn more about ourselves, the identities we share and the communities we live in.\n\nFor our upcoming session, we will be thinking about all the different ways we look at care and the nuances of caring for someone. This month we will look at two texts, the lovely personal essay \"Super Fandom\" by Ragini Rao Nag where she explores the communities of care she created by being part of a fandom and the wonderful short story \"What is Seized\" by Lorrie Moor which looks at the ways in which act of caring shapes our being. Once you register for the event, we will send you the text and the topics/themes we will discuss.\n\nThis programme is exclusively for 18–25 year olds.\n\nThis session is conducted as part of our engagements for the MAP Youth Collective. The MAP Youth Collective is a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.",
    "url": "https://map-india.org/map-events/on-caring/",
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2024/06/2-2.png"
  }
]