[
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1010@map-india.org",
    "name": "Encoded in Thread",
    "startDate": "2025-09-19T15:00:00+05:30",
    "endDate": "2025-09-19T16:00:00+05:30",
    "description": "The Haveli Collection by designer Poornima Jain, features a remarkable assembly of textiles and costumes that reveal the artistry behind human creativity. This Sasken exhibition offers a sneak peek into this exquisite collection.\n\nThe exhibition focuses on the journey from the earliest twisted fibers to finished garments, inviting us to view cloth as a manifestation of rhythm, logic, and human intelligence woven into form. Each piece tells a story of cultural heritage, where ancient techniques meet contemporary inspiration, and every thread connects us to the hands that shaped it.\n\n&nbsp;",
    "url": "https://map-india.org/map-events/encoded-in-thread/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-34.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1006@map-india.org",
    "name": "Rasas & Raagas: Art Inspired Melodies",
    "startDate": "2025-09-20T11:30:00+05:30",
    "endDate": "2025-09-20T14:30:00+05:30",
    "description": "Rasas &amp; Raagas: Art inspired Melodies is an immersive and interactive workshop that invites participants to explore the deep relationship between swar (musical notes), raaga (melodic framework), and rasa (emotional essence). \n\nWhat transforms this experience is its innovative dialogue with visual art. Participants will encounter the evocative modernist paintings of Ram Kumar, allowing his abstract forms and colors to inspire spontaneous musical responses through voice, breath, and sound.\n\nBy placing music in conversation with visual imagery, the workshop opens new pathways to experience both disciplines, designed for musicians, artists, and anyone curious about the emotive power of the arts. No prior training in music is required—just a willingness to listen, respond, and discover the harmony between sound, form, and emotion.\n\nThis event is in conjunction with the exhibition, Shape of a Thought: Letters from Ram Kumar.\n\nFacilitated by arts practitioners, Responding to Art through the Arts aims to activate our galleries through a series of workshops that hold space for young people’s responses to artwork on display. \n\nThis session is conducted as part of our engagements for the MAP Youth Collective. The MAP Youth Collective is a community for young people (18-25 year olds) to engage with the arts and culture sector. The collective is for, of and by young people — to explore our shared identities and interests through art.",
    "url": "https://map-india.org/map-events/rasas-raagas-art-inspired-melodies/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-28.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1015@map-india.org",
    "name": "Journeys with and through Music",
    "startDate": "2025-09-21T17:00:00+05:30",
    "endDate": "2025-09-21T18:30:00+05:30",
    "description": "In this special conversation, singer–composer Bindhumalini and cultural theorist–translator Tejaswini Niranjana reflect on the ways music shapes and accompanies our lives. Together they will explore how voice and song become pathways to listening, dialogue, and discovery",
    "url": "https://map-india.org/map-events/journeys-with-and-through-music/",
    "keywords": [
      "CBD",
      "MAP",
      "Talks"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-36.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1008@map-india.org",
    "name": "Hands-On Art: A Tactile Journey Through the MAP Collection",
    "startDate": "2025-09-27T11:00:00+05:30",
    "endDate": "2025-09-27T13:00:00+05:30",
    "description": "Join Gurjeet Singh for a unique sensory journey through Visible/Invisible: Representations of Women in Art through the MAP Collection.\n\nDesigned for people with visual impairment, this tactile workshop invites participants to explore artworks through touch, then channel their experience into creating personal tactile artworks exploring ornamentation and self-expression. All workshop materials, from textile fragments to modeling tools and decorative elements, are included.\n\nPlease note: This workshop is specifically designed for people with visual disabilities. Participants are welcome to bring a friend or family member to join them.",
    "url": "https://map-india.org/map-events/hands-on-art/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-32.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1012@map-india.org",
    "name": "Deaf Bookwave",
    "startDate": "2025-09-20T14:00:00+05:30",
    "endDate": "2025-09-20T17:00:00+05:30",
    "description": "Join Bengaluru's book club for the Deaf and Hard of Hearing community. Experience literature in a welcoming space designed for meaningful connection and expression through Indian Sign Language (ISL).\n\nThis session offers a safe, friendly environment where members explore books, share perspectives, and engage in rich discussions. We celebrate the power of storytelling while fostering genuine connections within the community.\n\nMore than just a book club—we're building a space where accessibility meets literary passion.",
    "url": "https://map-india.org/map-events/deaf-bookwave-2/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-35.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1005@map-india.org",
    "name": "NeuroQueer BrainBox",
    "startDate": "2025-09-20T15:00:00+05:30",
    "endDate": "2025-09-20T18:00:00+05:30",
    "description": "A warm invitation to all Neuroqueers!\n\nJoin us for another edition of NeuroQueer Brain Box facilitated by Mani Agarwal who is a NeuroQueer therapist. For this session, we’ll come together to reimagine art and write letters of care and affirmation.\nWe’ll begin by moving through Shape of a Thought: Letters from Ram Kumar at your own pace, in your own way. As you journey through the exhibition, hold close three words of affirmation; let them sit with you, and bring them to the huddle.\n\nThrough shared exploration and queer perspectives, we’ll shape those thoughts into community letters and collaborative art celebrating neuroqueer creativity and building a space where others can feel seen, safe, and held.\n\nPlease note: This is a free session exclusively for individuals who identify as LGBTQIA+ with ADHD/Autism/AuDHD.",
    "url": "https://map-india.org/map-events/neuroqueer-brainbox-2/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-27.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1017@map-india.org",
    "name": "In & Out of the Frame",
    "startDate": "2025-10-07T17:00:00+05:30",
    "endDate": "2025-10-07T18:00:00+05:30",
    "description": "Join us for a walkthrough of our permanent exhibition with Senior Archivist at the Archives at NCBS, Anjali Ramachandran.\n\nWhen we encounter artworks at a museum, we make meaning either through the work itself, its setting, or through labels that accompany them. Another way to read an artwork is to look for what's not in the 'frame'—to explore the circumstances of its creation and the use of the artwork, rather than just the artwork itself.\n\nIn this guided walk, you will get to explore our permanent exhibition, VISIBLE/INVISIBLE: Representation of Women through the MAP Collection, through the lens of an archivist. We will discuss the maker, the purpose, a specific object's relation to others, and the broader social and historical environment in which the artworks were created. In archival sciences, this is called contextualisation, where archivists understand records through the varied ways in which memories (remembered or in recorded acts) have been transmitted over time and space with numerous inscriptions, transmissions, and omissions.\n\nAlthough it sounds technical, the process itself can be disruptive and playful. It involves gossip, peeking behind the curtain, and an understanding of the complex process of making art!",
    "url": "https://map-india.org/map-events/in-out-of-the-frame/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1014@map-india.org",
    "name": "Accessible Art Experience: Tactile Walkthrough",
    "startDate": "2025-09-27T16:00:00+05:30",
    "endDate": "2025-09-27T17:00:00+05:30",
    "description": "Experience art beyond sight in this special walkthrough of VISIBLE/INVISIBLE: Representations of Women in Art through the MAP Collection. Join artist Gurjeet Singh as he guides you through the tactile artworks he created specifically for this exhibition, inviting you to engage with creativity through touch and discover new dimensions of artistic expression.\n\nThis session will focus on the tactile artworks he created for the exhibition, allowing visitors to engage with art through touch and explore new ways of experiencing creativity. Gurjeet will share his inspirations, processes, and the stories behind his tactile pieces, offering audiences a unique perspective into his practice.\n\nJoining him is MAP's Inclusion Manager, Shailesh Kulal, who will explore the accessibility measures thoughtfully integrated throughout the exhibition. From tactile guides to inclusive resources, discover why these considerations are essential for ensuring everyone can experience and enjoy art equally.",
    "url": "https://map-india.org/map-events/tactile-walkthrough/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/WEBSITE.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "EducationEvent",
    "@id": "1011@map-india.org",
    "name": "Art with Code",
    "startDate": "2025-09-20T11:00:00+05:30",
    "endDate": "2025-09-20T14:00:00+05:30",
    "description": "Join us for the \"Art with Code\" programme which introduces coding in an innovative context, teaching it through the lens of interactive art. Participants will start by learning the basics of creating art and incorporating interaction using JavaScript. This program aims to view technology not as the end goal, but as a means to create meaningful digital experiences.\n\nFacilitated by Tanvi Kumar, the program will teach participants p5.js, a JavaScript library created to teach the fundamentals of programming through art. This edition of the program will have a special theme - Ticket Tika Chaap - where participants will generate art using the ticket/chaap images that were a prominent part of the Indo-British textile trade.\n\nThis workshop is beginner-friendly, ideal for those with no coding experience as well as experienced coders.\n\nPlease note: Laptops are mandatory for this event. If you aren't able to bring one, please let us know beforehand at \n\nhello@map-india.org",
    "url": "https://map-india.org/map-events/art-with-code/",
    "keywords": [
      "CBD",
      "MAP",
      "Workshops"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-33.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1016@map-india.org",
    "name": "Bound Together",
    "startDate": "2025-09-26T15:00:00+05:30",
    "endDate": "2025-09-26T16:00:00+05:30",
    "description": "Join us for a guided walk through our digital textile exhibition, exploring how cloth serves as an expression of human creativity and cultural connection. Textiles are among the oldest human inventions, yet they remain endlessly renewed. To bind, dye, and transform cloth is a shared tradition of creativity—reminding us that making is also a way of becoming.\n\n'Bound Together' is exhibition presents the Haveli collection (1984–2016) by designer Poornima Jain, where influences from India, Japan, and Africa were reimagined into a modern language of abstraction. The works appear in dialogue with the cultural traditions that shaped them—bandhani, leheriya, shibori, and Kuba cloths—tracing connections across geographies while celebrating the singularity of each textile.",
    "url": "https://map-india.org/map-events/bound-together/",
    "keywords": [
      "CBD",
      "Guided Walk",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-37.png"
  },
  {
    "@context": "https://schema.org",
    "@type": "ScreeningEvent",
    "@id": "1013@map-india.org",
    "name": "Norma Rae (1979)",
    "startDate": "2025-09-20T16:00:00+05:30",
    "endDate": "2025-09-20T18:00:00+05:30",
    "description": "In collaboration with Bangalore Film Forum (BFF), MAP is excited to announce the screening of Norma Rae directed by Martin Ritt. Based on the true story of a textile worker who becomes involved in union organizing in the American South, Norma Rae is an iconic film about labour struggles. It sheds light on the harsh working conditions of mill workers and the personal cost of organizing. \n\nFollowing the screening, join us for a walkthrough of the exhibition Ticket, Tika, Chaap, which offers a deep dive into the often-overlooked world of textile labels in MAP’s collection.\n\nInspired by the themes of Norma Rae, we will reflect on the labour, craft, and histories embedded in these small yet powerful objects.",
    "url": "https://map-india.org/map-events/norma-rae-1979/",
    "keywords": [
      "CBD",
      "Film Screenings",
      "MAP"
    ],
    "inLanguage": "en",
    "workPresented": {
      "@type": "Movie",
      "name": "Norma Rae (1979)"
    },
    "image": "https://map-india.org/wp-content/uploads/2021/02/1440-X-810-Widget-05.jpg"
  },
  {
    "@context": "https://schema.org",
    "@type": "Event",
    "@id": "1009@map-india.org",
    "name": "Up, Close & Center",
    "startDate": "2025-09-23T17:00:00+05:30",
    "endDate": "2025-09-23T17:30:00+05:30",
    "description": "This session of Up, Close and Center looks at one of the artworks by the renowned modernist painter Ram Kumar from the exhibition Shape of a Thought: Letters from Ram Kumar by curator Priya Chauhan.",
    "url": "https://map-india.org/map-events/up-close-center/",
    "keywords": [
      "CBD",
      "Drop-in Sessions",
      "MAP"
    ],
    "inLanguage": "en",
    "image": "https://map-india.org/wp-content/uploads/2025/09/Website-cover-images-new-18.png"
  }
]