[
  {
    "name": "Freewheelin' Meet-up",
    "location": "Indiranagar",
    "options": [
      {
        "Freewheelin'": "₹1.00"
      },
      {
        "Rental Bike": "₹300.00"
      }
    ],
    "dates": [
      {
        "eventDate": "2024-08-28T00:00:00+05:30",
        "bookingBeginDate": "2024-08-28T14:15:00+05:30"
      },
      {
        "eventDate": "2024-09-08T00:00:00+05:30",
        "bookingBeginDate": "2024-09-08T01:30:00+05:30"
      }
    ],
    "duration": "2 hours",
    "metrics": [
      {
        "DISTANCE": "15KM"
      }
    ],
    "description": "Join this bicycle ride to meet the community and explore the city with them! Enjoy Bengaluru's sights, sounds, tastes and aromas, without the din and pollution of its traffic. Wind down your ride with some fun conversations and savour the delicacies of your favourite (or to be favourite) eateries. Next Date:  Wednesday -28th Aug'24Starting time: 7:45 pm @ Pedal in TandemWe'll be stopping over at some interesting eateries in Indiranagar. We usually do a mix of restaurants, street food joints or dessert places. Bikes are available for rent as add-on -----------------------------------------------------------------------------------------------------------------------------------------------------------------Sunday - 8th Sep'24Starting time: 7:30 am @ Pedal in TandemRide distance approx. 20kms and head over to Brik Oven, Indiranagar, for breakfast-----------------------------------------------------------------------------------------------------------------------------------------------------------------WHAT TO BRING:- Bicycle and helmet. Rentals are available at Pedal in Tandem."
  },
  {
    "name": "Workshop - Roadside fixes & Home maintenance",
    "location": "Pedal in Tandem",
    "options": [
      {
        "Workshop": "₹500.00"
      }
    ],
    "dates": [
      {
        "eventDate": "2024-08-31T00:00:00+05:30",
        "bookingBeginDate": "2024-08-31T05:30:00+05:30"
      }
    ],
    "duration": "2 hours, 11 am to 1 pm",
    "metrics": [],
    "description": "If you've ever been stranded on the road with a breakdown, you'll know the importance of bike maintenance. Even if you're new to cycling, this is essential know-how that will only make your journey into the world of bicycles even more fascinating. So come on over to our workshop and leave with some essential skills. You bring your own bike and we'll provide the tools. If you don't have a bike, just show up and we'll get you some hands-on on one of our bikes. \n"
  },
  {
    "name": "Ridge Trail",
    "location": "Gunjur & Chikka Tirupathi",
    "options": [
      {
        "L1 - Beginner - 25 km (with b'fast)": "₹2,050.00"
      },
      {
        "L2 - Moderate - 45 km (with b'fast)": "₹2,250.00"
      },
      {
        "Rental Bike (with transport)": "₹800.00"
      },
      {
        "Transport my bicycle": "₹300.00"
      }
    ],
    "dates": [
      {
        "eventDate": "2024-09-01T00:00:00+05:30",
        "bookingBeginDate": "2024-09-01T01:00:00+05:30"
      }
    ],
    "duration": "3-5 hours",
    "metrics": [
      {
        "DISTANCE": "25-40KM"
      },
      {
        "MIN. GROUP SIZE": "10"
      },
      {
        "ELEVATION GAIN": "150-250M"
      }
    ],
    "description": "Enjoy the freedom of being in the outdoors, away from the noise and traffic of the city. Take a ride on the Ridge Trail through the villages and farmlands off Chikka Tirupati road near Gunjur. As the name suggests, this easy route of 25km on mostly flat terrain, will take you over several lake bunds and ridges, offering scenic views of the countryside. This ride is ideal for beginners and those looking to get back in the saddle after a long break. Also, if you're new to our weekend rides, this ride is exactly what you need!"
  },
  {
    "name": "The Games We Play - Badminton",
    "location": "A PITStop meet-up",
    "options": [
      {
        "Badminton meet-up": "₹250.00"
      }
    ],
    "dates": [
      {
        "eventDate": "2024-09-11T00:00:00+05:30",
        "bookingBeginDate": "2024-09-11T13:30:00+05:30"
      }
    ],
    "duration": "",
    "metrics": [],
    "description": "Relive the joys of childhood games, and remember what it's like to not to take things too seriously, and just embrace the playful, spontaneous and carefree aspects of life. This one involves a few rounds of badminton while you get to meet and bond with members of the community. Location: Game Theory at Caurvery School, Indiranagar - Time: 7 to 9 pm If you don't have badminton shoes or rackets, you can rent them at the venue, from Game Theory."
  },
  {
    "name": "Cycle School",
    "location": "Indiranagar, Bangalore",
    "options": [
      {
        "CycleSchool": "₹1,000.00"
      }
    ],
    "dates": [
      {
        "eventDate": "2024-09-14T00:00:00+05:30",
        "bookingBeginDate": "2024-09-14T02:30:00+05:30"
      }
    ],
    "duration": "2 hours, 8-10am",
    "metrics": [],
    "description": "Cycle School is back! If you are an adult and have been wanting to learn to ride a bicycle, then these sessions are perfect for you. We will have bicycles (with helmets) and trained instructors who will make this learning easy, and a whole lot of fun too. Cycling is a life-skill that everyone should possess, and our mission through these sessions is to ensure that you learn and practice it in a safe environment, until you have the confidence to pedal out on your own."
  }
]