[
  {
    "@type": "Event",
    "name": "Sisters & Misters Salsa Workshop",
    "url": "https://puttingscene.com/events/1128",
    "startDate": "2025-10-05T10:00:00+05:30",
    "endDate": "2025-10-05T12:00:00+05:30",
    "description": "Salsa – Beginner Workshop\n\nAlways wanted to try Salsa but didn’t know where to start? This workshop is the perfect first step!\n\nJoin us for a fun session for beginners - no prior dance experience required.\n\nWe’ll guide you through the basics in a relaxed, playful way so you can feel the music, move with confidence, and discover just how fun and easy Salsa really is.\n\nWhat to Expect:\n1. Easy-to-follow salsa steps \n2. Partner rotations so you meet & dance with everyone\n3. Interactive games to learn rhythm & movement\n\nPerfect for:\n    •    Total beginners (no dance background needed)\n    •    Anyone looking to try something new & exciting\n    •    People who love music, movement, and good vibes!\n\nDress code:\n\n1. Wear whatever makes you feel your best and most comfortable - should be easy for you to move around. \n2. ⁠Carry a pair of socks with you - it’ll help with the dancing. You won’t be needing any special footwear for the session.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1128/4ff100eb-d7a4-4485-a723-cc482cdd8f2c.jpg",
    "location": {
      "name": "Palladium Dance Company",
      "address": "Palladium Dance Company, Bangalore",
      "url": "https://www.google.com/maps/search/palladium+dance+koramangala+address/@12.9333372,77.6249957,16z?entry=s&sa=X&ved=1t%3A199789"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "800.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "The Analog Club",
    "url": "https://puttingscene.com/events/1157",
    "startDate": "2025-10-18T15:00:00+05:30",
    "endDate": "2025-10-18T17:00:00+05:30",
    "description": "Step back in time at The Analog Club, an event series by the Studio by Copper + Cloves.\n\nImagine walking into a busy cafe and seeing not a single phone, no-one taking selfies and no one around you scrolling.\n\nDisconnect from devices for 3 hours of unplugged experience—we'll have books, board games, music, crochet, and of course, food! But this isn't about structured activities or organised fun, just genuine connection and relaxation. The event will be fluid- you can dip into activities if you want, or you can just chat to new people or graze at our high tea counter!\n\nMeet new friends, sketch, or read a book in quiet solitude (without being surrounded by people lost in their phones).\n\nWe will not be doing social media on our phones at the event, we will only take photos with a camera.\n\nEmbrace the analog experience, slow down, and reconnect in this crazy digital age!\n\n\nTickets are for entry, all games and art supplies, and unlimited high tea from our renowned deli counter.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1157/e21b60ad-8b16-4abb-8de2-c1aed4c3cdbc.jpg",
    "location": {
      "name": "The studio by copper and cloves",
      "address": "The studio by copper and cloves, Bangalore",
      "url": "https://maps.app.goo.gl/F73vBAC2tSYD43F2A"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "600.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Pint of View (Lecture 6) - Deja Oops: Why Neuroscience Says Your Memory Can’t Be Trusted",
    "url": "https://puttingscene.com/events/1158",
    "startDate": "2025-10-05T16:00:00+05:30",
    "endDate": "2025-10-05T18:00:00+05:30",
    "description": "Welcome to Pint of View – Bangalore's first-ever community where classroom-styled lectures meet craft cocktails in pubs and bars.\n\nIn our sixth lecture, we’re bringing you Dr. Sumyuktha Anand, a neuroscientist and science communicator who calls herself a neuroscience nerd. She has explored everything from addiction and reward circuits to the neuroscience of brain tumors, and while she earned her Ph.D. in Molecular and Cellular Biology, what excites her most is stepping outside the lab to share just how fascinating our brains really are. Passionate about making science accessible, Sumyuktha brings the marvels of neuroscience to non-specialist communities and now, to you — over a pint.\n\nHer talk, Déjà Oops: Why Neuroscience Says Your Memory Can’t Be Trusted, dives into the quirks of memory and the science of neuroplasticity. We like to think of memory as a reliable archive, but the truth is it’s constantly being rewritten, distorted, and reinvented by our brains. Why does this happen? What does it say about how our brains work? And how does this “unreliability” help us more than it harms us?\n\nCome, find out, and bring your questions — from everyday forgetfulness to the bigger mysteries of how memory shapes identity.\n\nAll of this, over Geist beer on tap at Jamming Goat 3.0, Indiranagar! 🍻\n\nWhat to Expect:\n\nA 60-minute lecture on memory, neuroplasticity, and why our brains misremember\n15-20 minutes of interactive Q&A\nOne Geist beer on tap or a mocktail included with your ticket\nA lively mixer to share your insights, laugh over your “oops” moments, and walk away seeing your memory in a whole new way\n\nAbout the Lecturer\n\nDr. Sumyuktha Anand is a neuroscientist and science communicator who has researched topics ranging from addiction and reward circuits to brain tumors. With a Ph.D. in Molecular and Cellular Biology, she is passionate about making brain science fun and accessible beyond academic circles — through teaching, writing, and now, with Pint of View.\n\nAbout Pint of View\n\nInspired by the successful Lectures on Tap community in the U.S., Pint of View brings this format to India for the first time. It’s where big ideas meet bar tables, and where you enjoy a drink in hand while walking out with a new way of seeing the world.\n\nBook now & develop your own pint of view! 🍻",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1158/e17c3e5a-2841-4606-89f3-169176ef39b0.jpg",
    "location": {
      "name": "Jamming Goat 3.0, Indiranagar",
      "address": "Jamming Goat 3.0, Indiranagar, Bangalore",
      "url": "https://maps.app.goo.gl/fsHW9onELE3TwJrB9"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "1100.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Pretzel Making Workshop",
    "url": "https://puttingscene.com/events/1159",
    "startDate": "2025-10-04T15:00:00+05:30",
    "endDate": "2025-10-04T17:00:00+05:30",
    "description": "Pretzel folding...\nThe event will flow in the following manner:\n\n* Brief introduction on pretzel\n* Chef demonstrating the folding procedure\n* Guest replicating the demonstration\n* Pretzels going for baking\n* Guests given warm pretzels.\n\nAll SIS members are eligible for a 10% discount on any purchase at the cafe",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1159/78d22b9f-9b5f-4bd8-bb5e-37609854d39f.jpg",
    "location": {
      "name": "German BrezelHaus - Bakery & Bistro",
      "address": "German BrezelHaus - Bakery & Bistro, Bangalore",
      "url": "https://www.google.com/maps?daddr=Site+No.+626%2C+Binnamangala%2C+Stage+1%2C+Indiranagar%2C+Bengaluru%2C+Karnataka+560038&fb=1&geocode=Kb9R9IKyFa47MQ5Ge3QV9Owx&gl=in&gs_lcrp=EgZjaHJvbWUqBggBEEUYOzIGCAAQRRg5MgYIARBFGDsyBggCEEUYPDIGCAMQRRhBMgYIBBBFGEEyBggFEEUYQTIGCAYQRRhBMgYIBxAuGEDSAQgyODQyajBqMagCALACAA&ie=UTF-8&sa=X&um=1"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "750.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Supper Clubs of India: Sweet Talk with Sakaré",
    "url": "https://puttingscene.com/events/1160",
    "startDate": "2025-10-11T12:30:00+05:30",
    "endDate": "2025-10-11T14:30:00+05:30",
    "description": "Bengaluru Servd and NIC Ice Creams present: Supper Clubs of India - Bengaluru Edition, a series of intimate dining experiences highlighting regional community-style meals and cuisines from across India!\n\nChef Jenny Clinta, founder of one of Bengaluru’s favourite Supper Clubs, Sakaré, is bringing us a pastry-lover’s feast!\n\nStarted in 2024, Sakaré was a way to showcase Chef Jenny’s journey from the Andamans to France where she trained to become a professional pastry chef.\nFor our Supper Club, she’s bringing back her iconic Gajar dessert, her personal favourite- the Tiramisu, her famous Macarons, Apple Tarte Tatin, and many more dishes.\n\nDISCLAIMER: All dishes contain Egg.\n\nThe 7-course tasting menu starts with savouries followed by a palate cleanser as well as two indulgent dishes paired with surprise NIC Ice Creams flavours and petit fours to end the experience.\nThe entire supper is crafted to be perfectly-balanced in its sweetness with ingredients from the Andamans as well such as locally-sourced Pandan and Cinnamon!\n\nAlso enjoy curated cocktails as you dive into the meal.\n\nNOTE: Once tickets are booked, please share your meal preference (Eggetarian or Non-Vegetarian) along with any allergies with us on WhatsApp at 8123265307\n\nJoin us on Saturday, 11th October at Daysie, MG Road.\nLimited seats. Book yours now!\n\nMenu:\nJam and Crust \nFocaccia, Tomato Jam, Garlic Confit Herbed Butter\n\nCourse 1\nIsland Stack \nBlinis, Chammanthi, Spiced Mushroom/Chicken, Chimichurri, Dessicated Coconut\n\nCourse 2\nMom’s Special Banana/Fish Cutlet \nFish Cutlet/Raw Banana Pate, Pain Demi, Banana Flower Salad\n\nCourse 3\nApple Tatin\nApple Tarte Tatin, Poached Apples, Creme Diplomat, Rosemary, Crumble, Cinnamon Wafer Garnish with a surprise NIC Ice Creams flavour\n\nCourse 4\nGajjar \nConfit Gajar, Rabri Mousse, Pistachio Sable\n\nCourse 5\nPetals and Palm\nCoconut Sprout, Candied Rose Petals, Coconut Veil, Tender Coconut Granita, Pickled Cucumber \n\nCourse 6\nSomething Like Tiramisu \nMascarpone Mousse, Coffee Sponge, Cocoa Crumble, Coffee Tuille, Coffee Caviar with a surprise NIC Ice Creams flavour\n\nCourse 7\nPetit Four\nKhara, Lemon Madeleine, Blueberry Cheese Macaron",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1160/c1198f64-6555-47d8-b29f-4ce38ccd4645.jpg",
    "location": {
      "name": "Daysie, MG Road",
      "address": "Daysie, MG Road, Bangalore",
      "url": "https://maps.app.goo.gl/2GTD79hsz7E42UVt9"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "1999.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Book Discussion: Broken Nest and Other Stories",
    "url": "https://puttingscene.com/events/1167",
    "startDate": "2025-10-04T18:00:00+05:30",
    "endDate": "2025-10-04T20:00:00+05:30",
    "description": "Some stories are timeless, returning to us with new meanings each time they are retold. Broken Nest and Other Stories, translated by acclaimed poet Sharmistha Mohanty, brings Rabindranath Tagore’s unforgettable tales into a contemporary voice that resonates with today’s readers. At this special discussion, poet and translator Sharmistha Mohanty will be in conversation with writer and scholar Mani Rao, exploring how translation can revive, reframe, and reimagine Tagore’s narratives for new generations.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1167/3d7572ff-a2cb-4ef0-a033-5523f407c616.jpg",
    "location": {
      "name": "Champaca Bookstore, Vasanthnagar",
      "address": "Champaca Bookstore, Vasanthnagar, Bangalore",
      "url": "https://maps.app.goo.gl/ZczKbdKsR5AuCvkC9"
    },
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Bars From Far",
    "url": "https://puttingscene.com/events/1168",
    "startDate": "2025-10-10T17:30:00+05:30",
    "endDate": "2025-10-10T19:30:00+05:30",
    "description": "A cocktail festival that brings 9 of the best bars and bartenders from India, under one roof. Bars From Far by Greater Than Gin is back in Bangalore for its second edition.\n\nWhat can you expect? Great cocktails, food pop-ups, and a fantastic music lineup featuring electronic, disco, afro, and house genres.\n\nExperience a selection of the best bars from Goa, Mumbai, Pune, Delhi, Hyderabad, Kolkata, Jaipur and Chandigarh, alongside Nao Spirits’ very own MTW Bar and Toasties.\n\nBFF is where you'll find the best bartenders stirring up the best cocktails by some of the best bars from across the country, but without leaving your city.\n\nIt's a bar crawl, but without the crawl. So mark your calendars and bring your BFF along to our BFF!",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1168/fffd9033-1681-4d27-9481-5461e74d81af.jpg",
    "location": {
      "name": "wework galaxy",
      "address": "wework galaxy, Bangalore"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "678.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Bars From Far - Day 2",
    "url": "https://puttingscene.com/events/1169",
    "startDate": "2025-10-11T17:30:00+05:30",
    "endDate": "2025-10-11T19:30:00+05:30",
    "description": "A cocktail festival that brings 9 of the best bars and bartenders from India, under one roof. Bars From Far by Greater Than Gin is back in Bangalore for its second edition.\nWhat can you expect? Great cocktails, food pop-ups, and a fantastic music lineup featuring electronic, disco, afro, and house genres.\nExperience a selection of the best bars from Goa, Mumbai, Pune, Delhi, Hyderabad, Kolkata, Jaipur and Chandigarh, alongside Nao Spirits’ very own MTW Bar and Toasties.\nBFF is where you'll find the best bartenders stirring up the best cocktails by some of the best bars from across the country, but without leaving your city.\nIt's a bar crawl, but without the crawl. So mark your calendars and bring your BFF along to our BFF!",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1169/f5f15081-f265-4833-833b-6045a5b66c28.jpg",
    "location": {
      "name": "wework galaxy",
      "address": "wework galaxy, Bangalore"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "678.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Horror Month at BFF - Titane (2021)",
    "url": "https://puttingscene.com/events/1174",
    "startDate": "2025-10-04T19:00:00+05:30",
    "endDate": "2025-10-04T21:00:00+05:30",
    "description": "Titane (2021)\n\nBy Julia Ducournau / 104' / French with Eng subs\n\nFollowing a series of unexplained crimes, a father is reunited with the son who has been missing for 10 years. Titane : A metal highly resistant to heat and corrosion, with high tensile strength alloys. \n\nJulia Ducournau’s Palme d’Or-winner is a jaw-dropping blast of Cronenbergian Body Horror. Conceptually audacious and dripping with insouciant attitude, Titane ignites a Molotov cocktail of gender politics, familial compassion, and female desire.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1174/98b21e5a-b10e-4f3b-bd1e-dd2163a6717d.jpg",
    "location": {
      "name": "Sabha Blr, Kamraj road",
      "address": "Sabha Blr, Kamraj road, Bangalore"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "200.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Film Screening: Pottery House by Mansi Bhatt",
    "url": "https://puttingscene.com/events/1175",
    "startDate": "2025-10-05T17:00:00+05:30",
    "endDate": "2025-10-05T19:00:00+05:30",
    "description": "Join us for a screening of Pottery House by Mansi Bhatt, an experimental film that explores memory, heritage, and architecture through the remains of a demolished home on the Khodiyar Pottery Estate. In this layered journey, Mansi blurs, overlays, and sutures objects and images, reanimating her family’s former house until its curves and textures become tangible once more. The film asks: what happens when a place transforms into a state of irrecognition—or disappears altogether along with the boundaries that once defined it?\n\nFollowing the screening, join architect and theorist Dr. Kaiwan Mehta for a discussion on the idea of Home, between memory and culture. Together, they will reflect on how architecture shapes human experience and the importance of recognising built environments as vessels of history and imagination.\n\nThis programme is presented in celebration of World Architecture Day, 6 October.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1175/55b02569-02b0-4070-bf3d-52acda50c4aa.jpg",
    "location": {
      "name": "Museum of Art & Photography, Ashok Nagar",
      "address": "Museum of Art & Photography, Ashok Nagar, Bangalore",
      "url": "https://maps.app.goo.gl/vT97Kpba2wXZiFof8"
    },
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Family Day",
    "url": "https://puttingscene.com/events/1176",
    "startDate": "2025-10-12T11:00:00+05:30",
    "endDate": "2025-10-12T13:00:00+05:30",
    "description": "They say it takes a village to raise a child. This October, we’re calling that village made up of all the parents, maamas and atthes, daadas and daadis, mom’s best friend and dad’s anna to come over to MAP and celebrate. Bring your children, nieces and nephews, grandkids and godchildren for a fun-filled day of exploration, games, and stories!\n\nFrom exciting quizzes and treasure hunts, to playful walkthroughs of our exhibitions, the day is packed with activities designed especially for children. Pause at special stations to listen, play, and discover together. Wrap up the experience with a delightful theatre performance for young audiences. We’ve got the whole day sorted—all you need is a child (or a few!) to join in. The more, the merrier!",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1176/c67b5484-3322-438a-bec9-2cbc031c618a.jpg",
    "location": {
      "name": "Museum of Art and Photography, Ashok Nagar",
      "address": "Museum of Art and Photography, Ashok Nagar, Bangalore",
      "url": "https://maps.app.goo.gl/87yDTzXihbb6jwfW6"
    },
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Inside-Out Performance: Data-Driven Prep for Your Next Run",
    "url": "https://puttingscene.com/events/1177",
    "startDate": "2025-10-04T23:30:00+05:30",
    "endDate": "2025-10-05T01:30:00+05:30",
    "description": "The thing about running that no one talks about\n\nTwo runners start the same training plan. Same distance, same pace, same dedication. Six months later, one feels stronger than ever. The other constantly asks chatGPT about \"knee pain remedies\" at 2 AM.\n\nWhat's the difference? It's not about talent. And while effort and consistency are important, they're just one part of the whole story.\nThe gap between these two types of runners isn't mysterious once you know what to look for. It's about inside-out performance: understanding what's happening beneath the surface and preparing with the right data.\n\nOn 4th October, learn the science behind fueling, race-day prep & recovery.\n\nAshwin Adiga (Director, NEB | CEO, MySamay & Enerjiva) will walk through a case study on Amar Singh Devanda's path to setting 12 hour & 24 hour National Records \n\nDr Gurmeet Soni Bhalla (Chief Medical Officer, Resolute | Ultra Runner | Completed Marathons across 7 continents & The North Pole!) will be breaking down the science behind fueling, race-day prep & recovery, and using data to unlock your best performance\n\nAnuj Srivastava (Cofounder, Troop HQ | Strength & Mobility coach) will guide you through a hands-on session on runner-specific workouts for long-term overall health\n\nWhether you're running your first 5K or your fiftieth marathon, come learn what makes the difference between runners who thrive and runners who survive.\n\nIncludes: Coffee, Q&As, and 1-on-1s with our experts.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1177/b57eeadf-9d90-405e-8623-edd36d72a852.jpg",
    "location": {
      "name": "Troop HQ",
      "address": "Troop HQ, Bangalore",
      "url": "https://maps.app.goo.gl/aRR4yc6kLc9FU2Rg6"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "499.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Laser Cut Interactive NFC Objects",
    "url": "https://puttingscene.com/events/1185",
    "startDate": "2025-10-04T11:00:00+05:30",
    "endDate": "2025-10-04T13:00:00+05:30",
    "description": "Join us for a fun, beginner-friendly workshop where you’ll design and laser cut your own bookmark, pass, or keychain – and then give it a secret digital twist with NFC. We help you integrate an NFC chip into whatever you make.  Just a tap of your phone will bring your creation to life!\n✨ What you can make:\nA bookmark that starts your reading playlist\nA keychain that instantly shares your Wi-Fi (no typing passwords!)\nA tag that works as a digital business card\nA keepsake that opens a photo album\nA fridge magnet that pulls up your favourite recipe\nAll materials will be provided, except laptop!\n\nGeneral Rules:\n-Ages 14 and above.\n-Please bring your own Laptops (Mac/Windows/Linux is okay)\n-Contact 9845620061 for more details.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1185/1ce014c0-7e7d-4a89-8fce-b08cbc461eec.jpg",
    "location": {
      "name": "Paper Crane Lab",
      "address": "Paper Crane Lab, Bangalore",
      "url": "https://maps.app.goo.gl/Ewg6tjqKcEg8N1Vh8"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "750.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Hydroponics 101",
    "url": "https://puttingscene.com/events/1186",
    "startDate": "2025-10-04T15:00:00+05:30",
    "endDate": "2025-10-04T17:00:00+05:30",
    "description": "Join us for Hydroponics 101, a hands-on urban farming workshop in Bangalore designed for beginners and city dwellers curious about growing their own food. Learn how to grow clean, fresh, pesticide-free vegetables right on your balcony or terrace, no soil needed! This guided session will walk you through hydroponic systems, plant care, nutrient mixing, low-cost hacks for compact urban setups, and more!\n\nAs part of the experience, you’ll also get to taste freshly harvested hydroponic produce and understand the difference clean food makes. All materials will be provided, and participants will receive personalised guidance from our experienced host.\n\nBonus: All attendees go home with a free self-watering plant! 🌱\n\nLimited seats for a more personalized experience. Perfect for beginners, no prior experience needed!\n\nDM us at @urbangronchain for any doubts :)",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1186/fa33d4ff-b91e-46b0-9074-2a1e115a99c2.jpg",
    "location": {
      "name": "Atlantis Sanctuary",
      "address": "Atlantis Sanctuary, Bangalore",
      "url": "https://maps.app.goo.gl/Lzrj9gQV63NRxGSb8"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "800.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Board Games",
    "url": "https://puttingscene.com/events/1188",
    "startDate": "2025-10-04T15:00:00+05:30",
    "endDate": "2025-10-04T17:00:00+05:30",
    "description": "Step away from screens and rediscover the joy of play! 🎲✨\nJoin us at Daak 64, Yelahanka for Digital Detox with Board Games, hosted by The Board Busters.\n\nWhether you’re a beginner or a seasoned gamer, this evening is all about fun, laughter, and connection. Explore 150+ rare and exciting board games, meet new people, and soak in the good vibes. From strategy and mystery to party favorites, there’s something for everyone!\n\n📅 Date: Saturday, October 4th\n🕒 Time: 3:00 PM – 6:00 PM\n🔞 Adults Only (18+)\n\nCome for the games, stay for the memories.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1188/438464e8-22f9-4029-8599-772ee0c06953.jpg",
    "location": {
      "name": "Daak64",
      "address": "Daak64, Bangalore",
      "url": "https://maps.app.goo.gl/ZDBkSrH9eHdpZEiU8"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "286.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Femtech India x Coro: Diwali Gathering",
    "url": "https://puttingscene.com/events/1189",
    "startDate": "2025-10-11T16:00:00+05:30",
    "endDate": "2025-10-11T18:00:00+05:30",
    "description": "Lighting the Way: Women Redefining Wellness & Work\n\nCome celebrate the spirit of Diwali with light, conversations, and community. An intimate evening where women leaders, entrepreneurs, and changemakers come together to share stories, spark connections, and illuminate new paths forward.\n\n✨ What to expect:\n– Warm welcome ritual\n– Panel: “Lighting the Way: Women Building the Future”\n– Conversations on wellness, technology & inclusive workspaces\n– High tea with a festive Indian twist and festive surprises\n\nDress code : Festive & Elegant Indian Wear",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1189/ab283539-e383-4eff-96bc-659d9598136d.jpg",
    "location": {
      "name": "Coro Space, Domlur",
      "address": "Coro Space, Domlur, Bangalore",
      "url": "https://maps.app.goo.gl/j685RCmENPuic4ER6"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "800.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Roll With Our Chef: A Guided Sushi-Making Experience",
    "url": "https://puttingscene.com/events/1200",
    "startDate": "2025-10-04T12:00:00+05:30",
    "endDate": "2025-10-04T14:00:00+05:30",
    "description": "Join us this weekend between 12 PM to 5 PM for a hands-on workshop where our chef takes you through the quiet art of sushi making. From spreading rice to rolling tight, from knife to plate - you’ll savour not just the sushi, but the story in every roll.\n\nOnce your payment is made, our team will reach out within 24 hours to confirm your spot and block your preferred time slot.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1200/d1c4cba5-9b1b-403e-a69e-5b0b63838ac7.jpg",
    "location": {
      "name": "Foodstories, Bangalore",
      "address": "Foodstories, Bangalore, Bangalore",
      "url": "https://maps.app.goo.gl/hZadDqwRRYsHweDo8"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "699.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Roll With Our Chef: A Guided Sushi-Making Experience",
    "url": "https://puttingscene.com/events/1201",
    "startDate": "2025-10-05T12:00:00+05:30",
    "endDate": "2025-10-05T14:00:00+05:30",
    "description": "Join us this weekend between 12 PM to 5 PM for a hands-on workshop where our chef takes you through the quiet art of sushi making. From spreading rice to rolling tight, from knife to plate - you’ll savour not just the sushi, but the story in every roll.\n\nOnce your payment is made, our team will reach out within 24 hours to confirm your spot and block your preferred time slot.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1201/a3a19b14-25f1-4604-8e55-95194c47be0c.jpg",
    "location": {
      "name": "Foodstories, Bangalore",
      "address": "Foodstories, Bangalore, Bangalore",
      "url": "https://maps.app.goo.gl/hZadDqwRRYsHweDo8"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "699.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "SHOW ME FRENCH! - Free French Film Screening",
    "url": "https://puttingscene.com/events/1202",
    "startDate": "2025-10-04T16:00:00+05:30",
    "endDate": "2025-10-04T18:00:00+05:30",
    "description": "🎬 SHOW ME FRENCH! ✨\n\nAF Bangalore invites you to our next film screening: Les 2 Alfred / French Touch by Bruno Podalydès! \n\nUnemployed, Alexandre is desperate to prove he can look after his children. But when a start-up with one strict rule — NO CHILDREN — hires him, he finds himself juggling the impossible. Chaos and hilarity ensue!\n\n🌟 Official Selection at the Cannes Film Festival, this comedy is sure to be a treat!\n\n🗓️ Saturday, 4th October\n🕓 4:00 – 6:00 PM\n📍 Alliance Française Bangalore\n\n🎟️ French with English subs | Free for all \n\n#culturalevents #cineclub",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1202/3d38aff7-c195-4940-9a87-66258a2ab1c5.jpg",
    "location": {
      "name": "Alliance Francaise, Bengaluru",
      "address": "Alliance Francaise, Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/YQFmUXCJdDfYaZaw5"
    },
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Screening: La Dolce Vita (1960)",
    "url": "https://puttingscene.com/events/1203",
    "startDate": "2025-10-04T20:00:00+05:30",
    "endDate": "2025-10-04T22:00:00+05:30",
    "description": "You recommended, and we curated! We're excited to announce the second edition of 'Letters to Cinema' with our inaugural screening!\n\nThe opening film of the curation is also the \"most talked about film in the world\"! Starting off with \"The Classics\", \"La Dolce Vita\" is one of Fellini's essentials, The film follows the life of Marcello, a glitz columnist, struggling between the vapid domesticity of his life, and the glamour of the social elite.\n\nWho are The Parallel Cinema Club?\nWe are a community-run film society based out of Bengaluru and Hyderabad. We are a group of film enthusiasts who meet up to discuss the real world, auteurs, and themes, and occasionally host guest lectures.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1203/a3d737c1-ef59-484f-922a-80bcb95d993c.jpg",
    "location": {
      "name": "Underline Center",
      "address": "Underline Center, Bangalore",
      "url": "https://maps.app.goo.gl/n3QSQMunqsC2eDFr7"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "338.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Riwaayat: The living legend Hariharan",
    "url": "https://puttingscene.com/events/1204",
    "startDate": "2025-10-04T19:30:00+05:30",
    "endDate": "2025-10-04T21:30:00+05:30",
    "description": "A Night of Music, Art & Cocktails Featuring the Living Legend – Hariharan Bengaluru | 2025 Step into an evening where music flows like poetry, art speaks in silence, and every sip tells a story. Riwaayat is more than an event—it’s a sensory journey through melody, mood, and magic. At the heart of this unforgettable night is Padma Shri Hariharan, a name synonymous with timeless ghazals and musical excellence. Witness the maestro live as he brings alive an experience like no other—soulful ghazals, deeply emotive vocals, and a performance that transcends time. Surrounded by an aesthetically immersive setting, curated art, and an atmosphere steeped in elegance, guests will enjoy handcrafted cocktails and refined hospitality—all woven into an intimate, unforgettable evening. Join us for a night where music meets mood, tradition meets contemporary, and every moment resonates with the soul. Riwaayat - Ek Mehfil – A one-of-a-kind ghazal showcase with Hariharan, wrapped in ambiance and elegance.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/03/1759489500584-1759489500500_fs0t0m7vaq.png",
    "location": {
      "name": "Prestige Centre for Performing Arts, Anjanadri Layout",
      "address": "Prestige Centre for Performing Arts, Anjanadri Layout, Bangalore",
      "url": "https://www.google.com/maps/search/?api=1&query=Prestige+Centre+for+Performing+Arts%2C+Silver+Oak+Plantation%2C+25%2C+Mudalappa+St%2C+Anjanadri+Layout%2C+Konanakunte%2C+Bengaluru%2C+Karnataka+560062+India"
    },
    "sameAs": "https://in.bookmyshow.com/events/riwaayat-ek-mehfil-by-the-living-legend/ET00454673",
    "offers": [
      {
        "@type": "Offer",
        "price": "3499.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Little Sounds",
    "url": "https://puttingscene.com/events/1205",
    "startDate": "2025-10-04T19:30:00+05:30",
    "endDate": "2025-10-04T21:30:00+05:30",
    "description": "Little Sounds brings its intimate concert series to the cosy lower space of the Prestige Centre for Performing Arts. This one‑of‑a‑kind series features independent musicians showcasing their original craft in this beautifully warm setting, where audiences will experience some of the coolest artists in the country up close. Artists will not only perform some of their best‑loved music but will also share stories and insights into their world and music. You wouldn't want to miss out on sharing this evening with some connoisseurs of original indie music! Limited seats available Meghana Mokhasi is a pop musician based in Bengaluru. With a distinctive style that focuses on lyrical storytelling, she has been a part of the music scene since 2019. Known for melancholic songwriting accompanied by a chirpy ukulele, Meghana has captivated audiences with her soulful melodies. Galat Admi is a Bangalore‑based Electronic‑Indie artist with a Post‑Punk/Art Rock influence fused with singer‑songwriter elements. The song themes are raw and introspective and the sonic experience fuses Fingerstyle Guitar with moody, atmospheric sounds. The artist is also part of Indie‑Electronic band Droolfox, and has previously released music under the moniker “Grungybob”",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/03/1759489390271-1759489390197_0tjcsv3nyhi.png",
    "location": {
      "name": "Prestige Centre for Performing Arts, Anjanadri Layout",
      "address": "Prestige Centre for Performing Arts, Anjanadri Layout, Bangalore",
      "url": "https://www.google.com/maps/search/?api=1&query=Prestige+Centre+for+Performing+Arts%2C+Silver+Oak+Plantation%2C+25%2C+Mudalappa+St%2C+Anjanadri+Layout%2C+Konanakunte%2C+Bengaluru%2C+Karnataka+560062+India"
    },
    "sameAs": "https://in.bookmyshow.com/events/little-sounds/ET00463174?webview=true",
    "offers": [
      {
        "@type": "Offer",
        "price": "499.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Court Martial",
    "url": "https://puttingscene.com/events/1206",
    "startDate": "2025-10-04T15:30:00+05:30",
    "endDate": "2025-10-04T17:30:00+05:30",
    "description": "Courage, conflict & conscience—Major Puri brings it all in Court Martial. @the_theatrenama presents @priyanka_priyadarshnee as Major Asha Puri in its most celebrated play, COURT MARTIAL. Date- 4th October Time- 3:30pm and 7:30pm Venue- @samarthanam_auditorium. Witness the intense cross-examination and gripping narrative that explores deep societal issues. Introducing Anand Menon in the pivotal role of BD Kapoor! Join us for two shows on: October 4th 3:30 PM & 7:30 PM Samarthanam Auditorium, HSR Layout.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/03/1759489639441-1759489639360_ldevnebf99b.png",
    "location": {
      "name": "Samarthanam Auditorium, HSR Layout",
      "address": "Samarthanam Auditorium, HSR Layout, Bangalore",
      "url": "https://maps.app.goo.gl/wRf4zvdgHDtySH3X9"
    },
    "sameAs": "https://in.bookmyshow.com/plays/court-martial/ET00350001",
    "offers": [
      {
        "@type": "Offer",
        "price": "299.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Book Lamp Making Workshop",
    "url": "https://puttingscene.com/events/1207",
    "startDate": "2025-10-04T15:00:00+05:30",
    "endDate": "2025-10-04T17:00:00+05:30",
    "description": "Celebrate the festival of lights in a uniquely creative way with the 'Turn Books into Glowing Memories' workshop, a special event for Diwali. This workshop invites you to swap screen time for story time and craft your very own beautiful, glowing Book Lamp. With every fold, flip, and sparkle, you will bring a book to life in a new and luminous form. This event offers a mindful and engaging making-experience set within the cozy and inspiring atmosphere of the Atta Galatta bookstore. It's a perfect activity for fostering laughter, bonding, and creativity with family and friends, or for enjoying some soulful 'me-time' amidst the hustle and bustle of the festive season. Immerse yourself in the warm, comforting smell of books as you work on your creation, and feel free to unwind at the adjoining café before or after the session. At the end of the workshop, you will take home your handmade lamp, a unique piece of art to brighten your own space or to give as a thoughtful, handcrafted gift to a loved one. All materials required for the workshop are provided, and the session is beginner-friendly, making it accessible to everyone regardless of their crafting experience. It's a family-friendly and solo-friendly event designed for pure enjoyment.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/03/1759490760215-1759490760184_q0l3jqt7a7.png",
    "location": {
      "name": "Atta Galatta, Indira Nagar",
      "address": "Atta Galatta, Indira Nagar, Bangalore",
      "url": "https://maps.app.goo.gl/yPkXUwSwEv2duyAT9"
    },
    "sameAs": "https://urbanaut.app/spot/turn-books-into-glowing-memories-diwali-special",
    "offers": [
      {
        "@type": "Offer",
        "price": "650.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "A Cheesecake Baking Experience",
    "url": "https://puttingscene.com/events/1208",
    "startDate": "2025-10-04T10:00:00+05:30",
    "endDate": "2025-10-04T12:00:00+05:30",
    "description": "This experience delves into the history of cheesecake from ancient Greece to 19th-century New York, focusing on the iconic Basque cheesecake technique. Participants will learn to bake this rustic, caramelized dessert from scratch, understanding the origins and science behind the ingredients. Each participant will make two 150g cheesecakes. The experience includes tips and techniques for baking, an exclusive recipe PDF, and the opportunity to take home their creations. No eggless options are available. Registration details specify one ticket per participant, with all materials, equipment, and utilities included. Registrations close one hour prior to the start time, subject to availability. Cancellations, refunds, and transfers are subject to their Refund Policy. Contact: hello@troveexperiences.com, +91 82629 16889. The host is Chef ViveQ Pawar, Executive Chef at Roxie.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/03/1759489675520-1759489675343_gjbh3wsmtx.png",
    "location": {
      "name": "Roxie, Sarjapur Road",
      "address": "Roxie, Sarjapur Road, Bangalore",
      "url": "https://maps.app.goo.gl/wmCJfVKhRpbjY6fw8"
    },
    "sameAs": "https://troveexperiences.com/collections/upcoming/products/sweet-surrender-cheesecake-making-in-banagalore",
    "offers": [
      {
        "@type": "Offer",
        "price": "2500.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Candlelight: Tribute to A.R. Rahman",
    "url": "https://puttingscene.com/events/1209",
    "startDate": "2025-10-04T21:00:00+05:30",
    "endDate": "2025-10-04T23:00:00+05:30",
    "description": "Immerse yourself in a mesmerizing tribute to the legendary composer A.R. Rahman, brought to life by the soft glow of candlelight. This unique concert series offers a live, multi-sensory musical experience in the stunning setting of the Hyatt Centric Hebbal Bengaluru. The tentative program features a selection of A.R. Rahman's most iconic compositions, including \"Ghanan Ghanan\" from Lagaan, \"Yeh Haseen Wadiyan/Pudhu Vellai Mazhai\" from Roja, \"Agar Tum Saath Ho\" from Tamasha, and \"Masakali\" from Delhi 6, with the final setlist being subject to change. The performance lasts for 60 minutes. To ensure a seamless experience, doors open 30 minutes before the show begins and close 5 minutes prior to the start, with no late entry allowed. The event is suitable for ages 8 and up, and guests under 16 must be accompanied by an adult. The venue is fully accessible for individuals with wheelchairs. Seating within each purchased zone is allocated on a first-come, first-served basis.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/03/1759489742560-1759489742530_y54u2nbg59q.png",
    "location": {
      "name": "Hyatt Centric Hebbal Bengaluru",
      "address": "Hyatt Centric Hebbal Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/Hq4RVmFeZww4QdS99"
    },
    "sameAs": "https://feverup.com/m/346132",
    "offers": [
      {
        "@type": "Offer",
        "price": "1399.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Math Cafe",
    "url": "https://puttingscene.com/events/1210",
    "startDate": "2025-10-04T15:00:00+05:30",
    "endDate": "2025-10-04T17:00:00+05:30",
    "description": "An evening of Games, Strategy & Aha moments by Career Space Join us for a 3‑hour gamified session where math lovers, puzzle solvers, and curious minds come together to play, solve, and win. You’ll crack puzzles, earn Career Space coins, unlock hints, and compete for medals, all while sipping coffee and having fun. Think of it as India’s version of a brain‑game reality show, but live, interactive, and completely immersive. Whether you love math or fear it, Math Café will make you see numbers in a whole new way.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/03/1759489860083-1759489859984_z1exez89jym.png",
    "location": {
      "name": "Atta Galatta, Indira Nagar",
      "address": "Atta Galatta, Indira Nagar, Bangalore",
      "url": "https://maps.app.goo.gl/yPkXUwSwEv2duyAT9"
    },
    "sameAs": "https://urbanaut.app/spot/math-cafe",
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Enfield Riders Woman Motorcycle Coaching Camp",
    "url": "https://puttingscene.com/events/1211",
    "startDate": "2025-10-04T08:00:00+05:30",
    "endDate": "2025-10-04T10:00:00+05:30",
    "description": "Join the Enfield Riders Woman Motorcycle Coaching Camp, a comprehensive foundation course designed for aspiring female riders in Bangalore. This 12-hour workshop, split over a Saturday and Sunday from 8:00 AM to 2:00 PM, offers a blend of practical and theoretical training. The curriculum covers essential skills including bike orientation, achieving balance, mastering start/stop procedures, riding in 1st and 2nd gear, executing turns, proper use of brakes, kick-starting the motorcycle, parking techniques, and safely lifting a fallen bike. You'll also learn to navigate common road imperfections like potholes. The course ensures personalized attention with a low coach-to-participant ratio of 1:4. All necessary equipment is provided, including a Royal Enfield 350cc or 500cc motorcycle with fuel, and sanitized safety gear such as a helmet, knee guards, and elbow guards. The package also includes breakfast on both days, mineral water during breaks, and a certificate of completion along with merchandise. This workshop is open to individuals aged 18 and above. Please note that while the motorcycles are covered by third-party insurance, participants are responsible for any damage costs. The exact GPS location for the sessions in Koramangala, Whitefield, and Jakkur will be shared via a dedicated WhatsApp group prior to the camp. For registration and further inquiries, you can contact +91 8822 456789.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/03/1759489761291-1759489761268_thybyeatby.png",
    "location": {
      "name": "LVR Residency 1, Koramangala",
      "address": "LVR Residency 1, Koramangala, Bangalore",
      "url": "https://maps.app.goo.gl/dZpPdserRDAc9i418"
    },
    "sameAs": "https://enfieldriders.com/product/motorcycle-coaching-workshop-foundation-bangalore/",
    "offers": [
      {
        "@type": "Offer",
        "price": "8475.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Henrique Camacho live",
    "url": "https://puttingscene.com/events/1212",
    "startDate": "2025-10-04T18:00:00+05:30",
    "endDate": "2025-10-04T20:00:00+05:30",
    "description": "Henrique Camacho brings his psychedelic soundscapes to Bengaluru for an electrifying night at Courtyard by Marriott, Hebbal. On October 4, lose yourself in hypnotic beats, immersive rhythms, and a high-energy vibe as Camacho takes the stage from 6 PM till late. Expect a full-sensory journey crafted for music lovers who thrive on boundary-pushing sounds and unforgettable live energy.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/03/1759490826854-1759490826797_vw6mgkpciir.png",
    "location": {
      "name": "Courtyard by Marriott Bengaluru, Nagavara",
      "address": "Courtyard by Marriott Bengaluru, Nagavara, Bangalore",
      "url": "https://www.google.com/maps/search/?api=1&query=Courtyard+by+Marriott+Bengaluru+Hebbal%2C+No+2%2F55+Outer+Ring+Road%2C+Nagavara%2C+Bengaluru%2C+Karnataka%2C+India+560045"
    },
    "sameAs": "https://sortmyscene.com/event/henrique-camacho-live-in-bangalore-oct-04-2025",
    "offers": [
      {
        "@type": "Offer",
        "price": "949.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Walk Through the Origin: Yelahanka & Kempegowda",
    "url": "https://puttingscene.com/events/1213",
    "startDate": "2025-10-04T07:30:00+05:30",
    "endDate": "2025-10-04T09:30:00+05:30",
    "description": "Step back into the origins of Bengaluru with a heritage walk through Yelahanka, one of the city’s oldest settlements. Led by Bengaluru Prayana and Beyond Visits, this guided trail traces centuries-old streets, temples, and stories tied to Kempegowda and the city’s early growth under the Vijayanagara Empire. From hidden shrines to forgotten lore, the walk uncovers the layers of history that shaped Bengaluru, followed by breakfast to close the morning journey.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/03/1759490857169-1759490856932_b480fl116ol.png",
    "location": {
      "name": "Yelahanka Old Town, Bangalore",
      "address": "Yelahanka Old Town, Bangalore, Bangalore",
      "url": "https://maps.app.goo.gl/1D3GqgSzE9wQzWYg9"
    },
    "sameAs": "https://www.instagram.com/p/DPKwIeCEykJ/",
    "offers": [
      {
        "@type": "Offer",
        "price": "1099.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Music Through Ages",
    "url": "https://puttingscene.com/events/1214",
    "startDate": "2025-10-04T18:30:00+05:30",
    "endDate": "2025-10-04T20:30:00+05:30",
    "description": "Step into a musical time machine with Music Through the Ages, presented by the BSM Voice Department at The Bangalore School of Music. This free concert at the Aruna Sunderlal Auditorium on October 4 takes audiences on a journey from the 1940s to today, featuring timeless classics and contemporary favorites sung by BSM’s talented choir. An evening of nostalgia, harmony, and community spirit, it invites everyone to sing along and celebrate the enduring joy of music across generations.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/03/1759491037382-1759491037326_89e1tlk1t86.png",
    "location": {
      "name": "The Bangalore School of Music",
      "address": "The Bangalore School of Music, Bangalore",
      "url": "https://maps.app.goo.gl/UVpyJXFrWhffhUtf9"
    },
    "sameAs": "https://www.instagram.com/p/DPMHLhFCFHB/",
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Whisper Of the Lake",
    "url": "https://puttingscene.com/events/1215",
    "startDate": "2025-10-04T09:30:00+05:30",
    "endDate": "2025-10-04T11:30:00+05:30",
    "description": "Step into hidden stories on a lakeside walk, discover the tiny lives that thrive at the water’s edge, spark curiosity with art and games, and close the day with a soulful music jam by the lake. A fun day out for kids!\nLittle explorers will get closer to nature by the lake, get messy with creative activities led by The LooRoo Club, and end the morning with a lively darbuka jam by Kadence Xperience. With tasty Lakehouse snacks in between, it’s the perfect mix of play, music, and discovery in the outdoors.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/03/1759491336661-1759491336591_wo7mgufjdv.png",
    "location": {
      "name": "Lakehouse, Restocafe, Hebbal",
      "address": "Lakehouse, Restocafe, Hebbal, Bangalore",
      "url": "https://www.google.com/maps/search/?api=1&query=Lakehouse+RestoCaf%C3%A9+Dr.+Puneet+Rajkumar+Road+Dasarahalli+Village+next+to+Rachenahalli+Lake+Hebbal+Bengaluru+Karnataka+India"
    },
    "sameAs": "https://www.instagram.com/p/DPN5i0rkS7u/?img_index=1",
    "offers": [
      {
        "@type": "Offer",
        "price": "2499.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Wings After Dark",
    "url": "https://puttingscene.com/events/1216",
    "startDate": "2025-10-04T12:00:00+05:30",
    "endDate": "2025-10-04T14:00:00+05:30",
    "description": "Immerse yourself in an overnight forest adventure where the night comes alive! Secretive birds, buzzing insects, and hidden creatures await.\n\nGuided by A Rocha India’s experts, explore trails, spot wildlife, savor local meals, and uncover stories of conservation!",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/03/1759491223460-1759491223417_9uxpgl9ozu8.png",
    "location": {
      "name": "A Rocha India, Bilwaradahalli",
      "address": "A Rocha India, Bilwaradahalli, Bangalore",
      "url": "https://www.google.com/maps/search/?api=1&query=A+Rocha+India+Field+Study+Centre%2C+%2313%2C+Kaserguppe+Village%2C+Bilwardahalli%2C+Bannerghatta+Post%2C+Jigani+Hobli%2C+Anekal+Taluk%2C+Bangalore+South%2C+Karnataka+560083%2C+India"
    },
    "sameAs": "https://www.instagram.com/p/DPLycfyEcCU/?img_index=1",
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Dynamite Disco Club ft. Rafiki + Stalvart John + Priyansha",
    "url": "https://puttingscene.com/events/1217",
    "startDate": "2025-10-04T20:30:00+05:30",
    "endDate": "2025-10-04T22:30:00+05:30",
    "description": "Dynamite Disco Club brings together a night of infectious groove and energetic flair as Rafiki, Stalvart John, and Priyansha take the stage on October 4, 2025. Led by the founder and visionary behind Bengaluru’s renowned Dynamite Disco Club collective, Stalvart John curates a sonic journey that blends disco’s soulful energy with cutting‑edge house ethos. Rafiki adds their unique style to the mix, while Priyansha brings fresh dynamism to the lineup. Expect a dancefloor charged with deep basslines, shimmering synths, and organic instrumentation, all in the spirit of inclusivity and musical craftsmanship that DDC is known for.\n\nThis event continues the collective’s tradition of accessible, authentic dance culture—built on decades of DJ‑led creativity, a thriving mentorship platform, and community‑first gatherings. With tickets priced affordably, attendees can lose themselves in a night of joyous, groove‑driven expression where the past and future of disco and house collide.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/03/1759491254635-1759491254608_h7m13y64f4l.png",
    "location": {
      "name": "The Burrow, Gandhi Nagar",
      "address": "The Burrow, Gandhi Nagar, Bangalore",
      "url": "https://www.google.com/maps/search/?api=1&query=The+Burrow%2C+37%2C+High+Grounds%2C+Crescent+Road%2C+Seshadripuram%2C+Bangalore%2C+Karnataka%2C+India"
    },
    "sameAs": "https://sortmyscene.com/event/dynamite-disco-club-ft-rafiki-stalvart-john-priyansha-oct-04-2025",
    "offers": [
      {
        "@type": "Offer",
        "price": "300.00",
        "priceCurrency": "INR"
      }
    ]
  }
]