[
  {
    "@type": "Event",
    "name": "Sisters & Misters Salsa Workshop",
    "url": "https://puttingscene.com/events/1128",
    "startDate": "2025-10-05T10:00:00+05:30",
    "endDate": "2025-10-05T12:00:00+05:30",
    "description": "Salsa – Beginner Workshop\n\nAlways wanted to try Salsa but didn’t know where to start? This workshop is the perfect first step!\n\nJoin us for a fun session for beginners - no prior dance experience required.\n\nWe’ll guide you through the basics in a relaxed, playful way so you can feel the music, move with confidence, and discover just how fun and easy Salsa really is.\n\nWhat to Expect:\n1. Easy-to-follow salsa steps \n2. Partner rotations so you meet & dance with everyone\n3. Interactive games to learn rhythm & movement\n\nPerfect for:\n    •    Total beginners (no dance background needed)\n    •    Anyone looking to try something new & exciting\n    •    People who love music, movement, and good vibes!\n\nDress code:\n\n1. Wear whatever makes you feel your best and most comfortable - should be easy for you to move around. \n2. ⁠Carry a pair of socks with you - it’ll help with the dancing. You won’t be needing any special footwear for the session.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1128/4ff100eb-d7a4-4485-a723-cc482cdd8f2c.jpg",
    "location": {
      "name": "Palladium Dance Company",
      "address": "Palladium Dance Company, Bangalore",
      "url": "https://www.google.com/maps/search/palladium+dance+koramangala+address/@12.9333372,77.6249957,16z?entry=s&sa=X&ved=1t%3A199789"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "800.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "The Analog Club",
    "url": "https://puttingscene.com/events/1157",
    "startDate": "2025-10-18T15:00:00+05:30",
    "endDate": "2025-10-18T17:00:00+05:30",
    "description": "Step back in time at The Analog Club, an event series by the Studio by Copper + Cloves.\n\nImagine walking into a busy cafe and seeing not a single phone, no-one taking selfies and no one around you scrolling.\n\nDisconnect from devices for 3 hours of unplugged experience—we'll have books, board games, music, crochet, and of course, food! But this isn't about structured activities or organised fun, just genuine connection and relaxation. The event will be fluid- you can dip into activities if you want, or you can just chat to new people or graze at our high tea counter!\n\nMeet new friends, sketch, or read a book in quiet solitude (without being surrounded by people lost in their phones).\n\nWe will not be doing social media on our phones at the event, we will only take photos with a camera.\n\nEmbrace the analog experience, slow down, and reconnect in this crazy digital age!\n\n\nTickets are for entry, all games and art supplies, and unlimited high tea from our renowned deli counter.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1157/e21b60ad-8b16-4abb-8de2-c1aed4c3cdbc.jpg",
    "location": {
      "name": "The studio by copper and cloves",
      "address": "The studio by copper and cloves, Bangalore",
      "url": "https://maps.app.goo.gl/F73vBAC2tSYD43F2A"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "600.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Pint of View (Lecture 6) - Deja Oops: Why Neuroscience Says Your Memory Can’t Be Trusted",
    "url": "https://puttingscene.com/events/1158",
    "startDate": "2025-10-05T16:00:00+05:30",
    "endDate": "2025-10-05T18:00:00+05:30",
    "description": "Welcome to Pint of View – Bangalore's first-ever community where classroom-styled lectures meet craft cocktails in pubs and bars.\n\nIn our sixth lecture, we’re bringing you Dr. Sumyuktha Anand, a neuroscientist and science communicator who calls herself a neuroscience nerd. She has explored everything from addiction and reward circuits to the neuroscience of brain tumors, and while she earned her Ph.D. in Molecular and Cellular Biology, what excites her most is stepping outside the lab to share just how fascinating our brains really are. Passionate about making science accessible, Sumyuktha brings the marvels of neuroscience to non-specialist communities and now, to you — over a pint.\n\nHer talk, Déjà Oops: Why Neuroscience Says Your Memory Can’t Be Trusted, dives into the quirks of memory and the science of neuroplasticity. We like to think of memory as a reliable archive, but the truth is it’s constantly being rewritten, distorted, and reinvented by our brains. Why does this happen? What does it say about how our brains work? And how does this “unreliability” help us more than it harms us?\n\nCome, find out, and bring your questions — from everyday forgetfulness to the bigger mysteries of how memory shapes identity.\n\nAll of this, over Geist beer on tap at Jamming Goat 3.0, Indiranagar! 🍻\n\nWhat to Expect:\n\nA 60-minute lecture on memory, neuroplasticity, and why our brains misremember\n15-20 minutes of interactive Q&A\nOne Geist beer on tap or a mocktail included with your ticket\nA lively mixer to share your insights, laugh over your “oops” moments, and walk away seeing your memory in a whole new way\n\nAbout the Lecturer\n\nDr. Sumyuktha Anand is a neuroscientist and science communicator who has researched topics ranging from addiction and reward circuits to brain tumors. With a Ph.D. in Molecular and Cellular Biology, she is passionate about making brain science fun and accessible beyond academic circles — through teaching, writing, and now, with Pint of View.\n\nAbout Pint of View\n\nInspired by the successful Lectures on Tap community in the U.S., Pint of View brings this format to India for the first time. It’s where big ideas meet bar tables, and where you enjoy a drink in hand while walking out with a new way of seeing the world.\n\nBook now & develop your own pint of view! 🍻",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1158/e17c3e5a-2841-4606-89f3-169176ef39b0.jpg",
    "location": {
      "name": "Jamming Goat 3.0, Indiranagar",
      "address": "Jamming Goat 3.0, Indiranagar, Bangalore",
      "url": "https://maps.app.goo.gl/fsHW9onELE3TwJrB9"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "1100.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Pretzel Making Workshop",
    "url": "https://puttingscene.com/events/1159",
    "startDate": "2025-10-04T15:00:00+05:30",
    "endDate": "2025-10-04T17:00:00+05:30",
    "description": "Pretzel folding...\nThe event will flow in the following manner:\n\n* Brief introduction on pretzel\n* Chef demonstrating the folding procedure\n* Guest replicating the demonstration\n* Pretzels going for baking\n* Guests given warm pretzels.\n\nAll SIS members are eligible for a 10% discount on any purchase at the cafe",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1159/78d22b9f-9b5f-4bd8-bb5e-37609854d39f.jpg",
    "location": {
      "name": "German BrezelHaus - Bakery & Bistro",
      "address": "German BrezelHaus - Bakery & Bistro, Bangalore",
      "url": "https://www.google.com/maps?daddr=Site+No.+626%2C+Binnamangala%2C+Stage+1%2C+Indiranagar%2C+Bengaluru%2C+Karnataka+560038&fb=1&geocode=Kb9R9IKyFa47MQ5Ge3QV9Owx&gl=in&gs_lcrp=EgZjaHJvbWUqBggBEEUYOzIGCAAQRRg5MgYIARBFGDsyBggCEEUYPDIGCAMQRRhBMgYIBBBFGEEyBggFEEUYQTIGCAYQRRhBMgYIBxAuGEDSAQgyODQyajBqMagCALACAA&ie=UTF-8&sa=X&um=1"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "750.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Supper Clubs of India: Sweet Talk with Sakaré",
    "url": "https://puttingscene.com/events/1160",
    "startDate": "2025-10-11T12:30:00+05:30",
    "endDate": "2025-10-11T14:30:00+05:30",
    "description": "Bengaluru Servd and NIC Ice Creams present: Supper Clubs of India - Bengaluru Edition, a series of intimate dining experiences highlighting regional community-style meals and cuisines from across India!\n\nChef Jenny Clinta, founder of one of Bengaluru’s favourite Supper Clubs, Sakaré, is bringing us a pastry-lover’s feast!\n\nStarted in 2024, Sakaré was a way to showcase Chef Jenny’s journey from the Andamans to France where she trained to become a professional pastry chef.\nFor our Supper Club, she’s bringing back her iconic Gajar dessert, her personal favourite- the Tiramisu, her famous Macarons, Apple Tarte Tatin, and many more dishes.\n\nDISCLAIMER: All dishes contain Egg.\n\nThe 7-course tasting menu starts with savouries followed by a palate cleanser as well as two indulgent dishes paired with surprise NIC Ice Creams flavours and petit fours to end the experience.\nThe entire supper is crafted to be perfectly-balanced in its sweetness with ingredients from the Andamans as well such as locally-sourced Pandan and Cinnamon!\n\nAlso enjoy curated cocktails as you dive into the meal.\n\nNOTE: Once tickets are booked, please share your meal preference (Eggetarian or Non-Vegetarian) along with any allergies with us on WhatsApp at 8123265307\n\nJoin us on Saturday, 11th October at Daysie, MG Road.\nLimited seats. Book yours now!\n\nMenu:\nJam and Crust \nFocaccia, Tomato Jam, Garlic Confit Herbed Butter\n\nCourse 1\nIsland Stack \nBlinis, Chammanthi, Spiced Mushroom/Chicken, Chimichurri, Dessicated Coconut\n\nCourse 2\nMom’s Special Banana/Fish Cutlet \nFish Cutlet/Raw Banana Pate, Pain Demi, Banana Flower Salad\n\nCourse 3\nApple Tatin\nApple Tarte Tatin, Poached Apples, Creme Diplomat, Rosemary, Crumble, Cinnamon Wafer Garnish with a surprise NIC Ice Creams flavour\n\nCourse 4\nGajjar \nConfit Gajar, Rabri Mousse, Pistachio Sable\n\nCourse 5\nPetals and Palm\nCoconut Sprout, Candied Rose Petals, Coconut Veil, Tender Coconut Granita, Pickled Cucumber \n\nCourse 6\nSomething Like Tiramisu \nMascarpone Mousse, Coffee Sponge, Cocoa Crumble, Coffee Tuille, Coffee Caviar with a surprise NIC Ice Creams flavour\n\nCourse 7\nPetit Four\nKhara, Lemon Madeleine, Blueberry Cheese Macaron",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1160/c1198f64-6555-47d8-b29f-4ce38ccd4645.jpg",
    "location": {
      "name": "Daysie, MG Road",
      "address": "Daysie, MG Road, Bangalore",
      "url": "https://maps.app.goo.gl/2GTD79hsz7E42UVt9"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "1999.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Book Discussion: Broken Nest and Other Stories",
    "url": "https://puttingscene.com/events/1167",
    "startDate": "2025-10-04T18:00:00+05:30",
    "endDate": "2025-10-04T20:00:00+05:30",
    "description": "Some stories are timeless, returning to us with new meanings each time they are retold. Broken Nest and Other Stories, translated by acclaimed poet Sharmistha Mohanty, brings Rabindranath Tagore’s unforgettable tales into a contemporary voice that resonates with today’s readers. At this special discussion, poet and translator Sharmistha Mohanty will be in conversation with writer and scholar Mani Rao, exploring how translation can revive, reframe, and reimagine Tagore’s narratives for new generations.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1167/3d7572ff-a2cb-4ef0-a033-5523f407c616.jpg",
    "location": {
      "name": "Champaca Bookstore, Vasanthnagar",
      "address": "Champaca Bookstore, Vasanthnagar, Bangalore",
      "url": "https://maps.app.goo.gl/ZczKbdKsR5AuCvkC9"
    },
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Bars From Far",
    "url": "https://puttingscene.com/events/1168",
    "startDate": "2025-10-10T17:30:00+05:30",
    "endDate": "2025-10-10T19:30:00+05:30",
    "description": "A cocktail festival that brings 9 of the best bars and bartenders from India, under one roof. Bars From Far by Greater Than Gin is back in Bangalore for its second edition.\n\nWhat can you expect? Great cocktails, food pop-ups, and a fantastic music lineup featuring electronic, disco, afro, and house genres.\n\nExperience a selection of the best bars from Goa, Mumbai, Pune, Delhi, Hyderabad, Kolkata, Jaipur and Chandigarh, alongside Nao Spirits’ very own MTW Bar and Toasties.\n\nBFF is where you'll find the best bartenders stirring up the best cocktails by some of the best bars from across the country, but without leaving your city.\n\nIt's a bar crawl, but without the crawl. So mark your calendars and bring your BFF along to our BFF!",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1168/fffd9033-1681-4d27-9481-5461e74d81af.jpg",
    "location": {
      "name": "wework galaxy",
      "address": "wework galaxy, Bangalore"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "678.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Bars From Far - Day 2",
    "url": "https://puttingscene.com/events/1169",
    "startDate": "2025-10-11T17:30:00+05:30",
    "endDate": "2025-10-11T19:30:00+05:30",
    "description": "A cocktail festival that brings 9 of the best bars and bartenders from India, under one roof. Bars From Far by Greater Than Gin is back in Bangalore for its second edition.\nWhat can you expect? Great cocktails, food pop-ups, and a fantastic music lineup featuring electronic, disco, afro, and house genres.\nExperience a selection of the best bars from Goa, Mumbai, Pune, Delhi, Hyderabad, Kolkata, Jaipur and Chandigarh, alongside Nao Spirits’ very own MTW Bar and Toasties.\nBFF is where you'll find the best bartenders stirring up the best cocktails by some of the best bars from across the country, but without leaving your city.\nIt's a bar crawl, but without the crawl. So mark your calendars and bring your BFF along to our BFF!",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1169/f5f15081-f265-4833-833b-6045a5b66c28.jpg",
    "location": {
      "name": "wework galaxy",
      "address": "wework galaxy, Bangalore"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "678.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Horror Month at BFF - Titane",
    "url": "https://puttingscene.com/events/1174",
    "startDate": "2025-10-04T19:00:00+05:30",
    "endDate": "2025-10-04T21:00:00+05:30",
    "description": "Titane (2021)\n\nBy Julia Ducournau / 104' / French with Eng subs\n\nFollowing a series of unexplained crimes, a father is reunited with the son who has been missing for 10 years. Titane : A metal highly resistant to heat and corrosion, with high tensile strength alloys. \n\nJulia Ducournau’s Palme d’Or-winner is a jaw-dropping blast of Cronenbergian Body Horror. Conceptually audacious and dripping with insouciant attitude, Titane ignites a Molotov cocktail of gender politics, familial compassion, and female desire.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1174/98b21e5a-b10e-4f3b-bd1e-dd2163a6717d.jpg",
    "location": {
      "name": "Sabha Blr, Kamraj road",
      "address": "Sabha Blr, Kamraj road, Bangalore"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "200.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Film Screening: Pottery House by Mansi Bhatt",
    "url": "https://puttingscene.com/events/1175",
    "startDate": "2025-10-05T17:00:00+05:30",
    "endDate": "2025-10-05T19:00:00+05:30",
    "description": "Join us for a screening of Pottery House by Mansi Bhatt, an experimental film that explores memory, heritage, and architecture through the remains of a demolished home on the Khodiyar Pottery Estate. In this layered journey, Mansi blurs, overlays, and sutures objects and images, reanimating her family’s former house until its curves and textures become tangible once more. The film asks: what happens when a place transforms into a state of irrecognition—or disappears altogether along with the boundaries that once defined it?\n\nFollowing the screening, join architect and theorist Dr. Kaiwan Mehta for a discussion on the idea of Home, between memory and culture. Together, they will reflect on how architecture shapes human experience and the importance of recognising built environments as vessels of history and imagination.\n\nThis programme is presented in celebration of World Architecture Day, 6 October.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1175/55b02569-02b0-4070-bf3d-52acda50c4aa.jpg",
    "location": {
      "name": "Museum of Art & Photography, Ashok Nagar",
      "address": "Museum of Art & Photography, Ashok Nagar, Bangalore",
      "url": "https://maps.app.goo.gl/vT97Kpba2wXZiFof8"
    },
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Family Day",
    "url": "https://puttingscene.com/events/1176",
    "startDate": "2025-10-12T11:00:00+05:30",
    "endDate": "2025-10-12T13:00:00+05:30",
    "description": "They say it takes a village to raise a child. This October, we’re calling that village made up of all the parents, maamas and atthes, daadas and daadis, mom’s best friend and dad’s anna to come over to MAP and celebrate. Bring your children, nieces and nephews, grandkids and godchildren for a fun-filled day of exploration, games, and stories!\n\nFrom exciting quizzes and treasure hunts, to playful walkthroughs of our exhibitions, the day is packed with activities designed especially for children. Pause at special stations to listen, play, and discover together. Wrap up the experience with a delightful theatre performance for young audiences. We’ve got the whole day sorted—all you need is a child (or a few!) to join in. The more, the merrier!",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1176/c67b5484-3322-438a-bec9-2cbc031c618a.jpg",
    "location": {
      "name": "Museum of Art and Photography, Ashok Nagar",
      "address": "Museum of Art and Photography, Ashok Nagar, Bangalore",
      "url": "https://maps.app.goo.gl/87yDTzXihbb6jwfW6"
    },
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Inside-Out Performance: Data-Driven Prep for Your Next Run",
    "url": "https://puttingscene.com/events/1177",
    "startDate": "2025-10-04T23:30:00+05:30",
    "endDate": "2025-10-05T01:30:00+05:30",
    "description": "The thing about running that no one talks about\n\nTwo runners start the same training plan. Same distance, same pace, same dedication. Six months later, one feels stronger than ever. The other constantly asks chatGPT about \"knee pain remedies\" at 2 AM.\n\nWhat's the difference? It's not about talent. And while effort and consistency are important, they're just one part of the whole story.\nThe gap between these two types of runners isn't mysterious once you know what to look for. It's about inside-out performance: understanding what's happening beneath the surface and preparing with the right data.\n\nOn 4th October, learn the science behind fueling, race-day prep & recovery.\n\nAshwin Adiga (Director, NEB | CEO, MySamay & Enerjiva) will walk through a case study on Amar Singh Devanda's path to setting 12 hour & 24 hour National Records \n\nDr Gurmeet Soni Bhalla (Chief Medical Officer, Resolute | Ultra Runner | Completed Marathons across 7 continents & The North Pole!) will be breaking down the science behind fueling, race-day prep & recovery, and using data to unlock your best performance\n\nAnuj Srivastava (Cofounder, Troop HQ | Strength & Mobility coach) will guide you through a hands-on session on runner-specific workouts for long-term overall health\n\nWhether you're running your first 5K or your fiftieth marathon, come learn what makes the difference between runners who thrive and runners who survive.\n\nIncludes: Coffee, Q&As, and 1-on-1s with our experts.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1177/b57eeadf-9d90-405e-8623-edd36d72a852.jpg",
    "location": {
      "name": "Troop HQ",
      "address": "Troop HQ, Bangalore",
      "url": "https://maps.app.goo.gl/aRR4yc6kLc9FU2Rg6"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "499.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Laser Cut Interactive NFC Objects",
    "url": "https://puttingscene.com/events/1185",
    "startDate": "2025-10-04T11:00:00+05:30",
    "endDate": "2025-10-04T13:00:00+05:30",
    "description": "Join us for a fun, beginner-friendly workshop where you’ll design and laser cut your own bookmark, pass, or keychain – and then give it a secret digital twist with NFC. We help you integrate an NFC chip into whatever you make.  Just a tap of your phone will bring your creation to life!\n✨ What you can make:\nA bookmark that starts your reading playlist\nA keychain that instantly shares your Wi-Fi (no typing passwords!)\nA tag that works as a digital business card\nA keepsake that opens a photo album\nA fridge magnet that pulls up your favourite recipe\nAll materials will be provided, except laptop!\n\nGeneral Rules:\n-Ages 14 and above.\n-Please bring your own Laptops (Mac/Windows/Linux is okay)\n-Contact 9845620061 for more details.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1185/1ce014c0-7e7d-4a89-8fce-b08cbc461eec.jpg",
    "location": {
      "name": "Paper Crane Lab",
      "address": "Paper Crane Lab, Bangalore",
      "url": "https://maps.app.goo.gl/Ewg6tjqKcEg8N1Vh8"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "750.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Hydroponics 101",
    "url": "https://puttingscene.com/events/1186",
    "startDate": "2025-10-04T15:00:00+05:30",
    "endDate": "2025-10-04T17:00:00+05:30",
    "description": "Join us for Hydroponics 101, a hands-on urban farming workshop in Bangalore designed for beginners and city dwellers curious about growing their own food. Learn how to grow clean, fresh, pesticide-free vegetables right on your balcony or terrace, no soil needed! This guided session will walk you through hydroponic systems, plant care, nutrient mixing, low-cost hacks for compact urban setups, and more!\n\nAs part of the experience, you’ll also get to taste freshly harvested hydroponic produce and understand the difference clean food makes. All materials will be provided, and participants will receive personalised guidance from our experienced host.\n\nBonus: All attendees go home with a free self-watering plant! 🌱\n\nLimited seats for a more personalized experience. Perfect for beginners, no prior experience needed!\n\nDM us at @urbangronchain for any doubts :)",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1186/fa33d4ff-b91e-46b0-9074-2a1e115a99c2.jpg",
    "location": {
      "name": "Atlantis Sanctuary",
      "address": "Atlantis Sanctuary, Bangalore",
      "url": "https://maps.app.goo.gl/Lzrj9gQV63NRxGSb8"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "800.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Beyond the Mic",
    "url": "https://puttingscene.com/events/1187",
    "startDate": "2025-10-03T18:00:00+05:30",
    "endDate": "2025-10-03T20:00:00+05:30",
    "description": "Beyond the Mic – Episode 1 at Daak.64 on 3rd October 2025 is a stage for every voice and every form of creativity. Unlike typical open mics, this evening embraces all styles—music, poetry, comedy, storytelling, dance, or fusion acts—welcoming both beginners and seasoned performers. The event is about expression without judgment, encouraging participants to share their talent in a warm, inclusive space. With Daak.64’s artistic ambiance, the audience becomes part of the performance, creating a vibrant community of stories and sounds. Beyond the Mic is more than an event—it’s a movement that celebrates courage, connection, and creativity.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1187/5c215aba-247a-4718-868d-e3c98885f879.jpg",
    "location": {
      "name": "Daak64",
      "address": "Daak64, Bangalore",
      "url": "https://maps.app.goo.gl/ZDBkSrH9eHdpZEiU8"
    },
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Board Games",
    "url": "https://puttingscene.com/events/1188",
    "startDate": "2025-10-04T15:00:00+05:30",
    "endDate": "2025-10-04T17:00:00+05:30",
    "description": "Step away from screens and rediscover the joy of play! 🎲✨\nJoin us at Daak 64, Yelahanka for Digital Detox with Board Games, hosted by The Board Busters.\n\nWhether you’re a beginner or a seasoned gamer, this evening is all about fun, laughter, and connection. Explore 150+ rare and exciting board games, meet new people, and soak in the good vibes. From strategy and mystery to party favorites, there’s something for everyone!\n\n📅 Date: Saturday, October 4th\n🕒 Time: 3:00 PM – 6:00 PM\n🔞 Adults Only (18+)\n\nCome for the games, stay for the memories.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1188/438464e8-22f9-4029-8599-772ee0c06953.jpg",
    "location": {
      "name": "Daak64",
      "address": "Daak64, Bangalore",
      "url": "https://maps.app.goo.gl/ZDBkSrH9eHdpZEiU8"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "286.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Femtech India x Coro: Diwali Gathering",
    "url": "https://puttingscene.com/events/1189",
    "startDate": "2025-10-11T16:00:00+05:30",
    "endDate": "2025-10-11T18:00:00+05:30",
    "description": "Lighting the Way: Women Redefining Wellness & Work\n\nCome celebrate the spirit of Diwali with light, conversations, and community. An intimate evening where women leaders, entrepreneurs, and changemakers come together to share stories, spark connections, and illuminate new paths forward.\n\n✨ What to expect:\n– Warm welcome ritual\n– Panel: “Lighting the Way: Women Building the Future”\n– Conversations on wellness, technology & inclusive workspaces\n– High tea with a festive Indian twist and festive surprises\n\nDress code : Festive & Elegant Indian Wear",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1189/ab283539-e383-4eff-96bc-659d9598136d.jpg",
    "location": {
      "name": "Coro Space, Domlur",
      "address": "Coro Space, Domlur, Bangalore",
      "url": "https://maps.app.goo.gl/j685RCmENPuic4ER6"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "800.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Tradition Transitions",
    "url": "https://puttingscene.com/events/1190",
    "startDate": "2025-10-03T11:00:00+05:30",
    "endDate": "2025-10-03T13:00:00+05:30",
    "description": "The group show Traditions | Transitions brings together works by Mainaz Bano, Madan Meena, and Veentia Chendvankar, exploring the balance between tradition and contemporary expression. With refined draftsmanship, spatial harmony, and layered symbolism, the exhibition reflects on intentionality and aesthetic shifts in modern Indian art. On view at KYNKYNY Art Gallery until October 25.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/02/1759407856650-1759407856611_xm9s9r925y.png",
    "location": {
      "name": "KYNKYNY Art Gallery",
      "address": "KYNKYNY Art Gallery, Bangalore",
      "url": "https://maps.app.goo.gl/X5ZpX7EauPSecm6Q6"
    },
    "sameAs": "https://www.instagram.com/p/DPGj1kJkq81/?img_index=1",
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Meenakari & Fusions",
    "url": "https://puttingscene.com/events/1191",
    "startDate": "2025-10-03T12:15:00+05:30",
    "endDate": "2025-10-03T14:15:00+05:30",
    "description": "Learn the intricate art of Rajasthani-style Meenakari at this hands-on workshop, where you’ll create your own fusion piece step by step. From selecting designs to layering colors and patterns, participants will craft a decorative artwork to take home—blending tradition with personal creativity.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/02/1759408351896-1759408351863_z5q7ib2sn.png",
    "location": {
      "name": "Studio Pepperfry, Indiranagar",
      "address": "Studio Pepperfry, Indiranagar, Bangalore",
      "url": "https://www.google.com/maps/search/?api=1&query=Pepperfry+Studio%2C+No.+1200%2C+Ground+Floor%2C+100+Feet+Road%2C+HAL+2nd+Stage%2C+Doopanahalli%2C+Indiranagar%2C+Bengaluru%2C+Karnataka+560038%2C+India"
    },
    "sameAs": "https://www.instagram.com/p/DPRaJGgE3Rb/",
    "offers": [
      {
        "@type": "Offer",
        "price": "2990.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Sky Observation Programme",
    "url": "https://puttingscene.com/events/1192",
    "startDate": "2025-10-03T18:30:00+05:30",
    "endDate": "2025-10-03T20:30:00+05:30",
    "description": "Sky Observation Programme invites visitors to peer through telescopes and explore the night sky above Bangalore. Open to all, the hour-long session (6:30–7:30 pm) offers a guided look at celestial bodies, making astronomy accessible in the heart of the city.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/02/1759407897136-1759407897103_81vasxfxckf.png",
    "location": {
      "name": "Visvesvaraya Industrial & Technological Museum, Kasturba Road",
      "address": "Visvesvaraya Industrial & Technological Museum, Kasturba Road, Bangalore",
      "url": "https://www.google.com/maps/search/?api=1&query=Visvesvaraya+Industrial+%26+Technological+Museum%2C+5216+Kasturba+Road%2C+Ambedkar+Veedhi%2C+Bengaluru%2C+Karnataka+560001%2C+India"
    },
    "sameAs": "https://www.vismuseum.gov.in/sky-observation-programme.php",
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "A Night of Jazz",
    "url": "https://puttingscene.com/events/1193",
    "startDate": "2025-10-03T19:00:00+05:30",
    "endDate": "2025-10-03T21:00:00+05:30",
    "description": "Experience 'A Night of Jazz' featuring the acclaimed Pune Jazz Project, led by the talented pianist Ison Nesamony. This event promises an unforgettable evening filled with a diverse range of musical styles, including classic Jazz standards, groovy Funk, smooth RnB, and vibrant Gypsy jazz. The band is known for its dynamic performances and has graced the stages of numerous festivals, captivating audiences with their improvisational skills and original compositions. Prepare to be mesmerized by the intricate melodies and rhythmic complexities as the musicians create a unique and spontaneous musical journey. The venue provides an intimate setting perfect for enjoying the sophisticated sounds of live jazz. It is recommended to arrive early to secure a good spot and settle in before the performance begins. Please be aware of the ticketing policies and the venue's assumption-of-risk guidelines. This event is a must-attend for all jazz enthusiasts and anyone looking for a high-quality musical experience in the heart of Bengaluru. The performance will showcase the synergy of the ensemble, highlighting their individual talents while creating a cohesive and powerful sound that will resonate with listeners long after the night is over. Don't miss this opportunity to witness a top-tier jazz performance.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/02/1759408118046-1759408118006_t0br4u5us7.png",
    "location": {
      "name": "Sabha Blr, 262 Kamaraj Road",
      "address": "Sabha Blr, 262 Kamaraj Road, Bangalore",
      "url": "https://maps.app.goo.gl/K7zsJqDtFFj2raci7"
    },
    "sameAs": "https://www.skillboxes.com/events/a-night-of-jazz",
    "offers": [
      {
        "@type": "Offer",
        "price": "499.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Kanakavalli Returns",
    "url": "https://puttingscene.com/events/1194",
    "startDate": "2025-10-03T10:00:00+05:30",
    "endDate": "2025-10-03T12:00:00+05:30",
    "description": "This event is an exhibition and sale of Kanjivaram silk saris by Kanakavalli at the Raintree Store in Bengaluru. The collection features a wide range of handwoven silks, catering to various tastes and occasions. The showcase includes exquisite heirloom and bridal Kanjivarams, known for their intricate designs, rich colors, and pure zari work, making them a centerpiece for weddings and grand celebrations. Alongside these opulent pieces, the exhibition also presents a selection of silks suitable for everyday elegance, allowing patrons to incorporate the timeless beauty of Kanjivaram into their daily wardrobe. The event provides an opportunity for connoisseurs and enthusiasts of fine textiles to explore and acquire authentic, handcrafted saris directly from a renowned name in the industry. Please note, the provided information was not sufficient to generate a description of over 200 words.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/02/1759408271135-1759408271104_ytwyimqlth.png",
    "location": {
      "name": "Raintree Store, Sankey Road",
      "address": "Raintree Store, Sankey Road, Bangalore",
      "url": "https://maps.app.goo.gl/t3KFrfnDLJPetGby7"
    },
    "sameAs": "https://allevents.in/bangalore/kanakavalli-returns-to-bengaluru/200028941026003",
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Tum Se Hi choreography workshop",
    "url": "https://puttingscene.com/events/1195",
    "startDate": "2025-10-03T19:00:00+05:30",
    "endDate": "2025-10-03T21:00:00+05:30",
    "description": "Choreographers Gaurav and Xana return to Bangalore with a special workshop on the much-loved “Tum Se Hi.” Designed for dancers of all levels, the two-hour session will guide participants through steps, flow, and performance style, making it a chance to learn, connect, and dance to one of Bollywood’s most iconic tracks.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/02/1759408221963-1759408221933_s2gf86kxskf.png",
    "location": {
      "name": "Treehouse, Indiranagar",
      "address": "Treehouse, Indiranagar, Bangalore",
      "url": "https://maps.app.goo.gl/yKxuuAehK2X1YxT87?g_st=ipc"
    },
    "sameAs": "https://www.instagram.com/p/DPEnFCoD2UT/",
    "offers": [
      {
        "@type": "Offer",
        "price": "999.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "SOI Chamber Orchestra",
    "url": "https://puttingscene.com/events/1196",
    "startDate": "2025-10-03T19:30:00+05:30",
    "endDate": "2025-10-03T21:30:00+05:30",
    "description": "The SOI Chamber Orchestra brings an evening of classical brilliance to Ranga Shankara with a programme spanning Vivaldi’s Concerto for Strings, Haydn’s Cello Concerto No.1, Beliczay’s Serenade for Strings, Strauss’s Egyptian March, and Brahms’s Hungarian Dances. Blending Baroque sparkle with Romantic elegance and folk-inflected energy, the concert offers a vibrant journey across centuries of music.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/02/1759408565259-1759408565223_5u78vvkyfpf.png",
    "location": {
      "name": "Ranga shankara",
      "address": "Ranga shankara, Bangalore",
      "url": "https://maps.app.goo.gl/Wjoid7E1VFA4r3L89"
    },
    "sameAs": "https://www.instagram.com/p/DPS1p07E_ZE/",
    "offers": [
      {
        "@type": "Offer",
        "price": "500.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Afro Station",
    "url": "https://puttingscene.com/events/1197",
    "startDate": "2025-10-03T18:00:00+05:30",
    "endDate": "2025-10-03T20:00:00+05:30",
    "description": "Afro Station lands in Bangalore this October with a three-day celebration of Afro dance and culture. Powered by ARDS India and AfroNtal, the festival features workshops, choreography competitions, panel discussions, and a high-energy after party. Bringing together dancers, creators, and community voices, it’s an invitation to connect, learn, and celebrate Afro rhythms in the city.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/02/1759408720757-1759408720720_9sq3i6ybd6m.png",
    "location": {
      "name": "ARDSindia, Indiranagar",
      "address": "ARDSindia, Indiranagar, Bangalore",
      "url": "https://maps.app.goo.gl/SnMZmgpkP6e2R9BP8"
    },
    "sameAs": "https://www.instagram.com/p/DNfq-QUzg82/?img_index=1",
    "offers": [
      {
        "@type": "Offer",
        "price": "1200.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "The Chimeric Concoction",
    "url": "https://puttingscene.com/events/1198",
    "startDate": "2025-10-03T10:00:00+05:30",
    "endDate": "2025-10-03T12:00:00+05:30",
    "description": "Artist Aparna Rajapandian presents The Chimeric Concoction at Art Houz, a fundraising exhibition where a share of proceeds supports CARE (Charlie’s Animal Rescue Centre). On view from October 3–5, the show blends creativity with compassion, spotlighting Aparna’s expressive works while raising awareness for the plight of abandoned animals.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/02/1759408773932-1759408773894_75w91pyuibt.png",
    "location": {
      "name": "Art Houz, Vasanth Nagar",
      "address": "Art Houz, Vasanth Nagar, Bangalore",
      "url": "https://www.google.com/maps/search/?api=1&query=Art+Houz%2C+No.+63%2C+Palace+Road%2C+Abshot+Layout%2C+Vasanth+Nagar%2C+Bengaluru+560052+India"
    },
    "sameAs": "https://www.instagram.com/p/DO51cbfAcDv/",
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Kaṇa x Ela Matcha pop-up",
    "url": "https://puttingscene.com/events/1199",
    "startDate": "2025-10-03T10:00:00+05:30",
    "endDate": "2025-10-03T12:00:00+05:30",
    "description": "Kana teams up with Ela Matcha for a breakfast pop-up on October 3, serving creamy lattes, berry matcha, and breakfast plates crafted to highlight the elegance of matcha. Running 10 am–2 pm, the event offers a chance to sip, savor, and ease into the weekend with fresh flavors and mindful mornings.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/02/1759408773932-1759408773894_75w91pyuibt.png",
    "location": {
      "name": "Kana by Coffee Mechanics, Hennur",
      "address": "Kana by Coffee Mechanics, Hennur, Bangalore",
      "url": "https://www.google.com/maps/search/?api=1&query=Kana+by+Coffee+Mechanics%2C+Punappa+Layout%2C+Hennur+Gardens%2C+Bengaluru%2C+Karnataka+560043%2C+India"
    },
    "sameAs": "https://www.instagram.com/p/DPOpR5yAaY4/",
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Roll With Our Chef: A Guided Sushi-Making Experience",
    "url": "https://puttingscene.com/events/1200",
    "startDate": "2025-10-04T12:00:00+05:30",
    "endDate": "2025-10-04T14:00:00+05:30",
    "description": "Join us this weekend between 12 PM to 5 PM for a hands-on workshop where our chef takes you through the quiet art of sushi making. From spreading rice to rolling tight, from knife to plate - you’ll savour not just the sushi, but the story in every roll.\n\nOnce your payment is made, our team will reach out within 24 hours to confirm your spot and block your preferred time slot.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1200/d1c4cba5-9b1b-403e-a69e-5b0b63838ac7.jpg",
    "location": {
      "name": "Foodstories, Bangalore",
      "address": "Foodstories, Bangalore, Bangalore",
      "url": "https://maps.app.goo.gl/hZadDqwRRYsHweDo8"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "699.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Roll With Our Chef: A Guided Sushi-Making Experience",
    "url": "https://puttingscene.com/events/1201",
    "startDate": "2025-10-05T12:00:00+05:30",
    "endDate": "2025-10-05T14:00:00+05:30",
    "description": "Join us this weekend between 12 PM to 5 PM for a hands-on workshop where our chef takes you through the quiet art of sushi making. From spreading rice to rolling tight, from knife to plate - you’ll savour not just the sushi, but the story in every roll.\n\nOnce your payment is made, our team will reach out within 24 hours to confirm your spot and block your preferred time slot.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1201/a3a19b14-25f1-4604-8e55-95194c47be0c.jpg",
    "location": {
      "name": "Foodstories, Bangalore",
      "address": "Foodstories, Bangalore, Bangalore",
      "url": "https://maps.app.goo.gl/hZadDqwRRYsHweDo8"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "699.00",
        "priceCurrency": "INR"
      }
    ]
  }
]