[
  {
    "@type": "Event",
    "name": "The Analog Club",
    "url": "https://puttingscene.com/events/1157",
    "startDate": "2025-10-18T15:00:00+05:30",
    "endDate": "2025-10-18T17:00:00+05:30",
    "description": "Step back in time at The Analog Club, an event series by the Studio by Copper + Cloves.\n\nImagine walking into a busy cafe and seeing not a single phone, no-one taking selfies and no one around you scrolling.\n\nDisconnect from devices for 3 hours of unplugged experience—we'll have books, board games, music, crochet, and of course, food! But this isn't about structured activities or organised fun, just genuine connection and relaxation. The event will be fluid- you can dip into activities if you want, or you can just chat to new people or graze at our high tea counter!\n\nMeet new friends, sketch, or read a book in quiet solitude (without being surrounded by people lost in their phones).\n\nWe will not be doing social media on our phones at the event, we will only take photos with a camera.\n\nEmbrace the analog experience, slow down, and reconnect in this crazy digital age!\n\n\nTickets are for entry, all games and art supplies, and unlimited high tea from our renowned deli counter.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1157/e21b60ad-8b16-4abb-8de2-c1aed4c3cdbc.jpg",
    "location": {
      "name": "The studio by copper and cloves",
      "address": "The studio by copper and cloves, Bangalore",
      "url": "https://maps.app.goo.gl/F73vBAC2tSYD43F2A"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "600.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Pint of View (Lecture 6) - Deja Oops: Why Neuroscience Says Your Memory Can’t Be Trusted",
    "url": "https://puttingscene.com/events/1158",
    "startDate": "2025-10-05T16:00:00+05:30",
    "endDate": "2025-10-05T18:00:00+05:30",
    "description": "Welcome to Pint of View – Bangalore's first-ever community where classroom-styled lectures meet craft cocktails in pubs and bars.\n\nIn our sixth lecture, we’re bringing you Dr. Sumyuktha Anand, a neuroscientist and science communicator who calls herself a neuroscience nerd. She has explored everything from addiction and reward circuits to the neuroscience of brain tumors, and while she earned her Ph.D. in Molecular and Cellular Biology, what excites her most is stepping outside the lab to share just how fascinating our brains really are. Passionate about making science accessible, Sumyuktha brings the marvels of neuroscience to non-specialist communities and now, to you — over a pint.\n\nHer talk, Déjà Oops: Why Neuroscience Says Your Memory Can’t Be Trusted, dives into the quirks of memory and the science of neuroplasticity. We like to think of memory as a reliable archive, but the truth is it’s constantly being rewritten, distorted, and reinvented by our brains. Why does this happen? What does it say about how our brains work? And how does this “unreliability” help us more than it harms us?\n\nCome, find out, and bring your questions — from everyday forgetfulness to the bigger mysteries of how memory shapes identity.\n\nAll of this, over Geist beer on tap at Jamming Goat 3.0, Indiranagar! 🍻\n\nWhat to Expect:\n\nA 60-minute lecture on memory, neuroplasticity, and why our brains misremember\n15-20 minutes of interactive Q&A\nOne Geist beer on tap or a mocktail included with your ticket\nA lively mixer to share your insights, laugh over your “oops” moments, and walk away seeing your memory in a whole new way\n\nAbout the Lecturer\n\nDr. Sumyuktha Anand is a neuroscientist and science communicator who has researched topics ranging from addiction and reward circuits to brain tumors. With a Ph.D. in Molecular and Cellular Biology, she is passionate about making brain science fun and accessible beyond academic circles — through teaching, writing, and now, with Pint of View.\n\nAbout Pint of View\n\nInspired by the successful Lectures on Tap community in the U.S., Pint of View brings this format to India for the first time. It’s where big ideas meet bar tables, and where you enjoy a drink in hand while walking out with a new way of seeing the world.\n\nBook now & develop your own pint of view! 🍻",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1158/e17c3e5a-2841-4606-89f3-169176ef39b0.jpg",
    "location": {
      "name": "Jamming Goat 3.0, Indiranagar",
      "address": "Jamming Goat 3.0, Indiranagar, Bangalore",
      "url": "https://maps.app.goo.gl/fsHW9onELE3TwJrB9"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Supper Clubs of India: Sweet Talk with Sakaré",
    "url": "https://puttingscene.com/events/1160",
    "startDate": "2025-10-11T12:30:00+05:30",
    "endDate": "2025-10-11T14:30:00+05:30",
    "description": "Bengaluru Servd and NIC Ice Creams present: Supper Clubs of India - Bengaluru Edition, a series of intimate dining experiences highlighting regional community-style meals and cuisines from across India!\n\nChef Jenny Clinta, founder of one of Bengaluru’s favourite Supper Clubs, Sakaré, is bringing us a pastry-lover’s feast!\n\nStarted in 2024, Sakaré was a way to showcase Chef Jenny’s journey from the Andamans to France where she trained to become a professional pastry chef.\nFor our Supper Club, she’s bringing back her iconic Gajar dessert, her personal favourite- the Tiramisu, her famous Macarons, Apple Tarte Tatin, and many more dishes.\n\nDISCLAIMER: All dishes contain Egg.\n\nThe 7-course tasting menu starts with savouries followed by a palate cleanser as well as two indulgent dishes paired with surprise NIC Ice Creams flavours and petit fours to end the experience.\nThe entire supper is crafted to be perfectly-balanced in its sweetness with ingredients from the Andamans as well such as locally-sourced Pandan and Cinnamon!\n\nAlso enjoy curated cocktails as you dive into the meal.\n\nNOTE: Once tickets are booked, please share your meal preference (Eggetarian or Non-Vegetarian) along with any allergies with us on WhatsApp at 8123265307\n\nJoin us on Saturday, 11th October at Daysie, MG Road.\nLimited seats. Book yours now!\n\nMenu:\nJam and Crust \nFocaccia, Tomato Jam, Garlic Confit Herbed Butter\n\nCourse 1\nIsland Stack \nBlinis, Chammanthi, Spiced Mushroom/Chicken, Chimichurri, Dessicated Coconut\n\nCourse 2\nMom’s Special Banana/Fish Cutlet \nFish Cutlet/Raw Banana Pate, Pain Demi, Banana Flower Salad\n\nCourse 3\nApple Tatin\nApple Tarte Tatin, Poached Apples, Creme Diplomat, Rosemary, Crumble, Cinnamon Wafer Garnish with a surprise NIC Ice Creams flavour\n\nCourse 4\nGajjar \nConfit Gajar, Rabri Mousse, Pistachio Sable\n\nCourse 5\nPetals and Palm\nCoconut Sprout, Candied Rose Petals, Coconut Veil, Tender Coconut Granita, Pickled Cucumber \n\nCourse 6\nSomething Like Tiramisu \nMascarpone Mousse, Coffee Sponge, Cocoa Crumble, Coffee Tuille, Coffee Caviar with a surprise NIC Ice Creams flavour\n\nCourse 7\nPetit Four\nKhara, Lemon Madeleine, Blueberry Cheese Macaron",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1160/c1198f64-6555-47d8-b29f-4ce38ccd4645.jpg",
    "location": {
      "name": "Daysie, MG Road",
      "address": "Daysie, MG Road, Bangalore",
      "url": "https://maps.app.goo.gl/2GTD79hsz7E42UVt9"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "1999.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Greater Than Bars From Far",
    "url": "https://puttingscene.com/events/1168",
    "startDate": "2025-10-10T17:30:00+05:30",
    "endDate": "2025-10-10T19:30:00+05:30",
    "description": "A cocktail festival that brings 9 of the best bars and bartenders from India, under one roof. Bars From Far by Greater Than Gin is back in Bangalore for its second edition.\n\nWhat can you expect? Great cocktails, food pop-ups, and a fantastic music lineup featuring electronic, disco, afro, and house genres.\n\nExperience a selection of the best bars from Goa, Mumbai, Pune, Delhi, Hyderabad, Kolkata, Jaipur and Chandigarh, alongside Nao Spirits’ very own MTW Bar and Toasties.\n\nBFF is where you'll find the best bartenders stirring up the best cocktails by some of the best bars from across the country, but without leaving your city.\n\nIt's a bar crawl, but without the crawl. So mark your calendars and bring your BFF along to our BFF!",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1168/fffd9033-1681-4d27-9481-5461e74d81af.jpg",
    "location": {
      "name": "wework galaxy",
      "address": "wework galaxy, Bangalore"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "678.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Bars From Far - Day 2",
    "url": "https://puttingscene.com/events/1169",
    "startDate": "2025-10-11T17:30:00+05:30",
    "endDate": "2025-10-11T19:30:00+05:30",
    "description": "A cocktail festival that brings 9 of the best bars and bartenders from India, under one roof. Bars From Far by Greater Than Gin is back in Bangalore for its second edition.\nWhat can you expect? Great cocktails, food pop-ups, and a fantastic music lineup featuring electronic, disco, afro, and house genres.\nExperience a selection of the best bars from Goa, Mumbai, Pune, Delhi, Hyderabad, Kolkata, Jaipur and Chandigarh, alongside Nao Spirits’ very own MTW Bar and Toasties.\nBFF is where you'll find the best bartenders stirring up the best cocktails by some of the best bars from across the country, but without leaving your city.\nIt's a bar crawl, but without the crawl. So mark your calendars and bring your BFF along to our BFF!",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1169/f5f15081-f265-4833-833b-6045a5b66c28.jpg",
    "location": {
      "name": "wework galaxy",
      "address": "wework galaxy, Bangalore"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "678.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Film Screening: Pottery House by Mansi Bhatt",
    "url": "https://puttingscene.com/events/1175",
    "startDate": "2025-10-05T17:00:00+05:30",
    "endDate": "2025-10-05T19:00:00+05:30",
    "description": "Join us for a screening of Pottery House by Mansi Bhatt, an experimental film that explores memory, heritage, and architecture through the remains of a demolished home on the Khodiyar Pottery Estate. In this layered journey, Mansi blurs, overlays, and sutures objects and images, reanimating her family’s former house until its curves and textures become tangible once more. The film asks: what happens when a place transforms into a state of irrecognition—or disappears altogether along with the boundaries that once defined it?\n\nFollowing the screening, join architect and theorist Dr. Kaiwan Mehta for a discussion on the idea of Home, between memory and culture. Together, they will reflect on how architecture shapes human experience and the importance of recognising built environments as vessels of history and imagination.\n\nThis programme is presented in celebration of World Architecture Day, 6 October.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1175/55b02569-02b0-4070-bf3d-52acda50c4aa.jpg",
    "location": {
      "name": "Museum of Art & Photography, Ashok Nagar",
      "address": "Museum of Art & Photography, Ashok Nagar, Bangalore",
      "url": "https://maps.app.goo.gl/vT97Kpba2wXZiFof8"
    },
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Family Day",
    "url": "https://puttingscene.com/events/1176",
    "startDate": "2025-10-12T11:00:00+05:30",
    "endDate": "2025-10-12T13:00:00+05:30",
    "description": "They say it takes a village to raise a child. This October, we’re calling that village made up of all the parents, maamas and atthes, daadas and daadis, mom’s best friend and dad’s anna to come over to MAP and celebrate. Bring your children, nieces and nephews, grandkids and godchildren for a fun-filled day of exploration, games, and stories!\n\nFrom exciting quizzes and treasure hunts, to playful walkthroughs of our exhibitions, the day is packed with activities designed especially for children. Pause at special stations to listen, play, and discover together. Wrap up the experience with a delightful theatre performance for young audiences. We’ve got the whole day sorted—all you need is a child (or a few!) to join in. The more, the merrier!",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1176/c67b5484-3322-438a-bec9-2cbc031c618a.jpg",
    "location": {
      "name": "Museum of Art and Photography, Ashok Nagar",
      "address": "Museum of Art and Photography, Ashok Nagar, Bangalore",
      "url": "https://maps.app.goo.gl/87yDTzXihbb6jwfW6"
    },
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Femtech India x Coro: Diwali Gathering",
    "url": "https://puttingscene.com/events/1189",
    "startDate": "2025-10-11T16:00:00+05:30",
    "endDate": "2025-10-11T18:00:00+05:30",
    "description": "Lighting the Way: Women Redefining Wellness & Work\n\nCome celebrate the spirit of Diwali with light, conversations, and community. An intimate evening where women leaders, entrepreneurs, and changemakers come together to share stories, spark connections, and illuminate new paths forward.\n\n✨ What to expect:\n– Warm welcome ritual\n– Panel: “Lighting the Way: Women Building the Future”\n– Conversations on wellness, technology & inclusive workspaces\n– High tea with a festive Indian twist and festive surprises\n\nDress code : Festive & Elegant Indian Wear",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1189/ab283539-e383-4eff-96bc-659d9598136d.jpg",
    "location": {
      "name": "Coro Space, Domlur",
      "address": "Coro Space, Domlur, Bangalore",
      "url": "https://maps.app.goo.gl/j685RCmENPuic4ER6"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "800.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Roll With Our Chef: A Guided Sushi-Making Experience (Day 2)",
    "url": "https://puttingscene.com/events/1201",
    "startDate": "2025-10-05T12:00:00+05:30",
    "endDate": "2025-10-05T14:00:00+05:30",
    "description": "Join us this weekend between 12 PM to 5 PM for a hands-on workshop where our chef takes you through the quiet art of sushi making. From spreading rice to rolling tight, from knife to plate - you’ll savour not just the sushi, but the story in every roll.\n\nOnce your payment is made, our team will reach out within 24 hours to confirm your spot and block your preferred time slot.",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1201/a3a19b14-25f1-4604-8e55-95194c47be0c.jpg",
    "location": {
      "name": "Foodstories, Bangalore",
      "address": "Foodstories, Bangalore, Bangalore",
      "url": "https://maps.app.goo.gl/hZadDqwRRYsHweDo8"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "699.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Desi Breakfast Club",
    "url": "https://puttingscene.com/events/1218",
    "startDate": "2025-10-05T09:30:00+05:30",
    "endDate": "2025-10-05T11:30:00+05:30",
    "description": "From the deep, masala-laden bite of Bedmi Poori to the indulgent fluff of Chole Bhature, every plate is a page from a desi breakfast diary.\n\nCraving something richer? Keema Pav brings the heat. And the Parathas? Stuffed, griddled, and made exactly the way they should be — with love, ghee, and no shortcuts.\n\nThis isn’t a meal. It’s a morning well spent.\n\nNow Serving Desi Breakfast only at Treat.\nEvery Sunday 09:30 am - 11:30 am\n\nPLEASE NOTE: We have two time slots available for the Desi Breakfast Club:\n\nSlot 1 - 09:30 AM - 10:15 AM\nSlot 2 - 10:30 AM - 11:15 AM\n\n- Once you send in your reservation request, our team will get in touch to confirm your preferred timing. If your chosen slot is full, we’ll happily offer you the next available one.\n\n- To reserve your spot, we’re charging a small fee of ₹200 per person—which is fully redeemable against your meal. You’re free to choose anything from the menu, and if your bill goes over, you can simply settle the difference at the restaurant.\n\nCan’t wait to see you at the Desi Breakfast Club ☀️",
    "image": "https://puttingscenes-prod-media.s3.ap-south-1.amazonaws.com/event_images/1218/12a8025c-a752-4ef3-b203-922f9ee6dbbb.jpg",
    "location": {
      "name": "Treat, Indiranagar",
      "address": "Treat, Indiranagar, Bangalore",
      "url": "https://maps.app.goo.gl/ZWVEGR4diYrVU6wi6"
    },
    "offers": [
      {
        "@type": "Offer",
        "price": "200.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Chess Connect - Blitz",
    "url": "https://puttingscene.com/events/1219",
    "startDate": "2025-10-05T10:00:00+05:30",
    "endDate": "2025-10-05T12:00:00+05:30",
    "description": "At Chess Connect – Blitz, the board heats up fast: 5-minute games, sharp minds, and a buzzing room full of challengers at RMZ Millenia, Halasuru. Whether you’re a seasoned player or just love the thrill of quickfire strategy, it’s a Sunday morning duel of wit and nerves, hosted by Bangalore Chess Club.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/04/1759557342228-1759557342135_d91rey7kwor.png",
    "location": {
      "name": "RMZ Millenia, Halasuru",
      "address": "RMZ Millenia, Halasuru, Bangalore",
      "url": "https://maps.app.goo.gl/XMxWssfqa8pWK1tq6"
    },
    "sameAs": "https://bangalorechessclub.in/chess-connect/2025-10-05/",
    "offers": [
      {
        "@type": "Offer",
        "price": "200.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Formula 1: Singapore GP",
    "url": "https://puttingscene.com/events/1220",
    "startDate": "2025-10-05T17:00:00+05:30",
    "endDate": "2025-10-05T19:00:00+05:30",
    "description": "Prepare to experience the Singapore GP Night Race like a team strategist! Join the Fosite crew on Sunday, October 5th, 2025, as we screen the thrilling Formula 1 Singapore Grand Prix live at the Fosite Studio. You’ll be watching the main feed on our massive 150‑inch Laser Projector (Dolby Vision & IMAX Enhanced), but that’s just the start. The Analyst Upgrade: we’re turning our studio into mission control. Our four LG 32‑inch 4K monitors will be dedicated to displaying live telemetry and custom driver perspectives. This means you can track crucial details like tire compound data, sector times, and on‑board views from different cars simultaneously, giving you a tactical edge over every casual viewer. Entry & Collectible: for a nominal fee of ₹299, your ticket secures entry and includes a custom‑designed, collectible Singapore GP track keychain from Fosite. Event Details: Date: Sunday, October 5th, 2025; Time: 4:00 PM onwards; Location: Fosite, Indiranagar, Bengaluru; Cost: ₹299 (Includes entry + custom collectible F1 keychain); Fuel Up: Beverages can be purchased at Fosite, but we provide water, AC, washrooms, and a designated ‘Chill Zone’ for smoking. Space is limited for this exclusive technical viewing experience. Secure your ticket and your piece of F1 history now!",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/04/1759557442975-1759557442866_fxlit6y82b.png",
    "location": {
      "name": "Fosite, Idiranagar",
      "address": "Fosite, Idiranagar, Bangalore",
      "url": "https://maps.app.goo.gl/wJ9der5tAnK4HqGeA"
    },
    "sameAs": "https://urbanaut.app/spot/f1-sg-gp",
    "offers": [
      {
        "@type": "Offer",
        "price": "352.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Local Food Club, Bangalore",
    "url": "https://puttingscene.com/events/1221",
    "startDate": "2025-10-05T16:00:00+05:30",
    "endDate": "2025-10-05T18:00:00+05:30",
    "description": "The Local Food Club (LFC) next meetup is happening on Sunday, 5 October 2025. The October theme is \"No Scraps Left Behind.\" The meetups are happening in multiple cities, and Bengaluru will host an LFC meetup at the venue @mybotree. It is a member-only meetup series, but membership is free and can be done via the link in the bio. Members receive RSVP links and WhatsApp group info. The invitation encourages people to 'Bring what you can. Come as you are. There’s always a seat at the table!'",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/04/1759557658118-1759557657963_n94iwkoccol.png",
    "location": {
      "name": "MyBoTree, Koramangala",
      "address": "MyBoTree, Koramangala, Bangalore",
      "url": "https://www.google.com/maps/search/?api=1&query=MyBoTree%2C+3rd+Floor%2C+25%2C+60+Feet+Road%2C+5th+Block%2C+Koramangala%2C+Bengaluru+560095"
    },
    "sameAs": "https://www.instagram.com/p/DPGIsuAEUe4?img_index=3",
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Gourmet Cinema - Chef",
    "url": "https://puttingscene.com/events/1222",
    "startDate": "2025-10-05T12:00:00+05:30",
    "endDate": "2025-10-05T14:00:00+05:30",
    "description": "Experience a unique cinematic and culinary event with SCC Gourmet Cinema's screening of the movie 'Chef'. This is not just a movie screening; it's an immersive journey where your senses are engaged through a specially curated 5-course tasting menu. Each course is thoughtfully designed and served in synchronization with the food scenes unfolding on screen, allowing you to taste what you see. The event promises a multi-sensory experience, blending the art of filmmaking with gourmet dining. The ticket includes both the movie screening and the full 5-course meal, along with other food and drink inclusions as part of the package. The event begins with entry at 12:00 PM, allowing guests to settle in before the movie starts promptly at 12:30 PM. Seating arrangements are designed for comfort to ensure an enjoyable viewing and dining experience. Please be aware of the terms and conditions, which include policies on cancellations and entry. This is a perfect outing for foodies and film lovers alike, offering a memorable afternoon that combines delicious food with a heartwarming story. Join Sunset Cinema Club for this one-of-a-kind event that brings the magic of 'Chef' to life on your plate.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/04/1759557506862-1759557506823_khpug8ta3a9.png",
    "location": {
      "name": "Hamilton Cocktail Bar, Seetharampalya",
      "address": "Hamilton Cocktail Bar, Seetharampalya, Bangalore",
      "url": "https://www.google.com/maps/search/?api=1&query=Hamilton+Cocktail+Bar%2C+2%2C+Behind+HDFC+Bank%2C+Doddanakundi+Industrial+Area+2%2C+Seetharampalya%2C+Hoodi%2C+Bengaluru%2C+Karnataka+560048"
    },
    "sameAs": "https://sunsetcinemaclub.in/bangalore/events/2232/scc-gourmet-cinema-chef",
    "offers": [
      {
        "@type": "Offer",
        "price": "3500.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Songs of Food and Hunger",
    "url": "https://puttingscene.com/events/1223",
    "startDate": "2025-10-05T16:00:00+05:30",
    "endDate": "2025-10-05T18:00:00+05:30",
    "description": "At Songs of Food and Hunger, scholar Achintya Prahlad explores the age-old ties between music and sustenance—from agricultural work songs to the Natya Shastra, from devotion to protest. Hosted at Science Gallery Bengaluru, this lecture delves into how hunger, longing, and nourishment echo through India’s musical and literary traditions, opening a window into the fascinating world of food-related music research.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/04/1759557854847-1759557854795_fham70hw1k.png",
    "location": {
      "name": "Science Gallery Bengaluru, Ganganagar",
      "address": "Science Gallery Bengaluru, Ganganagar, Bangalore",
      "url": "https://maps.app.goo.gl/vZ9qas9kWdBJSzUs8"
    },
    "sameAs": "https://calorie.scigalleryblr.org/programmes?p=songs-of-food-and-hunger",
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Sunday Bird Walk",
    "url": "https://puttingscene.com/events/1224",
    "startDate": "2025-10-05T07:00:00+05:30",
    "endDate": "2025-10-05T09:00:00+05:30",
    "description": "Join the First Sunday Bird Walk at Saul Kere, a public outing organized by dedicated BngBirds volunteers, with Bijoy Venugopal leading the event. The walk serves as a wonderful opportunity for both novice and experienced birdwatchers to explore the local avifauna. Participants are requested to gather at the Saul Kere [Savala Kere] East Entrance at 7:00 am; the walk typically concludes by 9:30 am. The meeting point is accessible via the RMZ Ecoworld/Adarsh Palm Retreat road, and a precise Google Maps link is provided for easy navigation. For those using public transport, the nearest bus stop is the Intel stop on the Ring Road, which is approximately a 2-kilometer or a 20-minute walk to the lake. Several bus routes, including those from Banashankari towards Marathahalli, service this stop. To ensure a comfortable and productive experience, attendees are advised to wear dull-coloured clothing, a hat or cap, and comfortable walking shoes. Depending on the weather forecast, rain gear may be necessary. It is recommended to bring a notebook and pen/pencil for taking notes, and plenty of water to stay hydrated. Optional but helpful items include bird books or mobile apps for identification, binoculars for better viewing, and a camera to capture the moments. You may also want to bring your own snacks. After the walk, there is a suggestion to visit The Rasaganga, a nearby restaurant with parking, for a post-outing meal and discussion.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/04/1759557718422-1759557718340_6bjz1im3dcb.png",
    "location": {
      "name": "Savala Kere East Entrance, Kaikondrahalli",
      "address": "Savala Kere East Entrance, Kaikondrahalli, Bangalore",
      "url": "https://www.google.com/maps/search/?api=1&query=Saul+Kere+East+Entrance%2C+Bengaluru%2C+Karnataka%2C+India"
    },
    "sameAs": "https://bngbirds.com/",
    "isAccessibleForFree": true
  },
  {
    "@type": "Event",
    "name": "Colonial Crawl",
    "url": "https://puttingscene.com/events/1225",
    "startDate": "2025-10-05T07:30:00+05:30",
    "endDate": "2025-10-05T09:30:00+05:30",
    "description": "The Colonial Crawl is a taste of history hidden right under your noses. In this walk, we will explore how the British sahibs, memsahibs, and royalty left their mark on the garden city. The English influence on the sprawling Cubbon park, the origins of the Cantonment area, and the surrounding architecture are testimony to a lot of events in history. For example, the American War of Independence, the Battle of Waterloo, and the French Revolution had a connection to this region. We will spill more of this tea when you walk with us. Whether you are visiting or you are a local, we promise you will see the city in a different light once you learn about the colonial influence on its churches, clubs, parks, and its people. Cubbon mornings are a sight to sore eyes, and the perfect time to discover the Colonial Hangover in one of the older parts of the city.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/04/1759558016848-1759558016809_9zemmealf86.png",
    "location": {
      "name": "Cubbon Park Metro, Ambedkar Veedhi",
      "address": "Cubbon Park Metro, Ambedkar Veedhi, Bangalore",
      "url": "https://maps.app.goo.gl/EeEaHWQTBfKB9MQt9"
    },
    "sameAs": "https://gully.tours/tours/colonial-crawl",
    "offers": [
      {
        "@type": "Offer",
        "price": "1500.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Polar Plunge",
    "url": "https://puttingscene.com/events/1226",
    "startDate": "2025-10-05T09:00:00+05:30",
    "endDate": "2025-10-05T11:00:00+05:30",
    "description": "Ice Bath Experience for Beginners in Bangalore Cold plunges have a rich history, dating back to ancient civilisations like Egypt, Greece, and Rome, where it was revered for its healing properties. Today, this practice is globally recognised for its numerous therapeutic and wellness benefits. A cold plunge, also known as an ice bath, involves immersing the body in cold water, typically at temperatures between 5‑7 °C, for a brief period. It is widely used by athletes and fitness enthusiasts to aid recovery and enhance physical and mental health. This immersive experience helps you take the plunge through a series of activities, guided by an expert. What Will You Get Discover the secrets and benefits of a therapeutic ice bath, under the guidance of an expert. Activities include a pre‑plunge warm up, breathwork exercises to calm the mind and body, ice plunge, and post‑plunge relaxation. An insight into potential physical and mental health benefits derived from regular cold plunges under expert guidance. A first step towards resilience‑building for overall optimal health. Registration Details One ticket is valid for one participant. The ticket price includes the cost of all the equipment required to conduct the experience. Registrations close on the day of the experience ‑ an hour prior to the start time, subject to availability of seats. Cancellations, refunds and transfers, if any, will be as per our Refund Policy. About The Host Sabyosachi Nandi is a fitness coach, athlete, and movement specialist at Elv8.fit. With years of experience training everyone from everyday movers to top‑tier celebrities, Sabyo has honed a key pillar of sustainable fitness which is recovery. He believes that what you do between workouts is just as important as the workouts themselves. A firm advocate of cold therapy, he incorporates ice baths into his own regimen to accelerate recovery, build mental resilience, and stay sharp day after day. At Elv8.fit, Sabyo doesn’t just train hard — he recovers smart, helping others do the same with methods that truly work. What's A 'Trove Experience' As our cities swell, we tend to do fewer and repetitive things for recreation. With Trove, you get to break the monotony and explore fresh activities in your city, meet like‑minded souls, and develop a deeper appreciation for the finer things. Most of us likely resonate with terms like 'workshops' or 'events.’ What makes these an 'experience' is the energies we put into scouring the right artists, creators and storytellers, to ensure that each Trove Experience leaves you enriched with meaningful moments to collect for your very own treasure trove.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/04/1759558414199-1759558414164_2aygwin95ts.png",
    "location": {
      "name": "Cafe Azzure, Kalyan Nagar",
      "address": "Cafe Azzure, Kalyan Nagar, Bangalore",
      "url": "https://www.google.com/maps/search/?api=1&query=Cafe+Azzure%2C+315%2C+CMR+Main+Rd%2C+HRBR+Layout+3rd+Block%2C+Kalyan+Nagar%2C+Bengaluru%2C+560043"
    },
    "sameAs": "https://troveexperiences.com/collections/upcoming/products/polar-plunge-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "price": "2000.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "DIY Woodworking",
    "url": "https://puttingscene.com/events/1227",
    "startDate": "2025-10-05T10:00:00+05:30",
    "endDate": "2025-10-05T12:00:00+05:30",
    "description": "Pick up the power tools and learn the basics of DIY woodworking at this beginner-friendly one-day workshop. Hosted by The Workshop, Bangalore, the session on October 5th introduces you to safe handling, cutting, and shaping techniques—perfect for anyone curious about building with their own hands. Whether you dream of crafting furniture or just love the smell of fresh sawdust, this hands-on day promises sparks, saws, and serious satisfaction.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/04/1759558334844-1759558334797_qk7el9afzq.png",
    "location": {
      "name": "Think Happy Everyday - Workshop, Munireddy Layout",
      "address": "Think Happy Everyday - Workshop, Munireddy Layout, Bangalore",
      "url": "https://maps.app.goo.gl/bH16n8nc2KwZWNtC7"
    },
    "sameAs": "https://www.instagram.com/p/DPFt9NnD0T6/?img_index=2",
    "offers": [
      {
        "@type": "Offer",
        "price": "5000.00",
        "priceCurrency": "INR"
      }
    ]
  },
  {
    "@type": "Event",
    "name": "Mainstream, Interrupted",
    "url": "https://puttingscene.com/events/1228",
    "startDate": "2025-10-05T11:30:00+05:30",
    "endDate": "2025-10-05T13:30:00+05:30",
    "description": "On October 5 2025, Atta Galatta hosts a powerful and thought‑provoking screening of Shazia Iqbal’s groundbreaking #dhadak2. This event goes beyond mere cinema—it is followed by an intimate conversation between the director and the poet Aleena that dives into women’s art, politics, and the courage to interrupt the mainstream. As a Moonbird Community Event, it is entirely non‑profit: all proceeds support the venue, recording the event, artist travel, and the remainder is donated to Mumbai 4 Peace. The gathering offers not just a film viewing but a rare, live dialogue with the director in a community‑driven setting.",
    "image": "https://puttingscenes-dev-media.s3.ap-south-1.amazonaws.com/generated-images/2025/10/04/1759557952724-1759557952558_hrbq61qhz98.png",
    "location": {
      "name": "Atta Galatta, Indira Nagar",
      "address": "Atta Galatta, Indira Nagar, Bangalore",
      "url": "https://maps.app.goo.gl/yPkXUwSwEv2duyAT9"
    },
    "sameAs": "https://in.bookmyshow.com/events/mainstream-interrupted/ET00462622",
    "offers": [
      {
        "@type": "Offer",
        "price": "450.00",
        "priceCurrency": "INR"
      }
    ]
  }
]