[
  {
    "@type": "Event",
    "name": "Kai Magga, Kale Sangama Exhibition - Design Craft showcases artisan designer graduates from Somaiya Kala Vidya - Oct 11",
    "url": "https://www.sabhablr.in/event-details/kai-magga-kale-sangama-exhibition",
    "startDate": "2025-10-11T10:00:00+05:30",
    "endDate": "2025-10-11T19:00:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_22a2682d60814341ad89f796e6c3d04c~mv2.png",
    "description": "Design Craft, a pioneering platform showcasing artisan designer graduates from Somaiya Kala Vidya, warmly invites you to \"Kai Magga, Kale Sangama.\" This curated exhibition will feature the exceptional work of 30 artisan designers from the 2025 graduating class of Somaiya Kala Vidya. Blending tradition with innovation, Design Craft curates handcrafted contemporary collections and connects craft-based designers to global markets that value authenticity and conscious fashion. At \"Kai Magga, Kale Sangama,\" you will experience creations from the heart of Karnataka, with a special glimpse into the vibrant crafts of Kachchh, Madhya Pradesh, and Meghalaya. Each piece reflects India's timeless textile traditions, reimagined with a contemporary spirit. We invite you to meet the artisan designers in person, explore their stories, and shop directly from them. Come celebrate creativity and craftsmanship, and be part of preserving India's rich textile heritage. We look forward to welcoming you!",
    "offers": {
      "@type": "Offer",
      "availability": "InStock"
    }
  },
  {
    "@type": "Event",
    "name": "Snugglewalas - By Varnam Craft Collective - Oct 16",
    "url": "https://www.sabhablr.in/event-details/snugglewalas-1",
    "startDate": "2025-10-16T11:00:00+05:30",
    "endDate": "2025-10-16T17:00:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_2a9effeb693f4be4a833a21c28b53307~mv2.jpg",
    "description": "Varnam Craft Collective, known for reviving and reimagining the Channapatna toy craft from Karnataka for the last 14 years, is launching it’s biggest craft collaboration yet.  The Snugglewalas - Storytellers of Handmade India, is a first-of-its-kind showcase where whimsical toys tell the story of India’s handmade crafts, all the way from Kashmir to Karnataka. This multi-city exhibition will travel through India to showcase the variety of handmade crafts reimagined in ways that are accessible to children and adults, in the form of toys, clothes, home accents, jewelry and Collectibles. Whether you’re an adult or a child, you’ll fall in love with the Snugglewalas - toys with delightful personalities, just like each of us. Meet Snappy the Crocodile, the gentle riverkeeper who loves floating spas and calm waters, Dawnold the Rooster who reminds us that everyday is a new start and Neckles the Giraffe, the family’s fashion icon who exudes poise and quiet elegance, and many more whimsical characters. The Snugglewalas: More than just toys A Snugglewala is not just a fluffy creature with soft paws and warm hugs. It is a feeling, a quiet, gentle reminder that comfort exists, that love can be as simple as a cuddle, as effortless as being near. A Snugglewala is the soft embrace of home, the quiet joy of unwinding, the feeling of being cradled by something similar and kind. The Snugglewalas are India’s first-of-its-kind exploration where toys transform into storytellers and design meets craft in playful and unexpected ways.  Born from the 200-year-old toy craft of Channapatna, the Snugglewalas are a whimsical caravan of storytellers, journeying across the country from Kashmir to Karnataka, with tales tucked inside their wooden forms. Each one is a playful companion, yet also a custodian of India’s craft traditions - carrying with them the voices of artisans, the colors of regions and the timeless spirit of design. Together, they are more than toys, they are narrators of heritage, weaving stories of craft and culture into the hearts of all who meet them. Unlike the usual narratives around craft that often dwell on decline and loss, the Snugglewalas bring a refreshing shift - celebrating possibility, positivity and the next generation of craft. This showcase looks ahead, not behind: to a future where artisans and young design talent collaborate to reimagine traditions for tomorrow.",
    "offers": {
      "@type": "Offer",
      "availability": "InStock"
    }
  },
  {
    "@type": "Event",
    "name": "Kayaka  - MD Pallavi and Bruce Lee Mani",
    "url": "https://www.sabhablr.in/event-details/kayaka",
    "startDate": "2025-10-18T19:00:00+05:30",
    "endDate": "2025-10-18T22:00:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_511c4488de95460baf96b44310d5e58d~mv2.jpeg",
    "sameAs": "https://swiggy.onelink.me/Ol3A?af_dp=swiggydiners%3A%2F%2Fentity%2FDINEOUT_EVENT%2F100005271"
  },
  {
    "@type": "Event",
    "name": "Soumik Datta | Travellers - This show is presented by Culturegrind",
    "url": "https://www.sabhablr.in/event-details/soumik-datta-travellers",
    "startDate": "2025-10-31T19:00:00+05:30",
    "endDate": "2025-10-31T20:30:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_e9410d598e7b4f9f9204eadd6d6fbc61~mv2.png",
    "sameAs": "https://urbanaut.app/spot/soumik-datta-the-travellers"
  },
  {
    "@type": "Event",
    "name": "Chilambu: Malabar Folklore in Classical Rhythm",
    "url": "https://www.sabhablr.in/event-details/chilambu-malabar-folklore-in-classical-rhythm",
    "startDate": "2025-11-20T19:00:00+05:30",
    "endDate": "2025-11-20T23:00:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_ad591a95381245558cc7c2503050e064~mv2.jpg",
    "sameAs": "https://in.bookmyshow.com/events/chilambu-malabar-folklore-in-classical-rhythm/ET00465255"
  }
]