[
  {
    "@type": "Event",
    "name": "Adoor, Jaya, Shabana, Girish… How India’s Finest Filmmakers Were Made",
    "url": "https://www.sabhablr.in/event-details/adoor-jaya-shabana-girish-how-indias-finest-filmmakers-were-made",
    "startDate": "2025-12-09T18:30:00+05:30",
    "endDate": "2025-12-09T20:00:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_43cc4bd5924345b19e7c6d87c8c33180~mv2.png",
    "sameAs": "https://bangaloreinternationalcentre.org/event/adoor-jaya-shabana-girish-how-indias-finest-filmmakers-were-made/"
  },
  {
    "@type": "Event",
    "name": "Oops to Opportunity - - The Beta Series",
    "url": "https://www.sabhablr.in/event-details/oops-to-opportunity",
    "startDate": "2025-12-10T18:00:00+05:30",
    "endDate": "2025-12-10T20:30:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_37cfc81f17ac46068115af1d5a782f5a~mv2.png",
    "sameAs": "https://in.bookmyshow.com/events/oops-to-opportunity-the-beta-series/ET00468889"
  },
  {
    "@type": "Event",
    "name": "A Woman of No Consequence  - Kalpana Karunakaran in conversation with Mary E. John",
    "url": "https://www.sabhablr.in/event-details/a-woman-of-no-consequence",
    "startDate": "2025-12-11T18:30:00+05:30",
    "endDate": "2025-12-11T20:00:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_e978ee898a174232b885faf8b84e0b9d~mv2.jpg",
    "description": "A HISTORICAL ACCOUNT OF A HOUSEWIFE’S QUEST FOR INTELLECTUAL GROWTH AND HER ABILITY TO RESIST TWENTIETH-CENTURY ORTHODOXIES IN MADRAS VIA WRITING AND READING. In this intimate, yet simultaneously anthropological, exploration of the life of her maternal grandmother Pankajam (1911–2007), Kalpana Karunakaran achieves the remarkable: capturing the singularity of an exceptional woman, even as it situates her in a social universe shaped by the conventions of Tamil Brahmin orthodoxy. Karunakaran conveys with clarity how the ‘utterly ordinary’ life of a ‘woman of no consequence’ (as Pankajam writes of herself), lived out largely within the confines of family and kin, was quite far from ordinary. The book draws extensively upon letters, glimpses of Pankajam’s life narrated through her thinly-disguised semi-autobiographical short stories that allowed her to ‘say the unsayable’ about love, intimacy and conjugality, and her autobiography, which she began writing in 1949 and kept writing till her last piece in 1995. What comes together is a riveting portrait of heartbreak and violence, yearning and delight, a housewife’s quest for intellectual growth and her talent for friendships across cultures and continents. In the final reckoning, A Woman of No Consequence is about the chequered trajectories of a newly-born nation as seen through the lens of its daughters—restless women forcing home and nation to reckon with their stubborn striving for self-actualisation.",
    "offers": {
      "@type": "Offer",
      "availability": "InStock"
    }
  },
  {
    "@type": "Event",
    "name": "Varnamala - Curated by Mavin Khoo",
    "url": "https://www.sabhablr.in/event-details/varnamala",
    "startDate": "2025-12-12T18:00:00+05:30",
    "endDate": "2025-12-12T20:00:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_ed35a3562a654863bd4fd9366192edcb~mv2.jpg",
    "description": "Varnamala Curated by Mavin Khoo For the second year in a row, Mavin Khoo curates Varnamala - a triptych of three varnams, three dancers, and three distinct journeys of artistic exploration. Each work is rooted in the rich musical legacy of Maharaja Swathi Thirunal, interpreted through contemporary sensibilities and individual artistic voices. This year’s edition is being presented at Sabha and features performances by Archana Raja with Kasi Aysola, K Sarveshan, and Kavya Ganesh, each offering a fresh perspective on form, emotion, and tradition.  Organiser's note: We are looking forward to sharing Varnamala with you.  Please note, we have spaces for 215 people which is why your RSVP helps us to plan. Also, kindly note that there is no parking near Sabha, so you will need time to park your vehicles and walk over to the venue. So please set aside time for that so that you can enter the hall on time and enjoy the entire evening. For event related queries please reach out to +447783891049 via WhatsApp",
    "offers": {
      "@type": "Offer",
      "availability": "SoldOut"
    }
  },
  {
    "@type": "Event",
    "name": "The Art of Intimacy Workshop - Ancient Tantra Practices & Tools to Expand your Pleasure Potential\n",
    "url": "https://www.sabhablr.in/event-details/the-art-of-intimacy-workshop",
    "startDate": "2025-12-13T10:00:00+05:30",
    "endDate": "2025-12-13T15:00:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_c769c65e8b0b4f5c91548af6ae19bcb7~mv2.png",
    "sameAs": "https://getintimacy.com/backstage/event-art-of-intimacy-workshop-bangalore/"
  },
  {
    "@type": "Event",
    "name": "The Night The Children Led - By The Merchants of Happiness",
    "url": "https://www.sabhablr.in/event-details/the-night-the-children-led",
    "startDate": "2025-12-14T17:00:00+05:30",
    "endDate": "2025-12-14T22:00:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_5b7a6a7b6b7546cd8d729709e4dc1c02~mv2.jpg",
    "sameAs": "https://urbanaut.app/spot/the-night-the-children-led?srsltid=AfmBOooa-dCapHYsTbIA8d_M4X3q-XAL6DgZTFgA6DMdZGN1R4equXqG"
  },
  {
    "@type": "Event",
    "name": "Season - A Film By R.V. Ramani",
    "url": "https://www.sabhablr.in/event-details/season",
    "startDate": "2025-12-16T17:00:00+05:30",
    "endDate": "2025-12-16T21:00:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_e753870148f64ea09cd147e9c9625911~mv2.png",
    "description": "SEASON 180 Minutes, Tamil, English with (English Subtitled), 1997 Photographed, Directed and Produced by R.V. Ramani Edited by Amitabh Chakraborty. Synopsis: In the Tamil month ‘Margazhi’, (Dec/Jan), Chennai hosts the festival of classical music and dance, popularly known as the December Season, organized by various Sabhas, featuring more than 1000 performances and related events across the city. Journeying through the ambience of the 1996 December Season, being with artists, before/during/after their performances, the film attempts to portray the very essence of the culture that prevails during the Season. FILMMAKER AND HIS MOTIVATION: R.V. Ramani, is an Award-winning filmmaker, makes films exploring various aspects of expression, in a candid, explorative and deeply subjective approach. With more than 30 independent films to his credit, he is created a niche for himself, in the Documentary/Avant- garde films in India. On the film ‘Season’ he says, ‘The idea for ‘Season’, probably began after hearing the concert by flautist T. Vishwanathan (Vishwa), in 1989. His music and presence deeply moved me, especially in the way he transforms a performance space into an intimate space. When he received his Sangita Kalanidhi award in 1996, I felt compelled to film with him and also journey through the ambience of the Season, filming with many artists.” FEATURED ARTISTES: Vishwanathan T, Vidhya Sridhar , Unnikrishnan, Sudha Raghunathan, Srilatha Suresh, Sowmya S, Sikkil Sisters, Shobana, Seshagopalan TN , Semmangudi Srinivasa Iyer , Sashank MS, Sanjay Subramaniam, Ravikiran N, Neiveli Santanagopalan, Leela Samson, Lakshmi Knight, Krishna TM, Kelucharan Mahapatra, Kanyakumari A , Kadri Gopalnath , Gayathri E , Chitra Visweswaran, Bombay Jayashree, Balamurali Krishna, Aruna Sayeeram, Anita Ratnam, Amjad Ali Khan and many more.",
    "offers": {
      "@type": "Offer",
      "availability": "InStock"
    }
  },
  {
    "@type": "Event",
    "name": "Madhuragati: An Odissi Dance Performance - By Anoushka Rahman",
    "url": "https://www.sabhablr.in/event-details/madhuragati-an-odissi-dance-performance-1",
    "startDate": "2025-12-19T19:00:00+05:30",
    "endDate": "2025-12-19T20:30:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_0bee296edeb1433a8c13366ffd336772~mv2.jpg",
    "sameAs": "https://urbanaut.app/spot/madhuragati-an-odissi-dance-performance"
  },
  {
    "@type": "Event",
    "name": "CARBON II: A Solo Guitar Concert By Konarak Reddy",
    "url": "https://www.sabhablr.in/event-details/carbon-ii-a-solo-guitar-concert-by-konarak-reddy",
    "startDate": "2025-12-20T19:30:00+05:30",
    "endDate": "2025-12-20T21:30:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_157a80a1dc3946bca0e5078b81bb8307~mv2.jpg",
    "sameAs": "https://urbanaut.app/spot/carbon-a-solo-guitar-concert-by-konarak-reddy"
  },
  {
    "@type": "Event",
    "name": "Earthlore: The Indigenous Music Band - Indigenous heritage with contemporary soundscapes",
    "url": "https://www.sabhablr.in/event-details/earthlore-the-indigenous-music-band",
    "startDate": "2025-12-23T19:00:00+05:30",
    "endDate": "2025-12-23T20:30:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_f552b46ab41a4a57b0e6d8b6e5717a2d~mv2.png",
    "sameAs": "https://urbanaut.app/spot/earthlore-band-performance-9668"
  },
  {
    "@type": "Event",
    "name": "Around the World in 8 Ragas - Music across continents ",
    "url": "https://www.sabhablr.in/event-details/around-the-world-in-8-ragas",
    "startDate": "2026-01-10T19:00:00+05:30",
    "endDate": "2026-01-10T21:00:00+05:30",
    "image": "https://static.wixstatic.com/media/e9d88b_fc46a9402abd4186808e44a1faa38c76~mv2.png",
    "sameAs": "https://urbanaut.app/spot/8ragas"
  }
]