[
  {
    "@type": "EducationEvent",
    "name": "Can a Machine Think Like a Chef?",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-14T16:00:00+05:30",
    "endDate": "2025-12-14T16:00:00+05:30",
    "description": "Can we teach a machine to understand food?\n\nJoin Ganesh Bagler as he explains how the rapid growth of food-related data and advances in artificial intelligence are transforming how we understand the science of gastronomy. Learn about the emerging discipline of computational gastronomy, a field that applies data science and AI to investigate culinary patterns, nutritional structures, and flavour principles. Explore how making food computable is allowing us to decode long-standing culinary mysteries, uncover the links between diet and health, and design innovative food solutions. Discover the implications this holds for public health, personalised nutrition, and sustainable food systems.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=can-a-machine-think-like-a-chef",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "The Life and Legacy of K.T Achaya",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-28T16:00:00+05:30",
    "endDate": "2025-12-28T16:00:00+05:30",
    "description": "Who was Dr K.T. Achaya?\n\nJoin Vinod Huria as he explores the life and legacy of Dr K.T. Achaya. As a former student of Dr Achaya, Vinod Huria presents a personal account of the scientist who pioneered research and writing on Indian foods. Learn of the many achievements and contributions that Dr Achaya has made to Indian food science, from his work in oil production to his research into food and nutrition. Discover how his books introduced new ways of writing and thinking about food writing in India.\n\nThis lecture is part of our launch of an exhibit on KT Achaya’s life as part of CALORIE.\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=life-legacy-kt-achaya",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "ScreeningEvent",
    "name": "My Radio My Life: Film Screening and Discussion",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-14T18:30:00+05:30",
    "endDate": "2025-12-14T20:00:00+05:30",
    "description": "My Radio My Life” is a distinctive documentary that nostalgically revisits the golden era of radio and its profound influence on people’s lives. The film journeys through a vintage radio museum curated by a passionate restorer in Bengaluru, revisits the historic 1969 Apollo 11 Moon landing commentary from the Voice of America (Tamil Service), and highlights the crucial role of Ham Radio during disasters such as tsunamis. It also traces how a childhood fascination with radio inspired individuals to become popular announcers, celebrates beloved programmes like Binaca Geetmala and cricket commentary, and follows the determined efforts of a retired librarian repairing his cherished radio.\n\nThe film further showcases the exciting revival of School Radio, where students are reimagining the magic of radio in new and innovative ways.\n\n“My Radio My Life” has been screened at over 80 film festivals across 36 countries, earning multiple awards and nominations for its heartfelt storytelling and cultural significance.\n\nJoin filmmaker Makarand Waikar and Creative Producer Simantinee Bhagwat as they explore the film’s concept, creative journey, and the enduring themes it explores.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=my-radio-my-life",
    "maximumAttendeeCapacity": "100"
  },
  {
    "@type": "EducationEvent",
    "name": "The Ecology of Our Homes: Examining Human Interactions With Urban Wildlife",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-20T16:00:00+05:30",
    "endDate": "2025-12-20T16:00:00+05:30",
    "description": "Have you ever wondered about the bustling world happening just outside or even inside your front door? Join Deepa Padmanaban as she explores the captivating ecology of our homes, where human lives constantly intersect with the lives of urban birds, insects, and animals.\n\nThis talk will look closely at the fascinating, often surprising, interactions that shape our daily environment. She will discuss everything from the spiders on our walls and the birds nesting under our eaves to the rats visiting our yard.  The session will help you understand how our behaviours impact their survival and discover ideas to promote positive coexistence. Whether you are a curious homeowner, a nature enthusiast, or simply someone looking to better understand your immediate surroundings, this talk will offer fresh perspectives on some amazing but often overlooked creatures.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=ecology-of-our-homes",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Accessibility in Food Spaces: From Gig Work to Dining",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-20T11:00:00+05:30",
    "endDate": "2025-12-20T14:00:00+05:30",
    "description": "How can we make food spaces more accessible?\n\nJoin Archit Majumdar as he demonstrates how one might bring the principles of accessibility into food spaces. Explore why accessibility matters and map the journeys of people with different disabilities as they access cafés, restaurants, and food delivery services.\n\nThe workshop highlights the perspectives of gig workers, service providers, and diners, highlighting common barriers, essential needs, and practical design solutions to create truly inclusive food environments. Focusing on lived experiences and drawing on insights from initiatives such as *Yes to Access*.\n\nThrough collaboration, discussion, and hands-on exercises, the workshop equips participants with actionable strategies to design and improve food spaces to be welcoming, usable, and enjoyable for all individuals.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=accesibility-in-food-spaces",
    "maximumAttendeeCapacity": "20"
  },
  {
    "@type": "EducationEvent",
    "name": "Tiny Chefs, Big Impact: Fermentation and the Future of Gut Health",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-28T11:00:00+05:30",
    "endDate": "2025-12-28T13:00:00+05:30",
    "description": "How do bacteria and yeasts turn everyday foods into flavours that nourish your gut, your immunity, and your mood?\n\nJoin Pooja Dewan as she enters the microscopic kitchen and explores the science of fermentation. Watch microbes transform simple ingredients into fizzy, tangy, gut-loving foods; taste and sip fermentation in action; and discover how your gut microbiome powers energy, immunity, and wellbeing. You’ll even get hands-on by creating your own mini ferment to take home. ",
    "url": "https://sci560.scigalleryblr.org/programmes?p=tiny-chefs-big-impact",
    "maximumAttendeeCapacity": "40"
  }
]