[
  {
    "@type": "EducationEvent",
    "name": "Songs of Food and Hunger",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-05T16:00:00+05:30",
    "endDate": "2025-10-05T16:00:00+05:30",
    "description": "How are music and food connected?\n\nExplore the diverse connections, conversations and clashes between music and food with Achintya Prahlad. Learn how Indians have been thinking of these connections for centuries through mediums like agricultural work songs and even ancient books on theatre like the Natya Shastra. Understand how realities like hunger find themselves represented in songs of devotion and protest. Come and be introduced to the world of food-related music research.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=songs-of-food-and-hunger",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "A Bite of CALORIE: Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-09-27T17:00:00+05:30",
    "endDate": "2025-09-27T17:00:00+05:30",
    "description": "Join the Science Gallery Bengaluru team for a closer look at our new exhibition season, CALORIE, one bite at a time. This walkthrough, invites you to reflect on the ideas of food, nutrition, and energy. As we move through the exhibition, the team will unpack the intimate, and often complicated, relationships we share with food, nourishment, and the systems that sustain us.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=general-walkthrough-1",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "Why should we care what frogs eat?",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-11T16:00:00+05:30",
    "endDate": "2025-10-11T16:00:00+05:30",
    "description": "What can frogs and toads do for us?\n\nJoin Seshadri as he shows us how the amphibians that we often label as creepy crawlies actually play a vital role as part of our food chain, quietly protecting our crops. Sharing insights from his research into how a rich diversity of frogs and toads helps sustain our ecosystems and agricultural landscapes. He will explore their vital role as natural pest controllers and how they could be a powerful antidote to the excessive spraying of pesticides. The talk will also have an interactive component where he will show how a healthy frog population is directly linked to the food we eat through a short game.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=frogs-and-toads",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Difficulty Remembering Faces? Or Never Forget a Face",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-09-28T16:00:00+05:30",
    "endDate": "2025-09-28T18:00:00+05:30",
    "description": "Have you ever instantly recognised a face or completely missed one?\n\nFaces are the foundation of human connection, yet our understanding of face perception has been shaped almost entirely by studies on Western populations. India, home to one-sixth of the world’s population, has remained absent from this research despite its immense diversity. Join SP Arun and Vaishnavi Mohite as they introduce the first large-scale project on face perception in India, focused on individuals with extraordinary recognition abilities (super recognisers) and those with severe impairments (prosopagnosia). \n\nThey will discuss the development of the Indian Face Memory Test (IFMT), a tool tailored to the unique features of Indian faces, and standardising clinical protocols for prosopagnosia research in the country. This project not only replicates classic findings such as the face inversion effect across cultures but also asks new questions, such as how contextual cues like clothing, voice, and hairstyle aid recognition when face perception fails. By combining behavioural measures with computational modelling, they aim to uncover both universal and culturally specific principles of face perception.\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=never-forget-face",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "The Story of Food: Past, Present, Futures",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-19T16:00:00+05:30",
    "endDate": "2025-10-19T16:00:00+05:30",
    "description": "How do our food choices affect us? How do they shape our societies and our environment? What is eating healthy? \n\nJoin Gurmeet Singh as he explores these questions by tracing our history with food from hunter-gatherers, the dawn of agriculture to the different agricultural revolutions and future science like 3D printing, bioreactors, microbiomics, and nutrigenetics. Gurmeet will further dive into how our food choices have affected us, our society and our planet, going through 3 million years of food history. ",
    "url": "https://sci560.scigalleryblr.org/programmes?p=the-story-of-food",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Archiving Kitchen Heirlooms: Documenting Culinary Heritage",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-19T11:00:00+05:30",
    "endDate": "2025-10-19T11:00:00+05:30",
    "description": "How do you capture the story behind your favourite dish?\n\nJoin Seher Krishna in a series of guided activities that will explore how to use everyday technology to create a rich, multi-layered archive of a recipe that captures not just flavour, but memory and history. Leave the workshop with the ability to begin building your own family food archive.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=archiving-kitchen",
    "maximumAttendeeCapacity": "30"
  },
  {
    "@type": "EducationEvent",
    "name": "A Bite of CALORIE: Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-05T12:00:00+05:30",
    "endDate": "2025-10-05T12:00:00+05:30",
    "description": "Join the Science Gallery Bengaluru team for a closer look at our new exhibition season, CALORIE, one bite at a time. This walkthrough, invites you to reflect on the ideas of food, nutrition, and energy. As we move through the exhibition, the team will unpack the intimate, and often complicated, relationships we share with food, nourishment, and the systems that sustain us.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=general-walkthrough-2",
    "maximumAttendeeCapacity": "60"
  },
  {
    "@type": "EducationEvent",
    "name": "Seeds of Expression",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-25T16:00:00+05:30",
    "endDate": "2025-10-25T16:00:00+05:30",
    "description": "How can knowledge be passed down through a seed?\n\nJoin Arunkumar HG and Dayananda Nagaraju, exhibiting artists of CALORIE, as they explore their exhibits in detail.\n\nLearn about the Akshatha Seedbank with Arunkumar as he shares how it became the foundation of the exhibit Vulnerable Guardians. Discover how this collection of seeds is a living archive of resilience, biodiversity, and cultural memory. Arunkumar will further dive into the ties between farmers, landscapes and seeds, while reflecting on how a seedbank can be a container of knowledge and wisdom from those who came before.\n\nDayananda will reflect on the artistic process behind his exhibit, Atantraru & The Golden Seed. He reflects on how a thought begins like a seed—small, invisible, and full of potential—and how it finds its way into expression through his artistic practice. Dayananda explores the ecology of creativity, the conditions that allow ideas to germinate, the fragility and resilience of expression, and the collective fields in which thoughts grow. Come and learn how an artwork - just like a seed - can carry memory and possibility!",
    "url": "https://sci560.scigalleryblr.org/programmes?p=seeds-of-expression",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Yuck to Yum! Insects for future food",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-12T16:00:00+05:30",
    "endDate": "2025-10-12T16:00:00+05:30",
    "description": "Would you eat insects?\n\nJoin Priyan as he brings us into the world of edible insects. Learn how insects are not only a nutritious alternative to fish and meat but also an environmentally sustainable option for the future. Explore India’s rich but undervalued traditions of entomophagy, highlight the cultural and medicinal uses of insects, and discuss how commercial rearing can provide livelihood opportunities while contributing to insect conservation. Learn why organisations like the FAO have identified insects as one of the most promising food resources to meet global nutritional needs. Step into a world where “yuck” turns into “yum” and discover the future of food.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=yuck-to-yum",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "Event",
    "name": "Eat, Read, Think",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-04T17:00:00+05:30",
    "endDate": "2025-10-04T17:00:00+05:30",
    "description": "Eat, Read, Think is a reading circle run by Science Gallery Bengaluru, bringing together curious minds to explore ideas through literature and conversation. Readings will be themed around the current exhibition season, CALORIE, exploring humanity's fraught and intimate relationship with food through readings inspired by the many exhibits present throughout the gallery. Eat, Read, Think welcomes young people from all walks of life to gather for conversations that connect science, culture and society.\n\nThis reading circle will begin its journey by reading an excerpt from “Dalit Kitchens of Marathwada” by Shahu Patole. Come for community and stay for snacks!",
    "url": "https://sci560.scigalleryblr.org/programmes?p=sgb-reading-circle",
    "maximumAttendeeCapacity": "20"
  }
]