[
  {
    "@type": "EducationEvent",
    "name": "A Bite of CALORIE: Kannada Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-03-01T16:00:00+05:30",
    "endDate": "2026-03-01T16:00:00+05:30",
    "description": "Join the Science Gallery Bengaluru team for a closer look at our new exhibition season, CALORIE, one bite at a time. This walkthrough, conducted in Kannada, invites you to reflect on the ideas of food, nutrition, and energy. As we move through the exhibition, the team will unpack the intimate, and often complicated, relationships we share with food, nourishment, and the systems that sustain us.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=bite-kannada-walkthrough",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "Breaking Down the Artist's Recipe",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-28T16:00:00+05:30",
    "endDate": "2026-02-28T17:30:00+05:30",
    "description": "Every artist has a recipe: a process of gathering ingredients, making creative choices, and shaping how their ideas are shared. Just as our bodies digest food, artists digest their experiences, breaking down observations, narratives, culture, and environments into creative work.\n\nThis walkthrough takes you behind the scenes of CALORIE, exploring how artists transform everyday experiences into art. By looking closely at their “ingredients,” flavour profiles, textures, and choice of medium, we trace the journey from idea to finished work and uncover the many modes of expression artists use to make sense of food, culture, and lived experience.\n\nJoin our experimenters, Nirupama and Shreya, for a playful and participatory walkthrough that treats art-making as explorations, creativity as a shared process, and meaning-making as something we all do every day.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=breaking-down-the-artists-recipe",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "Tell Me What You Eat: Food, Identity and Self",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-03-13T17:00:00+05:30",
    "endDate": "2026-03-13T17:00:00+05:30",
    "description": "How does the food we eat shape our identity and sense of self?\n\nJoin Dipali Khandelwal for a participatory conversation that reflects on the food that we grew up eating, the food we hide and the food that we have lost. Discover how food quietly shapes who we are, where we belong, and what we remember. Recognise disappearing food and the accompanying biodiversity loss. Understand how geographies and histories shape diets. Through this reflective session, learn to create food-identity records that can become part of a growing living archive in India.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=tell-me-what-you-eat",
    "maximumAttendeeCapacity": "20"
  },
  {
    "@type": "EducationEvent",
    "name": "A Bite of CALORIE: Telugu Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-03-07T16:00:00+05:30",
    "endDate": "2026-03-07T17:30:00+05:30",
    "description": "Join the Science Gallery Bengaluru team for a closer look at our new exhibition season, CALORIE, one bite at a time. This walkthrough, conducted in Telugu, invites you to reflect on the ideas of food, nutrition, and energy. As we move through the exhibition, the team will unpack the intimate, and often complicated, relationships we share with food, nourishment, and the systems that sustain us.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=bite-telugu-walkthrough",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "A Bite of CALORIE: Bengali Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-03-08T16:00:00+05:30",
    "endDate": "2026-03-08T17:30:00+05:30",
    "description": "Join the Science Gallery Bengaluru team for a closer look at our new exhibition season, CALORIE, one bite at a time. This walkthrough, conducted in Bangla, invites you to reflect on the ideas of food, nutrition, and energy. As we move through the exhibition, the team will unpack the intimate, and often complicated, relationships we share with food, nourishment, and the systems that sustain us.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=bite-bangla-walkthrough",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "A Bite of CALORIE: Malayalam Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-03-14T16:00:00+05:30",
    "endDate": "2026-03-14T17:30:00+05:30",
    "description": "Join the Science Gallery Bengaluru team for a closer look at our new exhibition season, CALORIE, one bite at a time. This walkthrough, conducted in Malayalam, invites you to reflect on the ideas of food, nutrition, and energy. As we move through the exhibition, the team will unpack the intimate, and often complicated, relationships we share with food, nourishment, and the systems that sustain us.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=bite-malayalam-walkthrough",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "A Bite of CALORIE: Hindi Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-03-15T16:00:00+05:30",
    "endDate": "2026-03-15T17:30:00+05:30",
    "description": "Join the Science Gallery Bengaluru team for a closer look at our new exhibition season, CALORIE, one bite at a time. This walkthrough, conducted in Hindi, invites you to reflect on the ideas of food, nutrition, and energy. As we move through the exhibition, the team will unpack the intimate, and often complicated, relationships we share with food, nourishment, and the systems that sustain us.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=bite-hindi-walkthrough",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "A Bite of CALORIE: Tamil Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-03-21T16:00:00+05:30",
    "endDate": "2026-03-21T17:30:00+05:30",
    "description": "Join the Science Gallery Bengaluru team for a closer look at our new exhibition season, CALORIE, one bite at a time. This walkthrough, conducted in Tamil, invites you to reflect on the ideas of food, nutrition, and energy. As we move through the exhibition, the team will unpack the intimate, and often complicated, relationships we share with food, nourishment, and the systems that sustain us.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=bite-tamil-walkthrough",
    "maximumAttendeeCapacity": "50"
  }
]