[
  {
    "@type": "Event",
    "name": "Superposition: A Dive into the Quantum World",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-11-17T18:30:00+05:30",
    "endDate": "2024-11-17T20:00:00+05:30",
    "description": "Can exploring quantum physics through art change the way we experience reality? Come join Robert Lisek and Dayita Nereyeth as they delve into this evolving landscape. <br><br>This visionary performance will explore the intersections of quantum physics, artificial intelligence, human cognition, and artistic expression, merging these fields into a unique experience that is both philosophical inquiry and experiential art. <br>Set in a dynamic space,  laser lights, video projections and dance respond to quantum principles like superposition, entanglement, interference, and decoherence.<br><br>This immersive installation encourages participants to experience multiple states of being and perceive layers of reality beyond ordinary perception.<br><br>This programmes is part of Studio Quantum, supported by Quantum Delta and V2.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=superposition",
    "performer": [
      {
        "@type": "Person",
        "name": "Robert-Lisek"
      },
      {
        "@type": "Person",
        "name": "Dayita-Nereyeth"
      }
    ],
    "maximumAttendeeCapacity": 80
  },
  {
    "@type": "EducationEvent",
    "name": "Pandemics in Perspective: History of Contagion Before and After Covid",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-12-06T18:00:00+05:30",
    "endDate": "2024-12-06T19:00:00+05:30",
    "description": "How has living through a pandemic reshaped our understanding of the history of contagion and the broader discipline of the history of medicine? Join Flurin Condrau as he examines the profound impact of the recent Covid-19 pandemic. Condrau will explore how the experience of living through a pandemic shifts historical perspectives on infection. <br><br>The pandemic has not only created new avenues for public engagement but also inspired profound reconsideration of the purpose and scope of medical history.<br> Come be a part of this thought-provoking lecture and gain fresh insights into the ways global health crises reshape our understanding of disease, society, and the role of history in public health.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=pandemics-in-perspective",
    "performer": [
      {
        "@type": "Person",
        "name": "Flurin-Condrau"
      }
    ],
    "maximumAttendeeCapacity": 70
  }
]