[
  {
    "@type": "EducationEvent",
    "name": "Understanding Digital Change Through Postcolonial Politics",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-16T18:00:00+05:30",
    "endDate": "2026-01-16T20:00:00+05:30",
    "description": "How are people’s online and offline lives connected? How do people navigate the space between the digital and the analogue, especially in the context of oppression? \n\nJoin Claire Crawford in a public lecture as she examines these questions from her forthcoming book, ‘Tethered’. The book combines ethnographic engagement with social movements and postcolonial ideas to understand why history and place matter. In the book she introduces ‘tethering’ as a simple way to recognise how digital change depends on context. The project addresses a ‘blind spot’ where many theories about digital change ignore differences between people and individual choice.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=understanding-digital-change",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "Event",
    "name": "Eat, Read, Think",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-18T17:00:00+05:30",
    "endDate": "2026-01-18T17:00:00+05:30",
    "description": "Eat, Read, Think is a reading circle run by Science Gallery Bengaluru, bringing together curious minds to explore ideas through literature and conversation. Readings will be themed around the current exhibition season, CALORIE, exploring humanity's fraught and intimate relationship with food through readings inspired by the many exhibits present throughout the gallery. Eat, Read, Think welcomes young people from all walks of life to gather for conversations that connect science, culture and society.\n\nFor the fourth session of the reading circle, we will be reading excerpts from the book 'Palm Oil: The Grease of Empire' by Max Haiven",
    "url": "https://sci560.scigalleryblr.org/programmes?p=eat-read-think-4",
    "maximumAttendeeCapacity": "30"
  },
  {
    "@type": "EducationEvent",
    "name": "Exploring Public Spaces as Playgrounds",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-17T11:00:00+05:30",
    "endDate": "2026-01-17T17:00:00+05:30",
    "description": "Science and play aren’t supposed to mix, apparently, like oil and water. What if our gallery proves otherwise?\n\nUsing Science Gallery’s CALORIE exhibition as our playground, we’ll turn spaces, objects, and information into rules, challenges, and stories for site-based games. Swapnesh Samaiya, Game Designer and Researcher at the National Institute of Design, invites participants to engage with exhibits through play. Together, we'll explore how play can transform the way we experience public spaces.\n\nThis workshop requires no prior experience in games or design. Participants are requested to bring their laptops. ",
    "url": "https://sci560.scigalleryblr.org/programmes?p=public-spaces-as-playgrounds",
    "maximumAttendeeCapacity": "15"
  },
  {
    "@type": "EducationEvent",
    "name": "CALORIE - Taste of Remembering",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-31T16:00:00+05:30",
    "endDate": "2026-01-31T17:30:00+05:30",
    "description": "Wistful Sunday mornings over chai and biscuits listening to the pattering of rain.\nRoasted rotis and sharing fragrant curries around a dining table.\nGoldeny sweet jalebes that capture the rich lights of festivals. Memories of food is more than its taste.\n\nJoin us on a walkthrough of Calorie where we explore food as nostalgia! Through art, stories, and interactive moments, we will explore the meals we once ignored, the flavors we miss the most, and the small rituals that quietly shaped us.\n\nCome for the stories, stay to colour.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=calorie-taste-of-remembering",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "After the First Bite: Leftovers Potluck",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-24T11:00:00+05:30",
    "endDate": "2026-01-24T14:00:00+05:30",
    "description": "Have you ever been to a leftovers potluck? \n\nLed by Ritaban Ghosh, this potluck examines whether hygiene and edibility are shaped by our beliefs and habits that we inherit, choose, or find difficult to leave behind. Is disgust a property of things, or an emotion that shapes moral codes? Is food (or waste) often a matter of attitude?\n\nWhether it’s pasta from a sunday brunch or rasam from the time you caught a cold. The older, the better. Plates will be exchanged and passed around after every bite. Eating in relay, we’ll pause at different stages of the food’s life, before it becomes waste, or perhaps doesn’t at all.\n\nLearn how to turn leftovers into consumable capsules and create a mind map on where edibility is withdrawn, how habits are reciprocal, and when refusal becomes aesthetic.\n\nParticipants are invited to bring leftovers. \n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=leftovers-potluck",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "To Eat or Not to Eat? On Edibility",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-25T04:00:00+05:30",
    "endDate": "2026-01-25T06:00:00+05:30",
    "description": "Sunday mornings often begin with a peek into the fridge with wilted greens, sprouting spuds and a questionable stench, followed by the question: to eat or not to eat? Deciding what to consume and what to discard is a perennial struggle. In doing so, we enter uneasy intimacies shaped by affordance, access and surplus. \n\nIn this talk, Ritaban Ghosh examines food and waste, asking: where does the boundary between purity and contamination lie? What truly determines edibility? He traces the processes through which food comes to be classified as waste, while moving across the globe, where repurposed food becomes sustenance. From Mexico’s *Huitlacoche*, a regional corn fungus delicacy, to Indonesia’s *Kopi luwak*, coffee beans collected from Civet excrement, food is far more complex than we often assume.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=on-edibility",
    "maximumAttendeeCapacity": "50"
  }
]