[
  {
    "@type": "EducationEvent",
    "name": "The Story of the Great Trigonometrical Survey",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-07-05T16:00:00+05:30",
    "endDate": "2025-07-05T16:00:00+05:30",
    "description": "Have you ever heard of the Great Trignometrical Survey?<br><br><br><br>Join us as Meera Iyer and Shruthi Rao take us through the story of one of the most astounding projects in the history of science. From its origins in Bengaluru all the way to the heights of the Himalayas. The talk will touch upon some of the most famous surveyors in the GTS including William Lambton and George Everest. Exploring why exactly these surveyors had to tramp across the country, braving wild beasts, monsoons, and disease in their quest for inch-perfect maps? It will also speak about some of the forgotten Indians who were a part of this extraordinary work. <br>",
    "url": "https://sci560.scigalleryblr.org/programmes?p=great-trignometrical-survey",
    "performer": [
      {
        "@type": "Person",
        "name": "Meera-Iyer"
      },
      {
        "@type": "Person",
        "name": "Shruthi-Rao"
      }
    ],
    "maximumAttendeeCapacity": 100
  },
  {
    "@type": "EducationEvent",
    "name": "Industrial Dreams and Digital Realities: Self Reliance in Bengaluru",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-07-06T16:00:00+05:30",
    "endDate": "2025-07-06T16:00:00+05:30",
    "description": "How has the desire for self-reliance evolved in Bengaluru? <br>In recent years, slogans to ‘Make in India’, harnessing a desire to become Self Reliant or Atmanirbhar Bharat have become ubiquitous. As ambitious as they are, they are not new. The early years of newly decolonized India, much like many other nascent nations across Asia and Africa, embraced self-reliance as a way of achieving economic and political independence from imperial powers.<br>A number of these technological and industrial projects were located in the city of Bengaluru, making it a true city of Science and Technology. At different points these projects enrolled key actors, from the model citizen-worker to the ‘tech entrepreneur’. Join Aditi Dey as she traces these episodes of Bengaluru’s history and the emergence of the celebrated figure of the ‘tech entrepreneur’. Diving into the history of technopolitics in Bengaluru.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=industrial-dreams-digital-realities",
    "performer": [
      {
        "@type": "Person",
        "name": "Aditi-Dey"
      }
    ],
    "maximumAttendeeCapacity": 100
  },
  {
    "@type": "Event",
    "name": "Bird Walk At Harohalli Kere",
    "location": {
      "@type": "Place",
      "name": "Harohalli Kere",
      "address": "Harohalli Kere, Bangalore",
      "url": "https://maps.app.goo.gl/8xwabwP2f6qVmmFW6"
    },
    "startDate": "2025-07-06T07:30:00+05:30",
    "endDate": "2025-07-06T07:30:00+05:30",
    "description": "Come and hang out with some of Bengaluru's feathered citizens!<br>Join us for a birdwalk around Harohalli Kere led by Ashwin Viswanathan. Spend the morning spotting and learning about the many birds that call our city and its lakes home. Learn to identify these birds by sight and sound. Open to everyone from beginners to experienced birdwatchers.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=bird-walk-harohalli",
    "performer": [
      {
        "@type": "Person",
        "name": "Ashwin-Viswanathan"
      }
    ],
    "maximumAttendeeCapacity": 35
  }
]