[
  {
    "@type": "Event",
    "name": "Invisible Work in the Digital Economy",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-22T17:00:00+05:30",
    "endDate": "2026-02-22T19:00:00+05:30",
    "description": "Are your 10 minute deliveries worth the labour? \n\nCycling through the streets of London, artist Beth Fox's 12 lemons documents her experience working for a food delivery company. We will screen this video essay to reflect on the gig economy and the tightly controlled labour behind one-click food deliveries.\n\nIt will be followed by a discussion on the physical, emotional, and psychological effects of platform work across sectors such as food delivery, data annotation, and content moderation. Our panelists will discuss the difficult nature of such work and the systems behind the gig and platform sectors' labour issues, while touching upon social security for platform labour, as well as the developments necessary for safe and dignified work.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=Invisible-Work-in-the-Digital-Economy",
    "maximumAttendeeCapacity": "70"
  },
  {
    "@type": "EducationEvent",
    "name": "Breaking Down the Artist's Recipe",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-28T16:00:00+05:30",
    "endDate": "2026-02-28T17:30:00+05:30",
    "description": "Every artist has a recipe: a process of gathering ingredients, making creative choices, and shaping how their ideas are shared. Just as our bodies digest food, artists digest their experiences, breaking down observations, narratives, culture, and environments into creative work.\n\nThis walkthrough takes you behind the scenes of CALORIE, exploring how artists transform everyday experiences into art. By looking closely at their “ingredients,” flavour profiles, textures, and choice of medium, we trace the journey from idea to finished work and uncover the many modes of expression artists use to make sense of food, culture, and lived experience.\n\nJoin our experimenters, Nirupama and Shreya, for a playful and participatory walkthrough that treats art-making as explorations, creativity as a shared process, and meaning-making as something we all do every day.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=breaking-down-the-artists-recipe",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "Tell Me What You Eat: Food, Identity and Self",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-03-13T17:00:00+05:30",
    "endDate": "2026-03-13T17:00:00+05:30",
    "description": "How does the food we eat shape our identity and sense of self?\n\nJoin Dipali Khandelwal for a participatory conversation that reflects on the food that we grew up eating, the food we hide and the food that we have lost. Discover how food quietly shapes who we are, where we belong, and what we remember. Recognise disappearing food and the accompanying biodiversity loss. Understand how geographies and histories shape diets. Through this reflective session, learn to create food-identity records that can become part of a growing living archive in India.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=tell-me-what-you-eat",
    "maximumAttendeeCapacity": "20"
  }
]