[
  {
    "@type": "EducationEvent",
    "name": "Tangible Selfies: Materialising Personal Data",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-04T15:00:00+05:30",
    "endDate": "2026-01-04T15:00:00+05:30",
    "description": "What if we could reflect on data about ourselves, not through charts and apps but with tangible materials?\n\nIn this workshop, Rasagy Sharma will explore personal data through the lens of quantified self-practices and tangible data representation. In a world obsessed with big data, large data models and digital automation, this workshop invites you to slow down and observe your daily lives with intention and curiosity. Participants will explore how to curate and make physical artefacts with their data. \n\nWhether you maintain detailed journals, use digital tracking apps, or are just curious to visualise a new year’s resolution, you’ll leave with a new perspective about data and its representation.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=tangible-selfies",
    "maximumAttendeeCapacity": "40"
  },
  {
    "@type": "EducationEvent",
    "name": "CALORIE meets Ghibli: People, Food and Stories",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-04T16:00:00+05:30",
    "endDate": "2026-01-04T17:30:00+05:30",
    "description": "Studio Ghibli, the Japanese animation studio known for stories with heart and meaning, teams up with CALORIE to serve up some serious food for thought.\nThe studio has a recurring theme of cooking and eating to connect the viewers and the worlds within the Ghibli movies. And when looking at an exhibition which also uses food as a connector, the two coming together was inevitable. \n\nWe will be exploring themes of history, politics and the environment, bringing together our exhibits and our favourite movies. \n\nSo, are you ready to be Spirited Away? Will you Totoro-ly love it? Where might this Moving Castle take us next?\n\nIf you got these puns…this walkthrough will be right up your alley!\nAnd if not? Come find out!\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=calorie-meets-ghibili-people-food-and-stories",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "Understanding Digital Change Through Postcolonial Politics and Resistance",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-16T18:00:00+05:30",
    "endDate": "2026-01-16T20:00:00+05:30",
    "description": "How are people’s online and offline lives connected? How do people navigate the space between the digital and the analogue, especially in the context of oppression? \n\nJoin Claire Crawford in a public lecture as she examines these questions from her forthcoming book, ‘Tethered’. The book combines ethnographic engagement with social movements and postcolonial ideas to understand why history and place matter. In the book she introduces ‘tethering’ as a simple way to recognise how digital change depends on context. The project addresses a ‘blind spot’ where many theories about digital change ignore differences between people and individual choice.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=understanding-digital-change",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "Event",
    "name": "Exhibition Opening: Women in Mathematics Around the World",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-10T18:00:00+05:30",
    "endDate": "2026-01-10T18:00:00+05:30",
    "description": "Join us for the opening of the exhibition ‘Women in Mathematics Around the World’. The exhibition brings together photographic narratives of women mathematicians from around the world and explores the lives, work, and intellectual journeys that shape the production of mathematics across different contexts. \n\nThe exhibition is presented in collaboration with the Consulate General of the Federal Republic of Germany in Bengaluru, the International Centre for Theoretical Sciences (ICTS), and the Raman Research Institute (RRI).\n\nFollowing opening remarks there will be a guided walkthrough of the exhibition.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=women-in-mathematics-opening",
    "maximumAttendeeCapacity": "80"
  }
]