[
  {
    "@type": "Event",
    "name": "Specimens and Stories: A Visit to Natural History Collections",
    "location": {
      "@type": "Place",
      "name": "National Centre for Biological Sciences",
      "address": "National Centre for Biological Sciences, Bangalore",
      "url": "https://maps.app.goo.gl/sZgsVT4sgj9Ub1Z69"
    },
    "startDate": "2025-06-29T11:00:00+05:30",
    "endDate": "2025-06-29T13:00:00+05:30",
    "description": "How are specimens collected, preserved, and studied?<br><br>Join us at the Natural History Collections at NCBS and discover the fascinating world of specimens. This visit will be an opportunity to see how scientists collect, preserve, and study specimens that help us understand the story of our planet’s biodiversity. From pressed plants and drawers full of insects to preserved bird specimens, every item offers clues about biodiversity, evolution, and environmental change. Participants will also learn how these collections support research, education, and conservation, and hear the stories behind them.<br><br>",
    "url": "https://sci560.scigalleryblr.org/programmes?p=specimens-stories",
    "performer": [
      {
        "@type": "Person",
        "name": "Pritha-Dey"
      }
    ],
    "maximumAttendeeCapacity": 30
  },
  {
    "@type": "EducationEvent",
    "name": "Commons Across Scale and Space",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-06-15T14:30:00+05:30",
    "endDate": "2025-06-15T15:30:00+05:30",
    "description": "What do the landscape markers of Bangalore reveal about its people and their relationship with nature? <br><br>The territory of Bangalore is a complex composition of rocky outcrops, high grounds, flat lands and valleys. The process of occupation is premised on the idea of effective management of water and its associated infrastructure – both manmade and natural. The natural capacity of the land finds varied expressions in human use – from settlements to sacred groves, from seasonal and perennial agriculture to grasslands. Join Dr. Mohan Rao as he unpacks the complex mosaic of Bangalore’s landscape, where markers of culture and belief—both sacred and everyday—are deeply embedded. These layered terrains can be seen as ‘watermarked’ by human interaction, creating a powerful sense of place, belonging, and identity, and reflecting a longstanding relationship between society and nature.<br><br>This programme is in collaboration with Integrated Design.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=commons-scale-space",
    "performer": [
      {
        "@type": "Person",
        "name": "Mohan-Rao"
      }
    ],
    "maximumAttendeeCapacity": 100
  },
  {
    "@type": "Event",
    "name": "Urban Commons: Ecology, Equity & Public Space",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-06-15T15:30:00+05:30",
    "endDate": "2025-06-15T16:30:00+05:30",
    "description": "How can we reimagine commons in rapidly urbanising cities ?<br><br>Urban commons—lakes, parks, housing collectives, and public spaces—are increasingly under pressure as cities grow. Join Anjali Karol Mohan, Sony Pellissery, Brinda Sastry, Sandhya Naidu, and Mohan Rao in a panel discussion that explores how we might rethink these shared spaces—from blue-green infrastructure and historic water systems to the governance of condominiums and the politics of public space design. Through diverse perspectives, the panel examines how collective stewardship, inclusive planning, and community-led design can help reimagine commons in ways that are ecologically sustainable, socially just, and deeply rooted in local context.<br><br>This programme is in collaboration with Integrated Design.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=urban-commons-space",
    "performer": [
      {
        "@type": "Person",
        "name": "Anjali-Mohan"
      },
      {
        "@type": "Person",
        "name": "Sony-Pellisery"
      },
      {
        "@type": "Person",
        "name": "Brinda-Sastry"
      },
      {
        "@type": "Person",
        "name": "Sandhya-Naidu"
      },
      {
        "@type": "Person",
        "name": "Mohan-Rao"
      }
    ],
    "maximumAttendeeCapacity": 100
  },
  {
    "@type": "EducationEvent",
    "name": "Translating Science into Impact: Our PCR Innovation Story (tentative title)",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-06-22T16:00:00+05:30",
    "endDate": "2025-06-22T16:00:00+05:30",
    "description": "How have innovations in molecular biology changed our lives?<br><br>Sometimes it can be difficult to directly connect modern scientific discovery to its real world impacts. Chandrsekhar Nair will bridge this gap by leading the audience through the story of how a deep understanding of molecular biology and PCR (Polymerase Chain Reaction) technology led to innovative solutions with tangible outcomes. Through his lecture he highlights how essential it is to translate science into innovation.<br>",
    "url": "https://sci560.scigalleryblr.org/programmes?p=pcr-innovation",
    "performer": [
      {
        "@type": "Person",
        "name": "Chandrasekhar-Nair"
      }
    ],
    "maximumAttendeeCapacity": 100
  },
  {
    "@type": "EducationEvent",
    "name": "Decoding 'Birds in the City': A Board Game For Engaging With Urban Nature",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-06-21T16:00:00+05:30",
    "endDate": "2025-06-21T16:00:00+05:30",
    "description": "Can games be a tool for public engagement with nature?<br><br>Join us to play Birds in the City: Bengaluru Edition, a board game designed to explore bird diversity and ecological change in urban areas. Created through a research-driven, iterative design process, the game can be used as an educational tool for sparking dialogue about wildlife in cities like Bengaluru.<br><br>This workshop invites you to experience the game firsthand and hear from the creators at ‘Play in Nature’ about how they blended research, design, and storytelling to create this game. Join us to explore how serious games can be designed to support environmental awareness and learning.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=birds-in-the-city",
    "performer": [
      {
        "@type": "Person",
        "name": "Priti-Bangal"
      },
      {
        "@type": "Person",
        "name": "Prasad-Sandbhor"
      },
      {
        "@type": "Person",
        "name": "Nicole-Elsa-Daniel"
      }
    ],
    "maximumAttendeeCapacity": 35
  }
]