[
  {
    "@type": "Event",
    "name": "Sense and Scientific Method: Sci560 Exhibition Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-11-09T17:00:00+05:30",
    "endDate": "2024-11-09T19:00:00+05:30",
    "description": "As humans, we have an intrinsic need to understand the world around us. We have evolved from crafting simple tools to mastering technologies with the potential to reshape the planet. We invented language, deconstructed planetary motion and split the atom. Through the ages, we have built better and sophisticated tools that let us expand the range of what we can perceive, letting us ‘sense’ beyond the limits of biology.<br>In this walkthrough, mediators Jagrut Amuri and Vignesh K use the current exhibition season Sci560 as an anchor to explore how we use senses to understand our world and the role that science plays in deepening this understanding.<br>",
    "url": "https://carbon.scigalleryblr.org/programmes?p=sense-walkthrough",
    "performer": [
      {
        "@type": "Person",
        "name": "Science-Gallery-Team"
      }
    ],
    "maximumAttendeeCapacity": 60
  },
  {
    "@type": "Event",
    "name": "Synthesising Sound and Video with AI",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-11-10T11:00:00+05:30",
    "endDate": "2024-11-10T13:00:00+05:30",
    "description": "How can we create videos electronically, without a camera? How to manipulate audio signals to create sound? Come learn more in this hands-on session by Robert B. Lisek where he opens up the art of video and sound synthesis using open-source software such as Pure Data/Max MSP, SuperCollider, Hydra, JavaScript, and shader programming. <br>Delve into programming and AI-driven code generation methods for producing sound, visuals, and video content tailored for performances, installations, interactive media, and networking. <br><br>Prior programming experience is not required. Participants will be required to bring their own laptop for the event.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=synthesise-ai",
    "performer": [
      {
        "@type": "Person",
        "name": "Robert-Lisek"
      }
    ],
    "maximumAttendeeCapacity": 40
  },
  {
    "@type": "Event",
    "name": "Sigh-ence and Bengaluru: Quiz",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-11-10T17:00:00+05:30",
    "endDate": "2024-11-10T19:00:00+05:30",
    "description": "Sighence will dwell on the stories, on the rare thrills and the frequent spills that are part of the history of Bengaluru as a science city. Join Arul Mani from St. Joseph’s University in learning about the city through a quiz.<br><br>Written Quiz. Teams of two.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=sighence-bengaluru-quiz",
    "performer": [
      {
        "@type": "Person",
        "name": "Arul-Mani"
      }
    ],
    "maximumAttendeeCapacity": 70
  },
  {
    "@type": "Event",
    "name": "Superposition: A Dive into Human Conciousness",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-11-17T18:30:00+05:30",
    "endDate": "2024-11-17T20:00:00+05:30",
    "description": "Can exploring quantum physics through art change the way we experience reality and consciousness? Come join Robert Lisek and Dayita Nereyeth as they delve into the evolving landscape of human consciousness. This visionary performance will explore the intersections of quantum physics, artificial intelligence, human cognition, and artistic expression, merging these fields into a unique experience that is both philosophical inquiry and experiential art. <br>Set in a dynamic space where laser lights, video projections, and dance respond to quantum principles like superposition, entanglement, interference, and decoherence, SUPERPOSITION reflects the fluid interconnectedness of human thought.<br><br>This immersive installation encourages participants to experience multiple states of being and perceive layers of reality beyond ordinary perception.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=superposition",
    "performer": [
      {
        "@type": "Person",
        "name": "Robert-Lisek"
      }
    ],
    "maximumAttendeeCapacity": 80
  }
]