[
  {
    "@type": "EducationEvent",
    "name": "Hands that Feed, Bodies that Burn",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-09-27T11:00:00+05:30",
    "endDate": "2025-09-27T11:00:00+05:30",
    "description": "How much labour goes into your food?\n\nJoin Dayananda Nagaraju for an interactive workshop exploring the physical energy in traditional methods of food preparation. Before machines, tasks like paddy pounding and rice preparation demanded both skill and strength—labour often carried by women who worked as both homemakers and farmers. In this workshop, the artist’s mother will demonstrate these practices and their physical intensity. The workshop bridges culture, science, and health, presenting calories not only as measures of food, but as movements of the body and testimonies of women’s invisible work in sustaining both families and fields.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=hands-feed-bodies-burn",
    "maximumAttendeeCapacity": "40"
  },
  {
    "@type": "EducationEvent",
    "name": "Songs of Food and Hunger",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-05T16:00:00+05:30",
    "endDate": "2025-10-05T16:00:00+05:30",
    "description": "How are music and food connected?\n\nExplore the diverse connections, conversations and clashes between music and food with Achintya Prahlad. Learn how Indians have been thinking of these connections for centuries through mediums like agricultural work songs and even ancient books on theatre like the Natya Shastra. Understand how realities like hunger find themselves represented in songs of devotion and protest. Come and be introduced to the world of food-related music research.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=songs-of-food-and-hunger",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Climate and Food: Getting to the Meat of the Matter",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-09-20T11:00:00+05:30",
    "endDate": "2025-09-20T11:00:00+05:30",
    "description": "From planetary diets to vegan diets, various advocates call for a move towards plant-based food as a way to address climate change.  \n\nHowever, a number of questions remain. How does food production relate with climate change? Is going Vegan or Vegetarian the best way ahead? Should we eat locally? Is this a feasible strategy for India? What factors shape our food choices (locally, nationally, and globally) and why do they matter for climate change? \n\nThis workshop will help participants figure out the idea of food choices and climate change by breaking down the various environmental, socio-economic, and climate related factors affecting such choices.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=climate-and-food",
    "maximumAttendeeCapacity": "30"
  },
  {
    "@type": "EducationEvent",
    "name": "The Nutritional Code: Unlocking your Genomic Menu",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-09-20T16:00:00+05:30",
    "endDate": "2025-09-20T16:00:00+05:30",
    "description": "How does your DNA affect your health?\n\nJoin Ashok Gopinath as he explores how advances in genomics are transforming everything from personalised nutrition and fitness to disease prevention and well-being. Discover how understanding your genes can help you make smarter choices on food, exercise, and even sleep. Ashok will trace the journey of genomics from scientific breakthrough to its disruptive role in building healthier lives and communities. Moreover, you will also learn about the future of precision health and see how your genetic code can help shape better health futures.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=the-nutritional-code",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "A Bite of CALORIE: Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-09-27T17:00:00+05:30",
    "endDate": "2025-09-27T17:00:00+05:30",
    "description": "Join the Science Gallery Bengaluru team for a closer look at our new exhibition season, CALORIE, one bite at a time. This walkthrough, invites you to reflect on the ideas of food, nutrition, and energy. As we move through the exhibition, the team will unpack the intimate, and often complicated, relationships we share with food, nourishment, and the systems that sustain us.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=general-walkthrough-1",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "Why should we care what frogs eat?",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-11T16:00:00+05:30",
    "endDate": "2025-10-11T16:00:00+05:30",
    "description": "What can frogs and toads do for us?\n\nJoin Seshadri as he shows us how the amphibians that we often label as creepy crawlies actually play a vital role as part of our food chain, quietly protecting our crops. Sharing insights from his research into how a rich diversity of frogs and toads helps sustain our ecosystems and agricultural landscapes. He will explore their vital role as natural pest controllers and how they could be a powerful antidote to the excessive spraying of pesticides. The talk will also have an interactive component where he will show how a healthy frog population is directly linked to the food we eat through a short game.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=frogs-and-toads",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Difficulty Remembering Faces? Or Never Forget a Face",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-09-28T16:00:00+05:30",
    "endDate": "2025-09-28T18:00:00+05:30",
    "description": "Have you ever instantly recognised a face or completely missed one?\n\nFaces are the foundation of human connection, yet our understanding of face perception has been shaped almost entirely by studies on Western populations. India, home to one-sixth of the world’s population, has remained absent from this research despite its immense diversity. Join SP Arun and Vaishnavi Mohite as they introduce the first large-scale project on face perception in India, focused on individuals with extraordinary recognition abilities (super recognisers) and those with severe impairments (prosopagnosia). \n\nThey will discuss the development of the Indian Face Memory Test (IFMT), a tool tailored to the unique features of Indian faces, and standardising clinical protocols for prosopagnosia research in the country. This project not only replicates classic findings such as the face inversion effect across cultures but also asks new questions, such as how contextual cues like clothing, voice, and hairstyle aid recognition when face perception fails. By combining behavioural measures with computational modelling, they aim to uncover both universal and culturally specific principles of face perception.\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=never-forget-face",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "The Story of Food: Past, Present, Futures",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-19T16:00:00+05:30",
    "endDate": "2025-10-19T16:00:00+05:30",
    "description": "How do our food choices affect us? How do they shape our societies and our environment? What is eating healthy? \n\nJoin Gurmeet Singh as he explores these questions by tracing our history with food from hunter-gatherers, the dawn of agriculture to the different agricultural revolutions and future science like 3D printing, bioreactors, microbiomics, and nutrigenetics. Gurmeet will further dive into how our food choices have affected us, our society and our planet, going through 3 million years of food history. ",
    "url": "https://sci560.scigalleryblr.org/programmes?p=the-story-of-food",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Archiving Kitchen Heirlooms: Documenting Culinary Heritage",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-19T11:00:00+05:30",
    "endDate": "2025-10-19T11:00:00+05:30",
    "description": "How do you capture the story behind your favourite dish?\n\nJoin Seher Krishna in a series of guided activities that will explore how to use everyday technology to create a rich, multi-layered archive of a recipe that captures not just flavour, but memory and history. Leave the workshop with the ability to begin building your own family food archive.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=archiving-kitchen",
    "maximumAttendeeCapacity": "30"
  }
]