[
  {
    "@type": "EducationEvent",
    "name": "Chittara: Discovering the Art and Culture of Karnataka’s Deevaru Community",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-12-08T16:00:00+05:30",
    "endDate": "2024-12-08T19:00:00+05:30",
    "description": "Have you ever wondered how art can reflect the traditions, beliefs and practices of a community? <br><br>Join Geetha Bhat , Pavitra Mohan and Namrata Cavale for a hands-on workshop exploring Chittara, the traditional mural art of the Deevaru community from Shimoga district, Karnataka. Discover the rich symbolism behind the designs, learn about the natural colors and eco-friendly materials used, and delve into the cultural stories that shape this unique art forms. <br>As part of the session, participants will get an exclusive walkthrough of the stunning Chittara mural created outside the Science Gallery Bengaluru building.<br><br>This programme is a part of BLR Hubba.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=chittara-art",
    "performer": [
      {
        "@type": "Person",
        "name": "Geetha-Bhat"
      },
      {
        "@type": "Person",
        "name": "Namrata-Cavale"
      },
      {
        "@type": "Person",
        "name": "Pavitra-Mohan"
      }
    ],
    "maximumAttendeeCapacity": 30
  },
  {
    "@type": "Event",
    "name": "Maths for the Masses: Experiments in Public Engagement",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-12-13T18:00:00+05:30",
    "endDate": "2024-12-13T19:30:00+05:30",
    "description": "Public engagement plays a crucial role in bridging the gap between academia, science, and society, transforming specialised knowledge into accessible narratives that inspire and inform. This discussion brings together Marcus du Sautoy and Jahnavi Phalkey, to explore the transformative power of public engagement. Together, they will unpack  fundamental questions: What problems does public engagement address? Why do we pursue it? How can we measure its success? And most importantly, how can we do it better? By reflecting on their own experiences and examining innovative strategies, they aim to spark a dialogue about making knowledge more inclusive and impactful.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=maths-for-masses",
    "performer": [
      {
        "@type": "Person",
        "name": "Marcus-Du-Sautoy"
      },
      {
        "@type": "Person",
        "name": "A 24"
      }
    ],
    "maximumAttendeeCapacity": 60
  }
]