[
  {
    "@type": "EducationEvent",
    "name": "Forbidden Desire: Sugar Blowing Workshop",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-16T11:00:00+05:30",
    "endDate": "2025-11-16T13:00:00+05:30",
    "description": "Sugar is a material full of contrasts, a sweet delight and a forbidden indulgence. Inspired by artist Jade Armstrong’s original concept, this workshop explores the delicate balance between beauty, sweetness, and the fleeting nature of life.\n\nIn this workshop, Chef Pratyay will guide the participants to learn and to create intricate sugar-blown sculptures, each capturing a single breath and symbolising both the passage of time and the fragility of life. As these sculptures slowly melt into syrupy residue, they reflect sugar’s transformation from a prized luxury to an overconsumed treat.\n\nThis hands-on experience encourages reflection on desire, decay, and consumption.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=sugar-blowing1",
    "maximumAttendeeCapacity": "25"
  },
  {
    "@type": "EducationEvent",
    "name": "Young Birders Month: Explore Nature through Board Games",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-22T10:00:00+05:30",
    "endDate": "2025-11-22T10:00:00+05:30",
    "description": "Can a board game help us explore nature?\n\nWhether you're a seasoned gamer or just curious about nature, come explore the world through a new lens. Join Jignasa Patel and Priti Bangal for a morning of nature-themed board gaming on the occasion of Young Birders Month celebration! Discover nature in an interactive and hands-on way. This programme will be the perfect chance to try a new game regardless of skill level.  Join in to meet new people and enjoy some screen free fun.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=nature-boardgame-ncf",
    "maximumAttendeeCapacity": "20"
  },
  {
    "@type": "EducationEvent",
    "name": "Caloric Connections in The Rainforest",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-09T16:00:00+05:30",
    "endDate": "2025-11-09T16:00:00+05:30",
    "description": "Have you ever wondered what life is like in a rainforest?\n\nJoin T. ganesh on a fascinating journey into the lush rainforests of the Kalakad–Mundanthurai Tiger Reserve. Explore the intricate relationships between plants and animals that have evolved over millions of years in the Western Ghats. Discover the story of a remarkable tree—whose parts are familiar in indian kitchens as a spice—serving as both culinary delight and vital sustenance for forest creatures. From elusive mice to agile canopy-dwelling monkeys, uncover how persistence and patience has led to remarkable discoveries in these ancient forests, long before modern technology made exploration easier.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=rainforest-caloric-connections",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Hungry City: Food Insecurity Among Labour Migrants",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-15T16:00:00+05:30",
    "endDate": "2025-11-15T16:00:00+05:30",
    "description": "Have you ever wondered what food security looks like in Indian cities?\n\nWhile urban conversations often focus on cutting carbs, counting calories, and following the latest diet trends, a very different story unfolds among the millions of low-skilled migrant workers who keep these cities running. Join Chetan Choithani as he explores the hidden face of urban food insecurity through the experiences of nearly 600 labour migrants in Bengaluru. Many of these workers leave their villages in search of better livelihoods, only to find themselves in precarious informal jobs that force them to compromise on their own nutrition—skipping meals, eating poorly, and sometimes going hungry. Through their stories, this lecture reveals how India’s food insecurity challenge is shifting—from being largely rural to becoming an increasingly urban concern.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=hungry-city",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "Event",
    "name": "Game On: Learning Through Play",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-09T11:00:00+05:30",
    "endDate": "2025-11-09T11:00:00+05:30",
    "description": "Each year on November 10, the International Science Day for Peace and Development celebrates science’s role in shaping a more sustainable and peaceful world. This year, Game On invites you to explore these ideas through curiosity and play. Together, we will experiment with games that reveal how climate change affects what we grow, how our energy choices shape the planet, and how imagination can open paths to peace. The session concludes with a reading of Ursula K. Le Guin’s The Carrier Bag Theory of Fiction and a collective blackout poetry exercise inspired by it.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=game-on",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "VisualArtsEvent",
    "name": "Innovation in Jazz",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-12T18:00:00+05:30",
    "endDate": "2025-11-12T18:00:00+05:30",
    "description": "Bengaluru Jazz Fest 2025 reimagines the long conversation between Indian classical music and jazz, uncovering the threads of Indo-German collaboration that have shaped this exchange for over forty-five years.\n\nWith the support of Bosch, whose seventy-year journey in Bengaluru reflects a shared ethos of invention and dialogue, the festival becomes a space to question how art and technology intersect — and how improvisation drives both.\n\nBeyond performance, the festival explores the psychological and sociological effects of collaboration: how shared rhythm and resonance influence perception, community, and creative identity.\n\nBengaluru Jazz Fest 2025 invites you to listen differently to explore sound as a form of inquiry, memory, and transformation.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=innovation-jazz",
    "maximumAttendeeCapacity": "100"
  },
  {
    "@type": "EducationEvent",
    "name": "Testing The Boundaries of Quantum Mechanics: Nobel Prize in Physics",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-09T16:00:00+05:30",
    "endDate": "2025-11-09T16:00:00+05:30",
    "description": "Are you curious about Quantum Mechanics?\n\nJoin Anil Ananthaswamy as he explores the discoveries of John Clarke, Michel H. Devoret and John M. Martinis the winners of this year's Nobel Prize in Physics. Dive into the question that has haunted physicists since the birth of quantum mechanics. How big can a system get before it stops behaving quantum mechanically and hews to theories of classical physics? Does nature have a quantum-classical boundary?. Explore the prize winners work in showing quantum mechanical tunneling and other quantum effects in macroscopic electrical circuits, suggesting that quantum theory remains applicable as objects get bigger. Anil will discuss the work that won the Nobel Prize, how it pushed the quantum-classical boundary beyond previously known limits, and the implications for technologies such as quantum computers.\n\nThe lecture will be followed by a panel discussion on Quantum Mechanics with Arindam Ghosh and Shobhana Narasimhan.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=quantumn-mechanics",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Eyes on the Prize' : Looking at the Nobel and Other Prizes for Literature",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-14T17:00:00+05:30",
    "endDate": "2025-11-14T18:30:00+05:30",
    "description": "As we read more and more in translation, the world of literature grows smaller and more intimate. We learn about other people and other cultures. And we realise that across the planet, all humans have the same hopes and fears, the same desires and anxieties. More than any other discipline, literature demonstrates and celebrates our common humanity. The number of literary prizes has grown rapidly in the last few decades, especially prizes for a single book. Where have these prizes come from and whom do they go to? This talk looks at some of the political, aesthetic and commercial interests that lie behind literary prizes.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=eyes-on-prize",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "Event",
    "name": "Council of Foods: A Human and an AI at the Table",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-22T17:00:00+05:30",
    "endDate": "2025-11-22T18:30:00+05:30",
    "description": "What would an organically grown potato think about pesticides? How would a mass-produced banana respond? And what can we add to the discussion? \n\nCouncil of Foods is a web-based artwork where AI language models speak as a diversity of foods, embodying distinct values and ethical positions shaped in collaboration with food system experts. Each discussion is unique and not limited to the food system alone—broader societal issues emerge through the voices of industrially farmed, genetically modified, and wild-foraged foods. \n\nFor this session, the Council turns its attention to industrial agriculture—its ethics, environmental costs, and entanglements with technology and policy. Adithya Pradyumna will join the discussion, engaging with the AI “foods” to explore how human and non-human perspectives can meet at the table to rethink the future of farming.\n\nNonhuman Nonsense is an exhibiting artist at CALORIE. ",
    "url": "https://sci560.scigalleryblr.org/programmes?p=human-at-table",
    "maximumAttendeeCapacity": "60"
  },
  {
    "@type": "EducationEvent",
    "name": "Innovation and Prosperity: The 2025 Economics Nobel",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-16T16:00:00+05:30",
    "endDate": "2025-11-16T16:00:00+05:30",
    "description": "How does economic growth impact our daily lives?\n\nJoin Anand Shrivastava as he explores what economic growth really means and how it impacts our daily lives. Understand why economists, governments and the media highlight percentage increases in GDP in growth discussions and why these discussions should matter to the common person.  With a focus on this year's winners of the Nobel Memorial Prize in Economics, learn about the role of innovation and technology in driving economic growth.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=innovation-prosperity-nobel-econ",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Making Sense, Making Meaning: Docu-walking through CALORIE",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-15T17:30:00+05:30",
    "endDate": "2025-11-15T19:00:00+05:30",
    "description": "Do you like keeping a diary, snapping photos, or collecting little things from nature? Is this our way of documenting the world? \n\nFrom a system of proof and preservation, documentation has evolved into a creative and interpretive process. Even seemingly simple things, like a meal, a walk, or a seed, can contain knowledge worth noticing. The walkthrough explores our current exhibition-season, CALORIE, as a space to question the history, methods, and purpose of documenting. \n\nJoin our Experimentors, Kruthika and Sai, as they think of documentation as a living process rather than a fixed record. ",
    "url": "https://sci560.scigalleryblr.org/programmes?p=making-sense-making-meaning-docu-walking-through-calorie",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "Measuring Calories and Why It Matters: DIY Calorimeter",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-16T17:00:00+05:30",
    "endDate": "2025-11-16T18:30:00+05:30",
    "description": "What is a Calorie? Why do we measure it?\n\nJoin CALORIE Experimentors Aashka and Tejashree as they take you through the journey of how the concept of a ‘calorie’ came to be, from steam engines to energy obtained from food.\n\nCalorie, a unit of energy, is sometimes overshadowed by the joule but is still a part of our daily conversations. What relevance does the calorie hold today, and how has its definition changed over time?\n\nIn this hands-on workshop, build your own DIY calorimeter to measure heat energy.\n\nLearn what a calorie means and reflect on how this simple unit connects science, society, and our modern relationship with energy and eating.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=measuring-calories-diy",
    "maximumAttendeeCapacity": "30"
  }
]