[
  {
    "@type": "EducationEvent",
    "name": "The Ecology Enigma: Exploring Carbon in the Environment",
    "location": "Science Gallery Bengaluru",
    "startDate": "2024-04-20T11:00:00+05:30",
    "description": "Carbon: one word with many hues, shapes, forms and features. Carbon is an essential building block of life. From invisible molecules to giant whales and thousand-year old trees—all life is carbon. In this two-day masterclass, join ecologist Meghna Krishnadas to explore all things carbon and ecology! From the fundamentals of carbon to nature walks, this masterclass will use  interactive, hands-on sessions to understand the ecology of carbon in living beings, and what that means for humans. Come prepared to exercise your [C]reativity!<br><br>Please note that this is a 2-day masterclass which will take place on Saturday and Sunday, 20 and 21 April.",
    "duration": "P2D",
    "url": "https://carbon.scigalleryblr.org/programmes?p=the-ecology-enigma",
    "performer": [
      {
        "@type": "Person",
        "name": "Meghna Krishnadas"
      }
    ],
    "maximumAttendeeCapacity": 45
  },
  {
    "@type": "EducationEvent",
    "name": "Living and Drowning on the Shore of Blue Capital",
    "location": "Science Gallery Bengaluru",
    "startDate": "2024-04-27T18:00:00+05:30",
    "description": "How do coastal cities and infrastructures sustain global capital? Can ‘blue capital’—solutions that are offered as alternatives to hydrocarbon economies—provide a way out of our carbon-intensive economies? Laleh Khalili puts this idea to the test as she examines how blue capital may in fact exacerbate the situation.  Join Khalili in a lecture that explores how extraction, transportation and logistics contribute to the gradual drowning of our cities and infrastructures. ",
    "duration": "PT2H",
    "url": "https://carbon.scigalleryblr.org/programmes?p=shore-of-blue-capital",
    "performer": [
      {
        "@type": "Person",
        "name": "Laleh Khalili"
      }
    ],
    "maximumAttendeeCapacity": 150
  },
  {
    "@type": "EducationEvent",
    "name": "Living and Drowning on the Shore of Blue Capital (Tutorial)",
    "location": "Science Gallery Bengaluru",
    "startDate": "2024-04-27T19:30:00+05:30",
    "description": "How do coastal cities and infrastructures sustain global capital? Can ‘blue capital’—solutions that are offered as alternatives to hydrocarbon economies—provide a way out of our carbon-intensive economies? Laleh Khalili puts this idea to the test as she examines how blue capital may in fact exacerbate the situation.  Join Khalili in a lecture that explores how extraction, transportation and logistics contribute to the gradual drowning of our cities and infrastructures. ",
    "duration": "PT1H",
    "url": "https://carbon.scigalleryblr.org/programmes?p=shore-of-blue-capital-tutorial",
    "performer": [
      {
        "@type": "Person",
        "name": "Laleh Khalili"
      }
    ],
    "maximumAttendeeCapacity": 50
  },
  {
    "@type": "EducationEvent",
    "name": "Aboard Cargo Ships: The Life and Labour of Logistics Workers",
    "location": "Science Gallery Bengaluru",
    "startDate": "2024-04-27T11:00:00+05:30",
    "description": "What do we know of the lives of logistics workers? What can a life on the seas, aboard a container ship, be like? The body of the logistics worker is the fulcrum upon which global systems of power and trade rest. But it is also a body on which gendered and racialised pressures rest. In this masterclass, Laleh Khalili will draw on her ongoing research and experiences of travelling on cargo ships to explore the life of these labourers. Join us to  investigate an experience riddled with adversities—loneliness, loss, and violence, stolen wages and exploitative logistics businesses—as well as ephemeral moments of joy and solidarity. <br><br>Please note that this is a 2-day masterclass which will take place on Saturday and Sunday, 27 and 28 April.",
    "duration": "P2D",
    "url": "https://carbon.scigalleryblr.org/programmes?p=aboard-cargo-ships",
    "performer": [
      {
        "@type": "Person",
        "name": "Laleh Khalili"
      }
    ],
    "maximumAttendeeCapacity": 45
  },
  {
    "@type": "EducationEvent",
    "name": "Radical Creativity in Public Art",
    "location": "Science Gallery Bengaluru ",
    "startDate": "2024-04-24T18:00:00+05:30",
    "description": "Dive into the fuzzy world of radical creativity, a cross- and transdisciplinary idea that requires us to break boundaries and collaboratively experiment outside of them. What can this kind of practice tell us about public art, which can shape our experiences of the world? Outi Turpeinen and Riikka Mäkikoskela will discuss the fundamentals of these two concepts. Taking examples from Bangalore (India), Espoo (Finland) and other parts of the world, they will show how radical creativity is seen through and in public art.",
    "duration": "PT1H30M",
    "url": "https://carbon.scigalleryblr.org/programmes?p=radical-creativity-public-art",
    "performer": [
      {
        "@type": "Person",
        "name": "Outi Turpeinen"
      },
      {
        "@type": "Person",
        "name": " Riikka Mäkikoskela"
      }
    ],
    "maximumAttendeeCapacity": 30
  },
  {
    "@type": "EducationEvent",
    "name": "Triggering Enquiries: On Art-Science Collaborations",
    "location": "Science Gallery Bengaluru",
    "startDate": "2024-04-21T16:30:00+05:30",
    "description": "Bridging the gap between art and science, we are inspired by the Renaissance figure Leonardo da Vinci, who mastered both fields. Fast forward to the present day, and we find a stark divide, with art and science being taught in separate institutions, and the public perception of these fields as fundamentally incompatible. Today, we often see art and science as separate, but when they come together, they offer a unique perspective, a stereo vision of the world.<br><br>Katharina Weikl, head of the art x science office at the University of Zurich, will present their work and deliver a talk on the power of interdisciplinary collaboration. Weikl led the ‘Triggered by Motion’ project, showcased at CARBON, which brought together researchers from 14 countries, highlighting the intersection of art, research, and conservation. Join us in this talk to rediscover the power of breaking disciplinary silos.",
    "duration": "PT1H30M",
    "url": "https://carbon.scigalleryblr.org/programmes?p=triggering-enquiries",
    "performer": [
      {
        "@type": "Person",
        "name": "Katharina Weikl"
      }
    ],
    "maximumAttendeeCapacity": 100
  }
]