[
  {
    "@type": "Event",
    "name": "Specimens and Stories: A Visit to Natural History Collections",
    "location": {
      "@type": "Place",
      "name": "National Centre for Biological Sciences",
      "address": "National Centre for Biological Sciences, Bangalore",
      "url": "https://maps.app.goo.gl/sZgsVT4sgj9Ub1Z69"
    },
    "startDate": "2025-06-29T11:00:00+05:30",
    "endDate": "2025-06-29T13:00:00+05:30",
    "description": "How are specimens collected, preserved, and studied?<br><br>Join us at the Natural History Collections at NCBS and discover the fascinating world of specimens. This visit will be an opportunity to see how scientists collect, preserve, and study specimens that help us understand the story of our planet’s biodiversity. From pressed plants and drawers full of insects to preserved bird specimens, every item offers clues about biodiversity, evolution, and environmental change. Participants will also learn how these collections support research, education, and conservation, and hear the stories behind them.<br><br>",
    "url": "https://sci560.scigalleryblr.org/programmes?p=specimens-stories",
    "performer": [
      {
        "@type": "Person",
        "name": "Pritha-Dey"
      }
    ],
    "maximumAttendeeCapacity": 30
  },
  {
    "@type": "EducationEvent",
    "name": "Translating Science to Impact Through PoC Diagnostics",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-06-22T16:00:00+05:30",
    "endDate": "2025-06-22T16:00:00+05:30",
    "description": "How have innovations in molecular biology changed our lives?<br><br>Sometimes it can be difficult to directly connect modern scientific discovery to its real-world impacts. Join Chandrasekhar Nair as he bridges this gap by leading the audience through the story of how a deep understanding of molecular biology and PCR (Polymerase Chain Reaction) technology led to innovative solutions with tangible outcomes like testing for various infectious diseases.Through his lecture he highlights how essential it is to translate science into innovation.<br><br>This programme is in collaboration with Infosys Science Foundation.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=pcr-innovation",
    "performer": [
      {
        "@type": "Person",
        "name": "Chandrasekhar-Nair"
      }
    ],
    "maximumAttendeeCapacity": 100
  },
  {
    "@type": "EducationEvent",
    "name": "Decoding 'Birds in the City': A Board Game For Engaging With Urban Nature",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-06-21T16:00:00+05:30",
    "endDate": "2025-06-21T16:00:00+05:30",
    "description": "Can games be a tool for public engagement with nature?<br><br>Join us to play Birds in the City: Bengaluru Edition, a board game designed to explore bird diversity and ecological change in urban areas. Created through a research-driven, iterative design process, the game can be used as an educational tool for sparking dialogue about wildlife in cities like Bengaluru.<br><br>This workshop invites you to experience the game firsthand and hear from the creators at ‘Play in Nature’ about how they blended research, design, and storytelling to create this game. Join us to explore how serious games can be designed to support environmental awareness and learning.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=birds-in-the-city",
    "performer": [
      {
        "@type": "Person",
        "name": "Priti-Bangal"
      },
      {
        "@type": "Person",
        "name": "Prasad-Sandbhor"
      },
      {
        "@type": "Person",
        "name": "Nicole-Elsa-Daniel"
      }
    ],
    "maximumAttendeeCapacity": 35
  },
  {
    "@type": "EducationEvent",
    "name": "The Story of the Great Trigonometrical Survey",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-07-05T16:00:00+05:30",
    "endDate": "2025-07-05T16:00:00+05:30",
    "description": "Have you ever heard of the Great Trignometrical Survey?<br><br><br><br>Join us as Meera Iyer and Shruthi Rao take us through the story of one of the most astounding projects in the history of science. From its origins in Bengaluru all the way to the heights of the Himalayas. The talk will touch upon some of the most famous surveyors in the GTS including William Lambton and George Everest. Exploring why exactly these surveyors had to tramp across the country, braving wild beasts, monsoons, and disease in their quest for inch-perfect maps? It will also speak about some of the forgotten Indians who were a part of this extraordinary work. <br>",
    "url": "https://sci560.scigalleryblr.org/programmes?p=great-trignometrical-survey",
    "performer": [
      {
        "@type": "Person",
        "name": "Meera-Iyer"
      },
      {
        "@type": "Person",
        "name": "Shruthi-Rao"
      }
    ],
    "maximumAttendeeCapacity": 100
  },
  {
    "@type": "EducationEvent",
    "name": "Mechanism Design: Aligning Divergent Stakeholders",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-06-28T11:00:00+05:30",
    "endDate": "2025-06-28T13:00:00+05:30",
    "description": "This workshop, a sequel to the one on 'Too Many Cooks Spoil the Broth: Planning for Bengaluru', is about 'mechanism design', towards accomplishing shared-desirable outcomes for the city. How can urban planning processes negotiate and reconcile competing demands of an amplified set of stakeholders who are often mis-aligned in their values and goals? In this workshop, Champaka Rajagopal will explore mechanism design which incorporates incentives and penalties for stakeholders to partner, behave and transact in ways that contribute to the accomplishment of shared outcomes. Drawing on existing practices and models, we will creatively craft multiple partnership arrangements among stakeholders with competing interests at different scales of decisions, in our endeavor for meeting shared desirable outcomes for Bengaluru.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=mechanism-design",
    "performer": [
      {
        "@type": "Person",
        "name": "Champaka-Rajagopal"
      }
    ],
    "maximumAttendeeCapacity": 30
  }
]