[
  {
    "@type": "Event",
    "name": "Power Shifts in Bengaluru: A Sci560 Exhibition Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-12-29T12:00:00+05:30",
    "endDate": "2024-12-29T14:00:00+05:30",
    "description": "Mediators Aditi and Pravallika take you on an exhibition walkthrough exploring how power struggles have shaped science, technology, and culture in Bengaluru. The walkthrough focuses on the colonial era, post-independence progress, and contemporary issues. Through key objects and stories, the walkthrough highlights themes of gender inequality in science, the digital divide, and the complexities of labour. Join us as we explore the stories about power struggle, oppression and empowerment in Bengaluru.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=power-shift-walkthrough",
    "performer": [
      {
        "@type": "Person",
        "name": "Sgb-Team"
      }
    ],
    "maximumAttendeeCapacity": 50
  },
  {
    "@type": "Event",
    "name": "Sense and Scientific Method: Sci560 Exhibition Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-12-29T17:00:00+05:30",
    "endDate": "2024-12-29T19:00:00+05:30",
    "description": "As humans, we have an intrinsic need to understand the world around us. We have evolved from crafting simple tools to mastering technologies with the potential to reshape the planet. We invented language, deconstructed planetary motion and split the atom. Through the ages, we have built better and sophisticated tools that let us expand the range of what we can perceive, letting us ‘sense’ beyond the limits of biology.<br><br>In this walkthrough, mediators Jagrut Amuri and Vignesh K use the current exhibition season Sci560 as an anchor to explore how we use senses to understand our world and the role that science plays in deepening this understanding.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=senses-walkthrough",
    "performer": [
      {
        "@type": "Person",
        "name": "Sgb-Team"
      }
    ],
    "maximumAttendeeCapacity": 50
  }
]