[
  {
    "@type": "Event",
    "name": "Maths for the Masses: Experiments in Public Engagement",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-12-13T18:00:00+05:30",
    "endDate": "2024-12-13T19:30:00+05:30",
    "description": "Public engagement plays a crucial role in bridging the gap between academia, science, and society, transforming specialised knowledge into accessible narratives that inspire and inform. This discussion brings together Marcus du Sautoy and Jahnavi Phalkey, to explore the transformative power of public engagement. Together, they will unpack  fundamental questions: What problems does public engagement address? Why do we pursue it? How can we measure its success? And most importantly, how can we do it better? By reflecting on their own experiences and examining innovative strategies, they aim to spark a dialogue about making knowledge more inclusive and impactful.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=maths-for-masses",
    "performer": [
      {
        "@type": "Person",
        "name": "Marcus-Du-Sautoy"
      },
      {
        "@type": "Person",
        "name": "A 24"
      }
    ],
    "maximumAttendeeCapacity": 60
  },
  {
    "@type": "EducationEvent",
    "name": "Living in Space: Exploring Innovative Solutions to Tackle New Challenges",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-12-15T11:00:00+05:30",
    "endDate": "2024-12-15T13:00:00+05:30",
    "description": "What does it take to sustain human life in the vast expanse of space?<br>Join Italian experts as they divulge the forefront of space research, focusing on sustainable innovations designed to support life beyond Earth. This session explores cutting-edge solutions for cosmic radiation protection, contamination control, and overcoming the physiological and biomechanical challenges of low-gravity environments. Discover and gain insights into nutrition and food sustainability tailored for long-term space missions, paving the way for a future where humanity thrives among the stars.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=living-in-space",
    "performer": [
      {
        "@type": "Person",
        "name": "Plinio-Innocenzi"
      },
      {
        "@type": "Person",
        "name": "Ugo-Della-Croce"
      },
      {
        "@type": "Person",
        "name": "Andrada-Pica"
      },
      {
        "@type": "Person",
        "name": "Antonella-Pantaleo"
      },
      {
        "@type": "Person",
        "name": "Alessia-Manca"
      },
      {
        "@type": "Person",
        "name": "In-Space"
      }
    ],
    "maximumAttendeeCapacity": 60
  }
]