[
  {
    "@type": "EducationEvent",
    "name": "From Numbers to Narrative: Exploring Information Design",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-11-02T16:00:00+05:30",
    "endDate": "2024-11-02T19:00:00+05:30",
    "description": "In today’s world, the truth is defined by facts, and facts are strengthened by data. Nowadays, storytelling has moved on from just its fictional form to data-based narratives. Not only verbal or written ones but visual stories weave a more compelling picture for people. Tangible proof holds an even higher value in the viewer’s eyes.<br><br>In this workshop, the Information Design students from the National Institute of Design (NID) Bangalore will guide participants through the process of making physical data visualizations that tell stories and make a true statement. They will take a deep dive into the UN Sustainable Development Goals and their significance in the present day.<br><br>This session will take you through their work revolving around the SDGs and give you an insight into their process of data physicalization, coupled with a hands-on exercise to learn and try the same for yourself.<br><br>",
    "url": "https://carbon.scigalleryblr.org/programmes?p=numbers-to-narrative",
    "performer": [
      {
        "@type": "Person",
        "name": "Nid-Info-Design"
      }
    ],
    "maximumAttendeeCapacity": 40
  },
  {
    "@type": "Event",
    "name": "All Play Means Something: An Exhibition of Games",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-11-03T11:00:00+05:30",
    "endDate": "2024-11-03T19:00:00+05:30",
    "description": "This exhibition showcases games created by students from the Digital Game Design discipline at the National Institute of Design. These games delve into themes of genome mutation, ecology, mental health, and social behaviour, bridging science, human experience, and design. Join us for a unique, interactive play session, engage in discussions with the game creators, and witness the creative process behind game development!<br><br>Open from 11:00 AM – 07:00 PM",
    "url": "https://carbon.scigalleryblr.org/programmes?p=all-play-means-something",
    "performer": [
      {
        "@type": "Person",
        "name": "Nid-Dgd"
      }
    ],
    "maximumAttendeeCapacity": 1000
  },
  {
    "@type": "EducationEvent",
    "name": "Pixel to Play: Digital Game Design Workshop",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-11-03T11:00:00+05:30",
    "endDate": "2024-11-03T16:00:00+05:30",
    "description": "Join us for an exciting workshop offered by the Digital Game Design Department at the National Institute of Design. Dive into the fascinating world of video games and discover how they blend technology and art to create unique experiences enjoyed by millions worldwide.<br><br>In this hands-on session, you’ll learn how digital games are made and brought to life using GDevelop—a free and easy-to-use game-making tool. No experience in programming or design is needed, just your curiosity and excitement to create games!<br><br>Participants will be required to bring their own laptop",
    "url": "https://carbon.scigalleryblr.org/programmes?p=world-of-digi-game-design",
    "performer": [
      {
        "@type": "Person",
        "name": "Nid-Dgd"
      }
    ],
    "maximumAttendeeCapacity": 40
  }
]