[
  {
    "@type": "EducationEvent",
    "name": "The Story of the Indian Mango",
    "location": {
      "@type": "Place",
      "name": "Reading Room, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-08-31T16:00:00+05:30",
    "endDate": "2025-08-31T16:00:00+05:30",
    "description": "Curious about the King of all Fruits?\n\nJoin Dr M.R Dinesh as he takes us through the origin and development of the mangoes of India. Learn about the science behind their diversity, ambiguous nomenclature and rootstocks. Understand the current realities of the Indian mango through Dr Dinesh’s hands-on expertise in fruit breeding and horticulture. Leave knowing just a little bit more about your favorite fruit.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=indian-mango",
    "maximumAttendeeCapacity": "100"
  },
  {
    "@type": "EducationEvent",
    "name": "Is India Food Secure?",
    "location": {
      "@type": "Place",
      "name": "Reading Room, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-08-10T16:00:00+05:30",
    "endDate": "2025-08-10T16:00:00+05:30",
    "description": "What is the story of food security in India? How have patterns of food consumption changed over time?\n\nJoin us for the first programme of the season by economist Madhura Swaminathan, as she explores the status of food security in India. In this lecture, Madhura will unpack key milestones and persistent challenges in both food production and consumption.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=india-food-secure",
    "maximumAttendeeCapacity": "100"
  },
  {
    "@type": "EducationEvent",
    "name": "Food, Foraging, and the Fabric of Social Insects",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-08-17T16:00:00+05:30",
    "endDate": "2025-08-17T16:00:00+05:30",
    "description": "What drives the complex lives of social insects like honey bees and wasps? \n\nJoin Sruthi Unnikrishnan as she explores how food, more than just sustenance, shapes the social structure and behaviour of insect societies. Drawing from a range of research on Asian honey bees and social wasps, she will highlight how foraging not only sustains the colony but also drives coordination, communication, and even decisions about reproduction. From the buzzing harmony of bee foragers to the role of nutrition in determining which wasps become queens, this talk uncovers the hidden power of food in shaping insect lives. Join us for a fascinating journey into the world of collective behaviour, division of labour, and the surprising social consequences of a simple resource.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=food-foraging-social-insects",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Contaminated Harvest: How Wastewater Impacts What We Eat",
    "location": {
      "@type": "Place",
      "name": "ATREE, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-08-23T11:00:00+05:30",
    "endDate": "2025-08-23T11:00:00+05:30",
    "description": "How safe is the food we eat? \n\nJoin ATREE’s Water and Soil Lab, led by Dr Priyanka Jamwal, for an interactive session where we explore how heavy metals like lead, mercury, and cadmium can find their way into our food. Learn how scientists test for contamination in food samples and hear about real-world case studies like the Minamata disaster in Japan, the Maggi noodles controversy, and findings from Byramangala near Bengaluru, where crops grown using wastewater were found to contain harmful metals. \nThis workshop brings together science, public health, and food safety to help us ask, what’s really on our plate?",
    "url": "https://sci560.scigalleryblr.org/programmes?p=contaminated-harvest",
    "maximumAttendeeCapacity": "25"
  },
  {
    "@type": "Event",
    "name": "Come Eat With Me",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-08-24T18:00:00+05:30",
    "endDate": "2025-08-24T18:00:00+05:30",
    "description": "What is the relationship between caste and food?\n\nCome Eat With Me is a performance piece by Sri Vamsi Matta that explores the relationship between caste and food while sharing a meal together. Focusing on Dalit Cuisine, Vamsi begins with personal stories and oral histories around food in his household and community. The performance is peppered with existing literature and academic writing around the multilayered, many-flavoured relationships between caste and food. The piece unpacks questions of oppression and solidarity, grief and joy, and the everyday victories of the human spirit in the face of structural injustices.\nAudiences are invited to eat together and share their own stories around caste and food. Please note that the performance will be for 2 hours, and dinner will be served afterwards. ",
    "url": "https://sci560.scigalleryblr.org/programmes?p=come-eat-with-me",
    "maximumAttendeeCapacity": "70"
  },
  {
    "@type": "EducationEvent",
    "name": "A Bite of CALORIE: Kannada Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-08-16T17:30:00+05:30",
    "endDate": "2025-08-16T19:30:00+05:30",
    "description": "Join the Science Gallery Bengaluru team for a closer look at our new exhibition season, CALORIE, one bite at a time. This walkthrough, conducted in Kannada, invites you to reflect on the ideas of food, nutrition, and energy. As we move through the exhibition, the team will unpack the intimate, and often complicated, relationships we share with food, nourishment, and the systems that sustain us.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=bite-kannada-walkthrough",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "A Bite of CALORIE: Curatorial Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-08-31T12:00:00+05:30",
    "endDate": "2025-08-31T14:00:00+05:30",
    "description": "Join the Science Gallery Bengaluru team for a closer look at our new exhibition season, CALORIE, one bite at a time. This walkthrough, invites you to reflect on the ideas of food, nutrition, and energy. As we move through the exhibition, the team will unpack the intimate, and often complicated, relationships we share with food, nourishment, and the systems that sustain us.\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=a-bite-curatorial",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "A Brief History of Nutrition Research in India",
    "location": {
      "@type": "Place",
      "name": "Reading Room, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-08-30T16:00:00+05:30",
    "endDate": "2025-08-30T16:00:00+05:30",
    "description": "How has nutrition research standardised the Indian Diet?\n\nJoin Veena Shatrugna as she explores how nutrition research in India has influenced the nation's eating habits. By the 1970s, scientific studies were guiding farming policy, school meals, wages, and even doctors’ advice. In the push to design the most affordable national diet, calories and proteins from different foods were treated as equal. This put low-cost plant foods at the centre, leaving little room to account for India’s rich food cultures and the needs of children and pregnant women. Alongside this, the importance of animal proteins, from foods eaten regularly by different castes was erased. Veena will further explore the policy choices behind that shift and the lasting mark they have left on everyday diets.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=nutrition-research-india",
    "maximumAttendeeCapacity": "50"
  }
]