[
  {
    "@type": "Event",
    "name": "River Landscapes: A New Glossary",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-03-09T11:00:00+05:30",
    "endDate": "2025-03-09T13:00:00+05:30",
    "description": "The River Landscapes workshop was an invitation to students, artists, creative practitioners and early career researchers in the age group 18-30 to think about and contribute to a glossary on fluvial landscapes in the form of writing, graphic/art, photographs or other media. The workshop aimed to pay particular attention to the story of the river Kaveri and its profound influence on the ecological, political and socio-cultural landscape of the region. Through the workshop, participants attempted to situate the historical and contemporary realities of Kaveri in the larger technocratic and socio-cultural imagination of river landscapes. <br><br>The outcomes of this workshop, including writings, artworks, photographs, and other media, will be on display. We invite you to come and explore these creative contributions that reflect on the Kaveri River and its evolving landscape.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=river-landscapes-showcase",
    "performer": [
      {
        "@type": "Person",
        "name": "Sgb-Team"
      }
    ],
    "maximumAttendeeCapacity": 60
  },
  {
    "@type": "EducationEvent",
    "name": "The Parental Brain: Understanding Parenthood and the Human Brain",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-03-09T16:00:00+05:30",
    "endDate": "2025-03-09T18:00:00+05:30",
    "description": "How does the transition to parenthood reshape the brain? What do these neurological changes mean for both birthing and non-birthing parents?<br><br>The transition to parenthood, particularly motherhood, involves significant neurological changes throughout pregnancy and into the postpartum period. Recent research has begun to uncover the profound alterations in the maternal brain during this time of matrescence, why they occur and what they mean. Furthermore, these changes are not exclusive to birthing parents—fathers and adoptive parents experience similar brain adaptations. Join Jodi Pawluski as she explores the key transformations in the brain during the transition to parenthood.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=the-parental-brain",
    "performer": [
      {
        "@type": "Person",
        "name": "Jodi-Pawluski"
      }
    ],
    "maximumAttendeeCapacity": 50
  },
  {
    "@type": "EducationEvent",
    "name": "Flexible Hybrid Perovskite Solar Cells: The Future of Renewable Energy",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-03-16T16:00:00+05:30",
    "endDate": "2025-03-16T18:00:00+05:30",
    "description": "What if solar panels weren’t just rigid structures on rooftops, but lightweight, bendable materials that could wrap around buildings, power wearable devices, and generate energy in remote locations?<br><br>Flexible hybrid perovskite solar cells are making this possible by combining high-efficiency perovskite materials with lightweight, flexible properties.<br>With power conversion efficiencies exceeding 25% and low-cost, solution-based fabrication, these solar cells can adapt to curved and dynamic surfaces, opening up new possibilities for energy harvesting.<br><br>Join Laxman Gouda as he explores the world of flexible hybrid perovskite solar cells, uncovering their potential, challenges, and role in shaping a more sustainable future.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=flexible-hybrid-solar-cells",
    "performer": [
      {
        "@type": "Person",
        "name": "Laxman-Gouda"
      }
    ],
    "maximumAttendeeCapacity": 50
  },
  {
    "@type": "EducationEvent",
    "name": "Rethinking Urban Flooding: Towards a Resilient Bengaluru",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-03-15T11:00:00+05:30",
    "endDate": "2025-03-15T14:00:00+05:30",
    "description": "What makes a city resilient to floods, and What role does technology play in predicting and managing urban floods?<br><br>Join Rajarshi Das Bhowmick as he dives into the complexities of urban flooding, with a focus on Bangalore’s unique challenges and mitigation strategies. He will explore the urban flood dynamics and introduce the Bangalore Urban Flood Model, demonstrating its role in forecasting and risk management. <br><br>Participants will engage in hands-on activities using Google Earth Engine to analyze flood-prone areas and evaluate mitigation measures. Furthermore, he will explore practical flood management solutions that integrate technology and policy approaches.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=rethinking-urban-flooding",
    "performer": [
      {
        "@type": "Person",
        "name": "Rajarshi-Das-Bhowmik"
      }
    ],
    "maximumAttendeeCapacity": 40
  },
  {
    "@type": "Event",
    "name": "Map-a-Lore: Sci560 Exhibition Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-03-16T12:00:00+05:30",
    "endDate": "2025-03-16T13:30:00+05:30",
    "description": "We have all seen maps, read them, and maybe even created a few. But have you ever stopped to wonder - what makes a map?<br><br>Is it just a way to represent places, or could it reveal something more? Maps don’t just chart landscapes; they shape how we see the world, understand our history, and navigate the unknown.<br><br>Join Upasana and Akshad for Map-a-Lore, where they rethink mapping beyond borders and blueprints. From historical maps and masterplans that shaped Bengaluru to constellations in the night sky and biomolecules, we invite you to discover how mapping extends into science, culture, and even the cosmos.<br><br>Come explore, question, and see maps in a whole new way!",
    "url": "https://carbon.scigalleryblr.org/programmes?p=map-a-lore",
    "performer": [
      {
        "@type": "Person",
        "name": "Sgb-Team"
      }
    ],
    "maximumAttendeeCapacity": 60
  }
]