[
  {
    "@type": "EducationEvent",
    "name": "In the pipeline: On AI labour",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-22T11:00:00+05:30",
    "endDate": "2026-02-22T14:00:00+05:30",
    "description": "What does it take to keep AI running?\n\nAI chatbots, self-driving cars, and social media platforms may appear seamless and autonomous, but they depend on vast networks of human labour. A large workforce of people, scattered across the world, provides data for training AI models, and removes harmful content released online, among other kinds of work. They often work in very harsh conditions; with low pay, inadequate support and social security, under uncertain terms, and often at great personal risk.\n\n‘In the pipeline’ is a card game that tries to demonstrate the problems workers face in their roles in content moderation and AI labour. Players will navigate these industries while enduring different hazards and bearing related costs. As players navigate shifting industry demands, workplace hazards, and economic uncertainty, they confront the invisible costs behind “intelligent” systems.\n\nThrough play, the workshop opens up conversations around precarity, advocacy, and the structural changes needed to imagine fairer technological futures.\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=In-the-pipeline",
    "maximumAttendeeCapacity": "30"
  },
  {
    "@type": "EducationEvent",
    "name": "Growing Tomorrow: Exploring Agricultural Innovation",
    "location": {
      "@type": "Place",
      "name": "Bayer, Manyata Tech Park, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-20T17:00:00+05:30",
    "endDate": "2026-02-20T17:00:00+05:30",
    "description": "Are you curious about agricultural science?\n\nJoin Anik and the Bayer Life Hub team as they take you through the science behind innovations in biotechnology, crop protection and digital agriculture. Participants will be guided through live plant specimens, different crop seeds, and molecular biology tools and get a tour of Bayer’s R&D laboratories in Bangalore. Explore how agricultural scientists tackle the problem of creating solutions to produce more resilient and sustainable harvests for farmers across the globe.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=growing-tomorrow",
    "maximumAttendeeCapacity": "30"
  },
  {
    "@type": "EducationEvent",
    "name": "Of Minds, Moods, and Meals: Understanding the Science of Emotions and Food",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-22T16:00:00+05:30",
    "endDate": "2026-02-22T17:30:00+05:30",
    "description": "Why does sugar feel irresistible? Why does loneliness change what we crave? And how can a single smell instantly transport you home?\n\nOf Minds, Moods, and Meals explores food as a meeting point between biology, emotion, neuroscience, and behaviour. Moving from neural reward pathways and microbial chemistry to inherited histories, we see how appetite is shaped long before it reaches the plate. Cravings are wired by evolution, moods are influenced by the gut, disgust protects and divides, and culture teaches us what is desirable, or forbidden. Food is not only nourishment; it is regulation, identity, attachment, and hierarchy. \n\nJoin our Experimentor Sai, for a walkthrough tracing these connections across body, brain, and society. \n\nCome curious. Leave seeing your plate differently.\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=of-minds-moods-and-meals-understanding-the-science-of-emotions-and-food",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "Adventures In The Gig Economy",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-21T17:00:00+05:30",
    "endDate": "2026-02-21T17:00:00+05:30",
    "description": "What can we learn from the London gig economy?\n\nJoin artist Beth Fox for an exploration of her exhibit through humorous short films. Explore her immersive primary research of the gig economy in London, a city where thirty-one thousand people work in the gig economy. This talk will draw on her experiences while working as a gig worker and attempts to rehumanise the workers behind the apps.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=adventures-in-the-gig-economy",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Exploring Roots and Recipes : One Ingredient at a Time",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-21T16:00:00+05:30",
    "endDate": "2026-02-21T17:30:00+05:30",
    "description": "When does our everyday food quietly become a cherished treasure? Is it a single ingredient, a meticulously balanced recipe, or the context of when and where it was first savored? \n\nFrom Chitranna and Javvu Mittai to Kanji and Chagali Chutney, each dish is anchored by a key ingredient that defines its taste, technique, cultural roots and culinary essence. \n\nOne exhibit. One ingredient. One recipe. Many stories.\nJoin Thejaswini to explore the roots and recipes held within CALORIE.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=exploring-roots-recipes-one-ingredient-at-a-time",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "Breaking Down the Artist's Recipe",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-28T16:00:00+05:30",
    "endDate": "2026-02-28T17:30:00+05:30",
    "description": "Every artist has a recipe: a process of gathering ingredients, making creative choices, and shaping how their ideas are shared. Just as our bodies digest food, artists digest their experiences, breaking down observations, narratives, culture, and environments into creative work.\n\nThis walkthrough takes you behind the scenes of CALORIE, exploring how artists transform everyday experiences into art. By looking closely at their “ingredients,” flavour profiles, textures, and choice of medium, we trace the journey from idea to finished work and uncover the many modes of expression artists use to make sense of food, culture, and lived experience.\n\nJoin our experimenters, Nirupama and Shreya, for a playful and participatory walkthrough that treats art-making as explorations, creativity as a shared process, and meaning-making as something we all do every day.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=breaking-down-the-artists-recipe",
    "maximumAttendeeCapacity": "50"
  }
]