[
  {
    "@type": "ScreeningEvent",
    "name": "Dreaming the Machine: TAAK Film Screening",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-14T17:00:00+05:30",
    "endDate": "2026-02-14T19:00:00+05:30",
    "description": "Who can afford privacy?\n\nJoin us for a screening of TAAK, a tech noir film that examines how constant visibility becomes ordinary within institutions, and how its consequences are unevenly distributed across class, gender, labour, and access. Privacy emerges not as a universal right, but as something negotiated through behaviour, reputation, and constrained choice.\n\nThe evening brings together film, play and collective imagination to examine technology in the age of surveillance. We begin with a participatory game imagining more ethical futures for technology, followed by the film screening and a conversation with the Producer of TAAK, Ishan Hendre and digital rights activist and scholar, Usha Ramanathan.\n\nParticipatory Game: 5 PM\nScreening: 5:30 PM\nDiscussion: 6:15 PM\n\nProduced through the Museum of Imagined Futures Impact Film Accelerator, Taak is both a film and an impact campaign—using cinema to spark public dialogue and imagine futures where technology respects privacy, agency, and human dignity.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=TAAK",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Know Your Food",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-15T12:00:00+05:30",
    "endDate": "2026-02-15T13:00:00+05:30",
    "description": "What’s in your food?\n\nFrom food labels to nutrition myths to healthy diets, this quiz puts your food and nutrition knowledge to the test. It is designed to spark conversation around how marketing, cultural beliefs, and experiences that shape our nutrition knowledge. Come on your own or with friends, you’ll be grouped for a beginner-friendly food trivia experience.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=know-your-food",
    "maximumAttendeeCapacity": "30"
  },
  {
    "@type": "EducationEvent",
    "name": "Does the Body Count Calories?",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-15T16:00:00+05:30",
    "endDate": "2026-02-15T18:00:00+05:30",
    "description": "How does the body count calories, and are all calories truly equal?\n\nIn an age of calorie counters, fitness watches, and food labels, energy seems easy to measure and neatly quantified. Yet what happens inside the body is far more complex. In this talk, Prof. Ullas Kolthur Seetharam from the Advanced Research Unit on Metabolism, Development, and Aging (ARUMDA) looks beyond weight and BMI to examine how nutrition, metabolism, and body composition shape our health.\n\nDrawing on ARUMDA's research, he unpacks how the body processes food, senses energy needs, and adapts to growth, activity, and aging. He explores why calories are not all equal, how energy expenditure is regulated beyond what labels tell us, and what body composition reveals that body weight alone cannot. Bridging molecular biology, technology, and public health, the talk connects scientific insights to everyday questions around diet, growth, obesity, undernutrition, and metabolic disease. Offering a research-based view of how our bodies manage energy in this ever-changing food landscape.\n\nThis workshop explores the themes of ‘EAT’ & ‘DIGEST’ in relation to Science Gallery Bengaluru’s Exhibition CALORIE. \n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=Does-the-Body-Count-Calories",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "What Makes You Up? Understanding Your Body’s Composition",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-14T11:00:00+05:30",
    "endDate": "2026-02-14T13:00:00+05:30",
    "description": "What does the scale really tell us about our bodies?\n\nIn this workshop, the ARUMDA Team decodes our weight, looking at fat, muscle, and body water to better understand how our bodies store and use energy. Using a portable body composition analyser, he explores how nutrition, calories, and metabolism are measured, and where these measurements fall short.\n\nDrawing on both scientific research and lived experiences, the workshop invites participants to look beyond the scale and rethink what these numbers mean for health and nutrition. \n\nThis workshop explores the themes of ‘EAT’ & ‘DIGEST’ in relation to Science Gallery Bengaluru’s Exhibition CALORIE. ",
    "url": "https://sci560.scigalleryblr.org/programmes?p=What-Makes-You-Up",
    "maximumAttendeeCapacity": "30"
  },
  {
    "@type": "EducationEvent",
    "name": "All Work and No Play : An Exploration of Labour in CALORIE",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-14T16:00:00+05:30",
    "endDate": "2026-02-14T17:30:00+05:30",
    "description": "In the age of steam engines, calorie as a unit was imagined as a measure of labour. Today calorie means food. Let's take a look at the labour that goes into bringing food from farm to table and from table to wastelands. From cultivating to selling, from segregating to treatment, who are these people making food possible?\n\nJoin Ayati and Megha as they explore CALORIE through the lens of labour. ",
    "url": "https://sci560.scigalleryblr.org/programmes?p=all-work-and-no-play-an-exploration-of-labour-in-calorie",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "Growing Tomorrow: Exploring Agricultural Innovation",
    "location": {
      "@type": "Place",
      "name": "Bayer, Manyata Tech Park, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-20T17:00:00+05:30",
    "endDate": "2026-02-20T17:00:00+05:30",
    "description": "Are you curious about agricultural science?\n\nJoin Anik and the Bayer Life Hub team as they take you through the science behind innovations in biotechnology, crop protection and digital agriculture. Participants will be guided through live plant specimens, different crop seeds, and molecular biology tools and get a tour of Bayer’s R&D laboratories in Bangalore. Explore how agricultural scientists tackle the problem of creating solutions to produce more resilient and sustainable harvests for farmers across the globe.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=growing-tomorrow",
    "maximumAttendeeCapacity": "30"
  },
  {
    "@type": "EducationEvent",
    "name": "Of Minds, Moods, and Meals: Understanding the Science of Emotions and Food",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-22T16:00:00+05:30",
    "endDate": "2026-02-22T17:30:00+05:30",
    "description": "Why does sugar feel irresistible? Why does loneliness change what we crave? And how can a single smell instantly transport you home?\n\nOf Minds, Moods, and Meals explores food as a meeting point between biology, emotion, neuroscience, and behaviour. Moving from neural reward pathways and microbial chemistry to inherited histories, we see how appetite is shaped long before it reaches the plate. Cravings are wired by evolution, moods are influenced by the gut, disgust protects and divides, and culture teaches us what is desirable, or forbidden. Food is not only nourishment; it is regulation, identity, attachment, and hierarchy. \n\nJoin our Experimentor Sai, for a walkthrough tracing these connections across body, brain, and society. \n\nCome curious. Leave seeing your plate differently.\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=of-minds-moods-and-meals-understanding-the-science-of-emotions-and-food",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "EducationEvent",
    "name": "Adventures In The Gig Economy",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-02-21T17:00:00+05:30",
    "endDate": "2026-02-21T17:00:00+05:30",
    "description": "What can we learn from the London gig economy?\n\nJoin artist Beth Fox for an exploration of her exhibit through humorous short films. Explore her immersive primary research of the gig economy in London, a city where thirty-one thousand people work in the gig economy. This talk will draw on her experiences while working as a gig worker and attempts to rehumanise the workers behind the apps.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=adventures-in-the-gig-economy",
    "maximumAttendeeCapacity": "80"
  }
]