[
  {
    "@type": "Event",
    "name": "K.T Achaya: Researching the History of Food in India",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-21T16:00:00+05:30",
    "endDate": "2025-12-21T16:00:00+05:30",
    "description": "How did we come to know what we know about Indian food?\n\nMuch of the groundwork was laid by Dr KT Achaya — a food historian whose research shaped how Indian food is studied, written about, and understood today. Join Vikram Doctor, Marryam Reshii, Antoine Lewis, and Sourish Bhattacharyya — food writers and historians — for a conversation on Achaya’s legacy and the challenges of researching food history in India today. From patchy archives to recording marginalised voices in food production, the panel will reflect on how the field has evolved since Achaya’s time.\n\nThis panel discussion is part of our launch of an exhibit on Dr KT Achaya as part of CALORIE.\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=researching-food-history-ktachaya",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Dr KT Achaya: Life, Legacy and Passions",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-28T16:00:00+05:30",
    "endDate": "2025-12-28T16:00:00+05:30",
    "description": "Who was Dr K.T. Achaya?\n\nJoin Vinod Huria as he explores the life and legacy of Dr K.T. Achaya. As a former student of Dr Achaya, Vinod Huria presents a personal account of the scientist who pioneered research and writing on Indian foods. Learn of the many achievements and contributions that Dr Achaya has made to Indian food science, from his work in oil production to his research into food and nutrition. Discover how his books introduced new ways of writing and thinking about food writing in India.\n\nThis lecture is part of our launch of an exhibit on KT Achaya’s life as part of CALORIE.\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=life-legacy-kt-achaya",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "The Ecology of Our Homes: Examining Human Interactions With Urban Wildlife",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-20T16:00:00+05:30",
    "endDate": "2025-12-20T16:00:00+05:30",
    "description": "Have you ever wondered about the bustling world happening just outside or even inside your front door? Join Deepa Padmanaban as she explores the captivating ecology of our homes, where human lives constantly intersect with the lives of urban birds, insects, and animals.\n\nThis talk will look closely at the fascinating, often surprising, interactions that shape our daily environment. She will discuss everything from the spiders on our walls and the birds nesting under our eaves to the rats visiting our yard.  The session will help you understand how our behaviours impact their survival and discover ideas to promote positive coexistence. Whether you are a curious homeowner, a nature enthusiast, or simply someone looking to better understand your immediate surroundings, this talk will offer fresh perspectives on some amazing but often overlooked creatures.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=ecology-of-our-homes",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Tiny Chefs, Big Impact: Fermentation and the Future of Gut Health",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-28T11:00:00+05:30",
    "endDate": "2025-12-28T13:00:00+05:30",
    "description": "How do bacteria and yeasts turn everyday foods into flavours that nourish your gut, your immunity, and your mood?\n\nJoin Pooja Dewan as she enters the microscopic kitchen and explores the science of fermentation. Watch microbes transform simple ingredients into fizzy, tangy, gut-loving foods; taste and sip fermentation in action; and discover how your gut microbiome powers energy, immunity, and wellbeing. You’ll even get hands-on by creating your own mini ferment to take home. ",
    "url": "https://sci560.scigalleryblr.org/programmes?p=tiny-chefs-big-impact",
    "maximumAttendeeCapacity": "40"
  },
  {
    "@type": "EducationEvent",
    "name": "Create, Consume, Discard : Eating in the Age of Plastics",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-28T16:00:00+05:30",
    "endDate": "2025-12-28T17:30:00+05:30",
    "description": "From packaging to clothes and now even in our food; plastics have found a ‘home’ everywhere. \n\nDespite growing concerns about its disposal starting as early as the 1960s, plastic production and use are only projected to grow. We know today that plastics are not only harmful in their everlasting afterlives but also in use - leaching millions of microplastics into food and water with every use. While reliance on plastics is a marker of living in the 21st century, how do we balance overconsumption and necessity? Join our Experimentor Ayati for this walkthrough as we attempt to look at the life-cycle of plastics and their role in our food systems through the CALORIE exhibition. ",
    "url": "https://sci560.scigalleryblr.org/programmes?p=create-consume-discard",
    "maximumAttendeeCapacity": "30"
  },
  {
    "@type": "EducationEvent",
    "name": "Rage Against the Machine: Understanding Bias in Computer Vision Algorithms",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-03T11:00:00+05:30",
    "endDate": "2026-01-03T13:00:00+05:30",
    "description": "What biases shape how machines see the world, and how can our conscious choices help make them more empathetic?\n\nRage Against the Machine is a playful critique of the biases embedded in computer vision algorithms, and an invitation to reflect on how conscious human choices can help build more empathetic machines. Join CALORIE artist Sahitya Pappireddy as she uses Teachable Machine, a graphical and user-friendly tool for training machine-learning models. Participants will learn how to “feed” a model with images to help it identify a cup, explore how a machine defines what a cup is—and what it isn’t—and then attempt to “break” the model by uncovering loopholes in its detection system. Through this process, the session reveals how machines see the world, and how this perception can be surprisingly different from human vision.\n\nThe participants need to carry their own laptop that has a camera as well as a cup/mug of their choice. \n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=rage-against-machine",
    "maximumAttendeeCapacity": "25"
  },
  {
    "@type": "EducationEvent",
    "name": "Will You Join Me For Lunch?: The Rise and Fall (and Rise) of Commensality",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-03T16:00:00+05:30",
    "endDate": "2026-01-03T16:00:00+05:30",
    "description": "\"Commensality\", derived from the Latin words 'com' (with) and 'mensa' (table), refers to the practice of eating together at the same table.\n\nIn this talk—more a conversation than a lecture—CALORIE artist Sahitya explores the deep connection between food and human relationships and how the act of eating together has evolved over time. She reflects on what transforms eating from a mere task into a shared experience, drawing on the idea that “we are not only what we eat, but also who we eat with” — Harry G. West.\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=will-join-me-for-lunch",
    "maximumAttendeeCapacity": "80"
  }
]