[
  {
    "@type": "EducationEvent",
    "name": "The Story of Food: Past, Present, Futures",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-19T16:00:00+05:30",
    "endDate": "2025-10-19T16:00:00+05:30",
    "description": "How do our food choices affect us? How do they shape our societies and our environment? What is eating healthy? \n\nJoin Gurmeet Singh as he explores these questions by tracing our history with food from hunter-gatherers, the dawn of agriculture to the different agricultural revolutions and future science like 3D printing, bioreactors, microbiomics, and nutrigenetics. Gurmeet will further dive into how our food choices have affected us, our society and our planet, going through 3 million years of food history. \n\nThis session will help you understand how food choices affect us and the society by looking at history and future of food. \n\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=the-story-of-food",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Archiving Kitchen Heirlooms: Documenting Culinary Heritage",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-19T11:00:00+05:30",
    "endDate": "2025-10-19T11:00:00+05:30",
    "description": "How do you capture the story behind your favourite dish?\n\nJoin Seher Krishna in a series of guided activities that will explore how to use everyday technology to create a rich, multi-layered archive of a recipe that captures not just flavour, but memory and history. Leave the workshop with the ability to begin building your own family food archive.\n\nThis session invites participants to discover how food and cooking can reveal deeper stories of identity, culture, and nourishment.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=archiving-kitchen",
    "maximumAttendeeCapacity": "30"
  },
  {
    "@type": "EducationEvent",
    "name": "Seeds of Expression",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-25T16:00:00+05:30",
    "endDate": "2025-10-25T16:00:00+05:30",
    "description": "How can knowledge be passed down through a seed?\n\nJoin Arunkumar HG and Dayananda Nagaraju, exhibiting artists of CALORIE, as they explore their exhibits in detail.\n\nLearn about the Akshatha Seedbank with Arunkumar as he shares how it became the foundation of the exhibit Vulnerable Guardians. Discover how this collection of seeds is a living archive of resilience, biodiversity, and cultural memory. Arunkumar will further dive into the ties between farmers, landscapes and seeds, while reflecting on how a seedbank can be a container of knowledge and wisdom from those who came before.\n\nDayananda will reflect on the artistic process behind his exhibit, Atantraru & The Golden Seed. He reflects on how a thought begins like a seed—small, invisible, and full of potential—and how it finds its way into expression through his artistic practice. Dayananda explores the ecology of creativity, the conditions that allow ideas to germinate, the fragility and resilience of expression, and the collective fields in which thoughts grow. Come and learn how an artwork - just like a seed - can carry memory and possibility!",
    "url": "https://sci560.scigalleryblr.org/programmes?p=seeds-of-expression",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Tales of Ragi",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-26T11:00:00+05:30",
    "endDate": "2025-10-26T11:00:00+05:30",
    "description": "What can we learn from a simple Ragi plant?\n\nJoin artist Surekha as she shares her experience of making ‘ragi.net’ - an exhibit displayed as part of CALORIE - through an interactive workshop. Participants will be invited to share their stories about Ragi in the urban context to uncover the lived and historic stories and experience of ragi, its journey between the rural and the urban contexts. Subramani, an artist from the farming community, will also join the workshop and share his experience of being both a farmer and artist, through his drawings and lived experiences. Participants will also learn to make a dish out of a recipe from ragi, from the very harvest extract ragi which she has grown for the CALORIE Exhibition. Explore the entire cycle of ragi, from seed to a fully grown plant, extracted and consumed.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=tales-of-ragi",
    "maximumAttendeeCapacity": "30"
  },
  {
    "@type": "Event",
    "name": "Book Launch: Resilience Decoded",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-10-24T17:00:00+05:30",
    "endDate": "2025-10-24T17:00:00+05:30",
    "description": "How has parenting teens changed in the digital age?\n\nJoin us for the launch of the Penguin-published book ‘Resilience Decoded: What every parent should know about teen mental health’ by Sujata Kelkar Shetty. Learn how in a digital age, teens are now growing up in a storm of stimulation – endless notifications, academic pressure, curated perfection, and connection that often feels more isolating than real. Understand why teens seem impulsive or unreachable and how to manage digital overwhelm, burnout, and the long-reaching effects of pandemic-era isolation. Drawing from her experience in neuroscience and years of stress research at the National Institutes of Health, Dr Shetty provides a compassionate guide to understanding the adolescent brain without reducing adolescence to simply a problem that needs to be solved.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=resilience-decoded",
    "maximumAttendeeCapacity": "80"
  }
]