[
  {
    "@type": "Event",
    "name": "Science Beyond Labs: A Sci560 Exhibition Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-02-22T16:00:00+05:30",
    "endDate": "2025-02-22T17:30:00+05:30",
    "description": "Science is often envisioned as a pursuit carried out by individuals with extensive formal education and in controlled environments equipped with complex instruments. While this is one way science is practiced, there are many other ways it takes shape, ways that are often unnoticed.<br><br>This walkthrough is an attempt to highlight how science is often practiced in spaces far removed from sophisticated laboratories, driven by collaboration among individuals with diverse skills, perspectives, and knowledge. We will also explore how science reaches beyond these spaces to engage with the general public, fostering understanding and curiosity through science communication, and demonstrating how scientific discoveries translate into tangible benefits for society.<br><br>Through exhibits in the Gallery, you’ll discover stories of science emerging in unexpected ways and through unique approaches. Join mediator Gokul as he invites you to reflect on the dynamic, collaborative, and applied nature of science, thriving in various forms and spaces, and ultimately shaping the world around us.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=science-beyond-labs",
    "performer": [
      {
        "@type": "Person",
        "name": "Sgb-Team"
      }
    ],
    "maximumAttendeeCapacity": 50
  },
  {
    "@type": "Event",
    "name": "River Landscapes: A New Glossary",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-03-09T11:00:00+05:30",
    "endDate": "2025-03-09T13:00:00+05:30",
    "description": "The River Landscapes workshop was an invitation to students, artists, creative practitioners and early career researchers in the age group 18-30 to think about and contribute to a glossary on fluvial landscapes in the form of writing, graphic/art, photographs or other media. The workshop aimed to pay particular attention to the story of the river Kaveri and its profound influence on the ecological, political and socio-cultural landscape of the region. Through the workshop, participants attempted to situate the historical and contemporary realities of Kaveri in the larger technocratic and socio-cultural imagination of river landscapes. <br><br>The outcomes of this workshop, including writings, artworks, photographs, and other media, will be on display. We invite you to come and explore these creative contributions that reflect on the Kaveri River and its evolving landscape.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=river-landscapes-showcase",
    "performer": [
      {
        "@type": "Person",
        "name": "Sgb-Team"
      }
    ],
    "maximumAttendeeCapacity": 60
  },
  {
    "@type": "EducationEvent",
    "name": "Geospatial Technologies: Transforming Data into Action",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-02-23T11:00:00+05:30",
    "endDate": "2025-02-23T13:00:00+05:30",
    "description": "How does geospatial technology leverage data to drive decision-making and how are these technologies used ?<br>In today’s data-driven world, geospatial technology is transforming how we analyse information, make decisions, and address public challenges. From urban planning to disaster management, Geographic Information Systems (GIS) play a crucial role in shaping a smarter and more sustainable future. Join PG Diwakar as he explores the powerful applications of GIS in our country and discusses how these innovations will benefit future generations.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=geospatial-tech-data",
    "performer": [
      {
        "@type": "Person",
        "name": "Pg-Diwakar"
      }
    ],
    "maximumAttendeeCapacity": 30
  },
  {
    "@type": "EducationEvent",
    "name": "WATER560",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-03-08T11:00:00+05:30",
    "endDate": "2025-03-08T14:00:00+05:30",
    "description": "How can we rethink Bengaluru’s water crisis? Can we take action to create a more sustainable future?<br><br>Bengaluru often complains of too much water (flooding situations), too less water (shortage of water supply in summer), and also un-clean water. Where does the problem lie? How can WE work towards changing this narrative? <br>We often take water for granted—until a crisis strikes. Too much water leads to floods, too little causes droughts, and contamination threatens the health of both humans and ecosystems. How can we shift our mindset to prioritise water security before it's too late? Join this interactive discussion and debate to understand these different threats to our water systems and participate in a unique role playing exercise that puts YOU in the driver's seat to solving these issues for our city.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=water560",
    "performer": [
      {
        "@type": "Person",
        "name": "The-Echo-Network"
      }
    ],
    "maximumAttendeeCapacity": 40
  }
]