[
  {
    "@type": "EducationEvent",
    "name": "Pandemics in Perspective: History of Contagion Before and After Covid",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-12-06T18:00:00+05:30",
    "endDate": "2024-12-06T19:00:00+05:30",
    "description": "How has living through a pandemic reshaped our understanding of the history of contagion and the broader discipline of the history of medicine? Join Flurin Condrau as he examines the profound impact of the recent Covid-19 pandemic. Condrau will explore how the experience of living through a pandemic shifts historical perspectives on infection. <br><br>The pandemic has not only created new avenues for public engagement but also inspired profound reconsideration of the purpose and scope of medical history.<br> Come be a part of this thought-provoking lecture and gain fresh insights into the ways global health crises reshape our understanding of disease, society, and the role of history in public health.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=pandemics-in-perspective",
    "performer": [
      {
        "@type": "Person",
        "name": "Flurin-Condrau"
      }
    ],
    "maximumAttendeeCapacity": 70
  },
  {
    "@type": "EducationEvent",
    "name": "Agri-Cultures & Elemental Exchanges",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-12-07T11:00:00+05:30",
    "endDate": "2024-12-07T14:00:00+05:30",
    "description": "When we share a meal, we delve into the profound exchanges we make with nonhuman beings in the cycles of food production, processing, and consumption. In a world increasingly defined by human-driven systems, we often overlook the essential, still-silent contributions of the nonhuman world—plants, animals, ecosystems, and the earth itself. <br><br>Join us for a public lunch and discussion of the Agri-Cultures & Elemental Exchanges project facilitated by Jamie Allen. This event invites you to reflect on the vital exchanges we make with nonhuman beings throughout the food production, processing, and consumption cycles. Together, we will explore how human and nonhuman actors—plants, animals, ecosystems, and technologies—collaborate in the metabolic processes that sustain life. Our discussion will open out into the long histories and stories of these exchanges, the implications of modern agricultural practices, and how we can comprehend and transform food systems.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=agri-cultures-exchanges",
    "performer": [
      {
        "@type": "Person",
        "name": "Jamie-Allen"
      }
    ],
    "maximumAttendeeCapacity": 20
  },
  {
    "@type": "EducationEvent",
    "name": "Bengaluru in Focus: Game Workshop",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-12-08T11:00:00+05:30",
    "endDate": "2024-12-08T14:00:00+05:30",
    "description": "How can the artistic lens offer a constructive critique of urban spaces? Can we reflect on our experiences of the city through a game? Join Surekha in this workshop to become more aware of your interaction with the city and to creatively react to it, discovering ways of responding to urban issues and possibilities. Surekha’s presentation and workshop will be around her continued artistic engagement with the city of Bangalore for two decades, focussing on a few specific projects specific to Bangalore. In this workshop she will be addressing the functional, aesthetic possibilities and problems that the urban issues of the city faces. Come join us in creating an interactive game about Bengaluru!",
    "url": "https://carbon.scigalleryblr.org/programmes?p=bengaluru-in-focus",
    "performer": [
      {
        "@type": "Person",
        "name": "Surekha"
      }
    ],
    "maximumAttendeeCapacity": 40
  },
  {
    "@type": "Event",
    "name": "Bengal-urania: Quiz on Bengaluru",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-12-07T17:00:00+05:30",
    "endDate": "2024-12-07T19:00:00+05:30",
    "description": "Urania is the muse of astronomy and astrology, and hence the muse of science. Is Bengaluru the muse of Indian Science and Technology?<br>Bengaluru is a hub of education, technology and startups. It also hosts a wide range of science and technology museums, galleries and research institutions.  How much do you know Bengaluru? Come check out your Bengal-urania Quotient in a quiz by Urmila Lakshmanan.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=bengal-urania",
    "performer": [
      {
        "@type": "Person",
        "name": "Urmila-Lakshmanan"
      }
    ],
    "maximumAttendeeCapacity": 60
  },
  {
    "@type": "Event",
    "name": "Complex-city: A Sci560 Exhibition Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-12-07T14:00:00+05:30",
    "endDate": "2024-12-07T15:30:00+05:30",
    "description": "How do billions of neurons interact to create intelligence? How did complex life originate from basic biomolecules? How do individuals come together to create cultures and societies? It seems like the universe is continuously creating complexity out of simple interacting components. And sometimes, something unexpected emerges from these interactions.<br>Join Sandhra Sajeevan and Vishwas Solagi as they take you through the exhibition season Sci560 and explore complexity in nature. And in the process, explore how Bengaluru evolved from a simple walled fortress to a city knowing no bounds.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=complex-city-walkthrough",
    "performer": [
      {
        "@type": "Person",
        "name": "Sgb-Team"
      }
    ],
    "maximumAttendeeCapacity": 60
  }
]