[
  {
    "@type": "EducationEvent",
    "name": "Patterns & Perspectives: Sci560 Exhibition Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-06-01T17:30:00+05:30",
    "endDate": "2025-06-01T19:00:00+05:30",
    "description": "Have you ever thought of our lives being bound by cycles? From the grand loop of the food chain to the economic flow, everything follows a cycle. But what about the cycles we don’t talk about? Isn’t it soul-stirring to pause and notice these cycles that have influenced us today?<br><br>Join our mediator, Manjuvarshini, who will tell us tales from political to academic cycles in the past. Come along and explore the cycle of success and failure in experimentation, conservation, and administration through the Sci560 exhibition season.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=patterns-perspectives",
    "performer": [
      {
        "@type": "Person",
        "name": "Sgb-Team"
      }
    ],
    "maximumAttendeeCapacity": 100
  },
  {
    "@type": "EducationEvent",
    "name": "The Physiological Effects of Long-Duration Space Travel",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-06-06T17:00:00+05:30",
    "endDate": "2025-06-06T19:00:00+05:30",
    "description": "How do astronauts stay fit, nourished, and safe during months in space?<br><br>Join Dr. Brigitte Godard as she takes us behind the scenes of astronaut care. Drawing on nearly two decades of experience, including her current work at the European Astronaut Centre, Dr. Godard unpacks the physiological and nutritional challenges of long-duration spaceflight from bone loss and disrupted sleep cycles to changes in gut microbiota, radiation exposure, and appetite shifts. Through ground-based studies like bed rest experiments and in-flight monitoring, she offers a compelling glimpse into the science that keeps humans healthy beyond Earth.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=physiological-effects-space",
    "performer": [
      {
        "@type": "Person",
        "name": "Brigitte-Godard"
      }
    ],
    "maximumAttendeeCapacity": 100
  },
  {
    "@type": "EducationEvent",
    "name": "Too many Cooks Spoil the Broth: Planning for Bengaluru",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-06-07T11:00:00+05:30",
    "endDate": "2025-06-07T13:00:00+05:30",
    "description": "Bengaluru's Master Plans have tenuously shaped its spatial development between paradigms of outward growth and compact city, since 1995. A city straddling multiple players and no clear owners so far, has long awaited revision to the 2015 Master Plan, as it struggles to deal with multiple contingencies. <br><br>Join Champaka Rajagopal as she traverses processes and paradigms adopted by multiple Master Plans for Bengaluru, since 1995, discuss fundamental questions of who should plan, at what scale and how. The workshop will also take a look at structural challenges and collectively revisit the planning process through tangible methods, in the hope for a better Bengaluru.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=too-many-cooks",
    "performer": [
      {
        "@type": "Person",
        "name": "Champaka-Rajagopal"
      }
    ],
    "maximumAttendeeCapacity": 30
  }
]