[
  {
    "@type": "EducationEvent",
    "name": "Forbidden Desire: Sugar Blowing Workshop",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-16T11:00:00+05:30",
    "endDate": "2025-11-16T13:00:00+05:30",
    "description": "Sugar is a material full of contrasts, a sweet delight and a forbidden indulgence. Inspired by artist Jade Armstrong’s original concept, this workshop explores the delicate balance between beauty, sweetness, and the fleeting nature of life.\n\nIn this workshop, Chef Pratyay will guide the participants to learn and to create intricate sugar-blown sculptures, each capturing a single breath and symbolising both the passage of time and the fragility of life. As these sculptures slowly melt into syrupy residue, they reflect sugar’s transformation from a prized luxury to an overconsumed treat.\n\nThis hands-on experience encourages reflection on desire, decay, and consumption.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=sugar-blowing1",
    "maximumAttendeeCapacity": "25"
  },
  {
    "@type": "Event",
    "name": "Investigating Invertebrates: Insects and Molluscs",
    "location": {
      "@type": "Place",
      "name": "ATREE, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-08T11:00:00+05:30",
    "endDate": "2025-11-08T11:00:00+05:30",
    "description": "Curious about Invertebrates?\n\nJoin us as we got to ATREE to visit the Insect Bio-systematics and Conservation Lab and the Freshwater Ecology and Conservation lab. Learn of their work in the documentation and conservation of invertebrates like insects and crickets. Interact with the researchers and equipment that drives scientific inquiry on these curious creatures. Discover how they play a big role in preserving our ecosystem and their potential as a food of the future.\n\nWork from these labs are featured in the CALORIE exhibits, Ingesting insects and Munching molluscs.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=investigating-invertebrates",
    "maximumAttendeeCapacity": "30"
  },
  {
    "@type": "EducationEvent",
    "name": "Decoding a Predator's Diet",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-08T16:00:00+05:30",
    "endDate": "2025-11-08T16:00:00+05:30",
    "description": "Ever wonder what predatory birds feed on? \n\nJoin Arjun Kannan, as he unravels the dietary secrets of Harriers - a migratory bird of prey. Harriers are long distance migrants that come to the dry grasslands of India during the months of August to March. They travel thousands of kilometres from their breeding grounds in Central Asia to spend the winter in India, catching diverse kinds of prey. Through long term research, Arjun has tried to decode what they eat and whether their diet shifts between the regions and seasons within India. Learn how Harriers contribute to ecosystem services by forming vital links in the fragmented grassland habitats of India.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=decoding-predator-diets",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Caloric Connections in The Rainforest",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-09T16:00:00+05:30",
    "endDate": "2025-11-09T16:00:00+05:30",
    "description": "Have you ever wondered what life is like in a rainforest?\n\nJoin T. ganesh on a fascinating journey into the lush rainforests of the Kalakad–Mundanthurai Tiger Reserve. Explore the intricate relationships between plants and animals that have evolved over millions of years in the Western Ghats. Discover the story of a remarkable tree—whose parts are familiar in indian kitchens as a spice—serving as both culinary delight and vital sustenance for forest creatures. From elusive mice to agile canopy-dwelling monkeys, uncover how persistence and patience has led to remarkable discoveries in these ancient forests, long before modern technology made exploration easier.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=rainforest-caloric-connections",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Hungry City: Food Insecurity Among Labour Migrants",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-15T16:00:00+05:30",
    "endDate": "2025-11-15T16:00:00+05:30",
    "description": "Have you ever wondered what food security looks like in Indian cities?\n\nWhile urban conversations often focus on cutting carbs, counting calories, and following the latest diet trends, a very different story unfolds among the millions of low-skilled migrant workers who keep these cities running. Join Chetan Choithani as he explores the hidden face of urban food insecurity through the experiences of nearly 600 labour migrants in Bengaluru. Many of these workers leave their villages in search of better livelihoods, only to find themselves in precarious informal jobs that force them to compromise on their own nutrition—skipping meals, eating poorly, and sometimes going hungry. Through their stories, this lecture reveals how India’s food insecurity challenge is shifting—from being largely rural to becoming an increasingly urban concern.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=hungry-city",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "Event",
    "name": "Game On: Learning Through Play",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-09T11:00:00+05:30",
    "endDate": "2025-11-09T11:00:00+05:30",
    "description": "Each year on November 10, the International Science Day for Peace and Development celebrates science’s role in shaping a more sustainable and peaceful world. This year, Game On invites you to explore these ideas through curiosity and play. Together, we will experiment with games that reveal how climate change affects what we grow, how our energy choices shape the planet, and how imagination can open paths to peace. The session concludes with a reading of Ursula K. Le Guin’s The Carrier Bag Theory of Fiction and a collective blackout poetry exercise inspired by it.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=game-on",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "VisualArtsEvent",
    "name": "Innovation in Jazz",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-12T18:00:00+05:30",
    "endDate": "2025-11-12T18:00:00+05:30",
    "description": "Bengaluru Jazz Fest 2025 reimagines the long conversation between Indian classical music and jazz, uncovering the threads of Indo-German collaboration that have shaped this exchange for over forty-five years.\n\nWith the support of Bosch, whose seventy-year journey in Bengaluru reflects a shared ethos of invention and dialogue, the festival becomes a space to question how art and technology intersect — and how improvisation drives both.\n\nBeyond performance, the festival explores the psychological and sociological effects of collaboration: how shared rhythm and resonance influence perception, community, and creative identity.\n\nBengaluru Jazz Fest 2025 invites you to listen differently to explore sound as a form of inquiry, memory, and transformation.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=innovation-jazz",
    "maximumAttendeeCapacity": "100"
  },
  {
    "@type": "EducationEvent",
    "name": "Testing The Boundaries of Quantum Mechanics: Nobel Prize in Physics",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-09T16:00:00+05:30",
    "endDate": "2025-11-09T16:00:00+05:30",
    "description": "Are you curious about Quantum Mechanics?\n\nJoin Anil Ananthaswamy as he explores the discoveries of John Clarke, Michel H. Devoret and John M. Martinis the winners of this year's Nobel Prize in Physics. Dive into the question that has haunted physicists since the birth of quantum mechanics. How big can a system get before it stops behaving quantum mechanically and hews to theories of classical physics? Does nature have a quantum-classical boundary?. Explore the prize winners work in showing quantum mechanical tunneling and other quantum effects in macroscopic electrical circuits, suggesting that quantum theory remains applicable as objects get bigger. Anil will discuss the work that won the Nobel Prize, how it pushed the quantum-classical boundary beyond previously known limits, and the implications for technologies such as quantum computers.\n\nThe lecture will be followed by a panel discussion on Quantum Mechanics with Arindam Ghosh and Shobhana Narasimhan.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=quantumn-mechanics",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Metal-Organic Frameworks: The Material, The Chemistry, The Nobel Prize and Beyond",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-08T16:00:00+05:30",
    "endDate": "2025-11-08T16:00:00+05:30",
    "description": "What makes Metal–Organic Frameworks (MOFs) so important in today’s world?\n\nThe 2025 Nobel Prize in Chemistry marks a remarkable recognition of Metal-\nOrganic Frameworks (MOFs) — crystalline, porous materials that have revolutionized materials science and chemistry. Built from the coordination driven assembly of metal ions or clusters with organic linkers, MOFs embody the concept of reticular chemistry. Join Tapas K. Maji as he traces the journey of MOFs—from the pioneering discoveries by Professors Robson, Kitagawa, and Yaghi, to their roles in addressing global challenges such as CO 2 capture and conversion, green hydrogen production, water harvesting and purification, and targeted drug delivery. Having had the privilege of working as a postdoctoral researcher with one of the laureates -Prof. Susumu Kitagawa (Kyoto University, Japan) - during the formative years of MOF research (2002–2005) Tapas will share insights from his work in the laureates laboratory. The talk will highlight how the MOF community’s collective efforts have shaped a new paradigm in porous materials chemistry, integrating functionality, adaptability, and aesthetics at the molecular level and beyond.\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=mof-nobel-chemistry",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Eyes on the Prize' : Looking at the Nobel and Other Prizes for Literature",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-11-14T17:00:00+05:30",
    "endDate": "2025-11-14T18:30:00+05:30",
    "description": "As we read more and more in translation, the world of literature grows smaller and more intimate. We learn about other people and other cultures. And we realise that across the planet, all humans have the same hopes and fears, the same desires and anxieties. More than any other discipline, literature demonstrates and celebrates our common humanity. The number of literary prizes has grown rapidly in the last few decades, especially prizes for a single book. Where have these prizes come from and whom do they go to? How do they impact books sales and impact the publishing industry? Literary prizes have political, aesthetic and commercial dimensions – how do these factors determine the literary landscape for readers like you and me?",
    "url": "https://sci560.scigalleryblr.org/programmes?p=eyes-on-prize",
    "maximumAttendeeCapacity": "80"
  }
]