[
  {
    "@type": "EducationEvent",
    "name": "Will You Join Me For Lunch?: The Rise and Fall (and Rise) of Commensality",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-03T16:00:00+05:30",
    "endDate": "2026-01-03T16:00:00+05:30",
    "description": "\"Commensality\", derived from the Latin words 'com' (with) and 'mensa' (table), refers to the practice of eating together at the same table.\n\nIn this talk—more a conversation than a lecture—CALORIE artist Sahitya explores the deep connection between food and human relationships and how the act of eating together has evolved over time. She reflects on what transforms eating from a mere task into a shared experience, drawing on the idea that “we are not only what we eat, but also who we eat with” — Harry G. West.\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=will-join-me-for-lunch",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Tangible Selfies: Materialising Personal Data",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-04T15:00:00+05:30",
    "endDate": "2026-01-04T15:00:00+05:30",
    "description": "What if we could reflect on data about ourselves, not through charts and apps but with tangible materials?\n\nIn this workshop, Rasagy Sharma will explore personal data through the lens of quantified self-practices and tangible data representation. In a world obsessed with big data, large data models and digital automation, this workshop invites you to slow down and observe your daily lives with intention and curiosity. Participants will explore how to curate and make physical artefacts with their data. \n\nWhether you maintain detailed journals, use digital tracking apps, or are just curious to visualise a new year’s resolution, you’ll leave with a new perspective about data and its representation.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=tangible-selfies",
    "maximumAttendeeCapacity": "40"
  },
  {
    "@type": "Event",
    "name": "The Making of an Exhibition: Women in Mathematics",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-04T11:00:00+05:30",
    "endDate": "2026-01-04T11:00:00+05:30",
    "description": "How is a portrait exhibition created, and how can it foreground the human side of mathematics?\n\nJoin photographer Noel Tovia Matoff, mathematician Sylvie Paycha, and physicist Sumati Surya for a panel discussion on the making of the upcoming exhibition Women in Mathematics. Bringing together photographic portraits and personal narratives of women mathematicians from around the world, the exhibition explores the lives, work, and intellectual journeys that shape the production of mathematics across different contexts. This discussion will unpack the process behind creating the portraits, how the women’s experiences were documented, and how storytelling informed the exhibition’s curatorial approach. The panel will reflect on how mathematics is produced by people rather than abstractions, and how attention to lived experience can make visible the institutional, cultural, and systemic conditions that shape participation in the field.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=women-of-mathematics",
    "maximumAttendeeCapacity": "100"
  },
  {
    "@type": "EducationEvent",
    "name": "CALORIE meets Ghibli: People, Food and Stories",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2026-01-04T16:00:00+05:30",
    "endDate": "2026-01-04T17:30:00+05:30",
    "description": "Studio Ghibli, the Japanese animation studio known for stories with heart and meaning, teams up with CALORIE to serve up some serious food for thought.\nThe studio has a recurring theme of cooking and eating to connect the viewers and the worlds within the Ghibli movies. And when looking at an exhibition which also uses food as a connector, the two coming together was inevitable. \n\nWe will be exploring themes of history, politics and the environment, bringing together our exhibits and our favourite movies. \n\nSo, are you ready to be Spirited Away? Will you Totoro-ly love it? Where might this Moving Castle take us next?\n\nIf you got these puns…this walkthrough will be right up your alley!\nAnd if not? Come find out!\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=calorie-meets-ghibili-people-food-and-stories",
    "maximumAttendeeCapacity": "50"
  }
]