[
  {
    "@type": "EducationEvent",
    "name": "Carbon: The Elusive Archaeomaterial",
    "location": "National Institute of Advanced Studies",
    "startDate": "2024-05-16T10:00:00+05:30",
    "description": "How do we understand human evolution through archaeology? And what role does carbon play in this? Dive into a two-day masterclass with archaeometallurgist Sharada Srinivasan, who will talk about the carbon in both organic and inorganic archaeomaterials. From carbon black used by ancient Egyptians to the famous diamond mines in Golconda, discover how carbon finds its way into a vast array of materials like iron and steel. <br><br>For example, delve into the saga of India’s legendary high carbon wootz steel, made particularly in southern India, known as ‘ukku’—likely the earliest known high grade steel. Since the role of carbon as a separate alloying element was not well understood, numerous studies were made by 18th and 19th century European scientists (including Faraday) to replicate wootz steel. These spurred several important discoveries leading up to the Industrial Revolution. <br><br>Join Sharada Shrinivasan as she brings together theoretical perspectives with hands-on experiences which explore the role of carbon in the firing of pottery kilns!<br><br>This masterclass is supported by the NIAS - TCS Heritage Initiative.",
    "duration": "P2D",
    "url": "https://carbon.scigalleryblr.org/programmes?p=carbon-elusive-archeomaterial",
    "performer": [
      {
        "@type": "Person",
        "name": "Sharada Srinivasan"
      }
    ],
    "maximumAttendeeCapacity": 60
  },
  {
    "@type": "EducationEvent",
    "name": "Threading it Together: An Exploration of Carbon Fibre",
    "location": "Science Gallery Bengaluru",
    "startDate": "2024-05-11T11:00:00+05:30",
    "description": "What is carbon fibre and how can you work with it? Properties similar to steel but resembling plastic in weight, carbon fibre finds applications in varied fields from aerospace engineering to the automotive industry. <br><br>In this workshop, get your hands dirty to experience the manufacturing process of carbon fibre components. From layup to curing, you can explore the entire production process to unlocking insights applicable across various industries. Join engineers from ProjectX Labs to delve into the curious world of carbon materials!",
    "duration": "P2D",
    "url": "https://carbon.scigalleryblr.org/programmes?p=threading-together-carbon-fibre",
    "performer": [
      {
        "@type": "Person",
        "name": "Projectx Labs"
      }
    ],
    "maximumAttendeeCapacity": 45
  }
]