[
  {
    "@type": "Event",
    "name": "Sci560 Reading Circle",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-07-17T17:00:00+05:30",
    "endDate": "2024-07-17T18:30:00+05:30",
    "description": "Have you ever wondered how the essence of a city can be captured through words? Join our reading circle, where we explore Bengaluru through a curated list of readings, from flash fiction to long-form essays. Together, we will delve into the city's vibrant culture, rich history, and contemporary life, creating a community of readers who experience Bengaluru in a novel way. <br><br>Join us for an an engaging and insightful journey as we ready ourselves for our next exhibition-season <i>Sci560</i>!<br><br>Registered participants will be sent a list of readings.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=sci560-reading-circle",
    "performer": [
      {
        "@type": "Person",
        "name": "Reading-Circle"
      }
    ],
    "maximumAttendeeCapacity": 20
  },
  {
    "@type": "ScreeningEvent",
    "name": "Songlines on Screen",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-07-19T00:00:00+05:30",
    "endDate": "2024-07-19T00:00:00+05:30",
    "description": "Songlines on Screen is a series of 7 short films that have been made to record, celebrate, and share precious historic and cultural information from Indigenous groups in remote western, northern, and central Australia. The film screening joins the larger exhibition ‘Walking Through A Songline’ run by the Australian Consulate-General Bengaluru.  Walking Through A Songline is an award-winning digital immersive art installation which explores the nexus between ancient Australian First Nations knowledge and cutting-edge technology, created by Mosster Studio for the National Museum of Australia.<br>Credits: A Screen Australia and National Indigenous Television (NITV) initiative",
    "url": "https://carbon.scigalleryblr.org/programmes?p=songlines-on-screen",
    "performer": [
      {
        "@type": "Person",
        "name": ""
      }
    ],
    "maximumAttendeeCapacity": 20
  }
]