[
  {
    "@type": "Event",
    "name": "Specimens and Stories: A Visit to Natural History Collections",
    "location": {
      "@type": "Place",
      "name": "National Centre for Biological Sciences",
      "address": "National Centre for Biological Sciences, Bangalore",
      "url": "https://maps.app.goo.gl/sZgsVT4sgj9Ub1Z69"
    },
    "startDate": "2025-06-29T11:00:00+05:30",
    "endDate": "2025-06-29T13:00:00+05:30",
    "description": "How are specimens collected, preserved, and studied?<br><br>Join us at the Natural History Collections at NCBS and discover the fascinating world of specimens. This visit will be an opportunity to see how scientists collect, preserve, and study specimens that help us understand the story of our planet’s biodiversity. From pressed plants and drawers full of insects to preserved bird specimens, every item offers clues about biodiversity, evolution, and environmental change. Participants will also learn how these collections support research, education, and conservation, and hear the stories behind them.<br><br>",
    "url": "https://sci560.scigalleryblr.org/programmes?p=specimens-stories",
    "performer": [
      {
        "@type": "Person",
        "name": "Pritha-Dey"
      }
    ],
    "maximumAttendeeCapacity": 30
  },
  {
    "@type": "EducationEvent",
    "name": "The Story of the Great Trigonometrical Survey",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-07-05T16:00:00+05:30",
    "endDate": "2025-07-05T16:00:00+05:30",
    "description": "Have you ever heard of the Great Trignometrical Survey?<br><br><br><br>Join us as Meera Iyer and Shruthi Rao take us through the story of one of the most astounding projects in the history of science. From its origins in Bengaluru all the way to the heights of the Himalayas. The talk will touch upon some of the most famous surveyors in the GTS including William Lambton and George Everest. Exploring why exactly these surveyors had to tramp across the country, braving wild beasts, monsoons, and disease in their quest for inch-perfect maps? It will also speak about some of the forgotten Indians who were a part of this extraordinary work. <br>",
    "url": "https://sci560.scigalleryblr.org/programmes?p=great-trignometrical-survey",
    "performer": [
      {
        "@type": "Person",
        "name": "Meera-Iyer"
      },
      {
        "@type": "Person",
        "name": "Shruthi-Rao"
      }
    ],
    "maximumAttendeeCapacity": 100
  },
  {
    "@type": "EducationEvent",
    "name": "Mechanism Design: Aligning Divergent Stakeholders",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-06-28T11:00:00+05:30",
    "endDate": "2025-06-28T13:00:00+05:30",
    "description": "This workshop, a sequel to the one on 'Too Many Cooks Spoil the Broth: Planning for Bengaluru', is about 'mechanism design', towards accomplishing shared-desirable outcomes for the city. How can urban planning processes negotiate and reconcile competing demands of an amplified set of stakeholders who are often mis-aligned in their values and goals? In this workshop, Champaka Rajagopal will explore mechanism design which incorporates incentives and penalties for stakeholders to partner, behave and transact in ways that contribute to the accomplishment of shared outcomes. Drawing on existing practices and models, we will creatively craft multiple partnership arrangements among stakeholders with competing interests at different scales of decisions, in our endeavor for meeting shared desirable outcomes for Bengaluru.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=mechanism-design",
    "performer": [
      {
        "@type": "Person",
        "name": "Champaka-Rajagopal"
      }
    ],
    "maximumAttendeeCapacity": 30
  },
  {
    "@type": "EducationEvent",
    "name": "560 Minutes of Sci560",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-06-29T10:00:00+05:30",
    "endDate": "2025-06-29T19:20:00+05:30",
    "description": "Sci560 is wrapping up in a few weeks. Curious about the stories of all 40 exhibits?<br>Join us for a special day-long workshop led by mediator Gokul and design intern Anuhya, as they guide you through an immersive exploration of the entire exhibition.<br>Through curated walkthroughs and hands-on activities woven across different zones of the gallery, participants will explore the full spectrum of science, art, and culture that the exhibition brings together. It’s an invitation to engage deeply, slowly, and expansively—with space to pause, play, and participate.<br>",
    "url": "https://sci560.scigalleryblr.org/programmes?p=560-sci560",
    "performer": [
      {
        "@type": "Person",
        "name": "Gokul-Prabhu"
      },
      {
        "@type": "Person",
        "name": "Anuhya-Mahesh"
      }
    ],
    "maximumAttendeeCapacity": 25
  },
  {
    "@type": "EducationEvent",
    "name": "The Heftiest Things Ever: Telescoping Sharp onto Giant Black Holes",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-06-28T16:00:00+05:30",
    "endDate": "2025-06-28T16:00:00+05:30",
    "description": "Modern technology enables us to reach far, far into the cosmic depths of our universe to unravel the unknown. Among the many discoveries that have followed are the heftiest things we know, namely giant black holes that inhabit the middles of galaxies. <br><br>The early evidence for these intriguing objects that emerged in the middle of the last century effectively rested on the Sherlock-Holmes argument. Today, however, we have the most direct evidence possible for black holes, discovered through telescopes—the sharpest eyes that technology can make. In this lecture, physicist Prajval Shastri will share the story of understanding these black holes.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=telescoping-onto-giant-black-holes",
    "performer": [
      {
        "@type": "Person",
        "name": "Prajval-Shastri"
      }
    ],
    "maximumAttendeeCapacity": 100
  }
]