[
  {
    "@type": "Event",
    "name": "River Landscapes: A New Glossary",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-03-09T11:00:00+05:30",
    "endDate": "2025-03-09T13:00:00+05:30",
    "description": "The River Landscapes workshop was an invitation to students, artists, creative practitioners and early career researchers in the age group 18-30 to think about and contribute to a glossary on fluvial landscapes in the form of writing, graphic/art, photographs or other media. The workshop aimed to pay particular attention to the story of the river Kaveri and its profound influence on the ecological, political and socio-cultural landscape of the region. Through the workshop, participants attempted to situate the historical and contemporary realities of Kaveri in the larger technocratic and socio-cultural imagination of river landscapes. <br><br>The outcomes of this workshop, including writings, artworks, photographs, and other media, will be on display. We invite you to come and explore these creative contributions that reflect on the Kaveri River and its evolving landscape.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=river-landscapes-showcase",
    "performer": [
      {
        "@type": "Person",
        "name": "Sgb-Team"
      }
    ],
    "maximumAttendeeCapacity": 60
  },
  {
    "@type": "EducationEvent",
    "name": "WATER560",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-03-08T11:00:00+05:30",
    "endDate": "2025-03-08T14:00:00+05:30",
    "description": "How can we rethink Bengaluru’s water crisis? Can we take action to create a more sustainable future?<br><br>Bengaluru often complains of too much water (flooding situations), too less water (shortage of water supply in summer), and also un-clean water. Where does the problem lie? How can WE work towards changing this narrative? <br>We often take water for granted—until a crisis strikes. Too much water leads to floods, too little causes droughts, and contamination threatens the health of both humans and ecosystems. How can we shift our mindset to prioritise water security before it's too late? Join this interactive discussion and debate to understand these different threats to our water systems and participate in a unique role playing exercise that puts YOU in the driver's seat to solving these issues for our city.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=water560",
    "performer": [
      {
        "@type": "Person",
        "name": "The-Echo-Network"
      }
    ],
    "maximumAttendeeCapacity": 40
  },
  {
    "@type": "Event",
    "name": "Open Mic at Namma Oota",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-03-02T15:00:00+05:30",
    "endDate": "2025-03-02T17:00:00+05:30",
    "description": "Food is more than just sustenance; it symbolises unity, culture, and nostalgia. Just like food, music has the power to bring people together. Join us for an open mic session where food lovers, musicians, storytellers, and poets come together to celebrate the magic of flavours and melodies.<br><br>Whether it's a treasured family recipe, a comical culinary mishap, or a story about trying new flavours, this is your opportunity to take the stage and share your love of food with a passionate audience.<br><br>Every meal has a story to tell, so come talk, sing, listen and enjoy some storytelling!<br><br>Register to perform here: <a href=\"https://forms.gle/nC6S69mmdLWBfXKZ8\" target=\"_blank\"><u>https://forms.gle/nC6S69mmdLWBfXKZ8</u></a>",
    "url": "https://carbon.scigalleryblr.org/programmes?p=namma-open-mic",
    "performer": [
      {
        "@type": "Person",
        "name": "Sgb-Team"
      }
    ],
    "maximumAttendeeCapacity": 300
  },
  {
    "@type": "EducationEvent",
    "name": "The Parental Brain: Understanding Parenthood and the Human Brain",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-03-09T16:00:00+05:30",
    "endDate": "2025-03-09T18:00:00+05:30",
    "description": "How does the transition to parenthood reshape the brain? What do these neurological changes mean for both birthing and non-birthing parents?<br><br>The transition to parenthood, particularly motherhood, involves significant neurological changes throughout pregnancy and into the postpartum period. Recent research has begun to uncover the profound alterations in the maternal brain during this time of matrescence, why they occur and what they mean. Furthermore, these changes are not exclusive to birthing parents—fathers and adoptive parents experience similar brain adaptations. Join Jodi Pawluski as she explores the key transformations in the brain during the transition to parenthood.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=the-parental-brain",
    "performer": [
      {
        "@type": "Person",
        "name": "Jodi-Pawluski"
      }
    ],
    "maximumAttendeeCapacity": 50
  },
  {
    "@type": "Event",
    "name": "Upcycling Flavour: Transforming Spent Grain into Delicious Possibilities",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-03-02T11:00:00+05:30",
    "endDate": "2025-03-02T12:30:00+05:30",
    "description": "Did you know that brewing beer leaves behind a super nutritious, flavour-packed by-product? Meet Brewer’s Spent Grain (BSG)—rich in fibre, protein, and endless possibilities! But here’s the catch: most of it goes to waste.<br>In this hands-on, tasting-driven workshop, we’ll take you on a grain-to-plate journey. Feel, taste, and experiment with spent grain in its different forms—from fresh and wet to dried and flour. Sample upcycled treats like cookies, granola, and even cheese aged with spent grain. Then, put your creativity to the test in our interactive ideation challenge, where you’ll dream up new ways to upcycle this overlooked ingredient.<br>Whether you're a foodie, a sustainability geek, or just someone who loves beer and snacks, this session will change the way you see ‘waste’.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=upcycling-flavour",
    "performer": [
      {
        "@type": "Person",
        "name": "Elizabeth-Yorke"
      }
    ],
    "maximumAttendeeCapacity": 30
  },
  {
    "@type": "Event",
    "name": "Fermentation 101: Microbes in Science and Culture",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-03-01T17:00:00+05:30",
    "endDate": "2025-03-01T18:30:00+05:30",
    "description": "What role has fermentation played in food preservation? How to get started on making your own ferments?<br><br>Join Payal Shah, founder of Kobo fermentary, for an exciting introduction to the world of fermentation. In this hands-on event, you will learn the basics of lacto-fermentation—a natural and time-honored way to preserve food while enhancing its flavor and nutritional benefits.  <br><br>Explore the key ingredients and tools in fermentation and engage in live demonstrations of delicious ferments. Whether you're a beginner or just curious about fermentation, this programme will leave you inspired to start fermenting in your own kitchen. <br><br>Come ready to learn, taste, and experiment!",
    "url": "https://carbon.scigalleryblr.org/programmes?p=fermentation-101",
    "performer": [
      {
        "@type": "Person",
        "name": "Payal-Shah"
      }
    ],
    "maximumAttendeeCapacity": 30
  },
  {
    "@type": "VisualArtsEvent",
    "name": "Xenkat Live at Namma Oota",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-03-02T17:00:00+05:30",
    "endDate": "2025-03-02T18:00:00+05:30",
    "description": "Headlining the Open Mic event at Namma Oota is Xenkat – A musician with a deep fascination for the role of bacteria and fungi in our lives. Watch him perform a series of short numbers spread over an hour. Get your heads bobbing to a plethora of ancient tribal instruments such as,  the Didgeridoo and mouth harps, he creates an atmosphere of exploration through his music.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=xenkat-live",
    "performer": [
      {
        "@type": "Person",
        "name": "Siddharth-Venkat"
      }
    ],
    "maximumAttendeeCapacity": 300
  },
  {
    "@type": "EducationEvent",
    "name": "The Untold Story of Grasses",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-03-08T16:00:00+05:30",
    "endDate": "2025-03-08T18:00:00+05:30",
    "description": "How have grasses shaped human civilisation and the ecosystem? <br><br>Grasses are an ancient, diverse and extraordinary group of plants, but most of us rarely give them a second thought.  Join Mahesh Sankaran as he explores how their evolution has transformed Earth in unprecedented ways, and how these amazing life forms impact our lives in ways we don’t realise.  The discussion will conclude by outlining the various dangers that grassland ecosystems are currently experiencing and stressing how vital it is that they be preserved.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=untold-story-grasses",
    "performer": [
      {
        "@type": "Person",
        "name": "Mahesh-Sankaran"
      }
    ],
    "maximumAttendeeCapacity": 50
  }
]