[
  {
    "@type": "Event",
    "name": "Superposition: A Dive into the Quantum World",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-11-17T18:30:00+05:30",
    "endDate": "2024-11-17T20:00:00+05:30",
    "description": "Can exploring quantum physics through art change the way we experience reality? Come join Robert Lisek and Dayita Nereyeth as they delve into this evolving landscape. <br><br>This visionary performance will explore the intersections of quantum physics, artificial intelligence, human cognition, and artistic expression, merging these fields into a unique experience that is both philosophical inquiry and experiential art. <br>Set in a dynamic space,  laser lights, video projections and dance respond to quantum principles like superposition, entanglement, interference, and decoherence.<br><br>This immersive installation encourages participants to experience multiple states of being and perceive layers of reality beyond ordinary perception.<br><br>This programmes is part of Studio Quantum, supported by Quantum Delta and V2.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=superposition",
    "performer": [
      {
        "@type": "Person",
        "name": "Robert-Lisek"
      },
      {
        "@type": "Person",
        "name": "Dayita-Nereyeth"
      }
    ],
    "maximumAttendeeCapacity": 80
  },
  {
    "@type": "EducationEvent",
    "name": "Mental Health: From Genes to Electrical and Magnetic Stimulation",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-11-17T16:00:00+05:30",
    "endDate": "2024-11-17T18:00:00+05:30",
    "description": "Join Suhas Ganesh and Rakshathi Basavaraju from the National Institute of Mental Health and Neurosciences (NIMHANS) in two short talks followed by an Ask Me Anything (AMA) on mental health.<br><br>1) When something is wrong with the body, the mind recognises the change and motivates us to action. When things start going wrong with the mind itself, what happens? In this public lecture, Suhas Ganesh will explore the myriad maladies of the mind and how our mind detects or fails to detect, a change within itself. He also looks at mental health through the lens of genetics. He explores the interplay between genes, experiences and the environment and their effect on the mind.<br><br>2) Mental health conditions can be of a multitude of types. The way each individual experiences mental health conditions is also diverse. It is no surprise then that there exist a plethora of treatments in psychiatry. One such treatment is the electric and magnetic stimulation of the brain. In this lecture, Rakshathi Basavaraju offers a glimpse into the types of electromagnetic stimulation in psychiatry, the conditions they treat and their safety.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=genes-electric-magnetic",
    "performer": [
      {
        "@type": "Person",
        "name": "Suhas-Ganesh"
      },
      {
        "@type": "Person",
        "name": "Rakshathi"
      }
    ],
    "maximumAttendeeCapacity": 60
  },
  {
    "@type": "EducationEvent",
    "name": "Pandemics in Perspective: History of Contagion Before and After Covid",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-12-06T18:00:00+05:30",
    "endDate": "2024-12-06T19:00:00+05:30",
    "description": "How has living through a pandemic reshaped our understanding of the history of contagion and the broader discipline of the history of medicine? Join Flurin Condrau as he examines the profound impact of the recent Covid-19 pandemic. Condrau will explore how the experience of living through a pandemic shifts historical perspectives on infection. <br><br>The pandemic has not only created new avenues for public engagement but also inspired profound reconsideration of the purpose and scope of medical history.<br> Come be a part of this thought-provoking lecture and gain fresh insights into the ways global health crises reshape our understanding of disease, society, and the role of history in public health.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=pandemics-in-perspective",
    "performer": [
      {
        "@type": "Person",
        "name": "Flurin-Condrau"
      }
    ],
    "maximumAttendeeCapacity": 70
  }
]