[
  {
    "@type": "Event",
    "name": "Info Session | CALORIE FT Mediators",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-01-12T17:00:00+05:30",
    "endDate": "2025-01-12T18:30:00+05:30",
    "description": "Why should you be a Mediator for CALORIE?<br><br>Interacting with Mediators at the exhibition is a key part of the Science Gallery Bengaluru experience. As a Mediator, you get to train with artists and scholars from around the world, have conversations with visitors from across Bengaluru and be a part of an exciting public engagement experiment.<br>Considering applying for the part-time or full-time Mediator Programmes for Calorie, our next exhibition-season? Confused about how to apply or what the programme entails?<br>Bring all of your questions to an in-person session to know more about the programme from the Learning team. Find out about the application process and hear from the present full-time cohort as they delve into the role of a Mediator and share some experiences from the exhibition floor.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=calorie-info-session",
    "performer": [
      {
        "@type": "Person",
        "name": "Sgb-Team"
      }
    ],
    "maximumAttendeeCapacity": 50
  },
  {
    "@type": "Event",
    "name": "South Asia & the Institute: Transformative Connections",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-01-18T11:00:00+05:30",
    "endDate": "2025-01-18T13:00:00+05:30",
    "description": "South Asia and the Institute: Transformational Connections showcases the longstanding connections between MIT and South Asia (India, Pakistan, Bangladesh, Sri Lanka, Nepal) that go back more than 140 years. <br>The Institute’s past and present has been enriched as much by South Asian students and faculty as their lives have been shaped by the Institute. Perched at the forefront of technological revolutions across the globe, MIT’s South Asians have negotiated a changing world of race and immigration in America, and decolonization and nation-building in South Asia.  South Asia and the Institute makes these transformative connections visible. <br>Join us for a conversation on the influence of science and technology education and the screening of the documentary, “Revolution on the Ganga: The Making of the Technological Indian.”",
    "url": "https://carbon.scigalleryblr.org/programmes?p=south-asia-institute-transformative",
    "performer": [
      {
        "@type": "Person",
        "name": "Sana-Aiyar"
      },
      {
        "@type": "Person",
        "name": "Hamsa-Balakrishnan"
      },
      {
        "@type": "Person",
        "name": "Srinath-Raghavan"
      },
      {
        "@type": "Person",
        "name": "Ranu-Boppana"
      },
      {
        "@type": "Person",
        "name": "Michael-John-Gorman"
      },
      {
        "@type": "Person",
        "name": "Narayana-Murthy"
      }
    ],
    "maximumAttendeeCapacity": 40
  },
  {
    "@type": "Event",
    "name": "Heritage Walk: Architecture at Cubbon Park",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-01-12T08:00:00+05:30",
    "endDate": "2025-01-12T10:00:00+05:30",
    "description": "Have you ever wondered how Cubbon Park became the heart of Bengaluru’s history? Come join Meera Iyer as she takes you on a journey through time to uncover 200 years of history. She will explore architecture and planning in and around Cubbon Park from soon after the Bangalore cantonment was established to Independence and beyond. Along the way, you’ll hear stories of people from near and far, and of events that have shaped our city.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=heritage-walk",
    "performer": [
      {
        "@type": "Person",
        "name": "Meera-Iyer"
      }
    ],
    "maximumAttendeeCapacity": 25
  },
  {
    "@type": "EducationEvent",
    "name": "Modelling and Managing Bengaluru’s Transport through Travel Behaviour",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-01-11T16:00:00+05:30",
    "endDate": "2025-01-11T18:00:00+05:30",
    "description": "People Travel and Goods Move. Where? When? Why? How? and How much? These questions encompass the study of travel behaviour. How does this behaviour then inform us in modelling and managing city-scale transportation systems? <br>Join Abdul Rawoof Pinjari in answering these questions and to understand how travel in cities is analysed. Come explore how transportation models can be used to decide what type of transportation infrastructure to provide, where to provide it and how much. Especially, in the context of namma Bengaluru.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=modelling-managing-transport",
    "performer": [
      {
        "@type": "Person",
        "name": "Abdul-Pinjari"
      }
    ],
    "maximumAttendeeCapacity": 50
  }
]