[
  {
    "@context": "http://schema.org",
    "@type": "EducationEvent",
    "name": "From Junk to Jules: Planning an Energy Efficient Kitchen",
    "location": "Science Gallery Bengaluru ",
    "startDate": "2024-04-06T14:00:00+05:30",
    "description": "Are you tired of the daily struggle of deciding what to eat amidst your busy schedule? Do you find yourself relying on delivery through food apps more often than not, sacrificing nutrition and sustainability? Join Chef and Nutritionist Nayantara Bagla, anchor of Namma Oota, as she guides you through simpler approaches to meal prep. Together, let's explore techniques to reduce kitchen waste, including water management, root-to-shoot cooking, creative use of food scraps, and better ingredient management.",
    "duration": "PT1H30M",
    "url": "https://carbon.scigalleryblr.org/programmes?p=from-junk-to-jules",
    "performer": [
      {
        "@type": "Person",
        "name": "Nayantara Bagla"
      }
    ],
    "maximumAttendeeCapacity": 45,
    "organizer": {
      "@type": "Organization",
      "name": "Science Gallery Bengaluru",
      "url": "https://carbon.scigalleryblr.org"
    }
  },
  {
    "@context": "http://schema.org",
    "@type": "EducationEvent",
    "name": "The Brewer’s Buzz: On Kombucha Making ",
    "location": "Science Gallery Bengaluru ",
    "startDate": "2024-04-07T14:00:00+05:30",
    "description": "Are you intrigued by the world of fermentation but unsure where to start? Ever wondered about the magic behind kombucha and its fizzy, probiotic goodness? Join us for an interactive workshop where we'll demystify the art and science of kombucha brewing. Led by brewers at Mountain Bee Kombucha, this session will cover everything from an introduction to the world to kombucha to understanding the symbiotic culture of bacteria and yeast (SCOBY), and essential steps in brewing. <br>",
    "duration": "PT1H30M",
    "url": "https://carbon.scigalleryblr.org/programmes?p=the-brewer's-buzz",
    "performer": [
      {
        "@type": "Person",
        "name": "Honey Islam"
      }
    ],
    "maximumAttendeeCapacity": 45,
    "organizer": {
      "@type": "Organization",
      "name": "Science Gallery Bengaluru",
      "url": "https://carbon.scigalleryblr.org"
    }
  }
]