[
  {
    "@type": "EducationEvent",
    "name": "Tracing Materials: From Resource to Waste to Art",
    "location": "Science Gallery Bengaluru",
    "startDate": "2024-07-13T11:00:00+05:30",
    "description": "What does ‘material’ or ‘medium’ mean to an artist? Do materials themselves provide rich narratives and social histories? Visual artist Arunkumar H G certainly thinks so! In this workshop he delves into the origins and historical contexts of materials, while they transform from resources to waste. <br><br>For this workshop, you are encouraged to bring your own accumulation of waste, to examine how we perceive and interpret waste. You will then work with Arunkumar H G to transform these materials into art objects, highlighting the qualities and significance of the seemingly mundane.",
    "duration": "PT6H",
    "url": "https://carbon.scigalleryblr.org/programmes?p=tracing-ecologies",
    "performer": [
      {
        "@type": "Person",
        "name": "Arunkumar Hg"
      }
    ],
    "maximumAttendeeCapacity": 45
  },
  {
    "@type": "EducationEvent",
    "name": "Building Resilient Climate Futures: Exploring AI in Climate Action",
    "location": "Science Gallery Bengaluru",
    "startDate": "2024-06-29T10:00:00+05:30",
    "description": "Can AI and other technological tools affect the future of climate action in Asia? And how can you assess these nuanced climate futures?<br><br>Join researchers Dona Mathew and Sasha John in a workshop that delves into the intersection of AI and climate action, while highlighting the Digital Futures Lab's research. Discover how to spot trends and signals that hint at future climate scenarios through hands-on activities. Imagine and design the climate futures you want to see, guided by foresight methodologies and creative thinking exercises. <br>",
    "duration": "PT6H",
    "url": "https://carbon.scigalleryblr.org/programmes?p=building-climate-futures",
    "performer": [
      {
        "@type": "Person",
        "name": "Sasha John"
      },
      {
        "@type": "Person",
        "name": " Dona Mathew"
      }
    ],
    "maximumAttendeeCapacity": 45
  },
  {
    "@type": "EducationEvent",
    "name": "Of Materials and Mediums: Carbon in Art",
    "location": "Science Gallery Bengaluru",
    "startDate": "2024-06-23T11:00:00+05:30",
    "description": "How do we define carbon? How can we explore it in the art we create? Carbon’s various structures and unique properties—be it charcoal, graphite, or diamond—can be harnessed to create works of art. Using the chemical structures of carbon as a visual language, artist Shanthamani Muddaiah will guide you through the process of creating your own art with charcoal. Get your hands dirty with charcoal as you explore it both as a medium and as a material. ",
    "duration": "PT3H",
    "url": "https://carbon.scigalleryblr.org/programmes?p=of-materials-mediums",
    "performer": [
      {
        "@type": "Person",
        "name": "Css Pe7"
      }
    ],
    "maximumAttendeeCapacity": 45
  },
  {
    "@type": "EducationEvent",
    "name": "Oppositions and Sister Squares are Reconciled",
    "location": "Online",
    "startDate": "2024-06-27T18:00:00+05:30",
    "description": "What if an artist gives up their brush to play chess, and in doing so, finds deep connections between seemingly opposite worlds? This lecture dives into the fascinating intersections between art and science, inspired by the artist Marcel Duchamp and the Ukrainian-French chess grandmaster Vitaly Halberstadt. Together, they explored the intricate world of chess endgames in their book,<i> Oppositions and Sister Squares are Reconciled</i>. Duchamp, who left his artistic career for chess, saw strategic parallels that connect both fields. This lecture isn't just about chess, though. It's about how art and science, often seen as opposites, share surprising connections and contrasts. <br><br>Presented by Diemut Strebe, Artist in Residence at the MIT Center for Art, Science & Technology this lecture will explore how science perceives colours, smells, and sounds—central to aesthetics—and whether these experiences are devalued as illusory.<br>A highlight of the lecture will be <i>The Redemption of Vanity</i>, an artwork featuring the \"Blackest Black\" on Earth, created with nanotube technology and applied to a $2 million diamond, examined as both an aesthetic and technical marvel. <br><br>",
    "duration": "PT1H30M",
    "url": "https://carbon.scigalleryblr.org/programmes?p=opposition-sister-squares",
    "performer": [
      {
        "@type": "Person",
        "name": "Diemut Strebe"
      }
    ],
    "maximumAttendeeCapacity": 150
  },
  {
    "@type": "Event",
    "name": "Aerocene : From Roadsted To Flight ",
    "location": "NCBS",
    "startDate": "2024-06-30T14:30:00+05:30",
    "description": "Have you ever dreamed of a world where we could fly without fossil fuels? Join us for India’s first ever Aerocene event, where Art, Science, and Sustainability converge! <br>As a movement for eco-social justice, adrift on air, floating free from fossil fuels, lithium or hydrogen, the Aerocene project created by Tomas Saraceno moves us towards an ethical re-alliance with the Earth and its cosmic web(s) of life. The Aerocene Backpack is a portable floating kit, which enables anyone to launch their own aerosolar sculpture and start sensing the ocean of air, lifted only by the sun,without the use of fossil fuels, helium, hydrogen, solar panels, or batteries.<br>This innovative experience is designed to engage participants in thinking-through-making activity, stimulating imagination and creativity, and imparting information about solar balloon flight, thermodynamic physics, meteorological science, and art practices. Don't miss this chance to see the skies filled with flight sculptures, and to learn more about the possibilities of a fossil-fuel-free world. <br>As we learn to attune to the weather and adapt to new climates, Aerocene flight activities are weather dependent. <br><br><br>",
    "duration": "PT1H",
    "url": "https://carbon.scigalleryblr.org/programmes?p=aerocene-flight-sculptures",
    "performer": [
      {
        "@type": "Person",
        "name": "Aerocene Foundation"
      }
    ],
    "maximumAttendeeCapacity": 60
  }
]