[
  {
    "@type": "ScreeningEvent",
    "name": "After the Gold | Documentary Screening on KGF",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-10-06T18:30:00+05:30",
    "endDate": "2024-10-06T20:00:00+05:30",
    "description": "More than a century ago, large scale gold mining was begun at Kolar Gold Field, Mysore. At its peak, the mines employed 36,000 workers who braved the dangerous labour and built a new life in the mining camp. Today, many third and fourth generation gold miners face the threat of not just unemployment but displacement from the area they have made their own. This film is a tribute to the \"labouring lions\" of Kolar Gold Field, a historical reconstruction of their work, culture and rich political traditions.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=after-the-gold",
    "performer": [
      {
        "@type": "Person",
        "name": "Janaki-Nair"
      }
    ],
    "maximumAttendeeCapacity": 80
  },
  {
    "@type": "EducationEvent",
    "name": "Telling the story of KGF - Past, Present and Future",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-10-06T11:00:00+05:30",
    "endDate": "2024-10-06T14:00:00+05:30",
    "description": "How can we explore and convey the technological, historical, cultural, and political significance of Kolar Gold Fields, a town once thriving with gold mining, now left with remnants of its industrial past?<br>The gold mining industry in Kolar Gold Fields was established during the British Colonial rule in 1880. This labour-intensive industry grew rapidly into a highly profitable venture. Today, while the mining has long been stopped and the families of workers who toiled in the mines have moved on, the industrial equipment and the mining infrastructure stand as a stark reminder of a time when the mining work defined every life in the town. Join Writer - Filmmaker, Basav Biradar where he will discuss the technological, historical, cultural and political aspects of the KGF story and deliberate on what the many ways to tell the story of this remarkable town.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=telling-the-story-kgf",
    "performer": [
      {
        "@type": "Person",
        "name": "Basav-Biradar"
      }
    ],
    "maximumAttendeeCapacity": 40
  },
  {
    "@type": "EducationEvent",
    "name": "Painting Science: Art and Science for Education",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2024-10-13T11:00:00+05:30",
    "endDate": "2024-10-13T14:00:00+05:30",
    "description": "Can science be effectively communicated through art? Where do the two fields intersect, and how can they offer us new ways to interrogate existing knowledge? Join Ravi Jambhekar in an exciting exploration of how visual media can bring scientific concepts to life. Through the lens of nature and natural history painting, Jambhekar will take us on a journey that bring together science and art!",
    "url": "https://carbon.scigalleryblr.org/programmes?p=art-science-education",
    "performer": [
      {
        "@type": "Person",
        "name": "Ravi-Jambhekar"
      }
    ],
    "maximumAttendeeCapacity": 50
  }
]