[
  {
    "@type": "Event",
    "name": "Cooking Futures: Collaborative Meal",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-07T11:30:00+05:30",
    "endDate": "2025-12-07T11:30:00+05:30",
    "description": "Curious about the everyday science that goes into how we eat?\n\nJoin Jamie Allen for a hands-on gathering where participants cook, taste, and think together. As part of Agri-Cultures & Elemental Exchanges and the CALORIE season, this session aims to bring together people from all walks of life  around a shared table to explore the stories, materials, microbes, and memories that shape how we eat. \n\nParticipants bring ingredients, practices, tools, and ideas from their own work—ranging from fermentation and food forests to tubers, dairy, soil, and water. Together  participants prepare a simple meal, share short reflections, and open up a space for discussions  around food futures, land relations, and more-than-human collaborations.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=cooking-futures-collaborative-meal",
    "maximumAttendeeCapacity": "20"
  },
  {
    "@type": "Event",
    "name": "Tasty Trivia",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-07T16:00:00+05:30",
    "endDate": "2025-12-07T16:00:00+05:30",
    "description": "Think you know a lot about food?\n\nFrom the art of cooking to the business of eating, get ready for a full-course meal of trivia. Join Saloni and Susovan as they test your knowledge with food-themed trivia covering pop culture, films, politics, and everything in between. Come solo or with a friend! You will be paired in teams of two and participate in a beginner-friendly trivia experience. \n\nTasty Trivia is co-curated by Susovan and Saloni. A multi-city, community-driven series, it has travelled across 5 cities and runs monthly in Bangalore — offering fun, beginner-friendly trivia events that make knowledge social, engaging, and full of surprises.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=tasty-trivia",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "Event",
    "name": "Open Mic @ Namma Oota",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-07T15:00:00+05:30",
    "endDate": "2025-12-07T15:00:00+05:30",
    "description": "Food is more than just sustenance; it symbolises unity, culture, and nostalgia. Just like food, music has the power to bring people together. Join us for an open mic session where food lovers, musicians, storytellers, and poets come together to celebrate the magic of flavours and melodies. Whether it's a treasured family recipe, a comical culinary mishap, or a story about trying new flavours, this is your opportunity to take the stage . Every meal has a story to tell, so come talk, sing, listen and enjoy some storytelling!\n\n[Sign up to perform here] \n\nThis event will take place on December 7 at 3:00 PM and will be hosted by Devika Pradeep and Diya Mathur!\n\n[Sign up to perform here]: https://forms.gle/LyfLbWhympHb8jGJ8",
    "url": "https://sci560.scigalleryblr.org/programmes?p=open-mic-namma-oota",
    "maximumAttendeeCapacity": "300"
  },
  {
    "@type": "Event",
    "name": "BluesGhat Live @ Namma Oota",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-07T18:00:00+05:30",
    "endDate": "2025-12-07T18:00:00+05:30",
    "description": "Get ready for a musical journey like no other! Headlining the Open Mic event at Namma Oota, BluesGhat will blend traditional blues and carnatic music to produce their iconic soulful melodies. \n\nCatch them live at the end of Namma Oota for a head bobbing time!",
    "url": "https://sci560.scigalleryblr.org/programmes?p=bluesghat-at-namma-oota",
    "maximumAttendeeCapacity": "300"
  },
  {
    "@type": "EducationEvent",
    "name": "Can a Machine Think Like a Chef?",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-14T16:00:00+05:30",
    "endDate": "2025-12-14T16:00:00+05:30",
    "description": "Can we teach a machine to understand food?\n\nJoin Ganesh Bagler as he explains how the rapid growth of food-related data and advances in artificial intelligence are transforming how we understand the science of gastronomy. Learn about the emerging discipline of computational gastronomy, a field that applies data science and AI to investigate culinary patterns, nutritional structures, and flavour principles. Explore how making food computable is allowing us to decode long-standing culinary mysteries, uncover the links between diet and health, and design innovative food solutions. Discover the implications this holds for public health, personalised nutrition, and sustainable food systems.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=can-a-machine-think-like-a-chef",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Legal Enclosures and Coastal Commons",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-13T11:00:00+05:30",
    "endDate": "2025-12-13T11:00:00+05:30",
    "description": "How does the law affect coastal food systems? \n\nJoin Kanchi Kohli for a workshop that will bring to life the different ways in which the shape, size and social relation of coastal commons can be transformed through environmental laws. Learn what this relationship means for coastal ecology, livelihoods and food systems.\n\nThe participants will be tasked to engage with the structural character of a few legal frameworks and work through how they can be altered to address specific challenges and potentially create solutions to better safeguard our coasts.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=legal-enclosures-coastal-commons",
    "maximumAttendeeCapacity": "20"
  },
  {
    "@type": "Event",
    "name": "Eat, Read, Think",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-13T17:00:00+05:30",
    "endDate": "2025-12-13T17:00:00+05:30",
    "description": "Eat, Read, Think is a reading circle run by Science Gallery Bengaluru, bringing together curious minds to explore ideas through literature and conversation. Readings will be themed around the current exhibition season, CALORIE, exploring humanity's fraught and intimate relationship with food through readings inspired by the many exhibits present throughout the gallery. Eat, Read, Think welcomes young people from all walks of life to gather for conversations that connect science, culture and society.\n\nFor the third session of the reading circle, we will be reading through a firsthand account of the Bengal Famine, published in 1946. \"Famine is like this\" by John Frederick Muehl.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=eat-read-think-3",
    "maximumAttendeeCapacity": "30"
  },
  {
    "@type": "EducationEvent",
    "name": "Educator Workshop: \nInterdisciplinary Thinking In Practice",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-13T09:00:00+05:30",
    "endDate": "2025-12-13T09:00:00+05:30",
    "description": "Click here to [register]! \n\nLearning is often presented as distinct, neatly defined subjects.\nInterdisciplinary thinking integrates them, opening up a word that is complex, interconnected, and full of surprises!\n\nThe Educator Workshop is a full-day immersive workshop for educators from across the city, to explore new ideas, think across disciplines, and reimagine learning together. Because the future of education is becoming increasingly interdisciplinary.\n\nWhat to expect?\n> Experience our exhibition-season CALORIE, where ideas from science, art, design, and society intersect.\n> Unpack interdisciplinarity through hands-on activities and reflective discussions.\n> Explore NCERT topics through a fresh lens.\n> Collaborate in small groups to design practical ideas for sparking interdisciplinarity in the classroom. \n> Present your insights in a lively pitching session.\n\nWho is this for?\nEducators and teachers across subjects (Classes 7–12) who value curiosity, inquiry, and exploring ideas across disciplines.\n\n\nCome, be a learner for a day.\nConnect with fellow educators.\nReturn inspired—with practical tools and renewed energy for teaching.\n\nClick here to [register]! \n\n[register]: https://docs.google.com/forms/d/e/1FAIpQLSdbACchT1wSVyhPTilwpQG84SMcXM2kEq2hbpp2t9xjj5XoMg/viewform",
    "url": "https://sci560.scigalleryblr.org/programmes?p=educator-workshop",
    "maximumAttendeeCapacity": "0"
  },
  {
    "@type": "EducationEvent",
    "name": "CA-LORE-EE: What’s your story?",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-13T16:00:00+05:30",
    "endDate": "2025-12-13T17:30:00+05:30",
    "description": "Something grown, something bought, something eaten, something caught.\n\nMoras, azúcar, sakkare, cheeni, qand, misri… one ingredient, many tales. But we’re not just talking sugar here! It’s about how words, objects, and habits collect stories over time. Could these stories be created through what we grow, buy, cook, share, remember, and even forget? \n\nCome find out on a walk with Thejaswini and Sai as they poke, prod, and nibble at the exhibits to uncover what’s been hiding in plain sight. So, we’re spilling some tea. What about you?\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=ca-lore-ee-whats-your-story",
    "maximumAttendeeCapacity": "50"
  },
  {
    "@type": "ScreeningEvent",
    "name": "My Radio My Life: Film Screening and Discussion",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-14T18:30:00+05:30",
    "endDate": "2025-12-14T20:00:00+05:30",
    "description": "My Radio My Life” is a distinctive documentary that nostalgically revisits the golden era of radio and its profound influence on people’s lives. The film journeys through a vintage radio museum curated by a passionate restorer in Bengaluru, revisits the historic 1969 Apollo 11 Moon landing commentary from the Voice of America (Tamil Service), and highlights the crucial role of Ham Radio during disasters such as tsunamis. It also traces how a childhood fascination with radio inspired individuals to become popular announcers, celebrates beloved programmes like Binaca Geetmala and cricket commentary, and follows the determined efforts of a retired librarian repairing his cherished radio.\n\nThe film further showcases the exciting revival of School Radio, where students are reimagining the magic of radio in new and innovative ways.\n\n“My Radio My Life” has been screened at over 80 film festivals across 36 countries, earning multiple awards and nominations for its heartfelt storytelling and cultural significance.\n\nJoin filmmaker Makarand Waikar and Creative Producer Simantinee Bhagwat as they explore the film’s concept, creative journey, and the enduring themes it explores.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=my-radio-my-life",
    "maximumAttendeeCapacity": "100"
  },
  {
    "@type": "EducationEvent",
    "name": "Making Food Computable",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-12-14T12:00:00+05:30",
    "endDate": "2025-12-14T14:00:00+05:30",
    "description": "TBD",
    "url": "https://sci560.scigalleryblr.org/programmes?p=making-food-computable",
    "maximumAttendeeCapacity": "40"
  }
]