[
  {
    "@type": "Event",
    "name": "Anthropo-Scenes: A Sci560 Exhibition Walkthrough",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-04-26T17:30:00+05:30",
    "endDate": "2025-04-26T19:30:00+05:30",
    "description": "For the past few decades, human activity has left an indelible mark on the Earth, leading to the proposed geological epoch called the Anthropocene. Though there is still debate on when the Anthropocene has started, in the midst of the climate crisis, there is an urgent call to acknowledge our lasting influence on the planet.<br>Join mediators Fathima Aslaha and Gaayatri Chandrasekharan as they explore the Anthropocene through the lens of Bengaluru—a city where nature perseveres amidst the pressures of rapid urbanisation. Using the Sci560 exhibition season as an anchor, they ask what a sustainable future in the city looks like.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=anthropo-scenes-walkthrough-w",
    "performer": [
      {
        "@type": "Person",
        "name": "Sgb-Team"
      }
    ],
    "maximumAttendeeCapacity": 50
  },
  {
    "@type": "EducationEvent",
    "name": "The Untold Story of Grasses",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-05-11T16:00:00+05:30",
    "endDate": "2025-05-11T18:00:00+05:30",
    "description": "How have grasses shaped human civilisation and the ecosystem? <br><br>Grasses are an ancient, diverse and extraordinary group of plants, but most of us rarely give them a second thought.  Join Mahesh Sankaran as he explores how their evolution has transformed Earth in unprecedented ways, and how these amazing life forms impact our lives in ways we don’t realise.  The discussion will conclude by outlining the various dangers that grassland ecosystems are currently experiencing and stressing how vital it is that they be preserved.<br><br>This programme is organised in collaboration with the Infosys Science Foundation.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=untold-story-grasses",
    "performer": [
      {
        "@type": "Person",
        "name": "Mahesh-Sankaran"
      }
    ],
    "maximumAttendeeCapacity": 50
  },
  {
    "@type": "EducationEvent",
    "name": "Recasting the Iron Age: Coastal Tamil Urn Burial Sites and Harappan Links",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-05-04T16:00:00+05:30",
    "endDate": "2025-05-04T18:00:00+05:30",
    "description": "Have we rewritten the history of the Iron Age? <br><br>Recent Accelerator Mass Spectrometry (AMS) dates from coastal urn burial sites of Sivagalai and Adichnallur in Tamil Nadu have pushed back the timeline for the early finds of iron. Evidence indicates the use of iron emerged as early as about 3000 BCE, suggesting people and technology could have moved between Tamil Nadu and Harappan sites. In this lecture, archaeometallurgist Sharada Srinivasan will share ongoing research which enables us to rethink the first use of iron from an archaeometallurgical perspective. Using burial urns as a central motif, she will share contemporary theories and evidence to show how these discoveries of iron in Tamil Nadu might reshape our understanding of the emergence of iron and technologies around smelting.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=recasting-iron-age",
    "performer": [
      {
        "@type": "Person",
        "name": "Sharada Srinivasan"
      }
    ],
    "maximumAttendeeCapacity": 60
  },
  {
    "@type": "EducationEvent",
    "name": "Through the Lens: Photographing Industrial and Institutional Spaces",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-05-03T11:00:00+05:30",
    "endDate": "2025-05-03T17:00:00+05:30",
    "description": "How does one document the complexity, scale and innovation of industrial spaces? How does one create compelling and impactful narratives?  <br><br>Join photographer Dipti Desai in a masterclass to explore these themes. She will look at connecting the inanimate with life or the absence of it, through emotive imagery. Dipti will not only dive into fundamentals such as lighting and composition but also look at safety and access, visual storytelling and post-processing!",
    "url": "https://carbon.scigalleryblr.org/programmes?p=through-the-lens",
    "performer": [
      {
        "@type": "Person",
        "name": "Dipti-Desai"
      }
    ],
    "maximumAttendeeCapacity": 40
  },
  {
    "@type": "EducationEvent",
    "name": "An Exploration of Jazz Music",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-04-27T18:00:00+05:30",
    "endDate": "2025-04-27T20:00:00+05:30",
    "description": "Surround yourself in the world of jazz with musicians and educators from the Bangalore School of Music! Curious about the history of jazz? Want to know more about its inclusive principles? Or just want to groove to some music? This lecture and performance will give you insights into the world of jazz while you listen to live music. Join us to trace the history of jazz through the ages—from how it became popular through the radio to how it evolved through world wars. ",
    "url": "https://carbon.scigalleryblr.org/programmes?p=exploration-of-jazz",
    "performer": [
      {
        "@type": "Person",
        "name": "Jagadeesh-Mr"
      },
      {
        "@type": "Person",
        "name": "Madhuri-Jagadeesh"
      },
      {
        "@type": "Person",
        "name": "Raman-Iyer"
      },
      {
        "@type": "Person",
        "name": "Rohit-Ps"
      }
    ],
    "maximumAttendeeCapacity": 180
  },
  {
    "@type": "EducationEvent",
    "name": "Future Bengaluru: Designing a People-Centric Sustainable City",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-04-27T11:00:00+05:30",
    "endDate": "2025-04-27T13:00:00+05:30",
    "description": "Bangalore is evolving rapidly, but how can we ensure it remains livable, green, and congestion-free? In this hands-on design thinking workshop, participants will become urban visionaries, reimagining the city’s future using Troy Blocks.  <br><br><br>Through an interactive design challenge, teams will create 3D models of Bangalore, integrating sustainable and people centric architecture, integrated transport solutions, and smart urban designs. Guided by real-world case studies from cities like Tokyo, Singapore, and Copenhagen, participants will explore innovative urban design solutions, eco-friendly infrastructure, and people centric public spaces.<br><br>The session encourages creativity, problem-solving, and storytelling as teams present their innovative urban design solutions, receiving feedback from facilitators and peers. Whether you're a student, young professional, or urban enthusiast, this workshop will inspire you to think boldly about sustainable, people centric city planning. Are you ready to shape the Bangalore of tomorrow?",
    "url": "https://carbon.scigalleryblr.org/programmes?p=future-bangalore",
    "performer": [
      {
        "@type": "Person",
        "name": "Farah-Ahmad"
      },
      {
        "@type": "Person",
        "name": "Renjin-Cherian"
      }
    ],
    "maximumAttendeeCapacity": 60
  },
  {
    "@type": "Event",
    "name": "Rehearsing Duality",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru",
      "address": "Science Gallery Bengaluru, Bangalore",
      "url": "https://maps.app.goo.gl/XCSmSbdFYokyC9qj8"
    },
    "startDate": "2025-05-08T16:00:00+05:30",
    "endDate": "2025-05-08T18:00:00+05:30",
    "description": "Artists Rohini Devasher & Elisa Storelli will set up an experiment to posit / prove alternative frames of collaboration between art and science. The title takes its name from two intertwined ideas, the ‘rehearsal’ and ‘duality’ or that which is shaped by the quality of ‘two’. Building on projects centered on chronology and observation, they will explore the format of a staging to frame working methodologies created by the intersections, collisions and amplification of individual thinking.",
    "url": "https://carbon.scigalleryblr.org/programmes?p=rehearsing-duality",
    "performer": [
      {
        "@type": "Person",
        "name": "Elisa-Rohini"
      }
    ],
    "maximumAttendeeCapacity": 180
  }
]