[
  {
    "@type": "Event",
    "name": "'Neladamma Provides': Songs of the Foragers",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-08-09T17:00:00+05:30",
    "endDate": "2025-08-09T18:30:00+05:30",
    "description": "We are kicking off CALORIE with a performance by Beru Bevaru Kala Balaga!\nJoin them as they showcase the cultural output of a collaborative research project in Chintamani taluk, Karnataka, which set out to understand the importance of uncultivated foods to marginalised communities in the region. \n\nImmerse yourself in songs that take you through the diverse range of foods foraged and hunted in this dryland region. Witness a performance that highlights the oppression faced by disadvantaged communities and their ingenuity in processing these hard-to-digest foods. \n\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=neladamma-provides",
    "maximumAttendeeCapacity": "80"
  },
  {
    "@type": "EducationEvent",
    "name": "Complex Challenges of Simple Carbohydrates",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-08-03T16:00:00+05:30",
    "endDate": "2025-08-03T16:00:00+05:30",
    "description": "How do carbohydrates influence physiology and society?\n\nBread for breakfast, roti for lunch, and rice for dinner. These carbohydrate-rich meals no longer complement many of our sedentary lifestyles. Join Artists Priya Mani and Vinay Venkataraman as they explore their exhibit Carbivore, which examines our relationship with carbohydrates and what it means to our society. Explore how carbs are more than just calories—they shape tradition, impact the environment, and also deeply influence our health. The talk will explain the basis of the installation, the process and behind-the-scenes snippets of the interactive art piece.\n",
    "url": "https://sci560.scigalleryblr.org/programmes?p=complex-carbs",
    "maximumAttendeeCapacity": "100"
  },
  {
    "@type": "EducationEvent",
    "name": "The Story of the Indian Mango",
    "location": {
      "@type": "Place",
      "name": "Reading Room, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-08-31T16:00:00+05:30",
    "endDate": "2025-08-31T16:00:00+05:30",
    "description": "Curious about the King of all Fruits?\n\nJoin Dr M.R Dinesh as he takes us through the origin and development of the mangoes of India. Learn about the science behind their diversity, ambiguous nomenclature and rootstocks. Understand the current realities of the Indian mango through Dr Dinesh’s hands-on expertise in fruit breeding and horticulture. Leave knowing just a little bit more about your favorite fruit.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=indian-mango",
    "maximumAttendeeCapacity": "100"
  },
  {
    "@type": "EducationEvent",
    "name": "Is India Food Secure?",
    "location": {
      "@type": "Place",
      "name": "Reading Room, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-08-10T16:00:00+05:30",
    "endDate": "2025-08-10T16:00:00+05:30",
    "description": "What is the story of food security in India? How have patterns of food consumption changed over time?\n\nJoin us for the first programme of the season by economist Madhura Swaminathan, as she explores the status of food security in India. In this lecture, Madhura will unpack key milestones and persistent challenges in both food production and consumption.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=india-food-secure",
    "maximumAttendeeCapacity": "100"
  },
  {
    "@type": "EducationEvent",
    "name": "Food, Foraging, and the Fabric of Social Insects",
    "location": {
      "@type": "Place",
      "name": "Science Gallery Bengaluru, Science Gallery",
      "address": "Science Gallery, Bangalore"
    },
    "startDate": "2025-08-17T16:00:00+05:30",
    "endDate": "2025-08-17T16:00:00+05:30",
    "description": "What drives the complex lives of social insects like honey bees and wasps? \n\nJoin Sruthi Unnikrishnan as she explores how food, more than just sustenance, shapes the social structure and behaviour of insect societies. Drawing from a range of research on Asian honey bees and social wasps, she will highlight how foraging not only sustains the colony but also drives coordination, communication, and even decisions about reproduction. From the buzzing harmony of bee foragers to the role of nutrition in determining which wasps become queens, this talk uncovers the hidden power of food in shaping insect lives. Join us for a fascinating journey into the world of collective behaviour, division of labour, and the surprising social consequences of a simple resource.",
    "url": "https://sci560.scigalleryblr.org/programmes?p=food-foraging-social-insects",
    "maximumAttendeeCapacity": "80"
  }
]