[
  {
    "name": "Carpet Stories From The Old Silk Roads",
    "startDate": "2025-10-25",
    "endDate": "2025-11-15",
    "eventAttendanceMode": "https://schema.org/OfflineEventAttendanceMode",
    "url": "https://sumukha.com/details?section=exhibition&id=402&ref=/exhibition",
    "image": "https://sumukha.com/_assets/exhibitionHeader/402.jpg",
    "description": "Stare at a tribal carpet long enough and something pops. Makes you wonder what those women were thinking. I say women because tribal carpets from Central Asia and the Caucasus region were generally woven by women. They were at the forefront of producing these masterpieces, mostly for personal use. The men sheared the sheep, goats or camels for the wool and did the dyeing, and the women carded and spun the wool yarn and wove the designs from their imagination. Their Shamanistic views translated their surrounding things into icons and patterns: people, animals, birds, mountains, gardens, flowers... The weavings were either flat kilims (like durries) which have two dimensions – warp and weft; or carpets with a pile, i.e., the third dimension of a vertical knot that creates the soft cushiony surface.\n \nThe tribes were nomadic and moved as the seasons changed. Their horizontal looms were uprooted and moved with their caravan of belongings. That is probably why a lot of these tribal carpets are not cookie-cutter or straight edged. They have rustic dings and dongs. I call them “perfectly imperfect.”\n \nThese treasures contain symbols left to our interpretation: for example, ear rings which supposedly indicated the desire of a young woman to marry, the snake for wisdom, the paisley for the universe, the star for happiness, and so on… The ancient tribal way of life and weaving traditions are now more or less extinct. Modern tribal carpets are generally designed by professional urban designers and mass produced in large workshops from formal samples and precision drawings.\n \nThese carpets are between 100 to 200 years old and were actively used in the day to day lives of the homes and families they belonged to: on the floor, as curtains to divide the tent into living quarters, as beds and blankets, as storage bags for food and clothes, as animal trappings, and so on… Though the weavers are long gone, they have left us their treasures. I feel like the guardian and custodian of\nthese treasures and like to ensure that they are preserved and cared for: we soak and wash these carpets, we repair and conserve them, and we even mount rare fragments on cloth and canvas to give them the respect they deserve as phenomenal works of art. We try to do all this without changing the original intent of the weaver.\n \nAs a mad and passionate collector, I seem to intimately know and remember every single piece in my collection. They are like our children – you do not forget what they are, where they came from, their colors…. One collector once told me that I had not lost my original childlike excitement about my carpets even though I have been collecting for quite a long time. I suppose that is often called madness!\n \nWe have travelled with our carpets to several cities in India, somewhat like the nomadic tribes that wove them. I love to meet new people at our exhibitions and am thrilled to see their faces light up with happiness when they encounter these very joyous weavings! I hope everyone will get to appreciate and enjoy the beauty of this rare art form created by anonymous weavers from a bygone era.\n \nThese carpets have been on a journey and each one has a story to tell…",
    "performer": {
      "@type": "PerformingGroup",
      "name": "from the collection of Danny Mehra"
    }
  }
]