[
  {
    "name": "Quieter Than Silence",
    "startDate": "2024-10-18",
    "endDate": "2024-11-23",
    "eventAttendanceMode": "https://schema.org/OfflineEventAttendanceMode",
    "url": "https://sumukha.com/details?section=exhibition&id=392&ref=/exhibition",
    "image": "https://sumukha.com/_assets/exhibitionHeader/392.jpg",
    "description": "#QUIETER THAN SILENCE\ncompilation of short stories\n\nby\nShakuntala Kulkarni\n\n\n\n\n#DRAWING OUT, DRAWING IN\n\nHuman bodies take on peculiar forms in Shakuntala Kulkarni's drawings. Costumes and armour become fused with the body giving them bizarre appearances, and when unclothed, the figures assume convoluted and awkward postures. The images are mostly of women, for the overarching preoccupation of Kulkarni’s art has been the life of women in our society. In this exhibition, the seven series of drawings combine emblematic images of pain, violence, defeat, and also resistance and overcoming. The sense of dread is accentuated by the dominant black pigment visible in many works, and in others, a free and animated line delineates the body contour.\n\nThough the artist's focus on the life of women has been a constant investigation, the forms she has explored to express these themes have been varied. Her practice has included sculpture, installation, video and performance, in addition to painting and drawing. Drawing has however taken center stage in Kulkarni’s practice: entering her studio is like entering a cave with drawings all around you. There are drawings on walls, on boards, and on pieces of paper pinned on doors. It is apparent that all the ideas for her cane armour sculptures and dresses, installations and videos have taken shape through countless drawings. Drawing being so pervasively at the heart of her varied practice, it is befitting that she is here presenting a full exhibition of only drawings.\n\n*‘Fallen warrior’, “Shattered’, ‘Antaheen’ - the series'* titles add to the dark moods of these works. We see helpless migrants trudging along as if in a trance, and bodies desperately trying to maintain balance. We see fallen, defeated warriors, their armour now transformed into a burden rather than a shield of protection. There are wrecked bodies in convoluted positions, and mothers mourning a battered child. In the series of large works “Stuck in the shadow”, strange bodies are caught in moments where they are about to topple: almost falling out of their own shadows, only to be saved by their sense of balance.\n\nThe exhibition highlights the ambivalent and circular relation between safety and the loss of freedom, between sanctuary and prison. In their strange inward silence, they suggest that only woman herself can be her own savior.  In the series 'Swaha' we see a procession of twenty-one women of firm bearing walking forward, holding their headgear above their heads as if preparing to crown themselves sovereign, or maybe to make a final offering of their burden and become free.\n  \n*Sudhir Patwardhan*                                                                                                              \nFebruary 2023\n\n                                                                                                                                                                                               \n\n\n\n\n\n\n\n\n\n\nPreview: 19th October, 2024\n5:30 pm – 8:30 pm\n\nOn View: 23rd of November, 2024\nMon-Sat, 10:30 am to 6:00 pm",
    "performer": {
      "@type": "PerformingGroup",
      "name": " Shakuntala Kulkarni"
    }
  }
]