[
  {
    "name": "Bring Me Flowers",
    "startDate": "2025-04-26",
    "endDate": "2025-05-17",
    "eventAttendanceMode": "https://schema.org/OfflineEventAttendanceMode",
    "url": "https://sumukha.com/details?section=exhibition&id=397&ref=/exhibition",
    "image": "https://sumukha.com/_assets/exhibitionHeader/397.jpg",
    "description": "#'Bring me Flowers'\na solo by Mohit Mahato\n\nPreview: 26th April, 2025\n5:30 pm - 8:00 pm,\nOn view until 17th May, 2025\nMon-Sat, 10:30 am to 6:00 pm\n\n*'Bring me Flowers’*, Mohit Mahato’s first solo show, presents a body of drawings on paper and bookforms exploring the silent voyages undertaken by plants and people alike, against the backdrop of a rapidly changing city, and an emotional landscape that is equally unpredictable. Mahato returns to the fundamental, impulsive gesture of drawing as a practice of temporarily rooting-in-place.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n#Mohit Mahato\n\nBorn in 1993, Jamshedpur, Jharkhand.\n\nMohit completed his Bachelor of Visual Arts in Painting, at the College of Fine Arts, Karnataka Chitrakala Parishath, Bengaluru (2018).\n\nHe has been part of several group exhibitions namely ‘Voices from India’, curated by Saad Ghosn, Nine Fish Art Gallery, Mumbai (2025) & Cincinnati, Ohio (2024); ‘Kannkaatchi’, Kannadi cupboard, West Tambaram, Chennai (2024); ’The Pollen Waits on Tiptoe', curated by Manasa Raj, Karnataka Chitrakala Parishath, Bengaluru (2024); 'Mumbai Art Fair', Gallery Sumukha, Mumbai (2023); 'A Soft Blanket of Plants on Tired Bodies,' 1Shanthiroad, Bengaluru (2023); 'Seattle Art Fair', Gallery Sumukha, Seattle, USA (2023 & 22); 'Threshold,' curated by Nicholas Ruth, Bach Art Gallery, Tallinn, Estonia (2022), Studio Pannadwar, Naigaon, Maharashtra (2022), Gallery Sumukha, Bengaluru (2022), HD Atelier de Gravure Hede, Brussels, Belgium (2022), Mirabo Press, New York, USA (2022), The Gallery, Johannesburg, South Africa (2022), See Street Gallery, Meadow Bank, Australia (2022), Arts Council, Baton Rouge, LA, USA (2022); 'Living A Dark Night,' curated by Paula Sengupta, Gallery Espace, New Delhi (2022); The Flying Goat Show, Flying Goat, Goa, (2022); 'The Wrong Biennial 2021-2022,' curated by Tasneem Lohani, 1Shanthiroad, Bengaluru (2022); Arebyte Gallery Plug-in Exhibition, Arebyte Gallery, London x The Wrong Biennale Embassy, Online (2021); 'The Drawing Show-l', Gallery Sumukha, Bengaluru (2021); Annual Art Exhibition, Karnataka Chitrakala Parishath (2018); Echoes of Earth Music Festival from 2016 to 2018. \n\nMohit has received the Generator Cooperative Art Grant, Experimenter, Kolkata in 2022. He was also invited to the 'Fumetto' International Comics Festival by Pro-Helvetia in Lucerne, Switzerland, in 2019. He has also received Excellence Award in Painting during his Bachelors.\n\nMohit is also the co-founder of ‘Pagal Canvas’ (2017) an independent visual publication house, which produces Art books, Comics and other print cultures, He has also set up an independent Print studio “Pagal Canvas Backyard” in Bengaluru for his practice and also for other Printmakers (2020-21)\n\nHe lives and works in Bengaluru.",
    "performer": {
      "@type": "PerformingGroup",
      "name": "A solo Mohit Mahato"
    }
  }
]