[
  {
    "name": "Carriers By Kodanda Rao Teppala",
    "startDate": "2025-11-29",
    "endDate": "2026-01-03",
    "eventAttendanceMode": "https://schema.org/OfflineEventAttendanceMode",
    "url": "https://sumukha.com/details?section=exhibition&id=403&ref=/exhibition",
    "image": "https://sumukha.com/_assets/exhibitionHeader/403.jpg",
    "description": "Kodanda Rao Teppala’s paintings are instantly inviting with their vivid, playful colours. This welcome is intentional, but it also sets up a gentle trap. It is once you are inside that the questions become harder. \nRao often paints gatherings such as beaches, festivals and everyday rituals. At first, these scenes seem joyful. Look longer, and they begin to feel like brief escapes from something\nheavier. Rao sees these moments of pleasure as temporary relief from something darker: systems that rely on the same people they keep unseen. The works in this show extend his\nlong interest in how ordinary life is marked by extraordinary forms of violence. Movement, ritual and migration become sites where these marks surface. The artist’s earlier works were more direct. These recent paintings are more reflective. After\nthe pandemic, he moved to acrylic, a medium that allows him to shift quickly between thinking and making. The ideas, though, have grown deeper, shaped by his readings of\nKrishnamurti, the Buddha and Ramana Maharshi. The canvases carry this questioning spirit. \nHis figures remain small, a habit from his printmaking background. They become carriers of belief, fear and the inherited habits that stay with us, often without our noticing. Even the titles seem simple, yet they deserve a second look. Like everything else, they offer a small misdirection before revealing themselves. This show presents Rao’s view of the human condition as it feels today: colourful, chaotic, exhausted, searching for meaning and perpetually on the verge of being swept out to sea.\nAmshula Prakash",
    "performer": {
      "@type": "PerformingGroup",
      "name": ""
    }
  }
]