[
  {
    "name": "Toy Boy From Malabar And His Journey To Wine Cheese And Chocolates",
    "startDate": "2024-04-27",
    "endDate": "2024-05-11",
    "eventAttendanceMode": "https://schema.org/OfflineEventAttendanceMode",
    "url": "https://sumukha.com/details?section=exhibition&id=389&ref=/exhibition",
    "image": "https://sumukha.com/_assets/exhibitionHeader/389.jpg",
    "description": "As a teenager, I dreamt of a magical future. I was going to go far away, somewhere I could be myself, where my birthdays would look like they did in the movies, with friends and cake and champagne – and fairy lights twinkling in the background.\n\nMy future was a movie playing in my head.\n\nBut my life did not go as planned. I reached a point at which I could barely sleep, and there came a time by which I could barely imagine a future at all. \n\nThe movie in my head stopped playing.\n\nI knew I had to make a life for myself where I could dream again.\n\nI left my hometown and moved to the city.\n\nAnd discovered that people can make you feel like you don’t belong there.\n\nWith their wine and cheese evenings, and their jargon bouncing off white walls.\n\nI had to make a decision.\n\nYou ask yourself, how strong is your desire to get to the other side?\n\nI wanted to be on the other side.\n\nSo I grabbed a knife and fork, traded my fake designer t-shirts for ikkat, masked my accent as best as I could, and got to work.\n\n\n*Toy Boy from Malabar and his Journey to Wine, Cheese, and Chocolates is a restaging of the growth of a young, queer, shudra boy from the small town to the big city, through conflict, fragility, resilience and love.*\n\n\nAbout the Artist\n\n*Sandeep TK*  is an artist from Thalassery, Kerala, who has been living and working in Bangalore at the art space 1Shanthiroad Studio/Gallery since 2015. his mediums are photographs, videos, and text looking at the experiences of his queer class caste colour identity in the Indian context by positioning himself as someone who transcended class from a working-class background to an upwardly mobile circle and his interpersonal relationships and experience of this journey of fitting in to a socially accepted legitimate culture of civilized.\nHis practice involves photographs, videos, and text. Sandeep had his first solo exhibition, “Singularity,” at Gallery Sumukha Bangalore in 2018 and his second solo, “let me add something in my melody”, at Villa Renata Basel 2022, Switzerland. Sandeep has been part of several group exhibitions nationally and internationally, including the Empowerment at Kunst Museum Wolfsburg 2022-23, and his works have screened/shown part of several film festivals and photo festivals, including FIF – Belo Horizonte’s International Festival of Photography Brazil, KG+ Kyotography Japan, and Vantage Point, Sharjah. His videos have been showcased at The Palace International Queer Film Festival, Bristol; Bangalore Queer Film Festival; and Festival of Video Art by Indian Contemporary Artists. In 2020 Sandeep received the Inlaks fine art award, and he was part of Khoj peers residency in 2021 and the Prohelvetia Studio residency award in 2022 in Switzerland.\nSandeep is the recipient of Robert Bosch Crossing boarders Grant.",
    "performer": {
      "@type": "PerformingGroup",
      "name": "Sandeep TK"
    }
  }
]