[
  {
    "name": "Gulammohammed Sheikh: Graphic Prints",
    "startDate": "2024-06-29",
    "endDate": "2024-07-27",
    "eventAttendanceMode": "https://schema.org/OfflineEventAttendanceMode",
    "url": "https://sumukha.com/details?section=exhibition&id=390&ref=/exhibition",
    "image": "https://sumukha.com/_assets/exhibitionHeader/390.jpg",
    "description": "#Gulammohammed Sheikh: Graphic Prints\na retrospective in two parts \n\ncurated by Pushpamala N\n\nPart I: Handprints\nwoodcut, linocut, etching-aquatint, lithography, silkscreen\nCelebrated as a painter, poet, art historian and teacher, Gulammohammed Sheikh’s long passion for printmaking is less known. This two- part retrospective looks at his printmaking practice from the 1950s to the present. \n\nPart I is conceived as an archive, exploring Sheikh’s handmade prints including his forays into little magazines using printmaking, and his interest in working collaboratively to democratise art and ideas. As a high school boy in Surendranagar in the early 1950s he illustrated and wrote for a handwritten literary magazine, *Pragati (Progress)*, whose single copy would be kept on the local library table to peruse. It can be seen as a precursor to his later interests when as an art student in Baroda, he learnt printmaking and became active in Gujarati literary circles. He illustrated the avant garde literary magazine *Kshitij (Horizon)* with original lino cuts by fellow artists alongside publishing poetry in free verse. His printmaking took an autobiographical turn in late 1960s when he also began writing his *Memoirs* in free-flowing prose. After attending the landmark printmaking workshop in 1970 by Paul Lingren at USIS Delhi where he learnt aquatint, he became seriously interested in printmaking and bought his own etching press. Around the same time, he started the little magazine *Vrishchik (Scorpio)* with Bhupen Khakhar while teaching art history in Baroda, to initiate a dialogue among artists. Each issue had a print run of 500 copies with linocuts and lithographs as covers and pull outs. Sheikh later established the Chhaap Foundation workshop and residency with Kavita Shah and Vijay Bagodi in the late 1990s to popularise printmaking, offering facilities for etching, dry point, lino, woodcut, and mono-print. \n\nStarting out as a printmaker working within a modernist idiom, his work over the years, strongly influenced by his literary and art historical interests, turned magic realist. Soon, with the advent of digital printmaking in India, he became one of the pioneers to use the technology – but that will be surveyed in Part II of the retrospective.\n\nWe are proud to present this groundbreaking retrospective in Bangalore, which will further add to the understanding of the work of this eminent artist. This is his first major show in South India. \n  \nPushpamala N",
    "performer": {
      "@type": "PerformingGroup",
      "name": "curated Pushpamala N."
    }
  }
]