[
  {
    "name": "Pain Corporation of India",
    "startDate": "2026-01-15",
    "endDate": "2026-02-26",
    "eventAttendanceMode": "https://schema.org/OfflineEventAttendanceMode",
    "url": "https://sumukha.com/exhibitions/429",
    "image": "https://sumukha.com/_next/image?url=%2Fsumukha-logo.png&w=256&q=75",
    "description": "How do images of divinity, democracy, and authority circulate, collide, and enact symbolic violence?\n\n\nIn Pain Corporation of India, Bharathesh G D examines these questions through a series of ideas/works that function as meaning-making machines—only to turn against themselves. The works expose how belief is engineered, pain normalised, and dissent absorbed, deferred, and managed within visual culture.\n\n\nThis project does not operate in the register of nostalgia. It begins with a refusal. Rather than offering solace or resolution, the works mimic the visual systems they seek to\ndismantle—borrowing their scale, materials, and repetitive logic to generate friction instead of\naffirmation. Images fracture rather than reassure. Meaning is not delivered; it is interrupted.\nWhat emerges is a visual grammar of interruption, where symbols refuse to settle, and\nperception is kept deliberately unstable.\n\n\nShaped by decades of accumulated pain—socially produced, politically administered, and\ncollectively endured under the promise of democracy—this body of work reflects a condition of\nmass anguish and helplessness. Here, dissent survives only through indirect speech: metaphor,\nsign, code. Multiple voices echo, trapped within the factory of images—an apparatus of visual\nproduction that endlessly manufactures meaning, flattens complexity, and converts plural\nrealities into singular opinions.\n\n\nPain Corporation of India reveals democracy not as an absence, but as an infrastructure:\noperational, procedural, and capable of sustaining suffering while appearing functional. The\nworks insist on looking at pain not as an exception, but as a product—systematically generated,\ncirculated, and consumed."
  }
]