[
  {
    "name": "Me, Amma, We",
    "startDate": "2025-12-21",
    "endDate": "2025-01-11",
    "eventAttendanceMode": "https://schema.org/OfflineEventAttendanceMode",
    "url": "https://sumukha.com/details?section=exhibition&id=393&ref=/exhibition",
    "image": "https://sumukha.com/_assets/exhibitionHeader/393.jpg",
    "description": "#ME, AMMA, WE\nby DEVU NENMARA & UNNIKRISHNAN C\n\n“Every colour and hue easily mixes with that of earth” says Devu Nenmara the 62 years old artist whose paintings convey intense intimacies and intimations arising from Earth. Devu is from Nenmara, a remote village in Palakkad district of Kerala, where she lives and works, and has brought up her family. A labourer throughout her life, she strayed into painting late in her life, accidentally or by chance, during covid times, when she was confined to home. With the materials provided by her artist son Unnikrishnan, she began experimenting with painting. For her art was a natural extension or expression of her life till then, one that is deeply rooted in her village, its flora and fauna, people and landscapes. The layers of darkness and light, flashes of wisdom and beliefs, traces of festivities and rituals, rhythms of seasons and labour of her land animate her earthy imaginations. Coming from a traditional weaver family, she has an instinctive feel for colours, shapes, lines and patterns. Starting with gouache drawings on art paper of trees, animals and landscapes, she moved to acrylic and canvas, to paint the verdant and pulsating forms and figures of life, nature and object-world around her. \n\nThis debut exhibition of her works is also a visual jugalbandi of sorts along with the works of her artist son Unnikrishnan, whose works, apart from their deep entanglements with nature, are also profoundly inspired and provoked by contemporary concerns like identity politics and ecological thinking. Though mother and son belong to the same topos and share similar existential and environmental anxieties, their aesthetic and formal strategies, as to their approaches towards form, symmetry and balance, colour tones, detailing and levels of abstraction, diverge. This exhibition showcases the creative expressions of artists from two generations, of a mother and son, of a woman and man, of a professional and an instinctive artist, of two ways of looking and feeling, figuring and colouring..\n\n\n\n#Unnikrishnan C.\n\nBorn in 1991, Pezhumpara, India.\n\nHe graduated in Painting from the Government College of Fine Arts, Thrissur in 2014 and completed his Post graduation from IGNOU, New Delhi, in 2023.\n\nUnnikrishnan held his first solo ‘Unravelling Dissonances’, curated by Preema John & Reha Sodhi at the Blum & Co, Zug, Switzerland (2018).\nHe has also been an Artist-in-Residence at Harmony Art Residency, Mumbai (2019); Taj + SKE projects residency, GallerySKE, Bengaluru (2016). He was also part of ‘Niracharthu’, curated by Sujith S N, Thrissur (2022).\nHe has participated and exhibited in many group shows namely ‘Phantasm’, curated by Veeranganakumari Solanki, Srishti Art Gallery, Hyderabad (2024); ‘INSCAPES- In search of a Place’, curated by Premjish Achari, Latitude 28, New Delhi (2024); ‘Seattle Art Fair 2023’, Gallery Sumukha, Seattle, USA (2023); ‘Polyphonies in Distances’, curated by Sibdas Sengupta, Gallery Dotwalk, New Delhi (2023); ‘Things are Vanishing Before Us’, curated by Premjish Achari, Gallery Dotwalk, NewDelhi (2023); ‘Contextual Cosmologies’, complied by Anushka Rajendran, Bose Krishnamachari, Premjish Achari, Sujith S N, College of Fine Arts, Thiruvananthapuram (2023); ‘Lokame Tharavadu (the world is one family)’, curated by Bose Krishnamachari, Alappuzha (2021); ‘Three Projects’, GallerySKE, New Delhi (2017); ‘The Past, the Present, the Possible’, curated by Eungie Joo, 12th Sharjah Biennial, Sharjah, U.A.E. (2015); ‘Three Projects’,  GallerySKE, New Delhi (2015); ‘Whorled Explorations’, curated by Jitish Kallat, 2nd Kochi-Muziris Biennale, Kochi (2014); ‘Hanging Terraces’, curated by Dr. Kavitha Balakrishnan, Gallery Veda, Chennai (2013).\n\nHe lives and works in Palakkad, Kerala.\n\n#Devu Nenmara\n\nBorn in 1960, Kerala, India.\nShe is a self-taught artist and this is her first exhibition.",
    "performer": {
      "@type": "PerformingGroup",
      "name": "DEVU NENMARA & UNNIKRISHNAN C"
    }
  },
  {
    "name": "Southern Stars",
    "startDate": "2025-01-25",
    "endDate": "2025-03-01",
    "eventAttendanceMode": "https://schema.org/OfflineEventAttendanceMode",
    "url": "https://sumukha.com/details?section=exhibition&id=394&ref=/exhibition",
    "image": "https://sumukha.com/_assets/exhibitionHeader/394.jpg",
    "description": "",
    "performer": {
      "@type": "PerformingGroup",
      "name": "Clare Arni"
    }
  }
]