[
  {
    "name": "Me, Amma, We",
    "startDate": "2024-12-21",
    "endDate": "2025-01-11",
    "eventAttendanceMode": "https://schema.org/OfflineEventAttendanceMode",
    "url": "https://sumukha.com/details?section=exhibition&id=393&ref=/exhibition",
    "image": "https://sumukha.com/_assets/exhibitionHeader/393.jpg",
    "description": "#ME, AMMA, WE\nby DEVU NENMARA & UNNIKRISHNAN C\n\n“Every colour and hue easily mixes with that of earth” says Devu Nenmara the 62 years old artist whose paintings convey intense intimacies and intimations arising from Earth. Devu is from Nenmara, a remote village in Palakkad district of Kerala, where she lives and works, and has brought up her family. A labourer throughout her life, she strayed into painting late in her life, accidentally or by chance, during covid times, when she was confined to home. With the materials provided by her artist son Unnikrishnan, she began experimenting with painting. For her art was a natural extension or expression of her life till then, one that is deeply rooted in her village, its flora and fauna, people and landscapes. The layers of darkness and light, flashes of wisdom and beliefs, traces of festivities and rituals, rhythms of seasons and labour of her land animate her earthy imaginations. Coming from a traditional weaver family, she has an instinctive feel for colours, shapes, lines and patterns. Starting with gouache drawings on art paper of trees, animals and landscapes, she moved to acrylic and canvas, to paint the verdant and pulsating forms and figures of life, nature and object-world around her. \n\nThis debut exhibition of her works is also a visual jugalbandi of sorts along with the works of her artist son Unnikrishnan, whose works, apart from their deep entanglements with nature, are also profoundly inspired and provoked by contemporary concerns like identity politics and ecological thinking. Though mother and son belong to the same topos and share similar existential and environmental anxieties, their aesthetic and formal strategies, as to their approaches towards form, symmetry and balance, colour tones, detailing and levels of abstraction, diverge. This exhibition showcases the creative expressions of artists from two generations, of a mother and son, of a woman and man, of a professional and an instinctive artist, of two ways of looking and feeling, figuring and colouring..",
    "performer": {
      "@type": "PerformingGroup",
      "name": "DEVU NENMARA & UNNIKRISHNAN C"
    }
  }
]