[
  {
    "name": "Gulammohammed Sheikh: Graphic Prints, Part-Ii",
    "startDate": "2024-08-17",
    "endDate": "2024-09-14",
    "eventAttendanceMode": "https://schema.org/OfflineEventAttendanceMode",
    "url": "https://sumukha.com/details?section=exhibition&id=391&ref=/exhibition",
    "image": "https://sumukha.com/_assets/exhibitionHeader/391.jpg",
    "description": "#Gulammohammed Sheikh: Graphic Prints\n\nA Retrospective in Two Parts\ncurated by Pushpamala N.\n\nPart Two\n\n#Mind Prints\nDigital Works\n\nSheikh began making digital prints in the New Media Art workshop held by the ARTunderground gallery in Baroda in 2001 where artists were given computers and facilitators. Always curious about new forms, he became intrigued by this medium which was ‘fast’ compared to the ‘slow’ processes of painting and printmaking. He was attracted by the ‘ephemeral’ and the ‘concrete’ facets of the medium: the tension between the image illuminated on the screen and the physical transformation of that image when realized as a print. He calls these *Mind Prints* because for him the computer ‘replaces the hands with the mind, where the mind is central to finding, composing and making images.’ While the *Hand Prints* extended the idea of the multiple by including original graphic prints into little magazines, in *Mind Prints*, Sheikh is constantly in search of new ways to make the machine serve his painterly purpose, by introducing artisanal aspects like hand painting to make his digital prints unique. In his large digital print mural done for the Mumbai airport he used kinetic elements. A state-of-the art digital workstation forms part of his artistic tools today. \n\nAround this time, during the 2002 communal riots in Gujarat, he and his family faced threats necessitating a temporary relocation from Baroda. However, as one of the foremost intellectuals of the country, Sheikh has not let himself be Othered. He stands firmly at the centre and embraces the richness of the world. His digital works explode with brilliant saturated colours and quotations across geography and time – the Speaking Tree appears again with the Mappa Mundi, a medieval map of the world – with Kabir, Majnu, Mary Magdalene; saints, angels and demons; poets and artists; figures from art history and legend – outsiders and rebels drowning in love and longing, seeking a deeper spirituality.",
    "performer": {
      "@type": "PerformingGroup",
      "name": "curated Pushpamala N."
    }
  }
]