[
  {
    "name": "Southern Stars",
    "startDate": "2025-01-25",
    "endDate": "2025-03-01",
    "eventAttendanceMode": "https://schema.org/OfflineEventAttendanceMode",
    "url": "https://sumukha.com/details?section=exhibition&id=394&ref=/exhibition",
    "image": "https://sumukha.com/_assets/exhibitionHeader/394.jpg",
    "description": "Clare Arni’s formative childhood in 1970s Madurai was steeped in the vibrant iconography of Tamil cinema. Billboards, lobby cards, and the hypnotic music booming from countless loudspeakers created a backdrop to her early years. “The music would climb up the hill where I lived, meandering through the banyan trees in the sleepy afternoons, while the house remained silenced by heat-induced napping,” she recalls. Her childhood lacked television and malls; instead, entertainment meant exploring small haberdashery stores near the Meenakshi temple or visiting the Regal Talkies cinema. The imagery that surrounded her featured the charismatic figures of M.G. Ramachandran (MGR) and Sivaji Ganesan—icons who were both swashbuckling and suave. Most of Clare’s adult life was spend in Bangalore where the Kannada cine hero, singer and cultural icon Dr Rajkumar had an equal affect. \nThese actors, MGR and Sivaji, are more than cinematic legends; they are cultural phenomena who transcended the silver screen to become symbols of Tamil identity. MGR, a beloved actor-turned-politician, epitomized the ideals of heroism, and leadership, while Sivaji’s masterful performances embodied a wide spectrum of human emotion. Both captivated audiences, creating bonds that extended far beyond the cinema halls. The connection between star and fan in Tamil cinema is both deeply personal and profoundly collective. It transcends age and gender, uniting communities.\nClare recalls the day MGR passed away: “I was in Trichy, and the grief was immense. The entire state shut down, and shrines to MGR, bedecked with flowers and garlands, appeared outside people’s houses. I was in Bangalore when Dr Rajkumar passed away and an equal outpouring of collective grief brought the state to a standstill. Dr Rajkumar Statues are to be found all over the city, and it is in honour of that devotion that I have created this shrine to South Indian cinema”.\n\n\n**Clare Arni** is a photographer based in Bangalore, India. Her work encompasses social documentary and cultural heritage. She has been published by leading publishing houses such as Phaidon, Thames and Hudson and Dorling Kindersley. She has also contributed work to magazines like Abitare (Italy), Tatler, Conde Nast (UK), Wallpaper, The Wall Street Journal and Harvard Design magazine as well as several Indian publications of repute. Her solo photographic books document the history of the architecture of Banaras, Palaces of the Deccan, the recent excavations of Hampi, the capital of the Vijaynagar Empire and a four-month journey along the course of the river Kaveri.",
    "performer": {
      "@type": "PerformingGroup",
      "name": "Clare Arni"
    }
  }
]