[
  {
    "name": "Vidya Bhushan",
    "startDate": "2025-08-09",
    "endDate": "2025-08-30",
    "eventAttendanceMode": "https://schema.org/OfflineEventAttendanceMode",
    "url": "https://sumukha.com/details?section=exhibition&id=400&ref=/exhibition",
    "image": "https://sumukha.com/_assets/exhibitionHeader/400.jpg",
    "description": "This show presents selected works of Vidya Bhushan (1923 -1996 ) spanning five\ndecades of his life, twenty nine years after the artist’s demise. Born in a small village\nin Maharashtra, he discovered art and left behind a farming life for the capital of\nBombay to undergo formal training at the JJ School of Art. The young Bhushan\nfound a resonance in the turbulent yet impassioned mood of pre-Independent India.\nIn art, the nationalist ideas of the Bengal School were spreading fast into the British\nacademic training that was imparted at JJ School. Along with mastery over western\nacademic realism, his other works of this period in the 40s are in the traditional\nIndian styles. Yet, even in these early works we can see an urge to break out of\ngiven structures in the way a picture plane tilts unexpectedly or the surface breaks\ninto areas of colour.\nIn 1954 he went to Belgrade and there he painted mostly still life, landscape and\nportraits but with a dramatic change in treatment. Learning the techniques of egg\ntempera and mosaic gave him a new understanding of form and pictorial surface.\nWithin the genres of still life, landscape and nude/figure studies he experimented\nwith tools and techniques, developing his specific style of layering translucent\ncolours over and over, with broad brush and palette knife. He applied this\nunderstanding to his early commission to copy the deteriorating Ajanta Frescoes in\nthe egg tempera medium.\nThis hard won aesthetic he pursued through the 1970’s with an exploration into\ncomplete abstraction, returning to the figure in the 80’s and 90’s, working in\nwatercolour and egg tempera, mediums he now used with great freedom.\nThe generations of artists he has mentored at College of Fine Arts, Hyderabad, like\nLaxma Goud, Vaikuntam, Kavita Deuskar, and Devraj Dakoji to name just a few,\nspeak of his deep influence as an artist and teacher.\n\nThis show is in memory of his late daughter Rekha Bhushan.",
    "performer": {
      "@type": "PerformingGroup",
      "name": "Selected works 1940 - 1996"
    }
  }
]