[
  {
    "@context": "https://schema.org",
    "@type": "ExhibitionEvent",
    "name": "Weaving Light",
    "startDate": "2024-03-09",
    "endDate": "2024-04-13",
    "eventAttendanceMode": "https://schema.org/OfflineEventAttendanceMode",
    "eventStatus": "https://schema.org/EventScheduled",
    "url": "https://sumukha.com/details?section=exhibition&id=388&ref=/exhibition",
    "location": {
      "@type": "Place",
      "name": "Gallery Sumukha",
      "address": {
        "@type": "PostalAddress",
        "streetAddress": "24/10, BTS Depot Road, Wilson Garden",
        "addressLocality": "Bengaluru",
        "postalCode": "560027",
        "addressCountry": "IN"
      },
      "telephone": "+91 93804 20041",
      "email": "info@sumukha.com"
    },
    "image": "https://sumukha.com/_assets/exhibitionHeader/388.jpg",
    "description": "Ada Lovelace, the first computer programmer describes that the functioning of the engine's is programmed by punch cards, she wrote: *\"We may say most aptly that the Analytical Engine weaves algebraical patterns just as the Jacquard loom weaves flowers and leaves.\"*\n\nKeeping tales alive, Archana Hande is a wanderer, seeker, researcher, and adventurer. Stories, resources, and conversations that she encounters while traveling helps to recreate her travel experiences. Throughout the course of this show, she delves into one such journey: Archana has persistently studied and quantified the impact and influence of technology. Finding the minute details and piecing together the vast array of changes that are missed is Archana's mission. She discusses with us the much-seen and much-unseen changes using the medium of Jacquard punching cards as she takes us along with her to explore this specific journey. Jacquard card perforations allow for the creation of forms and shapes that are characterized by the dance of light and shadow. Her play on understanding changes via multiple levels of human knowledge is shown through the structure, forms, and shapes created by the movement of light and shadow through the perforations of Jacquard cards.  How our surroundings, including cities, customs, and civilizations, are ever-changing. She examines how these developments affect human skills, patterns of settlements and resources by delving further into materiality and the archives of her travels. Through the use of light and shadow, Archana tells a tale that enables us to examine the results of her research in greater detail; as she arranges the many nuances —- of language, material and dialogue literally and figuratively.\n\nRucha Vibhute\n2024\n\nWeaving Light (2009-2024)\nJacquard perforated punching cards (plastic/cardboard) and timer lights\nVariation 2\n\nAcknowledgement:\nJacquard weavers;\nKumar; R Ramesh; Jayram; Rudresh\n\nIndividuals: \nMahak Sethia; Madhusree Dutta; Rucha Vibhute; Santosh Pattar; Suresh Jayaram; Sridevi Mallappa; Vinayak S Katenahalli; Vineesh Amin; Kavana Badrinath; Kiran Athma, Mohamed Rizvan.\n\nTimer light: Emsys Electronics\n\nInstitutions: Gallery Sumukha; 1Shanthiroad; Atelier Prati",
    "performer": {
      "@type": "PerformingGroup",
      "name": "Archana Hande"
    },
    "organizer": {
      "@type": "Organization",
      "name": "Gallery Sumukha",
      "url": "https://sumukha.com/"
    }
  }
]