[
  {
    "name": "Cupid's Soirée - Singles Mixer",
    "description": "_Mingle with potential matches in a safe and fun environment, as you sip on a\ndrink and_ _devour on a curated selection of canapés!_\n\n**Date | Time | Venue :** Sunday, April 27 | 4-6 PM | Bastian Garden City, St Mark's Rd, Ashok Nagar, Bengaluru,_  \n_  \n******What can you expect?  \n**  \n\\- Equal ratio of single men and women between ages of 26 - 38  \n\\- Fun and guided Ice breaking activities  \n\\- Three cocktails are included in each ticket  \n\\- Delicious appetizers  \n\\- Friendly hosts to help you navigate your evening :)  \n_**\\- This experience does not guarantee you finding a match, it only connects\nyou with singles in the city.**_\n\n**Please Note**\n\n\\- If you're expecting speed dating at this event, Cupid's Soiree isn't for\nyou! :)  \n\\- Ice breakers are meant to help you ease into the process but effort needs\nto be put in from your end to mingle with the other guests  \n\\- If you're interested in someone and want to ask them for their contact,\nfeel free to do so directly but if the answer is a no, it's a **NO.  \n** \\- At any point if anyone feels uncomfortable due to ANY reason, reach out\nto the host  \n\\- Drink Responsibly, else you will be asked to leave  \n\\- Dress code: Dress however you would while stepping out on a first dinner\ndate\n\n**Terms and Conditions**\n\n\\- By accepting the Terms and Conditions, you are also acceptation that you\nare legally and relationally single and are within the above mentioned age\ngroup  \n\\- Please carry a valid ID proof along with you  \n\\- Each voucher is valid for 1 person only  \n\\- This experience cannot be rescheduled or refunded but you can transfer it\nto another person of the same gender within the mentioned age bracket  \n\\- The sponsors/performers/organizers are not responsible for any injury or\ndamage occurring due to the event. Any claims regarding the same would be\nsettled in courts in Bangalore  \n\\- The organizer reserves the right to ask any guest to leave the event at any\ntime if their behavior is deemed inappropriate, disruptive, or in violation of\nevent guidelines. This is to ensure a safe and comfortable experience for all\nattendees.  \n\\- Photos and videos taken during the event may be used for promotions on The\nWhite Box's social media and website. If you do not consent, inform the hosts\nbefore the event. Requests after the event cannot be accommodated.\n\n",
    "url": "https://thewhiteboxco.in/products/cupids-soiree-singles-mixer",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3900.00"
      },
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "4500.00"
      }
    ],
    "startDate": "2025-04-27T16:00:00+05:30",
    "endDate": "2025-04-27T18:00:00+05:30"
  }
]