[
  {
    "name": "Hula Harmony",
    "description": "A toy that was once designed for recreation, hula hooping gradually took the\nworld by a storm, starting with the United States in the late 1950s. Today\nhula hooping is not just a playful activity, but also a form of exercise and\nartistic expression. A cultural phenomenon, influencing music, fashion, and\ndance.\n\n**_This experience will involve a guided introduction to hula hooping, tricks\nand transitions and flow choreography through some fun activities!_**\n\n",
    "url": "https://troveexperiences.com/products/hula-hooping-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "1600.00",
        "sku": "HOOBLR190125"
      }
    ],
    "startDate": "2025-01-19T14:30:00+05:30",
    "endDate": "2025-01-19T16:30:00+05:30"
  },
  {
    "name": "Treasures From The Estates",
    "description": "Switch from coffee enthusiast to aficionado in this unique coffee appreciation\nexperience. Delve into the world of premium Indian Estate Coffees, and learn\nthe nuances of brewing and tasting single-origin brews, including a cold one.\n\nThis immersive experience helps you develop a keen sense of understanding\nabout unique Indian coffees and what makes them special. We will cover three\nbrewing methods - AeroPress, FrenchPress and Pour Over.\n\n**_Join us for the Brunch edit. Enjoy Trove’s signature coffee brewing\nexperience alongside a special breakfast menu curated by Chef Ashley of Monkey\nBar._**\n\nAttendees can opt for either a vegetarian or non-vegetarian set breakfast\nmenu, which will include all items mentioned below.\n\n  * **Veg Meal:** Chole Bhature, Mini Fruit Bowl, and Mini Muffin.\n  * **Non Veg Meal:** Mushroom & Cheese Omelette (with a slice of bread, butter & side salad), Mini Muesli Bowl, and Mini Muffin.\n\nFresh watermelon juice will be served to all attendees.\n\n",
    "url": "https://troveexperiences.com/products/coffee-brewing-and-tasting-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2750.00",
        "sku": "COFBLR260125"
      }
    ],
    "startDate": "2025-01-26T10:00:00+05:30",
    "endDate": "2025-01-26T12:30:00+05:30"
  },
  {
    "name": "The Craft of Mixology",
    "description": "Discover the world of cocktails and spirits and learn how to balance your own\ncocktail concoction under the guidance of expert mixologists.\n\nThe experience will include a quick introduction to different spirits,\ncocktail making techniques, bar equipment, interesting garnishing tips along\nwith various stories and myths around cocktails and spirits.\n\n",
    "url": "https://troveexperiences.com/products/cocktail-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "MIXBLR190125"
      }
    ],
    "startDate": "2025-01-19T16:00:00+05:30",
    "endDate": "2025-01-19T19:00:00+05:30"
  },
  {
    "name": "Wonders of Horology",
    "description": "Delve into the enchanting world of watchmaking, and gain a deeper\nunderstanding about the stellar craftsmanship and intricate detailing that go\ninto the making of luxe time pieces.\n\nThis experience will have you discover the nuanced art and science of watch-\nmaking, and help you look at time from a whole new perspective under the\nguidance of an expert horologist.\n\n_**The experience includes navigating through various components of Time\nMaking, the intricacies of Fine Watchmaking in an immersive visual journey\nunder the guidance of an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/horology-watch-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "HORBLR250125"
      }
    ],
    "startDate": "2025-01-25T16:00:00+05:30",
    "endDate": "2025-01-25T18:00:00+05:30"
  },
  {
    "name": "Treasures From The Estates",
    "description": "Switch from coffee enthusiast to aficionado in this unique coffee appreciation\nexperience. Delve into the world of premium Indian Estate Coffees, and learn\nthe nuances of brewing and tasting single-origin brews, including a cold one.\n\nThis immersive experience helps you develop a keen sense of understanding\nabout unique Indian coffees and what makes them special. We will cover three\nbrewing methods - AeroPress, FrenchPress and Pour Over.\n\n",
    "url": "https://troveexperiences.com/products/treasures-from-the-estates-1",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2400.00",
        "sku": "COFBLR010225"
      }
    ],
    "startDate": "2025-02-01T11:00:00+05:30",
    "endDate": "2025-02-01T13:00:00+05:30"
  },
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking and dining well, this experience helps you engage all\nfive senses when you're in the kitchen. The caviar on the top is relishing a\nwonderful meal that you, along with a bunch of people, will cook together.  \n  \n**_The theme for this cookalong is Japanese cuisine - Sushi making. _**\n\n  * **The cookalong** :\n\n**Observe:** Our expert will demonstrate how to roll three types of sushi from\nscratch: Maki, uramaki, and temaki sushi.  \n\n**Make Your Own Sushi:** Learn to make four types of sushi from scratch using\nvarious fillings and rolling styles, as demonstrated by the chef and savour\nthem.\n\n_Note:_ The cookalong and the meal will include both vegetarian (exotic\nvegetables and yasai vegetables) and non-vegetarian (salmon and crab) options.\n\nAdditionally, all guests will be served asparagus tempura and pickled\nvegetables.\n\n",
    "url": "https://troveexperiences.com/products/gourmet-cookalong-make-your-sushi-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "SUSBLR250125"
      }
    ],
    "startDate": "2025-01-25T16:30:00+05:30",
    "endDate": "2025-01-25T19:00:00+05:30"
  },
  {
    "name": "Legacy of Strength",
    "description": "For centuries, the warriors and wrestlers of ancient India harnessed the\npowers of tools like the _Gada_ and _Mudgar_ to forge extraordinary strength\nand endurance. These iconic tools, symbols of power and protection, were more\nthan mere weapons; they were instruments of physical and spiritual\ntransformation. Today, Tagda Raho brings this ancient tradition to life,\nseamlessly blending it with modern fitness science.\n\nBeyond physical strength, the fitness routine if practiced regularly,\ncultivates an instinctive understanding of your body's biomechanics. By honing\nyour body awareness, you can optimise your workouts, prevent injuries, and\nachieve lasting results.\n\n**_Join us for this beginner-friendly experience that explores the magic of\nmovement by delving into ancient wisdom for building endurance in today’s\ntimes of sedentary lifestyles._**\n\n",
    "url": "https://troveexperiences.com/products/tagda-raho-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "TAGBLR190125"
      }
    ],
    "startDate": "2025-01-19T08:30:00+05:30",
    "endDate": "2025-01-19T10:30:00+05:30"
  }
]