[
  {
    "name": "Treasures From The Estates",
    "description": "Switch from coffee enthusiast to aficionado in this unique coffee appreciation\nexperience. Delve into the world of premium Indian Estate Coffees, and learn\nthe nuances of brewing and tasting single-origin brews, including a cold one.\n\nThis immersive experience helps you develop a keen sense of understanding\nabout unique Indian coffees and what makes them special. We will cover three\nbrewing methods - AeroPress, FrenchPress and Pour Over.\n\n",
    "url": "https://troveexperiences.com/products/treasures-from-the-estates-1",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2400.00",
        "sku": "COFBLR240525"
      }
    ],
    "startDate": "2025-05-31T16:00:00+05:30",
    "endDate": "2025-05-31T18:30:00+05:30"
  },
  {
    "name": "Hula Harmony",
    "description": "A toy that was once designed for recreation, hula hooping gradually took the\nworld by a storm, starting with the United States in the late 1950s. Today\nhula hooping is not just a playful activity, but also a form of exercise and\nartistic expression. A cultural phenomenon, influencing music, fashion, and\ndance.\n\n**_This experience will involve a guided introduction to hula hooping, tricks\nand transitions and flow choreography through some fun activities!_**\n\n",
    "url": "https://troveexperiences.com/products/hula-hooping-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "1600.00",
        "sku": "HOOBLR010525"
      }
    ],
    "startDate": "2025-06-01T14:30:00+05:30",
    "endDate": "2025-06-01T16:30:00+05:30"
  },
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking, this experience helps you engage all five senses when\nyou're in the kitchen.  \n  \n**_The theme for this cookalong is Asian cuisine - Dim Sum making._**\n\n**Cookalong** : Learn to make and steam Dim sums from scratch, options\ninclude; Pan fried chicken dim sum (non- veg) , Spicy Broccoli with cream\ncheese dim sum (veg) ,  \nVegetables fried wonton (veg).\n\n**Menu** : A welcome drink, the Dim Sums that you make along with a variety of\nhouse made Dim sums and Chinese tea.\n\n******Note:** The cookalong includes vegetarian and non-vegetarian option.\n\n",
    "url": "https://troveexperiences.com/products/dimsum-making-masterclass-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "DIMBLR010625"
      }
    ],
    "startDate": "2025-06-01T10:30:00+05:30",
    "endDate": "2025-06-01T13:00:00+05:30"
  },
  {
    "name": "Polar Plunge",
    "description": "Cold plunges have a rich history, dating back to ancient civilisations like\nEgypt, Greece, and Rome, where it was revered for its healing properties.\nToday, this practice is globally recognised for its numerous therapeutic and\nwellness benefits.\n\nA cold plunge, also known as an ice bath, involves immersing the body in cold\nwater, typically at temperatures between 5-7°C, for a brief period. It is\nwidely used by athletes and fitness enthusiasts to aid recovery and enhance\nphysical and mental health.\n\n_**This immersive experience helps you take the plunge through a series of\nactivities, guided by an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/polar-plunge-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "ICEBLR310525"
      }
    ],
    "startDate": "2025-05-31T09:00:00+05:30",
    "endDate": "2025-05-31T11:00:00+05:30"
  }
]