[
  {
    "name": "The Art of Shibori",
    "description": "An ancient Japanese textile art form, Shibori embodies both craftsmanship and\ncreative expression. Rooted in centuries of tradition, Shibori is more than\njust a technique; it is a philosophy that embraces the beauty of imperfection\nand the harmony between nature and human touch. This makes each outcome raw\nand different from one another.\n\nThis experience is an appreciation of the art of slowing down, of modern-day\nsensibilities still being relevant through age-old techniques, and of finding\nbeauty and inspiration in all things that surround us.\n\n_**The experience includes trying your hand at 3 different Shibori techniques\nto create your own customised design on a piece of fabric, under the guidance\nof an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/shibori-tie-dye-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "SHIBLR06102024"
      }
    ],
    "startDate": "2024-10-05T15:00:00+05:30",
    "endDate": "2024-10-05T18:00:00+05:30"
  },
  {
    "name": "Spin City",
    "description": "While the origin story of pole art is multifaceted, spanning across multiple\ncultures and time periods, today pole dance is regarded as an art form\ncelebrated for its fusion of athleticism, grace, and creativity.\n\n_**This experience is an immersion into the art of pole movement, looking\nbeyond its association with strip clubs to embracing it as a wonderful way to\nmove and stay fit.**_\n\n",
    "url": "https://troveexperiences.com/products/spin-city-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "POLBLR051024"
      }
    ],
    "startDate": "2024-10-05T16:00:00+05:30",
    "endDate": "2024-10-05T18:00:00+05:30"
  },
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking, this experience helps you engage all five senses when\nyou're in the kitchen.  \n  \n**_The theme for this cookalong is Asian cuisine - Dim Sum making._**\n\n**Cookalong** : Learn to make and steam Dim sums from scratch, options\ninclude; Pan fried chicken dim sum (non- veg) , Spicy Broccoli with cream\ncheese dim sum (veg) ,  \nVegetables fried wonton (veg).\n\n**Menu** : A welcome drink, the Dim Sums that you make along with a variety of\nhouse made Dim sums and Chinese tea.\n\n******Note:** The cookalong includes vegetarian and non-vegetarian options.\n\n",
    "url": "https://troveexperiences.com/products/dimsum-making-masterclass-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "DIMBLR13102024"
      }
    ],
    "startDate": "2024-10-13T10:30:00+05:30",
    "endDate": "2024-10-13T13:00:00+05:30"
  }
]