[
  {
    "name": "Hula Harmony",
    "description": "A toy that was once designed for recreation, hula hooping gradually took the\nworld by a storm, starting with the United States in the late 1950s. Today\nhula hooping is not just a playful activity, but also a form of exercise and\nartistic expression. A cultural phenomenon, influencing music, fashion, and\ndance.\n\n**_This experience will involve a guided introduction to hula hooping, tricks\nand transitions and flow choreography through some fun activities!_**\n\n",
    "url": "https://troveexperiences.com/products/hula-hooping-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "1600.00",
        "sku": "HOOBLR050725"
      }
    ],
    "startDate": "2025-07-05T14:30:00+05:30",
    "endDate": "2025-07-05T16:30:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Imagine that! Creative Studio",
      "address": "Ashok Nagar, Bangalore"
    }
  },
  {
    "name": "Echoes of Calm",
    "description": "The use of sound for healing dates back thousands of years to various ancient\ncultures. Indigenous peoples have long used drums, chanting, and other\ninstruments for ceremonial and therapeutic purposes. These practices were\noften tied to spiritual rituals and were believed to have healing properties.\n\nThis immersive sound bath experience is built on the enduring belief in the\npower of sound, and sets you on the path to healing, relaxation, and spiritual\ngrowth.\n\n",
    "url": "https://troveexperiences.com/products/sound-bathing-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "SOUBLR290625"
      }
    ],
    "startDate": "2025-06-29T14:30:00+05:30",
    "endDate": "2025-06-29T16:30:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Imagine that! Creative Studio",
      "address": "Ashok Nagar, Bangalore"
    }
  },
  {
    "name": "Aerial Playground",
    "description": "Inspired by ancient yogic traditions, Airo Yoga takes flight for the modern\nexplorer. Emerging in the 2000s, it reimagines classic poses with the playful\nfreedom of a custom-designed aerial hammock.\n\nAiro Yoga, a specific style within Aerial Yoga, incorporates the flowing\nsequences of Vinyasa yoga, the core control of Pilates, the thrill of\ninversions, and the playful connection of acro play. The result creates a\ntruly exhilarating and accessible practice that uses Eastern philosophies to\noffer a unique path to strength, mindfulness, and a joyful flight for all.\n\n",
    "url": "https://troveexperiences.com/products/airo-yoga-aerial-yoga-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "AERBLR070625"
      }
    ],
    "startDate": "2025-06-07T10:00:00+05:30",
    "endDate": "2025-06-07T12:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Smart Studio",
      "address": "Ulsoor, Bangalore"
    }
  },
  {
    "name": "A Mini Indulgence",
    "description": "Cupcakes first appeared in 1796 when Amelia Simmons’ cookbook referenced “a\nlight cake to bake in small cups.” What started as a practical way to portion\nbatter soon evolved into a global favourite, with flavours and techniques\nreflecting diverse cultures.\n\nOnce a simple teatime treat, these portable cakes have taken over bakeries,\ncelebrations, and social media, transforming into edible art with intricate\npiping, vibrant colours, and rich flavours. Innovations in baking have led to\nthe infusion of jams, chocolates, and creams into these treats while\npreserving their delicate texture.\n\n**Immerse yourself in a hands-on Cupcake Baking & Icing Experience, and\nexplore the art of baking light, fluffy cupcakes from scratch. Learn expert\ntechniques for icing with precision and creativity, all while indulging in\ndelightful treats that complement and elevate your creations.**  \n\n**Note: No eggless options are available.**\n\n",
    "url": "https://troveexperiences.com/products/a-mini-indulgence-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "CUPBLR280325"
      }
    ],
    "startDate": "2025-06-28T10:30:00+05:30",
    "endDate": "2025-06-28T13:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Magnolia Bakery",
      "address": "St Mark's Road, Bangalore"
    }
  }
]