[
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking and dining well, this experience helps you engage all\nfive senses when you're in the kitchen. The caviar on the top is relishing a\nwonderful meal that you, along with a bunch of people, will cook together.  \n  \n**_The theme of this cookalong is Neapolitan Pizza._**  \n\n  * **The cookalong** : Learn to make and stretch the Pizza Dough, assemble the pizza with toppings, taste different cheeses and the house sauce. Learn how to use a wood fired oven to bake pizzas.\n  * **The meal** : Virgin Mojito, the Pizza that you make, Dessert.\n\nNote: The cookalong includes vegetarian and non-vegetarian meal options.\n\n",
    "url": "https://troveexperiences.com/products/pizza-making-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "PIZBLR161124"
      }
    ],
    "startDate": "2024-11-16T10:00:00+05:30",
    "endDate": "2024-11-16T12:30:00+05:30"
  },
  {
    "name": "Hula Harmony",
    "description": "A toy that was once designed for recreation, hula hooping gradually took the\nworld by a storm, starting with the United States in the late 1950s. Today\nhula hooping is not just a playful activity, but also a form of exercise and\nartistic expression. A cultural phenomenon, influencing music, fashion, and\ndance.\n\n**_This experience will involve a guided introduction to hula hooping, tricks\nand transitions and flow choreography through some fun activities!_**\n\n",
    "url": "https://troveexperiences.com/products/hula-hooping-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "1600.00",
        "sku": "HOOBLR171124"
      }
    ],
    "startDate": "2024-11-17T11:00:00+05:30",
    "endDate": "2024-11-17T13:00:00+05:30"
  },
  {
    "name": "Treasures From The Estates",
    "description": "Switch from coffee enthusiast to aficionado in this unique coffee appreciation\nexperience. Delve into the world of premium Indian Estate Coffees, and learn\nthe nuances of brewing and tasting single-origin brews, including a cold one.\n\nThis immersive experience helps you develop a keen sense of understanding\nabout unique Indian coffees and what makes them special. We will cover three\nbrewing methods - AeroPress, FrenchPress and Pour Over.\n\n**_Join us for the Brunch edit. Enjoy Trove’s signature coffee brewing\nexperience alongside a special breakfast menu curated by Chef Ashley of Monkey\nBar._**\n\nAttendees can opt for either a vegetarian or non-vegetarian set breakfast\nmenu, which will include all items mentioned below.\n\n  * **Veg Meal:** Chole Bhature, Mini Fruit Bowl, and Mini Muffin.\n  * **Non Veg Meal:** Mushroom & Cheese Omelette (with a slice of bread, butter & side salad), Mini Muesli Bowl, and Mini Muffin.\n\nFresh watermelon juice will be served to all attendees.\n\n",
    "url": "https://troveexperiences.com/products/coffee-brewing-and-tasting-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2750.00",
        "sku": "COFBLR241124"
      }
    ],
    "startDate": "2024-11-24T10:00:00+05:30",
    "endDate": "2024-11-24T12:30:00+05:30"
  },
  {
    "name": "The Craft of Mixology",
    "description": "Discover the world of cocktails and spirits and learn how to balance your own\ncocktail concoction under the guidance of expert mixologists.\n\nThe experience will include a quick introduction to different spirits,\ncocktail making techniques, bar equipment, interesting garnishing tips along\nwith various stories and myths around cocktails and spirits.\n\n",
    "url": "https://troveexperiences.com/products/cocktail-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "MIXBLR171124"
      }
    ],
    "startDate": "2024-11-17T16:00:00+05:30",
    "endDate": "2024-11-17T19:00:00+05:30"
  },
  {
    "name": "Wonders of Horology",
    "description": "Delve into the enchanting world of watchmaking, and gain a deeper\nunderstanding about the stellar craftsmanship and intricate detailing that go\ninto the making of luxe time pieces.\n\nThis experience will have you discover the nuanced art and science of watch-\nmaking, and help you look at time from a whole new perspective under the\nguidance of an expert horologist.\n\n_**The experience includes navigating through various components of Time\nMaking, the intricacies of Fine Watchmaking in an immersive visual journey\nunder the guidance of an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/horology-watch-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "HORBLR231124"
      }
    ],
    "startDate": "2024-11-23T16:00:00+05:30",
    "endDate": "2024-11-23T18:00:00+05:30"
  },
  {
    "name": "Spin City",
    "description": "While the origin story of pole art is multifaceted, spanning across multiple\ncultures and time periods, today pole dance is regarded as an art form\ncelebrated for its fusion of athleticism, grace, and creativity.\n\n_**This experience is an immersion into the art of pole movement, looking\nbeyond its association with strip clubs to embracing it as a wonderful way to\nmove and stay fit.**_\n\n",
    "url": "https://troveexperiences.com/products/spin-city-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "POLBLR161124"
      }
    ],
    "startDate": "2024-11-16T15:00:00+05:30",
    "endDate": "2024-11-16T17:00:00+05:30"
  },
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking, this experience helps you engage all five senses when\nyou're in the kitchen.  \n  \n**_The theme for this cookalong is Asian cuisine - Dim Sum making._**\n\n**Cookalong** : Learn to make and steam Dim sums from scratch, options\ninclude; Pan fried chicken dim sum (non- veg) , Spicy Broccoli with cream\ncheese dim sum (veg) ,  \nVegetables fried wonton (veg).\n\n**Menu** : A welcome drink, the Dim Sums that you make along with a variety of\nhouse made Dim sums and Chinese tea.\n\n******Note:** The cookalong includes vegetarian and non-vegetarian options.\n\n",
    "url": "https://troveexperiences.com/products/dimsum-making-masterclass-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "DIMBLR10112024"
      }
    ],
    "startDate": "2024-11-24T09:30:00+05:30",
    "endDate": "2024-11-24T12:00:00+05:30"
  },
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking and dining well, this experience helps you engage all\nfive senses when you're in the kitchen. The caviar on the top is relishing a\nwonderful meal that you, along with a bunch of people, will cook together.  \n  \n  \n**_The theme for this cookalong is Japanese cuisine - Sushi making. _**\n\n  * **The cookalong** :\n\n**Observe:** Our expert will demonstrate how to roll three types of sushi from\nscratch: Maki, uramaki, and temaki sushi.  \n\n**Make Your Own Sushi:** Learn to make four types of sushi from scratch using\nvarious fillings and rolling styles, as demonstrated by the chef and savour\nthem.\n\n_Note:_ The cookalong and the meal will include both vegetarian (exotic\nvegetables and yasai vegetables) and non-vegetarian (salmon and crab) options.\n\nAdditionally, all guests will be served asparagus tempura and pickled\nvegetables.\n\n",
    "url": "https://troveexperiences.com/products/gourmet-cookalong-make-your-sushi-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "SUSBLR231124"
      }
    ],
    "startDate": "2024-11-23T16:30:00+05:30",
    "endDate": "2024-11-23T19:00:00+05:30"
  },
  {
    "name": "The Gooey Goodness",
    "description": "A fortunate kitchen mishap in the early 1900s led to the creation of the\nbrownie—a dense, fudgy confection that soon became an American classic. This\ndelightful oversight of not including baking powder in a chocolate cake batter\nresulted in a delectable hybrid of cake and cookie, celebrated for its rich\nchocolate flavour and chewy texture.\n\nOver the decades, brownies evolved into a beloved staple in bakeries and homes\nalike. Bakers experimented with a variety of ingredients and flavours, from\nclassic nuts and caramel to modern twists like sea salt and espresso. Today,\nbrownies are an iconic comfort food enjoyed across continents, offering a\nrange of irresistible flavours and joy for people of all ages.\n\n**Join us on a delightful discovery behind baking the perfect brownies and\nlearn to create rich, delectable brownies from scratch. Enjoy a hands-on\nexperience that combines tradition with creativity, and savour the sweet\nrewards of your baking success in our Brownie Bakealong experience.**\n\n",
    "url": "https://troveexperiences.com/products/brownie-bake-along-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2400.00",
        "sku": "BROBLR171124"
      }
    ],
    "startDate": "2024-11-17T10:00:00+05:30",
    "endDate": "2024-11-17T12:00:00+05:30"
  },
  {
    "name": "Polar Plunge",
    "description": "Cold plunges have a rich history, dating back to ancient civilisations like\nEgypt, Greece, and Rome, where it was revered for its healing properties.\nToday, this practice is globally recognised for its numerous therapeutic and\nwellness benefits.\n\nA cold plunge, also known as an ice bath, involves immersing the body in cold\nwater, typically at temperatures between 5-7°C, for a brief period. It is\nwidely used by athletes and fitness enthusiasts to aid recovery and enhance\nphysical and mental health.\n\n_**This immersive experience helps you take the plunge through a series of\nactivities, guided by an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/polar-plunge-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "ICEBLR241124"
      }
    ],
    "startDate": "2024-11-24T08:00:00+05:30",
    "endDate": "2024-11-24T10:00:00+05:30"
  }
]