[
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking and dining well, this experience helps you engage all\nfive senses when you're in the kitchen. The caviar on the top is relishing a\nwonderful meal that you, along with a bunch of people, will cook together.  \n  \n**_The theme of this cookalong is Neapolitan Pizza._**  \n\n  * **The cookalong** : Learn to make and stretch the Pizza Dough, assemble the pizza with toppings, taste different cheeses and the house sauce. Learn how to use a wood fired oven to bake pizzas.\n  * **The meal** : Virgin Mojito, the Pizza that you make, Dessert.\n\nNote: The cookalong includes vegetarian and non-vegetarian meal options.\n\n",
    "url": "https://troveexperiences.com/products/pizza-making-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "PIZBLR191024"
      }
    ],
    "startDate": "2024-10-19T10:00:00+05:30",
    "endDate": "2024-10-19T12:30:00+05:30"
  },
  {
    "name": "Treasures From The Estates",
    "description": "Switch from coffee enthusiast to aficionado in this unique coffee appreciation\nexperience. Delve into the world of premium Indian Estate Coffees, and learn\nthe nuances of brewing and tasting single-origin brews, including a cold one.\n\nThis immersive experience helps you develop a keen sense of understanding\nabout unique Indian coffees and what makes them special. We will cover three\nbrewing methods - AeroPress, FrenchPress and Pour Over.\n\n**_Join us for the Brunch edit. Enjoy Trove’s signature coffee brewing\nexperience alongside a special breakfast menu curated by Chef Ashley of Monkey\nBar._**\n\nAttendees can opt for either a vegetarian or non-vegetarian set breakfast\nmenu, which will include all items mentioned below.\n\n  * **Veg Meal:** Chole Bhature, Mini Fruit Bowl, and Mini Muffin.\n  * **Non Veg Meal:** Mushroom & Cheese Omelette (with a slice of bread, butter & side salad), Mini Muesli Bowl, and Mini Muffin.\n\nFresh watermelon juice will be served to all attendees.\n\n",
    "url": "https://troveexperiences.com/products/coffee-brewing-and-tasting-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2750.00",
        "sku": "COFBLR201024"
      }
    ],
    "startDate": "2024-10-20T22:00:00+05:30",
    "endDate": "2024-10-20T12:30:00+05:30"
  },
  {
    "name": "Echoes of Calm",
    "description": "The use of sound for healing dates back thousands of years to various ancient\ncultures. Indigenous peoples have long used drums, chanting, and other\ninstruments for ceremonial and therapeutic purposes. These practices were\noften tied to spiritual rituals and were believed to have healing properties.\n\nThis immersive sound bath experience is built on the enduring belief in the\npower of sound, and sets you on the path to healing, relaxation, and spiritual\ngrowth.\n\n",
    "url": "https://troveexperiences.com/products/sound-bathing-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "SOUBLR001"
      }
    ],
    "startDate": "2024-10-20T14:30:00+05:30",
    "endDate": "2024-10-20T16:30:00+05:30"
  },
  {
    "name": "Sommelier's Secrets",
    "description": "The origins of wine remain shrouded in mystery. Civilizations have flourished\nand generations have evolved since, but we have barely managed to decode the\nintricacies of one of the oldest alcoholic beverages known to mankind.\n\nThis wine tasting trail will take you on an immersive journey of tasting and\nappreciating 6 fabulous wines, sprinkled with the most interesting stories to\nhelp you understand the culture and nuances of the spirit.\n\n**This Wine Tasting will comprise a guided tasting of 6 wines from around the\nworld with varying styles and structures, emphasising on sustainable wine\nmaking practices.**\n\n",
    "url": "https://troveexperiences.com/products/wine-tasting-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3000.00",
        "sku": "WINBLR191024"
      }
    ],
    "startDate": "2024-10-19T14:00:00+05:30",
    "endDate": "2024-10-19T16:00:00+05:30"
  },
  {
    "name": "Wonders of Horology",
    "description": "Delve into the enchanting world of watchmaking, and gain a deeper\nunderstanding about the stellar craftsmanship and intricate detailing that go\ninto the making of luxe time pieces.\n\nThis experience will have you discover the nuanced art and science of watch-\nmaking, and help you look at time from a whole new perspective under the\nguidance of an expert horologist.\n\n_**The experience includes navigating through various components of Time\nMaking, the intricacies of Fine Watchmaking in an immersive visual journey\nunder the guidance of an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/horology-watch-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "HORBLR261024"
      }
    ],
    "startDate": "2024-10-26T16:00:00+05:30",
    "endDate": "2024-10-26T18:00:00+05:30"
  },
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking, this experience helps you engage all five senses when\nyou're in the kitchen.  \n  \n**_The theme for this cookalong is Asian cuisine - Dim Sum making._**\n\n**Cookalong** : Learn to make and steam Dim sums from scratch, options\ninclude; Pan fried chicken dim sum (non- veg) , Spicy Broccoli with cream\ncheese dim sum (veg) ,  \nVegetables fried wonton (veg).\n\n**Menu** : A welcome drink, the Dim Sums that you make along with a variety of\nhouse made Dim sums and Chinese tea.\n\n******Note:** The cookalong includes vegetarian and non-vegetarian options.\n\n",
    "url": "https://troveexperiences.com/products/dimsum-making-masterclass-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "DIMBLR13102024"
      }
    ],
    "startDate": "2024-10-13T10:30:00+05:30",
    "endDate": "2024-10-13T13:00:00+05:30"
  },
  {
    "name": "Aerial Playground",
    "description": "Inspired by ancient yogic traditions, Airo Yoga takes flight for the modern\nexplorer. Emerging in the 2000s, it reimagines classic poses with the playful\nfreedom of a custom-designed aerial hammock.\n\nAiro Yoga, a specific style within Aerial Yoga, incorporates the flowing\nsequences of Vinyasa yoga, the core control of Pilates, the thrill of\ninversions, and the playful connection of acro play. The result creates a\ntruly exhilarating and accessible practice that uses Eastern philosophies to\noffer a unique path to strength, mindfulness, and a joyful flight for all.\n\n",
    "url": "https://troveexperiences.com/products/airo-yoga-aerial-yoga-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "AERBLR191024"
      }
    ],
    "startDate": "2024-10-19T16:00:00+05:30",
    "endDate": "2024-10-19T18:00:00+05:30"
  }
]