[
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking and dining well, this experience helps you engage all\nfive senses when you're in the kitchen. The caviar on the top is relishing a\nwonderful meal that you, along with a bunch of people, will cook together.  \n  \n**_The theme of this cookalong is Neapolitan Pizza._**  \n\n  * **The cookalong** : Learn to make and stretch the Pizza Dough, assemble the pizza with toppings, taste different cheeses and the house sauce. Learn how to use a wood fired oven to bake pizzas.\n  * **The meal** : Virgin Mojito, the Pizza that you make, Dessert.\n\nNote: The cookalong includes vegetarian and non-vegetarian meal options.\n\n",
    "url": "https://troveexperiences.com/products/pizza-making-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "PIZBLR150325"
      }
    ],
    "startDate": "2025-03-15T10:00:00+05:30",
    "endDate": "2025-03-15T12:30:00+05:30"
  },
  {
    "name": "Hula Harmony",
    "description": "A toy that was once designed for recreation, hula hooping gradually took the\nworld by a storm, starting with the United States in the late 1950s. Today\nhula hooping is not just a playful activity, but also a form of exercise and\nartistic expression. A cultural phenomenon, influencing music, fashion, and\ndance.\n\n**_This experience will involve a guided introduction to hula hooping, tricks\nand transitions and flow choreography through some fun activities!_**\n\n",
    "url": "https://troveexperiences.com/products/hula-hooping-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "1600.00",
        "sku": "HOOBLR300325"
      }
    ],
    "startDate": "2025-03-30T14:30:00+05:30",
    "endDate": "2025-03-30T16:30:00+05:30"
  },
  {
    "name": "The Art of Shibori",
    "description": "An ancient Japanese textile art form, Shibori embodies both craftsmanship and\ncreative expression. Rooted in centuries of tradition, Shibori is more than\njust a technique; it is a philosophy that embraces the beauty of imperfection\nand the harmony between nature and human touch. This makes each outcome raw\nand different from one another.\n\nThis experience is an appreciation of the art of slowing down, of modern-day\nsensibilities still being relevant through age-old techniques, and of finding\nbeauty and inspiration in all things that surround us.\n\n_**The experience includes trying your hand at 3 different Shibori techniques\nto create your own customised design on a piece of fabric, under the guidance\nof an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/shibori-tie-dye-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2750.00",
        "sku": "SHIBLR220325"
      }
    ],
    "startDate": "2025-03-22T15:00:00+05:30",
    "endDate": "2025-03-22T17:00:00+05:30"
  },
  {
    "name": "Spin City",
    "description": "While the origin story of pole art is multifaceted, spanning across multiple\ncultures and time periods, today pole dance is regarded as an art form\ncelebrated for its fusion of athleticism, grace, and creativity.\n\n_**This experience is an immersion into the art of pole movement, looking\nbeyond its association with strip clubs to embracing it as a wonderful way to\nmove and stay fit.**_\n\n",
    "url": "https://troveexperiences.com/products/spin-city-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "POLBLR160325"
      }
    ],
    "startDate": "2025-03-16T12:30:00+05:30",
    "endDate": "2025-03-16T14:30:00+05:30"
  },
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking, this experience helps you engage all five senses when\nyou're in the kitchen.  \n  \n**_The theme for this cookalong is Asian cuisine - Dim Sum making._**\n\n**Cookalong** : Learn to make and steam Dim sums from scratch, options\ninclude; Pan fried chicken dim sum (non- veg) , Spicy Broccoli with cream\ncheese dim sum (veg) ,  \nVegetables fried wonton (veg).\n\n**Menu** : A welcome drink, the Dim Sums that you make along with a variety of\nhouse made Dim sums and Chinese tea.\n\n******Note:** The cookalong includes vegetarian and non-vegetarian option.\n\n_**This Women's Day, make time for learning, creating, and indulging with the\nwomen you love! As a special treat, this Dimsum Making experience includes two\nglasses of wine - on the house, per sign-up.**_\n\n",
    "url": "https://troveexperiences.com/products/dimsum-making-masterclass-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "DIMBLR080325"
      }
    ],
    "startDate": "2025-03-08T10:30:00+05:30",
    "endDate": "2025-03-08T13:00:00+05:30"
  },
  {
    "name": "Treasures From The Estates",
    "description": "Switch from coffee enthusiast to aficionado in this unique coffee appreciation\nexperience. Delve into the world of premium Indian Estate Coffees, and learn\nthe nuances of brewing and tasting single-origin brews, including a cold one.\n\nThis immersive experience helps you develop a keen sense of understanding\nabout unique Indian coffees and what makes them special. We will cover three\nbrewing methods - AeroPress, FrenchPress and Pour Over.\n\n",
    "url": "https://troveexperiences.com/products/treasures-from-the-estates-1",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2400.00",
        "sku": "COFBLR010325"
      }
    ],
    "startDate": "2025-03-08T11:00:00+05:30",
    "endDate": "2025-03-08T13:00:00+05:30"
  },
  {
    "name": "Aerial Playground",
    "description": "Inspired by ancient yogic traditions, Airo Yoga takes flight for the modern\nexplorer. Emerging in the 2000s, it reimagines classic poses with the playful\nfreedom of a custom-designed aerial hammock.\n\nAiro Yoga, a specific style within Aerial Yoga, incorporates the flowing\nsequences of Vinyasa yoga, the core control of Pilates, the thrill of\ninversions, and the playful connection of acro play. The result creates a\ntruly exhilarating and accessible practice that uses Eastern philosophies to\noffer a unique path to strength, mindfulness, and a joyful flight for all.\n\n",
    "url": "https://troveexperiences.com/products/airo-yoga-aerial-yoga-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "AERBLR290325"
      }
    ],
    "startDate": "2025-03-29T10:00:00+05:30",
    "endDate": "2025-03-29T12:00:00+05:30"
  },
  {
    "name": "Polar Plunge",
    "description": "Cold plunges have a rich history, dating back to ancient civilisations like\nEgypt, Greece, and Rome, where it was revered for its healing properties.\nToday, this practice is globally recognised for its numerous therapeutic and\nwellness benefits.\n\nA cold plunge, also known as an ice bath, involves immersing the body in cold\nwater, typically at temperatures between 5-7°C, for a brief period. It is\nwidely used by athletes and fitness enthusiasts to aid recovery and enhance\nphysical and mental health.\n\n_**This immersive experience helps you take the plunge through a series of\nactivities, guided by an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/polar-plunge-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "ICEBLR230325"
      },
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "ICEBLR230325-2"
      }
    ],
    "startDate": "2025-03-29T09:00:00+05:30",
    "endDate": "2025-03-29T11:00:00+05:30"
  },
  {
    "name": "Summit Seekers",
    "description": "Stemming from an age-old human desire to reach new heights, rock climbing is\nbeyond just a fitness ritual. This beginner-friendly rock climbing experience\ndraws inspiration from climbing pioneers, the unending human quest to problem-\nsolve better and design thinking to equip you with the skills and confidence\nto embark on your own climbing journey. Join us and discover a sport steeped\nin storytelling, where the upward journey is as beautiful as the summit.\n\n",
    "url": "https://troveexperiences.com/products/summit-seekers-rock-climbing-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "ROCBLR160325"
      }
    ],
    "startDate": "2025-03-16T11:00:00+05:30",
    "endDate": "2025-03-16T13:00:00+05:30"
  },
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking and dining well, this experience helps you engage all\nfive senses when you're in the kitchen.\n\n**_The theme for this cookalong is Pasta-making._**\n\n  * **The cookalong** : Learn to make Pasta dough, 1 stuffed pasta , 1 flat pasta (Fettuccine). Learn how to knead the pasta dough, rest, roll and sheet out the dough into shapes.\n  * **The demonstration** : Pesto & Arabiatta sauce. \n\nParticipants will take home the pasta that is rolled out, with instructions on\nhow to cook it at home; you’ll also be sampling two pasta dishes which are\nmade at Toast & Tonic.\n\n",
    "url": "https://troveexperiences.com/products/pasta-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3000.00",
        "sku": "PASBLR230325"
      }
    ],
    "startDate": "2025-03-23T15:00:00+05:30",
    "endDate": "2025-03-23T18:00:00+05:30"
  }
]