[
  {
    "name": "The Art of Shibori",
    "description": "An ancient Japanese textile art form, Shibori embodies both craftsmanship and\ncreative expression. Rooted in centuries of tradition, Shibori is more than\njust a technique; it is a philosophy that embraces the beauty of imperfection\nand the harmony between nature and human touch. This makes each outcome raw\nand different from one another.\n\nThis experience is an appreciation of the art of slowing down, of modern-day\nsensibilities still being relevant through age-old techniques, and of finding\nbeauty and inspiration in all things that surround us.\n\n_**The experience includes trying your hand at 3 different Shibori techniques\nto create your own customised design on a piece of fabric, under the guidance\nof an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/shibori-tie-dye-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2750.00",
        "sku": "SHIBLR0230225"
      }
    ],
    "startDate": "2025-02-23T15:00:00+05:30",
    "endDate": "2025-02-23T17:00:00+05:30"
  },
  {
    "name": "Treasures From The Estates",
    "description": "Switch from coffee enthusiast to aficionado in this unique coffee appreciation\nexperience. Delve into the world of premium Indian Estate Coffees, and learn\nthe nuances of brewing and tasting single-origin brews, including a cold one.\n\nThis immersive experience helps you develop a keen sense of understanding\nabout unique Indian coffees and what makes them special. We will cover three\nbrewing methods - AeroPress, FrenchPress and Pour Over.\n\n**_Join us for the Brunch edit. Enjoy Trove’s signature coffee brewing\nexperience alongside a special breakfast menu curated by Chef Ashley of Monkey\nBar._**\n\nAttendees can opt for either a vegetarian or non-vegetarian set breakfast\nmenu, which will include all items mentioned below.\n\n  * **Veg Meal:** Chole Bhature, Mini Fruit Bowl, and Mini Muffin.\n  * **Non Veg Meal:** Mushroom & Cheese Omelette (with a slice of bread, butter & side salad), Mini Muesli Bowl, and Mini Muffin.\n\nFresh watermelon juice will be served to all attendees.\n\n",
    "url": "https://troveexperiences.com/products/coffee-brewing-and-tasting-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2750.00",
        "sku": "COFBLR230225"
      }
    ],
    "startDate": "2025-02-23T10:00:00+05:30",
    "endDate": "2025-02-23T12:30:00+05:30"
  },
  {
    "name": "Oasis Of Scents",
    "description": "An ode to the masterful craft of perfume making and the country's best noses,\nthis experience will have you develop a discerning sense of smell, understand\nthe nuances of perfumery as a science and art, as well as how fragrances\npassively contribute to our overall experiences to create a lasting memory.\n\n_**The experience includes navigating through various fragrance notes to\nformulate your own customised bottle of perfume, under the guidance of an\nexpert.**_  \n\n",
    "url": "https://troveexperiences.com/products/perfume-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3000.00",
        "sku": "PERBLR220225"
      }
    ],
    "startDate": "2025-02-22T11:00:00+05:30",
    "endDate": "2025-02-22T13:00:00+05:30"
  },
  {
    "name": "Treasures From The Estates",
    "description": "Switch from coffee enthusiast to aficionado in this unique coffee appreciation\nexperience. Delve into the world of premium Indian Estate Coffees, and learn\nthe nuances of brewing and tasting single-origin brews, including a cold one.\n\nThis immersive experience helps you develop a keen sense of understanding\nabout unique Indian coffees and what makes them special. We will cover three\nbrewing methods - AeroPress, FrenchPress and Pour Over.\n\n",
    "url": "https://troveexperiences.com/products/treasures-from-the-estates-1",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2400.00",
        "sku": "COFBLR010325"
      }
    ],
    "startDate": "2025-03-01T11:00:00+05:30",
    "endDate": "2025-03-01T13:00:00+05:30"
  }
]