[
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking and dining well, this experience helps you engage all\nfive senses when you're in the kitchen. The caviar on the top is relishing a\nwonderful meal that you, along with a bunch of people, will cook together.  \n  \n**_The theme of this cookalong is Neapolitan Pizza._**  \n\n  * **The cookalong** : Learn to make and stretch the Pizza Dough, assemble the pizza with toppings, taste different cheeses and the house sauce. Learn how to use a wood fired oven to bake pizzas.\n  * **The meal** : Virgin Mojito, the Pizza that you make, Dessert.\n\nNote: The cookalong includes vegetarian and non-vegetarian meal options.\n\n",
    "url": "https://troveexperiences.com/products/pizza-making-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "PIZBLR120725"
      }
    ],
    "startDate": "2025-07-12T10:00:00+05:30",
    "endDate": "2025-07-12T12:30:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Roxie",
      "address": "Sarjapur Road, Bangalore"
    }
  },
  {
    "name": "Echoes of Calm",
    "description": "The use of sound for healing dates back thousands of years to various ancient\ncultures. Indigenous peoples have long used drums, chanting, and other\ninstruments for ceremonial and therapeutic purposes. These practices were\noften tied to spiritual rituals and were believed to have healing properties.\n\nThis immersive sound bath experience is built on the enduring belief in the\npower of sound, and sets you on the path to healing, relaxation, and spiritual\ngrowth.\n\n",
    "url": "https://troveexperiences.com/products/sound-bathing-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "SOUBLR130725"
      }
    ],
    "startDate": "2025-07-13T14:30:00+05:30",
    "endDate": "2025-07-13T16:30:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Good Move Studios & Dance Academy - Koramangala",
      "address": "Bangalore"
    }
  },
  {
    "name": "Oasis Of Scents",
    "description": "An ode to the masterful craft of perfume making and the country's best noses,\nthis experience will have you develop a discerning sense of smell, understand\nthe nuances of perfumery as a science and art, as well as how fragrances\npassively contribute to our overall experiences to create a lasting memory.\n\n_**The experience includes navigating through various fragrance notes to\nformulate your own customised bottle of perfume, under the guidance of an\nexpert.**_  \n\n",
    "url": "https://troveexperiences.com/products/perfume-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3000.00",
        "sku": "PERBLR220625"
      }
    ],
    "startDate": "2025-07-20T11:00:00+05:30",
    "endDate": "2025-07-20T13:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Daysie",
      "address": "MG Road, Bangalore"
    }
  },
  {
    "name": "Spin City",
    "description": "While the origin story of pole art is multifaceted, spanning across multiple\ncultures and time periods, today pole dance is regarded as an art form\ncelebrated for its fusion of athleticism, grace, and creativity.\n\n_**This experience is an immersion into the art of pole movement, looking\nbeyond its association with strip clubs to embracing it as a wonderful way to\nmove and stay fit.**_\n\n",
    "url": "https://troveexperiences.com/products/spin-city-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "POLBLR130725"
      }
    ],
    "startDate": "2025-07-13T14:30:00+05:30",
    "endDate": "2025-07-13T16:30:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Azdah",
      "address": "Indiranagar, Bangalore"
    }
  },
  {
    "name": "The Gooey Goodness",
    "description": "A fortunate kitchen mishap in the early 1900s led to the creation of the\nbrownie—a dense, fudgy confection that soon became an American classic. This\ndelightful oversight of not including baking powder in a chocolate cake batter\nresulted in a delectable hybrid of cake and cookie, celebrated for its rich\nchocolate flavour and chewy texture.\n\nOver the decades, brownies evolved into a beloved staple in bakeries and homes\nalike. Bakers experimented with a variety of ingredients and flavours, from\nclassic nuts and caramel to modern twists like sea salt and espresso. Today,\nbrownies are an iconic comfort food enjoyed across continents, offering a\nrange of irresistible flavours and joy for people of all ages.\n\n**Join us on a delightful discovery behind baking the perfect brownies and\nlearn to create rich, delectable brownies from scratch. Enjoy a hands-on\nexperience that combines tradition with creativity, and savour the sweet\nrewards of your baking success in our Brownie Bakealong experience.**\n\n",
    "url": "https://troveexperiences.com/products/brownie-bake-along-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "BROBLR200725"
      }
    ],
    "startDate": "2025-07-19T10:30:00+05:30",
    "endDate": "2025-07-19T13:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Magnolia Bakery",
      "address": "St Mark's Road, Bangalore"
    }
  },
  {
    "name": "Polar Plunge",
    "description": "Cold plunges have a rich history, dating back to ancient civilisations like\nEgypt, Greece, and Rome, where it was revered for its healing properties.\nToday, this practice is globally recognised for its numerous therapeutic and\nwellness benefits.\n\nA cold plunge, also known as an ice bath, involves immersing the body in cold\nwater, typically at temperatures between 5-7°C, for a brief period. It is\nwidely used by athletes and fitness enthusiasts to aid recovery and enhance\nphysical and mental health.\n\n_**This immersive experience helps you take the plunge through a series of\nactivities, guided by an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/polar-plunge-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "ICEBLR220625"
      }
    ],
    "startDate": "2025-07-20T09:00:00+05:30",
    "endDate": "2025-07-20T11:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Runway 27",
      "address": "Yemalur, Off Old Airport Road, Bangalore"
    }
  },
  {
    "name": "Summit Seekers",
    "description": "Stemming from an age-old human desire to reach new heights, rock climbing is\nbeyond just a fitness ritual. This beginner-friendly rock climbing experience\ndraws inspiration from climbing pioneers, the unending human quest to problem-\nsolve better and design thinking to equip you with the skills and confidence\nto embark on your own climbing journey. Join us and discover a sport steeped\nin storytelling, where the upward journey is as beautiful as the summit.\n\n",
    "url": "https://troveexperiences.com/products/rock-climbing-in-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "ROCBLR130725"
      }
    ],
    "startDate": "2025-07-13T16:00:00+05:30",
    "endDate": "2025-07-13T18:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Svadhyaya's Learning Space",
      "address": "Jayanagar, Bangalore"
    }
  },
  {
    "name": "Glass Gardens",
    "description": "Imagine our world, shrunk to fit inside a bottle. In 19th century England, a\nchance encounter with a tenacious fern sparked an idea, that of a terrarium.\nToday, these self-sustaining havens encapsulate a tiny piece of the great\noutdoors, indoors, and are a testament to human ingenuity and nature's\nresilience.\n\n_**This immersive experience delves into the world of terrariums and plant\ncare. Participants get to make and take home their own terrarium.**_\n\n_**Note: Participants will create a Self-Sustaining Nature Terrarium in a Jar\nwith tropical plants.**_\n\n",
    "url": "https://troveexperiences.com/products/glass-gardens-make-your-own-terrarium-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "TERBLR130725"
      }
    ],
    "startDate": "2025-07-13T10:00:00+05:30",
    "endDate": "2025-07-13T12:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Suzy Q",
      "address": "Cunnigham Road, Bangalore"
    }
  }
]