[
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking and dining well, this experience helps you engage all\nfive senses when you're in the kitchen. The caviar on the top is relishing a\nwonderful meal that you, along with a bunch of people, will cook together.  \n  \n**_The theme of this cookalong is Neapolitan Pizza._**  \n\n  * **The cookalong** : Learn to make and stretch the Pizza Dough, assemble the pizza with toppings, taste different cheeses and the house sauce. Learn how to use a wood fired oven to bake pizzas.\n  * **The meal** : Virgin Mojito, the Pizza that you make, Dessert.\n\nNote: The cookalong includes vegetarian and non-vegetarian meal options.\n\n",
    "url": "https://troveexperiences.com/products/pizza-making-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "PIZBLR141224"
      }
    ],
    "startDate": "2024-12-14T10:00:00+05:30",
    "endDate": "2024-12-14T12:30:00+05:30"
  },
  {
    "name": "Wonders of Horology",
    "description": "Delve into the enchanting world of watchmaking, and gain a deeper\nunderstanding about the stellar craftsmanship and intricate detailing that go\ninto the making of luxe time pieces.\n\nThis experience will have you discover the nuanced art and science of watch-\nmaking, and help you look at time from a whole new perspective under the\nguidance of an expert horologist.\n\n_**The experience includes navigating through various components of Time\nMaking, the intricacies of Fine Watchmaking in an immersive visual journey\nunder the guidance of an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/horology-watch-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "HORBLR141224"
      }
    ],
    "startDate": "2024-12-14T16:00:00+05:30",
    "endDate": "2024-12-14T18:00:00+05:30"
  },
  {
    "name": "Legacy of Strength",
    "description": "For centuries, the warriors and wrestlers of ancient India harnessed the\npowers of tools like the _Gada_ and _Mudgar_ to forge extraordinary strength\nand endurance. These iconic tools, symbols of power and protection, were more\nthan mere weapons; they were instruments of physical and spiritual\ntransformation. Today, Tagda Raho brings this ancient tradition to life,\nseamlessly blending it with modern fitness science.\n\nBeyond physical strength, the fitness routine if practiced regularly,\ncultivates an instinctive understanding of your body's biomechanics. By honing\nyour body awareness, you can optimise your workouts, prevent injuries, and\nachieve lasting results.\n\n**_Join us for this beginner-friendly experience that explores the magic of\nmovement by delving into ancient wisdom for building endurance in today’s\ntimes of sedentary lifestyles._**\n\n",
    "url": "https://troveexperiences.com/products/tagda-raho-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "TAGBLR151224"
      }
    ],
    "startDate": "2024-12-15T08:30:00+05:30",
    "endDate": "2024-12-15T10:30:00+05:30"
  }
]