[
  {
    "name": "Chocolate Wonderland",
    "description": "Indulge in the world of premium couverture chocolates - the real deal - and\nget hands on with the basics of artisanal chocolate making.\n\nThis delightful experience will have you indulge in premium chocolate sourced\nfrom the best locations, and learn delectable chocolate recipes under the\nguidance of expert chocolatiers.\n\n",
    "url": "https://troveexperiences.com/products/chocolate-tasting-and-making-workshops-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2200.00",
        "sku": "CHOBLR160225"
      }
    ],
    "startDate": "2025-02-16T16:00:00+05:30",
    "endDate": "2025-02-16T18:00:00+05:30"
  },
  {
    "name": "Hula Harmony",
    "description": "A toy that was once designed for recreation, hula hooping gradually took the\nworld by a storm, starting with the United States in the late 1950s. Today\nhula hooping is not just a playful activity, but also a form of exercise and\nartistic expression. A cultural phenomenon, influencing music, fashion, and\ndance.\n\n**_This experience will involve a guided introduction to hula hooping, tricks\nand transitions and flow choreography through some fun activities!_**\n\n",
    "url": "https://troveexperiences.com/products/hula-hooping-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "1600.00",
        "sku": "HOOBLR160225"
      }
    ],
    "startDate": "2025-02-16T14:30:00+05:30",
    "endDate": "2025-02-16T16:30:00+05:30"
  },
  {
    "name": "The Art of Shibori",
    "description": "An ancient Japanese textile art form, Shibori embodies both craftsmanship and\ncreative expression. Rooted in centuries of tradition, Shibori is more than\njust a technique; it is a philosophy that embraces the beauty of imperfection\nand the harmony between nature and human touch. This makes each outcome raw\nand different from one another.\n\nThis experience is an appreciation of the art of slowing down, of modern-day\nsensibilities still being relevant through age-old techniques, and of finding\nbeauty and inspiration in all things that surround us.\n\n_**The experience includes trying your hand at 3 different Shibori techniques\nto create your own customised design on a piece of fabric, under the guidance\nof an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/shibori-tie-dye-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2750.00",
        "sku": "SHIBLR0230225"
      }
    ],
    "startDate": "2025-02-23T15:00:00+05:30",
    "endDate": "2025-02-23T17:00:00+05:30"
  },
  {
    "name": "The Craft of Mixology",
    "description": "Discover the world of cocktails and spirits and learn how to balance your own\ncocktail concoction under the guidance of expert mixologists.\n\nThe experience will include a quick introduction to different spirits,\ncocktail making techniques, bar equipment, interesting garnishing tips along\nwith various stories and myths around cocktails and spirits.\n\n",
    "url": "https://troveexperiences.com/products/cocktail-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "MIXBLR090225"
      }
    ],
    "startDate": "2025-02-09T16:00:00+05:30",
    "endDate": "2025-02-09T19:00:00+05:30"
  },
  {
    "name": "Oasis Of Scents",
    "description": "An ode to the masterful craft of perfume making and the country's best noses,\nthis experience will have you develop a discerning sense of smell, understand\nthe nuances of perfumery as a science and art, as well as how fragrances\npassively contribute to our overall experiences to create a lasting memory.\n\n_**The experience includes navigating through various fragrance notes to\nformulate your own customised bottle of perfume, under the guidance of an\nexpert.**_  \n\n",
    "url": "https://troveexperiences.com/products/perfume-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3000.00",
        "sku": "PERBLR220225"
      }
    ],
    "startDate": "2025-02-22T11:00:00+05:30",
    "endDate": "2025-02-22T13:00:00+05:30"
  },
  {
    "name": "Spin City",
    "description": "While the origin story of pole art is multifaceted, spanning across multiple\ncultures and time periods, today pole dance is regarded as an art form\ncelebrated for its fusion of athleticism, grace, and creativity.\n\n_**This experience is an immersion into the art of pole movement, looking\nbeyond its association with strip clubs to embracing it as a wonderful way to\nmove and stay fit.**_\n\n",
    "url": "https://troveexperiences.com/products/spin-city-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "POLBLR080225"
      }
    ],
    "startDate": "2025-02-08T12:30:00+05:30",
    "endDate": "2025-02-08T14:30:00+05:30"
  },
  {
    "name": "Aerial Playground",
    "description": "Inspired by ancient yogic traditions, Airo Yoga takes flight for the modern\nexplorer. Emerging in the 2000s, it reimagines classic poses with the playful\nfreedom of a custom-designed aerial hammock.\n\nAiro Yoga, a specific style within Aerial Yoga, incorporates the flowing\nsequences of Vinyasa yoga, the core control of Pilates, the thrill of\ninversions, and the playful connection of acro play. The result creates a\ntruly exhilarating and accessible practice that uses Eastern philosophies to\noffer a unique path to strength, mindfulness, and a joyful flight for all.\n\n",
    "url": "https://troveexperiences.com/products/airo-yoga-aerial-yoga-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "AERBLR080225"
      }
    ],
    "startDate": "2025-02-08T10:00:00+05:30",
    "endDate": "2025-02-08T12:00:00+05:30"
  },
  {
    "name": "The Gooey Goodness",
    "description": "A fortunate kitchen mishap in the early 1900s led to the creation of the\nbrownie—a dense, fudgy confection that soon became an American classic. This\ndelightful oversight of not including baking powder in a chocolate cake batter\nresulted in a delectable hybrid of cake and cookie, celebrated for its rich\nchocolate flavour and chewy texture.\n\nOver the decades, brownies evolved into a beloved staple in bakeries and homes\nalike. Bakers experimented with a variety of ingredients and flavours, from\nclassic nuts and caramel to modern twists like sea salt and espresso. Today,\nbrownies are an iconic comfort food enjoyed across continents, offering a\nrange of irresistible flavours and joy for people of all ages.\n\n**Join us on a delightful discovery behind baking the perfect brownies and\nlearn to create rich, delectable brownies from scratch. Enjoy a hands-on\nexperience that combines tradition with creativity, and savour the sweet\nrewards of your baking success in our Brownie Bakealong experience.**\n\n",
    "url": "https://troveexperiences.com/products/brownie-bake-along-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "BROBLR150225"
      }
    ],
    "startDate": "2025-02-15T10:00:00+05:30",
    "endDate": "2025-02-15T12:30:00+05:30"
  },
  {
    "name": "Summit Seekers",
    "description": "Stemming from an age-old human desire to reach new heights, rock climbing is\nbeyond just a fitness ritual. This beginner-friendly rock climbing experience\ndraws inspiration from climbing pioneers, the unending human quest to problem-\nsolve better and design thinking to equip you with the skills and confidence\nto embark on your own climbing journey. Join us and discover a sport steeped\nin storytelling, where the upward journey is as beautiful as the summit.\n\n",
    "url": "https://troveexperiences.com/products/summit-seekers-rock-climbing-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "ROCBLR160225"
      }
    ],
    "startDate": "2025-02-16T11:00:00+05:30",
    "endDate": "2025-02-16T13:00:00+05:30"
  },
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking and dining well, this experience helps you engage all\nfive senses when you're in the kitchen.\n\n**_The theme for this cookalong is Pasta-making._**\n\n  * **The cookalong** : Learn to make Pasta dough, 1 stuffed pasta , 1 flat pasta (Fettuccine). Learn how to knead the pasta dough, rest, roll and sheet out the dough into shapes.\n  * **The demonstration** : Pesto & Arabiatta sauce. \n\nParticipants will take home the pasta that is rolled out, with instructions on\nhow to cook it at home; you’ll also be sampling two pasta dishes which are\nmade at Toast & Tonic.\n\n",
    "url": "https://troveexperiences.com/products/pasta-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3000.00",
        "sku": "PASBLR160225"
      }
    ],
    "startDate": "2025-02-15T16:00:00+05:30",
    "endDate": "2025-02-15T18:00:00+05:30"
  }
]