[
  {
    "name": "The Art of Shibori",
    "description": "An ancient Japanese textile art form, Shibori embodies both craftsmanship and\ncreative expression. Rooted in centuries of tradition, Shibori is more than\njust a technique; it is a philosophy that embraces the beauty of imperfection\nand the harmony between nature and human touch. This makes each outcome raw\nand different from one another.\n\nThis experience is an appreciation of the art of slowing down, of modern-day\nsensibilities still being relevant through age-old techniques, and of finding\nbeauty and inspiration in all things that surround us.\n\n_**The experience includes trying your hand at 3 different Shibori techniques\nto create your own customised design on a piece of fabric, under the guidance\nof an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/shibori-tie-dye-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2750.00",
        "sku": "SHIBLR011224"
      }
    ],
    "startDate": "2024-11-30T12:00:00+05:30",
    "endDate": "2024-11-30T14:00:00+05:30"
  },
  {
    "name": "Echoes of Calm",
    "description": "The use of sound for healing dates back thousands of years to various ancient\ncultures. Indigenous peoples have long used drums, chanting, and other\ninstruments for ceremonial and therapeutic purposes. These practices were\noften tied to spiritual rituals and were believed to have healing properties.\n\nThis immersive sound bath experience is built on the enduring belief in the\npower of sound, and sets you on the path to healing, relaxation, and spiritual\ngrowth.\n\n",
    "url": "https://troveexperiences.com/products/sound-bathing-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "SOUBLR101124"
      }
    ],
    "startDate": "2024-12-08T14:30:00+05:30",
    "endDate": "2024-12-08T16:30:00+05:30"
  },
  {
    "name": "Oasis Of Scents",
    "description": "An ode to the masterful craft of perfume making and the country's best noses,\nthis experience will have you develop a discerning sense of smell, understand\nthe nuances of perfumery as a science and art, as well as how fragrances\npassively contribute to our overall experiences to create a lasting memory.\n\n_**The experience includes navigating through various fragrance notes to\nformulate your own customised bottle of perfume, under the guidance of an\nexpert.**_  \n\n",
    "url": "https://troveexperiences.com/products/perfume-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3000.00",
        "sku": "PERBLR081224"
      }
    ],
    "startDate": "2024-12-08T11:00:00+05:30",
    "endDate": "2024-12-08T13:00:00+05:30"
  },
  {
    "name": "Spin City",
    "description": "While the origin story of pole art is multifaceted, spanning across multiple\ncultures and time periods, today pole dance is regarded as an art form\ncelebrated for its fusion of athleticism, grace, and creativity.\n\n_**This experience is an immersion into the art of pole movement, looking\nbeyond its association with strip clubs to embracing it as a wonderful way to\nmove and stay fit.**_\n\n",
    "url": "https://troveexperiences.com/products/spin-city-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "POLBLR071224"
      }
    ],
    "startDate": "2024-12-07T12:30:00+05:30",
    "endDate": "2024-12-07T14:30:00+05:30"
  }
]