[
  {
    "name": "Oasis Of Scents - Artisanal Perfume Making",
    "description": "An ode to the masterful craft of perfume making and the country's best noses,\nthis experience will have you develop a discerning sense of smell, understand\nthe nuances of perfumery as a science and art, as well as how fragrances\npassively contribute to our overall experiences to create a lasting memory.\n\n_**The experience includes navigating through various fragrance notes to\nformulate your own customised bottle of perfume, under the guidance of an\nexpert.**_  \n\n",
    "url": "https://troveexperiences.com/products/perfume-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3000.00",
        "sku": "PERBLR220625"
      }
    ],
    "startDate": "2025-12-13T11:00:00+05:30",
    "endDate": "2025-12-13T13:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Hyatt Centric",
      "address": "Hebbal, Bangalore"
    }
  },
  {
    "name": "Flavours of Thailand - A Thai Cookalong Experience",
    "description": "At the heart of Thai cooking lies balance not just of flavours, but of\nphilosophy. Every dish is guided by the principle of harmony, where sweet,\nsour, spicy, salty and bitter notes come together without overpowering one\nanother. It’s this balance that gives Thai cuisine its unmistakable depth and\nglobal appeal.****\n\n**In this experience, you’ll step into this world of layered flavours and\ntextures through a guided cookalong led by a culinary expert. Learn how to\nbuild dishes that feel balanced as you make classics like Pad Thai, Pad Kra\nPao (Basil Chicken), and Mango Sticky Rice and sit down to enjoy a meal that\nreminds you why Thai cuisine has captured hearts (and appetites) across the\nworld.**\n\n",
    "url": "https://troveexperiences.com/products/thai-cooklong-for-begginers-in-bangalaore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3200.00",
        "sku": "RAMBLR130725"
      }
    ],
    "startDate": "2025-12-13T11:00:00+05:30",
    "endDate": "2025-12-13T13:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Bruar School of Baking & Culinary Arts",
      "address": "Shivajinagar, Bangalore"
    }
  },
  {
    "name": "The Espresso Lab - Crafting Barista-Style Beverages - Christmas Edit",
    "description": "As India’s love for coffee grows, so does the curiosity about the craft. At\nthe heart of almost every coffee beverage we love sits the espresso - a small,\nintense and richly layered shot of finely ground coffee that will fascinate\nevery kind of coffee drinker.  \n\nIt may look like a small, simple shot of coffee. But espresso is one of the\nmost complex brews in the world - a result of timing, pressure, and grind\ncoming together in just a few quick seconds.\n\nIn this hands-on experience powered by Häfele, step into the shoes of a\nbarista and explore the science behind espresso. Pull your own shots using\n**Häfele’s U-Kaffee Plus espresso machines** , taste the difference between\nunder, over and perfectly extracted brews, and craft three **Christmas themed\nbeverages - ⁠Dark Chocolate Orange Mocha, ⁠Ginger Bread Latte and Plum Cake\nLatte.**\n\n",
    "url": "https://troveexperiences.com/products/christmas-themed-espresso-brewing-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "ESPHYD90625"
      }
    ],
    "startDate": "2025-12-13T11:00:00+05:30",
    "endDate": "2025-12-13T13:30:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Hafele Design Center",
      "address": "Langford Road, Bangalore"
    }
  },
  {
    "name": "Art of the Alley - Graffiti Through the Ages",
    "description": "A form of unbounded artistic expression or an act of rebellion - Graffiti been\nraising the same questions for the thousands of years that it has been around.\n\nUncover the rebellious roots of graffiti and its journey to mainstream\nrecognition. This hands-on graffiti making experience includes learning and\npractising the art on a life-size canvas, guided by stories of iconic pieces\nand artists, who revolutionised the art form.  \n\n",
    "url": "https://troveexperiences.com/products/learn-the-art-of-graffiti-in-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "GRFBLR130725"
      }
    ],
    "startDate": "2025-12-14T15:00:00+05:30",
    "endDate": "2025-12-14T17:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Runway 27",
      "address": "Yemalur, Off Old Airport Road, Bangalore"
    }
  },
  {
    "name": "Echoes of Calm - An Immersive Sound Bath Experience",
    "description": "The use of sound for healing dates back thousands of years to various ancient\ncultures. Indigenous peoples have long used drums, chanting, and other\ninstruments for ceremonial and therapeutic purposes. These practices were\noften tied to spiritual rituals and were believed to have healing properties.\n\nThis immersive sound bath experience is built on the enduring belief in the\npower of sound, and sets you on the path to healing, relaxation, and spiritual\ngrowth.\n\n",
    "url": "https://troveexperiences.com/products/echoes-of-calm",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "SOUBLR130725"
      }
    ],
    "startDate": "2025-12-14T15:00:00+05:30",
    "endDate": "2025-12-14T17:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "DizzyDuck Yoga Studio",
      "address": "Koramangla, Bangalore"
    }
  },
  {
    "name": "The Soul's Palette - An Introduction to Textured Art - Christmas Edit",
    "description": "Tracing its roots to prehistoric cave paintings, textured art began when early\nhumans used natural pigments, clay and ash to create tactile, layered visuals\non rock walls. Over centuries, this instinct to add depth evolved as seen in\neverything from Renaissance frescoes to Van Gogh’s impasto strokes.\n\n  \n\nIn the 20th century, textured art came into its own, as artists began\nexperimenting with fabric, sand, paper and found objects to push beyond the\nflat canvas. Today, it spans styles from abstract and expressionism to realism\nand surrealism each piece layered with depth, feeling and character.\n\n  \n\nJoin our experience and explore the sensory richness of texture as you sculpt,\nlayer and paint a **Christmas themed textured art piece** that’s entirely your\nown. Let your creativity flow freely onto a canvas that’s tactile, expressive\nand personal.\n\n",
    "url": "https://troveexperiences.com/products/christmas-themed-texture-art-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "TEXBLR210625"
      }
    ],
    "startDate": "2025-12-14T16:00:00+05:30",
    "endDate": "2025-12-14T18:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Social",
      "address": "Koramangla, Bangalore"
    }
  },
  {
    "name": "Spin City - The Artistry of Pole",
    "description": "While the origin story of pole art is multifaceted, spanning across multiple\ncultures and time periods, today pole dance is regarded as an art form\ncelebrated for its fusion of athleticism, grace, and creativity.\n\n_**This experience is an immersion into the art of pole movement, looking\nbeyond its association with strip clubs to embracing it as a wonderful way to\nmove and stay fit.**_\n\n",
    "url": "https://troveexperiences.com/products/spin-city-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "POLBLR130725"
      }
    ],
    "startDate": "2025-12-20T14:30:00+05:30",
    "endDate": "2025-12-20T16:30:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Azdah",
      "address": "Indiranagar, Bangalore"
    }
  },
  {
    "name": "Hula Harmony - Explore Movement Through Hooping",
    "description": "A toy that was once designed for recreation, hula hooping gradually took the\nworld by a storm, starting with the United States in the late 1950s. Today\nhula hooping is not just a playful activity, but also a form of exercise and\nartistic expression. A cultural phenomenon, influencing music, fashion, and\ndance.\n\n**_This experience will involve a guided introduction to hula hooping, tricks\nand transitions and flow choreography through some fun activities!_**\n\n",
    "url": "https://troveexperiences.com/products/hula-hooping-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "1600.00",
        "sku": "HOOBLR050725"
      }
    ],
    "startDate": "2025-12-21T14:30:00+05:30",
    "endDate": "2025-12-21T16:30:00+05:30",
    "location": {
      "@type": "Place",
      "name": "DizzyDuck Yoga Studio",
      "address": "Koramangla, Bangalore"
    }
  },
  {
    "name": "The Craft of Mixology - Making & Mastering A Fine Cocktail",
    "description": "Discover the world of cocktails and spirits and learn how to balance your own\ncocktail concoction under the guidance of expert mixologists.\n\nThe experience will include a quick introduction to different spirits,\ncocktail making techniques, bar equipment, interesting garnishing tips along\nwith various stories and myths around cocktails and spirits.\n\n",
    "url": "https://troveexperiences.com/products/cocktail-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "MIXBLR080625"
      }
    ],
    "startDate": "2025-12-21T16:00:00+05:30",
    "endDate": "2025-12-21T19:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Siren - Cocktail Bar",
      "address": "Lavelle Road, Bangalore"
    }
  },
  {
    "name": "Art In Fragments - A Mosaic Art Experience - Christmas Edit",
    "description": "What would you do with broken tiles, leftover glass or scraps of pottery?\n\n5,000 years ago, people pieced them together to decorate walls and ceilings,\nbreathe new life into spaces and tell stories that lasted centuries and they\nstill hold value today. That’s the beauty of mosaics: tiny pieces (tesserae)\ncome together to create patterns and pictures that seem almost magical from a\ndistance.\n\n****  \n\nStep into this vibrant world with our Mosaic Art experience. Explore this\ncenturies-old craft and with step-by-step guidance from an expert, **create\nyour own Christmas-themed mosaic masterpiece** while gaining a deeper\nappreciation for this timeless art form.\n\n",
    "url": "https://troveexperiences.com/products/christmas-themed-mosaic-art-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3000.00",
        "sku": "MOSBLR02"
      }
    ],
    "startDate": "2025-12-20T16:00:00+05:30",
    "endDate": "2025-12-20T18:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Street Storyss",
      "address": "Indiranagar, Bangalore"
    }
  },
  {
    "name": "The Crafted Spread - A Hands-On Cheese Grazing Table Experience - Christmas Edit",
    "description": "For as long as humans have gathered, food has been the centerpiece of\ncommunity. It has always reflected culture, care and the spirit of sharing.\n\nGrazing tables carry that spirit into today. More than a display of food,\nthey’re an expression of creativity and detail that elevates the simplest food\ninto something intentional and crafted.\n\n**This experience explores the craft of building thoughtful Christmas-themed\ncheese grazing tables. Discover how presentation shapes perception, arranging\nbecomes an act of hosting and how small details make a table truly\nmemorable.**\n\n",
    "url": "https://troveexperiences.com/products/christmas-themed-cheese-grazing-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3000.00",
        "sku": "CHSBLR200725"
      }
    ],
    "startDate": "2025-12-21T15:00:00+05:30",
    "endDate": "2025-12-21T17:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Dolci",
      "address": "Lavelle Road, Bangalore"
    }
  },
  {
    "name": "The Way of Flowers - Flower Arrangement Experience - Christmas Edit",
    "description": "Arranging flowers is one of the simplest ways to bring beauty into a space,\nyet the craft becomes truly special when you slow down and create with\nintention.\n\nIn this experience, you’ll explore how balance, colour, texture, height and\nnegative space come together to form a thoughtful arrangement. Each stem, leaf\nand bloom is placed with purpose, and the final composition naturally reflects\nthe person creating it, their mood, their style, their sense of the season.\n\n**Step into a calm, meditative setting and be guided by an expert in the\ncraft. With the Christmas spirit in the air, you’ll work with festive reds and\ngreens, dried elements and seasonal accents to shape an arrangement from your\nown perspective. Finish the session by styling an elegant tablescape designed\nfor holiday hosting.**\n\n",
    "url": "https://troveexperiences.com/products/christmas-themed-flower-arrangement-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2600.00",
        "sku": "FLOBLR130725"
      }
    ],
    "startDate": "2025-12-21T11:00:00+05:30",
    "endDate": "2025-12-21T13:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Suzy Q",
      "address": "Cunnigham Road, Bangalore"
    }
  }
]