[
  {
    "name": "Gourmet Cookalong - A Community Cooking & Dining Experience",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking and dining well, this experience helps you engage all\nfive senses when you're in the kitchen. The caviar on the top is relishing a\nwonderful meal that you, along with a bunch of people, will cook together.  \n  \n**_The theme of this cookalong is Neapolitan Pizza._**  \n\n  * **The cookalong** : Learn to make and stretch the Pizza Dough, assemble the pizza with toppings, taste different cheeses and the house sauce. Learn how to use a wood fired oven to bake pizzas.\n  * **The meal** : Virgin Mojito, the Pizza that you make, Dessert.\n\nNote: The cookalong includes vegetarian and non-vegetarian meal options.\n\n",
    "url": "https://troveexperiences.com/products/pizza-making-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "PIZBLR120725"
      }
    ],
    "startDate": "2025-09-13T10:00:00+05:30",
    "endDate": "2025-09-13T12:30:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Roxie",
      "address": "Sarjapur Road, Bangalore"
    }
  },
  {
    "name": "The Dawn of Dough - Exploring Breads from Around the World",
    "description": "It all began thousands of years ago, when crushed grains mixed with water met\nfire and the first flatbreads were born. In ancient Egypt, an accidental\nfermentation led to fluffy loaves, turning bread into a staple of\ncivilization. From India’s tandoor to Greek clay ovens, baking soon became an\nart form.\n\nBy the Middle Ages, bread fed both the masses and the elite, with hearty\nloaves for everyday people and soft, rich breads for royal feasts. The\nIndustrial Revolution brought machines, transforming bread into a global\nphenomenon.Today, bread is more than a food - it's culture on a plate. From\ntangy sourdough to chewy naan and crusty baguette, every bite tells a story of\nevolution, resilience, and creativity.\n\n_**Step into the world of breads and learn the art of making piadina\nsandwiches and hand-rolled bagels while exploring their rich histories.\nImmerse yourself in the cultural journey of bread in this experience.**_  \n\n_**Note: The experience includes only eggless options.**_\n\n",
    "url": "https://troveexperiences.com/products/the-dawn-of-dough-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "BREBLR180525"
      }
    ],
    "startDate": "2025-09-13T11:00:00+05:30",
    "endDate": "2025-09-13T13:30:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Milano Bakery Cafe",
      "address": "Indiranagar, Bangalore"
    }
  },
  {
    "name": " The Golden Shot - An Espresso Brewing Experience",
    "description": "Switch from coffee enthusiast to aficionado in this unique coffee appreciation\nexperience. Delve into the world of coffee and discover the nuances of brewing\nand tasting across different roast profiles.\n\nStep behind the counter and learn to pull a great espresso shot. Discover what\nsets great coffees apart as you explore grind sizes, brewing pressures, and\nthe art of espresso extraction. Get hands-on with professional gear and taste\nthe difference in every pour.\n\n**Note: Each participant makes an espresso shot and creates latte art on their\nCappuccino**  \n\n",
    "url": "https://troveexperiences.com/products/treasures-from-the-estates-espresso-edit-in-banaglore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2200.00",
        "sku": "ESPHYD90625"
      }
    ],
    "startDate": "2025-09-13T14:00:00+05:30",
    "endDate": "2025-09-13T16:30:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Daily Bakehouse",
      "address": "Cunningham Road, Bangalore"
    }
  },
  {
    "name": "Chocolate Wonderland - Bean-to-Bar Chocolate Making & Tasting",
    "description": "Indulge in the world of premium couverture chocolates - the real deal - and\nget hands on with the basics of artisanal chocolate making.\n\nThis delightful experience will have you indulge in premium chocolate sourced\nfrom the best locations, and learn delectable chocolate recipes under the\nguidance of expert chocolatiers.\n\n",
    "url": "https://troveexperiences.com/products/chocolate-tasting-and-making-workshops-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2200.00",
        "sku": "CHOBLR160225"
      }
    ],
    "startDate": "2025-09-13T15:00:00+05:30",
    "endDate": "2025-09-13T17:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Chocolate Philosophy",
      "address": "RT Nagar, Bangalore"
    }
  },
  {
    "name": "Oasis Of Scents - Artisanal Perfume Making",
    "description": "An ode to the masterful craft of perfume making and the country's best noses,\nthis experience will have you develop a discerning sense of smell, understand\nthe nuances of perfumery as a science and art, as well as how fragrances\npassively contribute to our overall experiences to create a lasting memory.\n\n_**The experience includes navigating through various fragrance notes to\nformulate your own customised bottle of perfume, under the guidance of an\nexpert.**_  \n\n",
    "url": "https://troveexperiences.com/products/perfume-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3000.00",
        "sku": "PERBLR220625"
      }
    ],
    "startDate": "2025-09-14T11:00:00+05:30",
    "endDate": "2025-09-14T13:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "The Biere Club",
      "address": "Ashok Nagar, Bangalore"
    }
  },
  {
    "name": "Hula Harmony - Explore Movement Through Hooping",
    "description": "A toy that was once designed for recreation, hula hooping gradually took the\nworld by a storm, starting with the United States in the late 1950s. Today\nhula hooping is not just a playful activity, but also a form of exercise and\nartistic expression. A cultural phenomenon, influencing music, fashion, and\ndance.\n\n**_This experience will involve a guided introduction to hula hooping, tricks\nand transitions and flow choreography through some fun activities!_**\n\n",
    "url": "https://troveexperiences.com/products/hula-hooping-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "1600.00",
        "sku": "HOOBLR050725"
      }
    ],
    "startDate": "2025-09-14T14:30:00+05:30",
    "endDate": "2025-09-14T16:30:00+05:30",
    "location": {
      "@type": "Place",
      "name": "DizzyDuck Yoga studio",
      "address": "Koramangla"
    }
  },
  {
    "name": "Layers of Decadence - A Tiramisu Making Experience",
    "description": "Tiramisu, meaning \"pick me up\" in Italian, was crafted to be as uplifting as\nits name suggests. Some myths trace it back to the 17th century, when a\nsimilar dessert called Duke’s Soup was made for Grand Duke Cosimo III de’\nMedici, but the tiramisu we know today took shape much later.\n\nOriginally more of a custard than a cake, tiramisu evolved into its signature\nlayered form, with espresso-soaked biscuits and creamy mascarpone. Over the\nyears, it has become a global favourite, loved for its rich yet airy texture\nand simple, no-bake process.\n\n_**Join our Tiramisu Making Experience and master the art of crafting this\nclassic Italian dessert from scratch. Learn key techniques, from achieving the\nperfect mascarpone texture to balancing flavors, and assemble your tiramisu\nstep by step. Take home your handcrafted treat to enjoy and share.**_  \n\n_**Note: The experience includes egg/eggless options.**_\n\n",
    "url": "https://troveexperiences.com/products/tiramisu-making-in-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "TIRBLR150625"
      }
    ],
    "startDate": "2025-09-28T11:30:00+05:30",
    "endDate": "2025-09-28T13:30:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Lumara Bar & Kitchen",
      "address": "MG Road, Bangalore"
    }
  }
]