[
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking and dining well, this experience helps you engage all\nfive senses when you're in the kitchen. The caviar on the top is relishing a\nwonderful meal that you, along with a bunch of people, will cook together.  \n  \n**_The theme of this cookalong is Neapolitan Pizza._**  \n\n  * **The cookalong** : Learn to make and stretch the Pizza Dough, assemble the pizza with toppings, taste different cheeses and the house sauce. Learn how to use a wood fired oven to bake pizzas.\n  * **The meal** : Virgin Mojito, the Pizza that you make, Dessert.\n\nNote: The cookalong includes vegetarian and non-vegetarian meal options.\n\n",
    "url": "https://troveexperiences.com/products/pizza-making-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "PIZBLR010225"
      }
    ],
    "startDate": "2025-02-01T10:00:00+05:30",
    "endDate": "2025-02-01T12:30:00+05:30"
  },
  {
    "name": "The Craft of Mixology",
    "description": "Discover the world of cocktails and spirits and learn how to balance your own\ncocktail concoction under the guidance of expert mixologists.\n\nThe experience will include a quick introduction to different spirits,\ncocktail making techniques, bar equipment, interesting garnishing tips along\nwith various stories and myths around cocktails and spirits.\n\n",
    "url": "https://troveexperiences.com/products/cocktail-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "MIXBLR090225"
      }
    ],
    "startDate": "2025-02-09T16:00:00+05:30",
    "endDate": "2025-02-09T19:00:00+05:30"
  },
  {
    "name": "Echoes of Calm",
    "description": "The use of sound for healing dates back thousands of years to various ancient\ncultures. Indigenous peoples have long used drums, chanting, and other\ninstruments for ceremonial and therapeutic purposes. These practices were\noften tied to spiritual rituals and were believed to have healing properties.\n\nThis immersive sound bath experience is built on the enduring belief in the\npower of sound, and sets you on the path to healing, relaxation, and spiritual\ngrowth.\n\n",
    "url": "https://troveexperiences.com/products/sound-bathing-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "SOUBLR050125"
      }
    ],
    "startDate": "2025-02-02T14:30:00+05:30",
    "endDate": "2025-02-02T16:30:00+05:30"
  },
  {
    "name": "Oasis Of Scents",
    "description": "An ode to the masterful craft of perfume making and the country's best noses,\nthis experience will have you develop a discerning sense of smell, understand\nthe nuances of perfumery as a science and art, as well as how fragrances\npassively contribute to our overall experiences to create a lasting memory.\n\n_**The experience includes navigating through various fragrance notes to\nformulate your own customised bottle of perfume, under the guidance of an\nexpert.**_  \n\n",
    "url": "https://troveexperiences.com/products/perfume-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3000.00",
        "sku": "PERBLR220225"
      }
    ],
    "startDate": "2025-02-22T11:00:00+05:30",
    "endDate": "2025-02-22T13:00:00+05:30"
  },
  {
    "name": "Spin City",
    "description": "While the origin story of pole art is multifaceted, spanning across multiple\ncultures and time periods, today pole dance is regarded as an art form\ncelebrated for its fusion of athleticism, grace, and creativity.\n\n_**This experience is an immersion into the art of pole movement, looking\nbeyond its association with strip clubs to embracing it as a wonderful way to\nmove and stay fit.**_\n\n",
    "url": "https://troveexperiences.com/products/spin-city-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "POLBLR080225"
      }
    ],
    "startDate": "2025-02-08T12:30:00+05:30",
    "endDate": "2025-02-08T14:30:00+05:30"
  },
  {
    "name": "Treasures From The Estates",
    "description": "Switch from coffee enthusiast to aficionado in this unique coffee appreciation\nexperience. Delve into the world of premium Indian Estate Coffees, and learn\nthe nuances of brewing and tasting single-origin brews, including a cold one.\n\nThis immersive experience helps you develop a keen sense of understanding\nabout unique Indian coffees and what makes them special. We will cover three\nbrewing methods - AeroPress, FrenchPress and Pour Over.\n\n",
    "url": "https://troveexperiences.com/products/treasures-from-the-estates-1",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2400.00",
        "sku": "COFBLR010225"
      }
    ],
    "startDate": "2025-02-01T11:00:00+05:30",
    "endDate": "2025-02-01T13:00:00+05:30"
  }
]