[
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking and dining well, this experience helps you engage all\nfive senses when you're in the kitchen. The caviar on the top is relishing a\nwonderful meal that you, along with a bunch of people, will cook together.  \n  \n**_The theme of this cookalong is Neapolitan Pizza._**  \n\n  * **The cookalong** : Learn to make and stretch the Pizza Dough, assemble the pizza with toppings, taste different cheeses and the house sauce. Learn how to use a wood fired oven to bake pizzas.\n  * **The meal** : Virgin Mojito, the Pizza that you make, Dessert.\n\nNote: The cookalong includes vegetarian and non-vegetarian meal options.\n\n",
    "url": "https://troveexperiences.com/products/pizza-making-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "PIZBLR141224"
      }
    ],
    "startDate": "2024-12-14T10:00:00+05:30",
    "endDate": "2024-12-14T12:30:00+05:30"
  },
  {
    "name": "Echoes of Calm",
    "description": "The use of sound for healing dates back thousands of years to various ancient\ncultures. Indigenous peoples have long used drums, chanting, and other\ninstruments for ceremonial and therapeutic purposes. These practices were\noften tied to spiritual rituals and were believed to have healing properties.\n\nThis immersive sound bath experience is built on the enduring belief in the\npower of sound, and sets you on the path to healing, relaxation, and spiritual\ngrowth.\n\n",
    "url": "https://troveexperiences.com/products/sound-bathing-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "SOUBLR101124"
      }
    ],
    "startDate": "2024-12-08T14:30:00+05:30",
    "endDate": "2024-12-08T16:30:00+05:30"
  },
  {
    "name": "Oasis Of Scents",
    "description": "An ode to the masterful craft of perfume making and the country's best noses,\nthis experience will have you develop a discerning sense of smell, understand\nthe nuances of perfumery as a science and art, as well as how fragrances\npassively contribute to our overall experiences to create a lasting memory.\n\n_**The experience includes navigating through various fragrance notes to\nformulate your own customised bottle of perfume, under the guidance of an\nexpert.**_  \n\n",
    "url": "https://troveexperiences.com/products/perfume-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3000.00",
        "sku": "PERBLR081224"
      }
    ],
    "startDate": "2024-12-08T11:00:00+05:30",
    "endDate": "2024-12-08T13:00:00+05:30"
  },
  {
    "name": "Wonders of Horology",
    "description": "Delve into the enchanting world of watchmaking, and gain a deeper\nunderstanding about the stellar craftsmanship and intricate detailing that go\ninto the making of luxe time pieces.\n\nThis experience will have you discover the nuanced art and science of watch-\nmaking, and help you look at time from a whole new perspective under the\nguidance of an expert horologist.\n\n_**The experience includes navigating through various components of Time\nMaking, the intricacies of Fine Watchmaking in an immersive visual journey\nunder the guidance of an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/horology-watch-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "HORBLR141224"
      }
    ],
    "startDate": "2024-12-14T16:00:00+05:30",
    "endDate": "2024-12-14T18:00:00+05:30"
  },
  {
    "name": "Spin City",
    "description": "While the origin story of pole art is multifaceted, spanning across multiple\ncultures and time periods, today pole dance is regarded as an art form\ncelebrated for its fusion of athleticism, grace, and creativity.\n\n_**This experience is an immersion into the art of pole movement, looking\nbeyond its association with strip clubs to embracing it as a wonderful way to\nmove and stay fit.**_\n\n",
    "url": "https://troveexperiences.com/products/spin-city-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "POLBLR071224"
      }
    ],
    "startDate": "2024-12-07T12:30:00+05:30",
    "endDate": "2024-12-07T14:30:00+05:30"
  },
  {
    "name": "Legacy of Strength",
    "description": "For centuries, the warriors and wrestlers of ancient India harnessed the\npowers of tools like the _Gada_ and _Mudgar_ to forge extraordinary strength\nand endurance. These iconic tools, symbols of power and protection, were more\nthan mere weapons; they were instruments of physical and spiritual\ntransformation. Today, Tagda Raho brings this ancient tradition to life,\nseamlessly blending it with modern fitness science.\n\nBeyond physical strength, the fitness routine if practiced regularly,\ncultivates an instinctive understanding of your body's biomechanics. By honing\nyour body awareness, you can optimise your workouts, prevent injuries, and\nachieve lasting results.\n\n**_Join us for this beginner-friendly experience that explores the magic of\nmovement by delving into ancient wisdom for building endurance in today’s\ntimes of sedentary lifestyles._**\n\n",
    "url": "https://troveexperiences.com/products/tagda-raho-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "TAGBLR151224"
      }
    ],
    "startDate": "2024-12-15T08:30:00+05:30",
    "endDate": "2024-12-15T10:30:00+05:30"
  }
]