[
  {
    "name": "Hula Harmony",
    "description": "A toy that was once designed for recreation, hula hooping gradually took the\nworld by a storm, starting with the United States in the late 1950s. Today\nhula hooping is not just a playful activity, but also a form of exercise and\nartistic expression. A cultural phenomenon, influencing music, fashion, and\ndance.\n\n**_This experience will involve a guided introduction to hula hooping, tricks\nand transitions and flow choreography through some fun activities!_**\n\n",
    "url": "https://troveexperiences.com/products/hula-hooping-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "1600.00",
        "sku": "HOOBLR280924"
      }
    ],
    "startDate": "2024-09-28T09:15:00+05:30",
    "endDate": "2024-09-28T11:15:00+05:30"
  },
  {
    "name": "The Craft of Mixology",
    "description": "Discover the world of cocktails and spirits and learn how to balance your own\ncocktail concoction under the guidance of expert mixologists.\n\nThe experience will include a quick introduction to different spirits,\ncocktail making techniques, bar equipment, interesting garnishing tips along\nwith various stories and myths around cocktails and spirits.\n\n",
    "url": "https://troveexperiences.com/products/cocktail-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "MIXBLR290924"
      }
    ],
    "startDate": "2024-09-29T16:00:00+05:30",
    "endDate": "2024-09-29T19:00:00+05:30"
  },
  {
    "name": "Spin City",
    "description": "While the origin story of pole art is multifaceted, spanning across multiple\ncultures and time periods, today pole dance is regarded as an art form\ncelebrated for its fusion of athleticism, grace, and creativity.\n\n_**This experience is an immersion into the art of pole movement, looking\nbeyond its association with strip clubs to embracing it as a wonderful way to\nmove and stay fit.**_\n\n",
    "url": "https://troveexperiences.com/products/spin-city-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2000.00",
        "sku": "POLBLR051024"
      }
    ],
    "startDate": "2024-10-05T16:00:00+05:30",
    "endDate": "2024-10-05T18:00:00+05:30"
  },
  {
    "name": "Gourmet Cookalong",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking and dining well, this experience helps you engage all\nfive senses when you're in the kitchen. The caviar on the top is relishing a\nwonderful meal that you, along with a bunch of people, will cook together.  \n  \n  \n**_The theme for this cookalong is Japanese cuisine - Sushi making. _**\n\n  * **The cookalong** :\n\n**Observe:** Our expert will demonstrate how to roll three types of sushi from\nscratch: Maki, uramaki, and temaki sushi.  \n\n**Make Your Own Sushi:** Learn to make four types of sushi from scratch using\nvarious fillings and rolling styles, as demonstrated by the chef and savour\nthem.\n\n_Note:_ The cookalong and the meal will include both vegetarian (exotic\nvegetables and yasai vegetables) and non-vegetarian (salmon and crab) options.\n\nAdditionally, all guests will be served asparagus tempura and pickled\nvegetables.\n\n",
    "url": "https://troveexperiences.com/products/gourmet-cookalong-make-your-sushi-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "SUSBLR280924"
      }
    ],
    "startDate": "2024-09-28T16:30:00+05:30",
    "endDate": "2024-09-28T19:00:00+05:30"
  },
  {
    "name": "The Gooey Goodness",
    "description": "A fortunate kitchen mishap in the early 1900s led to the creation of the\nbrownie—a dense, fudgy confection that soon became an American classic. This\ndelightful oversight of not including baking powder in a chocolate cake batter\nresulted in a delectable hybrid of cake and cookie, celebrated for its rich\nchocolate flavour and chewy texture.\n\nOver the decades, brownies evolved into a beloved staple in bakeries and homes\nalike. Bakers experimented with a variety of ingredients and flavours, from\nclassic nuts and caramel to modern twists like sea salt and espresso. Today,\nbrownies are an iconic comfort food enjoyed across continents, offering a\nrange of irresistible flavours and joy for people of all ages.\n\n**Join us on a delightful discovery behind baking the perfect brownies and\nlearn to create rich, delectable brownies from scratch. Enjoy a hands-on\nexperience that combines tradition with creativity, and savour the sweet\nrewards of your baking success in our Brownie Bakealong experience.**\n\n",
    "url": "https://troveexperiences.com/products/brownie-bake-along-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2400.00",
        "sku": "BROBLR290924"
      }
    ],
    "startDate": "2024-09-29T10:30:00+05:30",
    "endDate": "2024-09-29T13:00:00+05:30"
  }
]