[
  {
    "name": "Gourmet Cookalong - A Community Cooking & Dining Experience",
    "description": "Drawing inspiration from community dining and the pleasures of deep diving\ninto the art of cooking and dining well, this experience helps you engage all\nfive senses when you're in the kitchen. The caviar on the top is relishing a\nwonderful meal that you, along with a bunch of people, will cook together.  \n  \n**_The theme of this cookalong is Neapolitan Pizza._**  \n\n  * **The cookalong** : Learn to make and stretch the Pizza Dough, assemble the pizza with toppings, taste different cheeses and the house sauce. Learn how to use a wood fired oven to bake pizzas.\n  * **The meal** : Virgin Mojito, the Pizza that you make, Dessert.\n\nNote: The cookalong includes vegetarian and non-vegetarian meal options.\n\n",
    "url": "https://troveexperiences.com/products/pizza-making-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "PIZBLR120725"
      }
    ],
    "startDate": "2025-08-16T10:00:00+05:30",
    "endDate": "2025-08-16T12:30:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Roxie",
      "address": "Sarjapur Road, Bangalore"
    }
  },
  {
    "name": "The Art of Shibori - An Introduction to Japanese Tie Dye",
    "description": "An ancient Japanese textile art form, Shibori embodies both craftsmanship and\ncreative expression. Rooted in centuries of tradition, Shibori is more than\njust a technique; it is a philosophy that embraces the beauty of imperfection\nand the harmony between nature and human touch. This makes each outcome raw\nand different from one another.\n\nThis experience is an appreciation of the art of slowing down, of modern-day\nsensibilities still being relevant through age-old techniques, and of finding\nbeauty and inspiration in all things that surround us.\n\n_**The experience includes trying your hand at 3 different Shibori techniques\nto create your own customised design on a piece of fabric, under the guidance\nof an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/shibori-tie-dye-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2750.00",
        "sku": "SHIBLR260325"
      }
    ],
    "startDate": "2025-08-23T15:00:00+05:30",
    "endDate": "2025-08-23T17:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "The Brown Table",
      "address": "Sadashivnagar, Bangalore"
    }
  },
  {
    "name": "The Craft of Mixology - Making & Mastering A Fine Cocktail",
    "description": "Discover the world of cocktails and spirits and learn how to balance your own\ncocktail concoction under the guidance of expert mixologists.\n\nThe experience will include a quick introduction to different spirits,\ncocktail making techniques, bar equipment, interesting garnishing tips along\nwith various stories and myths around cocktails and spirits.\n\n",
    "url": "https://troveexperiences.com/products/cocktail-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "MIXBLR080625"
      }
    ],
    "startDate": "2025-08-23T16:00:00+05:30",
    "endDate": "2025-08-23T19:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Siren - Cocktail Bar",
      "address": "Lavelle Road, Bangalore"
    }
  },
  {
    "name": "Echoes of Calm - An Immersive Sound Bath Experience",
    "description": "The use of sound for healing dates back thousands of years to various ancient\ncultures. Indigenous peoples have long used drums, chanting, and other\ninstruments for ceremonial and therapeutic purposes. These practices were\noften tied to spiritual rituals and were believed to have healing properties.\n\nThis immersive sound bath experience is built on the enduring belief in the\npower of sound, and sets you on the path to healing, relaxation, and spiritual\ngrowth.\n\n",
    "url": "https://troveexperiences.com/products/sound-bathing-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "SOUBLR130725"
      }
    ],
    "startDate": "2025-08-23T17:00:00+05:30",
    "endDate": "2025-08-23T19:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Angadi Heritage",
      "address": "Ashoka Pillar Road, Bangalore"
    }
  },
  {
    "name": "Oasis Of Scents - Artisanal Perfume Making",
    "description": "An ode to the masterful craft of perfume making and the country's best noses,\nthis experience will have you develop a discerning sense of smell, understand\nthe nuances of perfumery as a science and art, as well as how fragrances\npassively contribute to our overall experiences to create a lasting memory.\n\n_**The experience includes navigating through various fragrance notes to\nformulate your own customised bottle of perfume, under the guidance of an\nexpert.**_  \n\n",
    "url": "https://troveexperiences.com/products/perfume-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3000.00",
        "sku": "PERBLR220625"
      }
    ],
    "startDate": "2025-08-24T11:00:00+05:30",
    "endDate": "2025-08-24T13:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Hyatt Centric",
      "address": "Hebbal, Bangalore"
    }
  },
  {
    "name": "A Mini Indulgence - A Cupcake Baking & Icing Experience",
    "description": "Cupcakes first appeared in 1796 when Amelia Simmons’ cookbook referenced “a\nlight cake to bake in small cups.” What started as a practical way to portion\nbatter soon evolved into a global favourite, with flavours and techniques\nreflecting diverse cultures.\n\nOnce a simple teatime treat, these portable cakes have taken over bakeries,\ncelebrations, and social media, transforming into edible art with intricate\npiping, vibrant colours, and rich flavours. Innovations in baking have led to\nthe infusion of jams, chocolates, and creams into these treats while\npreserving their delicate texture.\n\n**Immerse yourself in a hands-on Cupcake Baking & Icing Experience, and\nexplore the art of baking light, fluffy cupcakes from scratch. Learn expert\ntechniques for icing with precision and creativity, all while indulging in\ndelightful treats that complement and elevate your creations.**  \n\n**Note: The experience includes only eggless option.**\n\n",
    "url": "https://troveexperiences.com/products/a-mini-indulgence-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "CUPBLR280325"
      }
    ],
    "startDate": "2025-08-17T10:30:00+05:30",
    "endDate": "2025-08-17T13:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Magnolia Bakery",
      "address": "St Mark's Road, Bangalore"
    }
  }
]