[
  {
    "name": "The Art of Shibori - An Introduction to Japanese Tie Dye",
    "description": "An ancient Japanese textile art form, Shibori embodies both craftsmanship and\ncreative expression. Rooted in centuries of tradition, Shibori is more than\njust a technique; it is a philosophy that embraces the beauty of imperfection\nand the harmony between nature and human touch. This makes each outcome raw\nand different from one another.\n\nThis experience is an appreciation of the art of slowing down, of modern-day\nsensibilities still being relevant through age-old techniques, and of finding\nbeauty and inspiration in all things that surround us.\n\n_**The experience includes trying your hand at 3 different Shibori techniques\nto create your own customised design on a piece of fabric, under the guidance\nof an expert.**_\n\n",
    "url": "https://troveexperiences.com/products/shibori-tie-dye-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2750.00",
        "sku": "SHIBLR260325"
      }
    ],
    "startDate": "2025-08-23T15:00:00+05:30",
    "endDate": "2025-08-23T17:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "The Brown Table",
      "address": "Sadashivnagar, Bangalore"
    }
  },
  {
    "name": "The Craft of Mixology - Making & Mastering A Fine Cocktail",
    "description": "Discover the world of cocktails and spirits and learn how to balance your own\ncocktail concoction under the guidance of expert mixologists.\n\nThe experience will include a quick introduction to different spirits,\ncocktail making techniques, bar equipment, interesting garnishing tips along\nwith various stories and myths around cocktails and spirits.\n\n",
    "url": "https://troveexperiences.com/products/cocktail-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3500.00",
        "sku": "MIXBLR080625"
      }
    ],
    "startDate": "2025-08-23T16:00:00+05:30",
    "endDate": "2025-08-23T19:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Siren - Cocktail Bar",
      "address": "Lavelle Road, Bangalore"
    }
  },
  {
    "name": "Echoes of Calm - An Immersive Sound Bath Experience",
    "description": "The use of sound for healing dates back thousands of years to various ancient\ncultures. Indigenous peoples have long used drums, chanting, and other\ninstruments for ceremonial and therapeutic purposes. These practices were\noften tied to spiritual rituals and were believed to have healing properties.\n\nThis immersive sound bath experience is built on the enduring belief in the\npower of sound, and sets you on the path to healing, relaxation, and spiritual\ngrowth.\n\n",
    "url": "https://troveexperiences.com/products/sound-bathing-experience-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "SOUBLR130725"
      }
    ],
    "startDate": "2025-08-23T17:00:00+05:30",
    "endDate": "2025-08-23T19:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Angadi Heritage",
      "address": "Ashoka Pillar Road, Bangalore"
    }
  },
  {
    "name": "Oasis Of Scents - Artisanal Perfume Making",
    "description": "An ode to the masterful craft of perfume making and the country's best noses,\nthis experience will have you develop a discerning sense of smell, understand\nthe nuances of perfumery as a science and art, as well as how fragrances\npassively contribute to our overall experiences to create a lasting memory.\n\n_**The experience includes navigating through various fragrance notes to\nformulate your own customised bottle of perfume, under the guidance of an\nexpert.**_  \n\n",
    "url": "https://troveexperiences.com/products/perfume-making-workshop-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "3000.00",
        "sku": "PERBLR220625"
      }
    ],
    "startDate": "2025-08-24T11:00:00+05:30",
    "endDate": "2025-08-24T13:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Hyatt Centric",
      "address": "Hebbal, Bangalore"
    }
  },
  {
    "name": "Layers of Decadence - A Tiramisu Making Experience",
    "description": "Tiramisu, meaning \"pick me up\" in Italian, was crafted to be as uplifting as\nits name suggests. Some myths trace it back to the 17th century, when a\nsimilar dessert called Duke’s Soup was made for Grand Duke Cosimo III de’\nMedici, but the tiramisu we know today took shape much later.\n\nOriginally more of a custard than a cake, tiramisu evolved into its signature\nlayered form, with espresso-soaked biscuits and creamy mascarpone. Over the\nyears, it has become a global favourite, loved for its rich yet airy texture\nand simple, no-bake process.\n\n_**Join our Tiramisu Making Experience and master the art of crafting this\nclassic Italian dessert from scratch. Learn key techniques, from achieving the\nperfect mascarpone texture to balancing flavors, and assemble your tiramisu\nstep by step. Take home your handcrafted treat to enjoy and share.**_  \n\n_**Note: The experience includes egg/eggless options.**_\n\n",
    "url": "https://troveexperiences.com/products/tiramisu-making-in-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "TIRBLR150625"
      }
    ],
    "startDate": "2025-08-31T11:30:00+05:30",
    "endDate": "2025-08-31T13:30:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Lumara Bar & Kitchen",
      "address": "MG Road, Bangalore"
    }
  },
  {
    "name": "Glass Gardens - A Terrarium Making Experience",
    "description": "Imagine our world, shrunk to fit inside a bottle. In 19th century England, a\nchance encounter with a tenacious fern sparked an idea, that of a terrarium.\nToday, these self-sustaining havens encapsulate a tiny piece of the great\noutdoors, indoors, and are a testament to human ingenuity and nature's\nresilience.\n\n_**This immersive experience delves into the world of terrariums and plant\ncare. Participants get to make and take home their own terrarium.**_\n\n_**Note: Participants will create a closed Terrarium in a Jar with tropical\nplants.**_\n\n",
    "url": "https://troveexperiences.com/products/glass-gardens-make-your-own-terrarium-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "TERBLR130725"
      }
    ],
    "startDate": "2025-08-31T11:00:00+05:30",
    "endDate": "2025-08-31T13:00:00+05:30",
    "location": {
      "@type": "Place",
      "name": "Cahoots Classic Bar House",
      "address": "Brigade Road, Bangalore"
    }
  }
]