[
  {
    "name": "Treasures From The Estates",
    "description": "Switch from coffee enthusiast to aficionado in this unique coffee appreciation\nexperience. Delve into the world of premium Indian Estate Coffees, and learn\nthe nuances of brewing and tasting single-origin brews, including a cold one.\n\nThis immersive experience helps you develop a keen sense of understanding\nabout unique Indian coffees and what makes them special. We will cover three\nbrewing methods - AeroPress, FrenchPress and Pour Over.\n\n**_Join us for the Brunch edit. Enjoy Trove’s signature coffee brewing\nexperience alongside a special breakfast menu curated by Chef Ashley of Monkey\nBar._**\n\nAttendees can opt for either a vegetarian or non-vegetarian set breakfast\nmenu, which will include all items mentioned below.\n\n  * **Veg Meal:** Chole Bhature, Mini Fruit Bowl, and Mini Muffin.\n  * **Non Veg Meal:** Mushroom & Cheese Omelette (with a slice of bread, butter & side salad), Mini Muesli Bowl, and Mini Muffin.\n\nFresh watermelon juice will be served to all attendees.\n\n",
    "url": "https://troveexperiences.com/products/coffee-brewing-and-tasting-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2750.00",
        "sku": "COFBLR030525"
      }
    ],
    "startDate": "2025-05-04T10:00:00+05:30",
    "endDate": "2025-05-04T12:30:00+05:30"
  },
  {
    "name": "Layers of Decadence",
    "description": "Tiramisu, meaning \"pick me up\" in Italian, was crafted to be as uplifting as\nits name suggests. Some myths trace it back to the 17th century, when a\nsimilar dessert called Duke’s Soup was made for Grand Duke Cosimo III de’\nMedici, but the tiramisu we know today took shape much later.\n\nOriginally more of a custard than a cake, tiramisu evolved into its signature\nlayered form, with espresso-soaked biscuits and creamy mascarpone. Over the\nyears, it has become a global favourite, loved for its rich yet airy texture\nand simple, no-bake process.\n\n_**Join our Tiramisu Making Experience and master the art of crafting this\nclassic Italian dessert from scratch. Learn key techniques, from achieving the\nperfect mascarpone texture to balancing flavors, and assemble your tiramisu\nstep by step. Take home your handcrafted treat to enjoy and share.**_  \n\n",
    "url": "https://troveexperiences.com/products/tiramisu-making-in-bangalore",
    "offers": [
      {
        "@type": "Offer",
        "priceCurrency": "INR",
        "price": "2500.00",
        "sku": "TIRBLR040525"
      }
    ],
    "startDate": "2025-05-04T11:30:00+05:30",
    "endDate": "2025-05-04T13:30:00+05:30"
  }
]