[
  {
    "title": "Vineeth Srinivasan Live",
    "subtitle": "A Musical Journey",
    "cost": "₹399 onwards",
    "datetime": "13th July 7:00 PM - 10:00 PM",
    "venue": "Phoenix Marketcity",
    "event_id": "39523",
    "location": "Palm Meadows, Prestige Ozone, Whitefield Main Road, Whitefield, Devasandra Industrial Estate, Krishnarajapura",
    "description": "Join us for an unforgettable evening with Vineeth Srinivasan on 13th July 2024 at Phoenix Marketcity, Whitefield. Presented by Noizz Entertainment in association with Sia Entertainment, this concert promises to be a musical extravaganza.  Vineeth Srinivasan is a celebrated figure in the Indian music industry, renowned for his contributions to Indian cinema. Not only a star in the Malayalam music scene, Vineeth is also a multilingual singer, captivating audiences with songs in Tamil, Telugu, and Hindi. His melodic richness and emotional depth have made him a beloved artist!  Experience his famous hits like \"Karale\" from Ustad Hotel, \"Anuraagam\" from Thattathin Marayathu, \"Akaleyo Nee\" from Urumi, \"Thangamey\" from Naanum Rowdy Dhaan, and \"Mental Madhilo\" from Okka Kshanam. Don't miss this chance to see Vineeth Srinivasan live and witness his versatile talent firsthand!",
    "share_url": "https://zoma.to/live-event/39523",
    "start": "2024-07-13T19:00:00+05:30",
    "end": "2024-07-13T22:00:00+05:30"
  },
  {
    "title": "Karaoke Nights",
    "subtitle": "Ft KJ Naveen",
    "cost": "Free entry",
    "datetime": "26th June 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "39577",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Have you ever let your inner bathroom singer play for the rest of the world?\r\nIf not, our Karaoke Nights are the perfect opportunity to let loose and sing like no one is watching with a group of people who care about your passion of singing and want to share it with you.\r\nBring your friends and family to Hard Rock Cafe, Bengaluru for an unforgettable Karaoke night.",
    "share_url": "https://zoma.to/live-event/39577",
    "start": "2024-06-26T20:30:00+05:30",
    "end": "2024-06-26T23:00:00+05:30"
  },
  {
    "title": "Classic Rock",
    "subtitle": "ft. Sunny",
    "cost": "₹249 onwards",
    "datetime": "27th June 9:00 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "39578",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Sunny Band will be performing live at Hard Rock Cafe, Bengaluru. Join us for an evening of fantastic music, delectable cuisine, and cool cocktails. So get your tickets now for an unforgettable night of rock & roll!",
    "share_url": "https://zoma.to/live-event/39578",
    "start": "2024-06-27T21:00:00+05:30",
    "end": "2024-06-27T23:00:00+05:30"
  },
  {
    "title": "Boogie Nights",
    "subtitle": "Ft Prashu",
    "cost": "Free entry",
    "datetime": "28th June 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "39579",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Make some noise and have fun, since the music gets two times better when a DJ lifts his hands in the air. Every Friday night, starting at 8:30 p.m., Hard Rock Cafe, Bengaluru is happy to host DJ PRASHU and his incredible sounds for the musically charged Blockbusters. Prepare to party and enjoy the evening with excellent food, live music, and cool drinks.",
    "share_url": "https://zoma.to/live-event/39579",
    "start": "2024-06-28T20:30:00+05:30",
    "end": "2024-06-28T23:00:00+05:30"
  },
  {
    "title": "Rock Out Sundays",
    "subtitle": "Ft Franky Paul",
    "cost": "Free entry",
    "datetime": "30th June 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "39580",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Make some noise and have fun, since the music gets two times better when a DJ lifts his hands in the air. Starting at 8:30 p.m., Hard Rock Cafe, Bengaluru is happy to host DJ FRANKY and his incredible sounds for the musically charged Blockbusters.\r\nPrepare to party and enjoy the evening with excellent food, live music, and cool drinks.",
    "share_url": "https://zoma.to/live-event/39580",
    "start": "2024-06-30T20:30:00+05:30",
    "end": "2024-06-30T23:00:00+05:30"
  },
  {
    "title": "Karaoke Nights",
    "subtitle": "Ft KJ Naveen",
    "cost": "Free entry",
    "datetime": "27th June 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "39678",
    "location": "Unit G 25 & 26, Ground Floor, Park Square Mall, International Tech Park, Pattandur Agrahara, Whitefield",
    "description": "Have you ever let your inner bathroom singer play for the rest of the world?\r\nIf not, our Karaoke Nights are the perfect opportunity to let loose and sing like no one is watching with a group of people who care about your passion of singing and want to share it with you.\r\nBring your friends and family to Hard Rock Cafe, Whitefield, Bengaluru for an unforgettable Karaoke night",
    "share_url": "https://zoma.to/live-event/39678",
    "start": "2024-06-27T20:30:00+05:30",
    "end": "2024-06-27T23:00:00+05:30"
  },
  {
    "title": "Blockbuster Friday",
    "subtitle": "FT. DJ Franky",
    "cost": "Free entry",
    "datetime": "28th June 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "39679",
    "location": "Unit G 25 & 26, Ground Floor, Park Square Mall, International Tech Park, Pattandur Agrahara, Whitefield",
    "description": "Make some noise and have fun, since the music gets two times better when a DJ lifts his hands in the air.\r\nEvery Friday night, starting at 8:30 p.m., Hard Rock Cafe Whitefield Bengaluru is happy to host DJ FRANKY and his incredible sounds for the musically charged Blockbusters.\r\nPrepare to party and enjoy the evening with excellent food, live music, and cool drinks.",
    "share_url": "https://zoma.to/live-event/39679",
    "start": "2024-06-28T20:30:00+05:30",
    "end": "2024-06-28T23:00:00+05:30"
  },
  {
    "title": "Ankita's Brother : A Stand Up Show By Anmol Garg",
    "subtitle": "Come & meet the Corporate Babaji",
    "cost": "₹399 onwards",
    "datetime": "12th July 8:00 PM - 11:00 PM",
    "venue": "The Underground Comedy Club",
    "event_id": "40716",
    "location": "Building No.480, KHB Colony, 5th Block, Koramangala",
    "description": "Tired of your corporate job?\r\n\r\nConfused about what to do in life?\r\nEver felt lost?\r\n\r\nIf yes, this show is for you!\r\n\r\nAnmol Garg, popularly known as Corporate Babaji, brings to you his theme based set Ankita`s Brother where he shares with you his life story and answers the million dollar question How to find your passion?\r\n\r\nThis is going to be 1 hour of non-stop laughter!\r\nIn short, he`ll help you forget about your corporate job :P",
    "share_url": "https://zoma.to/live-event/40716",
    "start": "2024-07-12T20:00:00+05:30",
    "end": "2024-07-12T23:00:00+05:30"
  },
  {
    "title": "DGTL Bengaluru 2024",
    "subtitle": "DGTL returns to Bengaluru to recreate the magic and experience you’ve been waiting for",
    "cost": "₹3650 onwards",
    "datetime": "9th to 10th November 2:00 PM onwards",
    "venue": "Jayamahal Palace",
    "event_id": "40858",
    "location": "1, Jayamahal Main Rd, near Cantonment Railway Station Road, Nandi Durga Road Extension, Jayamahal",
    "description": "DGTL India 2023 saw over 15,000 attendees across 3 days enjoying world-class techno and electronic music, stunning lighting and stage designs, conceptual showcases, and vital sustainability initiatives, resulting in an immersive, audio-visual experience.\r\nBook your tickets now to secure your spot for this year!\r\nDGTL is a global electronic music festival with editions in Amsterdam, Santiago (Chile), São Paulo (Brazil), Bengaluru & Mumbai, and during the Amsterdam Dance Event. Besides its focus on music, DGTL features unique art installations and exciting sustainability projects. Its sustainability program sets it apart in the festival landscape.\r\nImportant Note: No entry without a wristband. If you lose, damage, remove, or tamper with your tickets/wristbands, no replacements will be issued, and entry will not be allowed.",
    "share_url": "https://zoma.to/live-event/40858"
  },
  {
    "title": "Hues of Harmony ft. Priyanka NK",
    "subtitle": "Live in Concert!",
    "cost": "₹699 onwards",
    "datetime": "13th July 7:00 PM - 10:00 PM",
    "venue": "Nexus Shantiniketan",
    "event_id": "40919",
    "location": "Whitefield Main Rd, Thigalarapalya, Krishnarajapuram",
    "description": "From classic hits to contemporary favourites, Priyanka NK will enchant you with her soulful singing.\r\n\r\nPriyanka NK is an Indian playback singer known for her captivating vocals and versatile performances. With a passion for music from a young age, Priyanka honed her skills and rose to prominence in the Indian music industry. She has mesmerized audiences with her soulful renditions across various genres, including Tamil, Telugu, and Kannada. Over the years, Priyanka NK has collaborated with leading music composers and singers, delivering chart-topping hits and unforgettable melodies.\r\n\r\nWith a repertoire that spans across languages and genres, Priyanka NK continues to enchant audiences with her soul-stirring performances, leaving an indelible mark on the world of music.",
    "share_url": "https://zoma.to/live-event/40919",
    "start": "2024-07-13T19:00:00+05:30",
    "end": "2024-07-13T22:00:00+05:30"
  },
  {
    "title": "Punchliners Comedy Show ft Biswa Kalyan Rath",
    "subtitle": "Laugh Out Loud with Biswa Live at Ecoworld Amphitheater!",
    "cost": "₹943 onwards",
    "datetime": "30th June 7:00 PM - 8:15 PM",
    "venue": "Ecoworld",
    "event_id": "41760",
    "location": "RMZ Ecospace, Adarsh Palm Retreat, Bellandur, Bengaluru",
    "description": "Don't wait in lines to hear great jokes! Book your tickets now for Biswa Kalyan Rath live at Ecoworld Amphitheater, Bangalore. Get ready for an evening filled with laughter as Biswa tickles your funny bone with his unique humor and witty observations. Known for his sharp comedy and relatable jokes, this event is a must-see for all comedy enthusiasts. Join us for a night of non-stop entertainment and hilarious moments you won't forget!",
    "share_url": "https://zoma.to/live-event/41760",
    "start": "2024-06-30T19:00:00+05:30",
    "end": "2024-06-30T20:15:00+05:30"
  },
  {
    "title": "Skandagiri Sunrise / Night Trek",
    "subtitle": "Witness the magnificent view of clouds with sunrise",
    "cost": "₹4500 onwards",
    "datetime": "28th to 30th June 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "41778",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Skandagiri, also known as Kalwarbetta or Kalavara Durga, is a mountain fortress 70 km from Bangalore. This rewarding 8 km trek, completed in about 4 hours, takes you through the wilderness to a stunning sunrise view. The moderately difficult trek is perfect for thrill-seekers, with a challenging climb starting from the Papagni Temple, leading through dense shrubs and steep terrains. At the summit, you'll find the ruins of Tipu Sultan’s fortress and an abandoned fort. Skandagiri is famous for offering the experience of walking above the clouds.",
    "share_url": "https://zoma.to/live-event/41778"
  },
  {
    "title": "Bandajje waterfalls trek",
    "subtitle": "Discover Bandaje Falls: A Trekker's Hidden Paradise",
    "cost": "₹4000 onwards",
    "datetime": "28th to 30th June 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "41785",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Situated in the Charmadi Ghats area of the western ghats, this offbeat trail to Bandaje waterfalls is one of the must-do treks when in Bangalore. The journey takes you through magnificent meadows, river streams, and lush green forests, all of which are a delight to behold. Embark on this exciting trek and see the beauty for yourself.",
    "share_url": "https://zoma.to/live-event/41785"
  },
  {
    "title": "Kodachadri Trek & Jog falls",
    "subtitle": "Highlights of Nagara fort and Jog falls",
    "cost": "₹4500 onwards",
    "datetime": "28th to 30th June 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "41789",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Brace yourself to find the breathtaking panoramic view of the Kodachadri Hills in Valur, Karnataka. The 1343-meter altitude where the hills are situated has a dense forest around. Every year the peak is explored by thousands of people. Whet your stamina to climb the tricky terrains on this 2-day trekking trip from Bangalore and reach the top of the hill where you will be able to grasp the enormous stretches of the Western Ghats.\r\n\r\nThe plethora of natural spectacle in Kodachadri won’t be ending. Visit Hidlumane Waterfalls on your trip in addition to your tour of Nagara Fort as well, along with Jog Falls",
    "share_url": "https://zoma.to/live-event/41789"
  },
  {
    "title": "Ettina Bhuja Trek",
    "subtitle": "Ettina Bhuja: Trek to Panoramic Views in Nature's Lap",
    "cost": "₹3500 onwards",
    "datetime": "28th to 30th June 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "41791",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Ettina Bhuja (literally translates to Ox’s Shoulder, in Kannada), is located close to the temple town of Dharmasthala. Byrapura village in Mudigere range of Chickmagalur district to be exact. About 250km from Bangalore, it makes for a good weekend trip away from the hustle and bustle of the city.\r\n\r\nAlthough it’s not a popular trail among trekkers, Ettina Bhuja offers scenic landscapes at about 1300m altitude and features a mosaic of grassland and forest patches in undulating terrain. One can find bamboo and cane plantations on the way to the top. Trek along this pleasant terrain to the sound of chirping birds in the lap of nature.\r\n\r\nOnce you reach the top which looks like the hump of an ox, feast yourself to panoramic views of dense green forests.",
    "share_url": "https://zoma.to/live-event/41791"
  },
  {
    "title": "Tadiandamol trek",
    "subtitle": "Conquer Tadiandamol: Coorg's Pinnacle of Natural Beauty",
    "cost": "₹3600 onwards",
    "datetime": "28th to 30th June 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "41794",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Coorg in South Karnataka is considered the natural vista refreshing the minds of many with an amazing collection of greenery and related sights of the mighty Western Ghats. The replenishing nature, tricky terrains, thickly wooded slopes, and misty valleys have attracted thousands of travelers and trekkers. Tadiandamol is the highest peak in Coorg and is surrounded by stunning greenery of the Shola forests. It reaches an elevation of 1,748 m.\r\n\r\nEnjoy unraveling the winsome landscape of Coorg that lures several travelers. Once on top, feel the pride as you conquer the highest peak of the destination. This feat is rewarded with sweeping views of green forests and coffee plantations.",
    "share_url": "https://zoma.to/live-event/41794"
  },
  {
    "title": "Dudhsagar Trek",
    "subtitle": "Trek Dudhsagar: Witness Goa's Majestic 'Sea of Milk'",
    "cost": "₹4950 onwards",
    "datetime": "28th to 30th June 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "41797",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Head out on an adventurous trek to Dudhsagar falls, located on the eastern hinges of Goa’s border. Dudhsagar Falls, also known as the ‘Sea of Milk’, is a four-tiered waterfall located on the Mandovi River in the exotic, fun-loving state of Goa. The intimidating Dudhsagar Falls is amongst India’s tallest waterfalls with a height of 310m(1017 feet) and an average width of 30m (100 feet).\r\n\r\nOn your trek here, you will discover that the falls is located comfortably in the Bhagwan Mahaveer Sanctuary and Mollem National Park amongst the Western ghats and forms the border between Karnataka and Goa states. The area is surrounded by thick deciduous forests and has a rich and diverse bio-diversity that you can witness whilst on your exciting two-day trek.",
    "share_url": "https://zoma.to/live-event/41797"
  },
  {
    "title": "Night camping, trek & activities @Ramanagar",
    "subtitle": "Explore Ramanagara: Climb Ancient Granite Outcrops",
    "cost": "₹1750 onwards",
    "datetime": "28th to 30th June 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "41799",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Ramanagara is approximately 50 km southwest of Bangalore. It has an average elevation of 747 metres (2450 feet). Ramanagara is famous for the huge rocky outcroppings.\r\nThis region has several tall granitic hills which are famous for many short rock climbs, typically 1 to 2 pitches in length. Grades vary from 5.8 American to 5.11 American. It is home to some of the world`s oldest granite outcrops. Ramdevarabetta showing the cave entrances made for the film Passage to India. Another well-known hill is Ramadevarabetta.\r\nTrek Distance: 4 Km Level of Trek: Moderate",
    "share_url": "https://zoma.to/live-event/41799"
  },
  {
    "title": "CrossOver ft. Martin Roth",
    "subtitle": "Event by: Centigrade",
    "cost": "Free entry",
    "datetime": "7th July 7:00 PM - 1:00 AM",
    "venue": "Sunburn Union",
    "event_id": "41899",
    "location": "Mantri Avenue, Koramangala 6th Block, Bangalore",
    "description": "Excitement fills us as we bring the Anjunadeep spearhead MARTIN ROTH to Bangalore, marking its inaugural appearance at Sunburn Union for our CrossOver Showcase this July. 🍾",
    "share_url": "https://zoma.to/live-event/41899",
    "start": "2024-07-07T19:00:00+05:30",
    "end": "2024-07-08T01:00:00+05:30"
  },
  {
    "title": "Floral Lagoon",
    "subtitle": "Anyone Can Paint",
    "cost": "₹1999 onwards",
    "datetime": "29th June 4:00 PM - 6:00 PM",
    "venue": "Paint The Town Cafe",
    "event_id": "42042",
    "location": "No. 101, 1st floor, Money Center, 7th Block, Koramangala",
    "description": "Join our Sip & Paint Party! We’ve got all the art supplies, a yummy meal, and a chance to meet new friends. Our artists will help you paint, and it’s a relaxed way to have a good time. Come to Paint The Town Art Cafe for a simple and enjoyable afternoon of art, food, and friendly chats.",
    "share_url": "https://zoma.to/live-event/42042",
    "start": "2024-06-29T16:00:00+05:30",
    "end": "2024-06-29T18:00:00+05:30"
  },
  {
    "title": "Rainbow Moonrise",
    "subtitle": "Anyone Can Paint",
    "cost": "₹1999 onwards",
    "datetime": "30th June 1:00 PM - 3:00 PM",
    "venue": "Paint The Town Cafe",
    "event_id": "42043",
    "location": "No. 101, 1st floor, Money Center, 7th Block, Koramangala",
    "description": "Join our Sip & Paint Party! We’ve got all the art supplies, a yummy meal, and a chance to meet new friends. Our artists will help you paint, and it’s a relaxed way to have a good time. Come to Paint The Town Art Cafe for a simple and enjoyable afternoon of art, food, and friendly chats.",
    "share_url": "https://zoma.to/live-event/42043",
    "start": "2024-06-30T13:00:00+05:30",
    "end": "2024-06-30T15:00:00+05:30"
  },
  {
    "title": "Punchliners Comedy Show ft Maheep Singh",
    "subtitle": "A Punchliners Comedy Show",
    "cost": "₹399 onwards",
    "datetime": "30th June 4:00 PM - 5:15 PM",
    "venue": "Just BLR",
    "event_id": "42055",
    "location": "1st Floor, Deena Complex, Opp Mc Donald, Brigade Road",
    "description": "Join us for a night of laughter at the Punchliners Comedy Show featuring the hilarious Maheep Singh! Known for his witty observations and sharp humor, Maheep Singh will take you on a rollercoaster of laughs with his unique style and relatable jokes. Whether you're a comedy enthusiast or just looking for a fun evening, this show promises to keep you entertained. Don't miss out on an unforgettable night filled with humor and joy. Grab your tickets now for an evening of non-stop laughter!",
    "share_url": "https://zoma.to/live-event/42055",
    "start": "2024-06-30T16:00:00+05:30",
    "end": "2024-06-30T17:15:00+05:30"
  },
  {
    "title": "Tala | A Classical Musical Show",
    "subtitle": "Carnatic, Hindustani and More",
    "cost": "₹99 onwards",
    "datetime": "30th June 5:00 PM - 7:00 PM",
    "venue": "Someyathi",
    "event_id": "42330",
    "location": "2nd floor, #10, Padma Lakshmi Vilasa, 1st cross, 1st main, Vallabha nagara, Bengaluru, Karnataka 560061",
    "description": "Join us for an enchanting evening celebrating the rich heritage of Indian classical music. This event will feature masterful performances by talented musicians, showcasing the timeless beauty of ragas and talas. Immerse yourself in the soulful rhythms and intricate melodies that have been passed down through generations. \r\n\r\nWhether you are a lifelong aficionado or a curious newcomer, this evening promises to captivate your senses and transport you to the heart of Indian classical tradition.\r\n\r\nThis event has 4 classical music open mic performances and 4 curated performances. Each performance is for around 8-10 minutes. Before every performance, the host shall describe the roots, meaning and story behind the raag. A short break in between is planned to network with the musicians and other audience. ",
    "share_url": "https://zoma.to/live-event/42330",
    "start": "2024-06-30T17:00:00+05:30",
    "end": "2024-06-30T19:00:00+05:30"
  },
  {
    "title": "LIL MIC | A Open Mic for Kids",
    "subtitle": "Step into a world of wonder and watch as young stars ignite the stage with their boundless creativity and infectious energy at dowithlit's Lil Mic! ",
    "cost": "₹99 onwards",
    "datetime": "7th July 5:00 PM - 7:00 PM",
    "venue": "Pops of Pastel",
    "event_id": "42351",
    "location": "1st Floor, No. 53, 1st Floor, Shree Chambers, Subbarama Chetty Road, Nettakallappa Cir, above Karnataka Bank ATM, Basavanagudi, Bengaluru, Karnataka 560004",
    "description": "Hello Bengaluru!\r\nCalling all young superstars-in-the-making! Get ready to rock the mic and light up the stage at our famed open mics, now for kids🌟🎤 It's an explosion of talent as kids aged 5-13 unleash their inner rockstars, comedians, poets, and everything in between! With each act more electrifying than the last, this event is a rollercoaster ride of laughs, cheers, and jaw-dropping moments.\r\nDWL Open Mic brings you a platform to perform your poetry, stories or music. Our open mics which became popular online during the lockdown, is now going around cities in India bringing like-minded artists together to perform, jam and network. Perform or catch the best performances from some of the most talented artists in your city. Either way, DWL Open Mics is an experience of it's own.",
    "share_url": "https://zoma.to/live-event/42351",
    "start": "2024-07-07T17:00:00+05:30",
    "end": "2024-07-07T19:00:00+05:30"
  },
  {
    "title": "MisoSexy Presents SoMAD Select Sundaze",
    "subtitle": "Ft. Kampai, Lush Lata, Seezi, Rahul AVD, Sama B2B Matt & Why Factor",
    "cost": "Free entry",
    "datetime": "30th June 4:00 PM - 12:00 AM",
    "venue": "MisoSexy",
    "event_id": "42690",
    "location": "963, 12th Main Rd, HAL 2nd Stage, Doopanahalli, Indiranagar",
    "description": "Bengaluru SoMAD Select Sundaze Alert We are bringing back the benders to @misosexy_blr this season, Yes! You heard it right. Team up with your crew and come experience a fun Sundowner dressed in the most elegant Attire.  \r\n\r\n• Mixology session & Fun Bar takeovers (PS. If you wish to get behind the bar. Who knows? You might be the Party starter)\r\n• Sign Up for the exclusive Sushi Rolling workshop by our head chef @misosexy_blr & dive in and learn the art of Sushi Rolling!\r\n• Come experience and grab some Prints and unique art pieces from our Exclusive Art showcase Gathering.\r\n• Wanna get that impromptu Tattoo we have some selected Hand poke tattoo artists setting up their Pop zone too",
    "share_url": "https://zoma.to/live-event/42690",
    "start": "2024-06-30T16:00:00+05:30",
    "end": "2024-07-01T00:00:00+05:30"
  },
  {
    "title": "Soul Jams",
    "subtitle": "By Soul Ventures",
    "cost": "₹590 onwards",
    "datetime": "29th June 4:30 PM - 8:00 PM",
    "venue": "ButterFly - Brew Bite & Fly",
    "event_id": "42734",
    "location": "57, 3rd Floor, 1st Main Rd, Sarakki Industrial Layout, Dollar Layout, 3rd Phase, J. P. Nagar",
    "description": "Soul Jams is the ultimate destination for music lovers! Join us for an evening of relaxation, unwinding, and rejuvenation. Our welcoming space allows you to be yourself and feel at home. \r\nBring your guitars, cajones, and voices to sing your heart out alongside our vibrant community in a beautiful jamming session. \r\n\r\nThe event comprises three soul-enriching parts: \r\n\r\n1. Soul Open Mic: Perform for a warm and appreciative audience, regardless of where you are on your musical journey. Reach out to @souljams_live on Instagram to book your slot.\r\n2. Social Mixers: Connect with like-minded individuals and find your tribe, fostering meaningful connections. \r\n3. Soul Jamming: Sing, play instruments, and join the community in a spontaneous, free-flowing musical experience. We create music together, fostering an atmosphere of refreshment and excitement.",
    "share_url": "https://zoma.to/live-event/42734",
    "start": "2024-06-29T16:30:00+05:30",
    "end": "2024-06-29T20:00:00+05:30"
  },
  {
    "title": "Chowraasta Live",
    "subtitle": "Telugu Music Night",
    "cost": "₹499 onwards",
    "datetime": "6th July 8:00 PM - 12:00 AM",
    "venue": "Macaw by Stories",
    "event_id": "42885",
    "location": "No 2224 , 2225 AECS Layout Singasandra Hosur, Service Rd, Bengaluru, Karnataka 560068",
    "description": "Chowraasta is a dynamic Telugu band known for their eclectic blend of traditional and contemporary sounds. Their music resonates with a wide audience, combining soulful melodies, powerful lyrics, and infectious rhythms. Each performance by Chowraasta is a journey through the diverse landscape of Telugu music, infused with their unique style and passion.\r\nJoin Us for a Night to Remember\r\nGather your friends, family, and fellow music enthusiasts for an incredible night with Chowraasta. Whether you're a long-time fan or new to their music, this live performance is a must-attend event that promises great entertainment and unforgettable memories.",
    "share_url": "https://zoma.to/live-event/42885",
    "start": "2024-07-06T20:00:00+05:30",
    "end": "2024-07-07T00:00:00+05:30"
  },
  {
    "title": "Skandagiri Sunrise / Night Trek",
    "subtitle": "Witness the magnificent view of clouds with sunrise",
    "cost": "₹4500 onwards",
    "datetime": "5th to 7th July 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "42936",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Skandagiri, also known as Kalwarbetta or Kalavara Durga, is a mountain fortress 70 km from Bangalore. This 8 km, 4-hour trek offers a moderately difficult climb starting at Papagni Temple, leading through dense shrubs and steep terrain. At the summit, explore Tipu Sultan’s ruins and enjoy a stunning sunrise above the clouds.\r\nTotal Trek distance: 22 Kms, Level of Trek: Moderate.\r\nThings to Carry:\r\n• Raincoat/Poncho (during monsoon)\r\n• ID proof\r\n• Backpack\r\n• Sunscreen/cap\r\n• Track pants\r\n• Full sleeve cotton t-shirt (to avoid getting sunburnt)\r\n• Torch (with extra batteries)\r\n• Personal Medication\r\n• Necessary toiletries\r\n• Shoes with a good grip",
    "share_url": "https://zoma.to/live-event/42936"
  },
  {
    "title": "Bandajje waterfalls trek",
    "subtitle": "Discover Bandaje Falls: A Trekker's Hidden Paradise",
    "cost": "₹4000 onwards",
    "datetime": "5th to 7th July 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "42939",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Situated in the Charmadi Ghats area of the western ghats, this offbeat trail to Bandaje waterfalls is one of the must-do treks when in Bangalore. The journey takes you through magnificent meadows, river streams, and lush green forests, all of which are a delight to behold. Embark on this exciting trek and see the beauty for yourself.\r\nTotal Trek distance: 22 Kms, Level of Trek: Moderate.\r\nThings to Carry:\r\n• Raincoat/Poncho (during monsoon)\r\n• ID proof\r\n• Backpack\r\n• Sunscreen/cap\r\n• Track pants\r\n• Full sleeve cotton t-shirt (to avoid getting sunburnt)\r\n• Torch (with extra batteries)\r\n• Personal Medication\r\n• Necessary toiletries\r\n• Shoes with a good grip",
    "share_url": "https://zoma.to/live-event/42939"
  },
  {
    "title": "Kodachadri Trek & Jog falls",
    "subtitle": "Highlights of Nagara fort and Jog falls",
    "cost": "₹4500 onwards",
    "datetime": "5th to 7th July 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "42940",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Experience the breathtaking panoramic views of the Kodachadri Hills in Valur, Karnataka. Located at an altitude of 1343 meters, these hills are surrounded by dense forest and attract thousands of visitors annually. Challenge yourself on a 2-day trek from Bangalore, navigating tricky terrains to reach the summit and admire the vast Western Ghats. Explore the natural wonders of Kodachadri, including Hidlumane Waterfalls, Nagara Fort, and Jog Falls.\r\nTotal Trek distance: 22 Kms, Level of Trek: Moderate.\r\nThings to Carry:\r\n• Raincoat/Poncho (during monsoon)\r\n• ID proof\r\n• Backpack\r\n• Sunscreen/cap\r\n• Track pants\r\n• Full sleeve cotton t-shirt (to avoid getting sunburnt)\r\n• Torch (with extra batteries)\r\n• Personal Medication\r\n• Necessary toiletries\r\n• Shoes with a good grip",
    "share_url": "https://zoma.to/live-event/42940"
  },
  {
    "title": "Ettina Bhuja Trek",
    "subtitle": "Ettina Bhuja: Trek to Panoramic Views in Nature's Lap",
    "cost": "₹3500 onwards",
    "datetime": "5th to 7th July 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "42941",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Ettina Bhuja, meaning Ox's Shoulder in Kannada, is near Dharmasthala, in Byrapura village, Mudigere range, Chikmagalur district. Located about 250km from Bangalore, it's an ideal weekend getaway.\r\nThough not well-known among trekkers, Ettina Bhuja offers scenic landscapes at 1300m altitude with grasslands, forests, bamboo, and cane plantations. The trek features the soothing sounds of nature.\r\nAt the top, which resembles an ox's hump, enjoy panoramic views of dense green forests.\r\nTotal Trek distance: 22 Kms, Level of Trek: Moderate.\r\nThings to Carry:\r\n• Raincoat/Poncho (during monsoon)\r\n• ID proof\r\n• Backpack\r\n• Sunscreen/cap\r\n• Track pants\r\n• Full sleeve cotton t-shirt (to avoid getting sunburnt)\r\n• Torch (with extra batteries)\r\n• Personal Medication\r\n• Necessary toiletries\r\n• Shoes with a good grip",
    "share_url": "https://zoma.to/live-event/42941"
  },
  {
    "title": "Tadiandamol trek",
    "subtitle": "Conquer Tadiandamol: Coorg's Pinnacle of Natural Beauty",
    "cost": "₹3600 onwards",
    "datetime": "5th to 7th July 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "42942",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Coorg in South Karnataka refreshes minds with its lush greenery and stunning Western Ghats views. Its replenishing nature, tricky terrains, wooded slopes, and misty valleys attract many travelers and trekkers. Tadiandamol, Coorg's highest peak at 1,748m, is surrounded by the Shola forests' stunning greenery. Enjoy exploring Coorg's captivating landscape, and feel the pride of conquering its highest peak, rewarded with sweeping views of green forests and coffee plantations.\r\nTotal Trek distance: 22 Kms, Level of Trek : Moderate.\r\nThings to Carry:\r\n• Raincoat/Poncho (during monsoon)\r\n• ID proof\r\n• Backpack\r\n• Sunscreen/cap\r\n• Track pants\r\n• Full sleeve cotton t-shirt (to avoid getting sun burnt)\r\n• Torch (with extra batteries)\r\n• Personal Medication\r\n• Necessary toiletries\r\n• Shoes with a good grip",
    "share_url": "https://zoma.to/live-event/42942"
  },
  {
    "title": "Dudhsagar Trek",
    "subtitle": "Trek Dudhsagar: Witness Goa's Majestic 'Sea of Milk'",
    "cost": "₹4950 onwards",
    "datetime": "5th to 7th July 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "42943",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Head out on an adventurous trek to Dudhsagar Falls, located on Goa's eastern border. Known as the ‘Sea of Milk,’ this four-tiered waterfall on the Mandovi River is one of India's tallest, standing at 310m (1017 feet) with an average width of 30m (100 feet).\r\n\r\nThe falls are nestled in the Bhagwan Mahaveer Sanctuary and Mollem National Park within the Western Ghats, marking the border between Karnataka and Goa. Surrounded by thick deciduous forests, the area boasts rich biodiversity, perfect for a two-day trek.\r\n\r\nTotal trek distance: 22 km, moderate difficulty.\r\n\r\nThings to carry:\r\n• Raincoat/Poncho (monsoon)\r\n• ID proof\r\n• Backpack\r\n• Sunscreen/Cap\r\n• Track pants\r\n• Full sleeve cotton T-shirt\r\n• Torch (with extra batteries)\r\n• Personal medication\r\n• Necessary toiletries\r\n• Shoes with a good grip",
    "share_url": "https://zoma.to/live-event/42943"
  },
  {
    "title": "Night camping, trek & activities @Ramanagar",
    "subtitle": "Explore Ramanagara: Climb Ancient Granite Outcrops",
    "cost": "₹1750 onwards",
    "datetime": "5th to 7th July 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "42944",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Ramanagara, 50 km southwest of Bangalore, stands at 747 meters (2450 feet) and is famous for its massive granite outcrops. Known for short rock climbs, grades range from 5.8 to 5.11 American. It features some of the world's oldest granite outcrops, including Ramdevarabetta, famous for its cave entrances in \"Passage to India.\" The trek distance is 4 km, with a moderate difficulty level.\r\nTotal Trek distance: 22 Kms, Level of Trek: Moderate.\r\nThings to Carry:\r\n• Raincoat/Poncho (during monsoon)\r\n• ID proof\r\n• Backpack\r\n• Sunscreen/cap\r\n• Track pants\r\n• Full sleeve cotton t-shirt (to avoid getting sunburnt)\r\n• Torch (with extra batteries)\r\n• Personal Medication\r\n• Necessary toiletries\r\n• Shoes with a good grip",
    "share_url": "https://zoma.to/live-event/42944"
  }
]