[
  {
    "title": "Gymnastics For Dancers & Youngsters",
    "cost": "₹5310 onwards",
    "datetime": "2nd January to 29th April 7:00 AM onwards",
    "venue": "LVDS: Indiranagar",
    "event_id": "25057",
    "location": "4th Floor, 598/1, 12th Main Rd, 7th Cross, HAL 2nd Stage, Indiranagar, Bengaluru, Karnataka 560038",
    "description": "Are you ready to enhance your dance abilities and overall fitness? Join our Gymnastics for Dancers & Youngsters program at LVDS and experience a holistic approach to physical development!",
    "url": "https://in.bookmyshow.com/events/gymnastics-for-dancers-youngsters/ET00377636"
  },
  {
    "title": "A Soulful Evening with Sonu Nigam",
    "cost": "₹1000 onwards",
    "datetime": "17th March 7:30 PM - 9:30 PM",
    "venue": "Bhartiya Mall Of Bengaluru",
    "event_id": "30359",
    "location": "Bhartiya City, Thanisandra Main Road, Kannuru, Kannuru",
    "description": "Sonu Nigam is an Indian playback singer, music director, dubbing artist and actor. He has been described in the media as one of the best, most popular and successful playback singers in Hindi and Kannada cinema",
    "url": "https://in.bookmyshow.com/events/a-soulful-evening-with-sonu-nigam/ET00384502"
  },
  {
    "title": "Kisi Ko Batana Mat Ft. Anubhav Singh Bassi",
    "cost": "₹799 onwards",
    "datetime": "4th February to 31st March 3:00 PM onwards",
    "venue": "Dr B.R. Ambedkar Bhavan",
    "event_id": "30362",
    "location": "Millers Road, Kaverappa Layout, Vasanth Nagar, Near Bhagwan Mahaveer Jain Hospital",
    "description": "After the great success of his previous show \"Bas kar bassi,\" Anubhav Singh Bassi is coming back to perform live on stage. This time, he will bring a whole new set of funny stories and jokes that will keep you entertained. Get ready to enjoy an exciting and hilarious performance that will make you laugh uncontrollably and leave you in high spirits.",
    "url": "https://in.bookmyshow.com/pune/events/anubhav-singh-bassi-new-material/ET00355125"
  },
  {
    "title": "SHAYAR Sartaaj Live: Bengaluru",
    "cost": "₹1000 onwards",
    "datetime": "15th March 6:00 PM - 9:00 PM",
    "venue": "Prestige Srihari Khoday Centre For Performing Arts",
    "event_id": "30366",
    "location": "Silver Oak Plantation, 25, Mudalappa St, Anjanadri Layout, Konanakunta",
    "description": "Sartaaj is on the road most of the time kicking off his creative projects. Currently he is promoting his signing on the Rukus Avenue music label. Don't miss the opportunity to catch up with him on tour.",
    "url": "https://in.bookmyshow.com/events/shayar-sartaaj-live-bengaluru/ET00385447"
  },
  {
    "title": "DANIEL SLOSS: CAN’T - India Tour 2024 - Bengaluru",
    "cost": "₹999 onwards",
    "datetime": "17th March 7:00 PM - 11:59 PM",
    "venue": "St. John's Auditorium",
    "event_id": "30743",
    "location": "WJJC+JP8, 18th Main Rd, John Nagar, Koramangala, Bengaluru,",
    "description": "Daniel’s previous ground-breaking, global smash-hits include ‘HUBRiS’ (the world’s biggest solo comedy touring show and 5th biggest ticket selling event for most of 2021 as reported in Pollstar) and ‘X’ (his acclaimed tour de force about sexual assault. ‘X’ toured non-stop for 300 performances over 17 months around the globe, traversing Europe, UK, U.S., Canada, Australia, Hong Kong, Japan and even packing a Moscow arena (becoming Russia’s biggest-ever English language comedy show and creating a sensation with a joke about the importance of sex education – not a taboo subject in Putin’s Russia – an illegal one.). The film of ‘X’ is on HBO in USA, Canada and was the first UK comedy special with a UK premiere in cinemas, following a nationwide release at Vue",
    "url": "https://insider.in/daniel-sloss-cant-india-tour-2024-bangalore-mar17-2024/event"
  },
  {
    "title": "Sitar For Mental Health",
    "subtitle": "HSBC presents ‘SFMH’ - Rishab Rikhiram Sharma",
    "cost": "₹354 onwards",
    "datetime": "31st March 7:00 PM - 10:00 PM",
    "venue": "Prestige Srihari Khoday Centre",
    "event_id": "31539",
    "location": "Silver Oak Plantation, 25, Mudalappa St, Anjanadri Layout, Konanakunte, Bengaluru, Karnataka 560062",
    "description": "Sitar for Mental Health events are immersive experiences that bridge ancient practices of sound and energy medicine using traditional Indian music, designed to invoke states of deep reflection, receptivity, and introspection.\r\n\r\nSitarist, music producer, and mental health advocate, Rishab Rikhiram Sharma, is made for the spotlight and his multi-faceted career is shaping up to be nothing short of iconic. Rishab presents his massive fourth Pan India SFMH Tour across eleven cities. Bringing awareness towards Mental health by inducing education and experiences of the auditory sensory processing system which Classical music brings forth and re-introduces the sound of the Sitar as a transformational tool.",
    "start": "2024-03-31T19:00:00+05:30",
    "end": "2024-03-31T22:00:00+05:30"
  },
  {
    "title": "Seedhe Maut - Lunch Break India Tour 2024",
    "subtitle": "Still On A Lunch Break!",
    "cost": "₹943 onwards",
    "datetime": "27th April 7:00 PM - 10:00 PM",
    "venue": "Venue to be Announced",
    "event_id": "31673",
    "location": "Bengaluru",
    "description": "Catch the 'best in the business' in a city near you! Seedhe Maut are taking their hit mixtape on a massive 12-city pan-India tour. The dynamic duo, known for their explosive live performances, will be playing an extended set and will feature several special guests as well as a few surprises! Get your tickets now! \r\n\r\nHaving mastered the art of delivering razor-sharp rhymes - this Delhi-based duo comprising Encore ABJ and Calm has used their lyrical dexterity to push forward the boundaries of Hip-Hop in India. Presenting Hindi Rap in a revolutionary new format, Seedhe Maut is taking the industry by storm and is unanimously regarded as the next big thing to break in the rapidly growing subculture landscape.\r\n\r\nAge Restriction: 16+",
    "start": "2024-04-27T19:00:00+05:30",
    "end": "2024-04-27T22:00:00+05:30"
  },
  {
    "title": "BANGALORE HOLI FESTIVAL 2024",
    "subtitle": "| Rain Dance | Disco Bash |",
    "cost": "₹200 onwards",
    "datetime": "23rd to 25th March 11:00 AM onwards",
    "venue": "Skygarden, Whitefield",
    "event_id": "31831",
    "location": "Metro station, 3rd floor HVP Aster, ITPL Main Rd, near Garudacharpalya, Kaveri Nagar, Krishnarajapura",
    "description": "It's gonna be a riot of COLORS!\r\n\r\nBangalore's Biggest #HOLI Festival 2024 is back at SKY GARDEN, WHITEFIELD, and you wouldn't want to be anywhere else on this 'Holi'Day! \r\nChoose from or be there on all 3 days with 8 hours of Music & FNB."
  },
  {
    "title": "Bengaluru Holi Carnival",
    "subtitle": "Holi Carnival in Bangalore",
    "cost": "₹599 onwards",
    "datetime": "23rd to 25th March 11:00 AM onwards",
    "venue": "Hotel Royal Orchid, Domlur",
    "event_id": "31905",
    "location": "No 1, Golf Avenue, adjoining KGA Golf Course, HAL Old Airport Rd, Domlur",
    "description": "This year's Biggest Holi Carnival at Hotel Royal Orchid Domlur promises a multitude of surprises!\r\n\r\nA grand setup awaits you\r\nComplimentary colors for everyone\r\nExpansive lawn area\r\nDelicious food stalls\r\nEnjoy a rain dance to amplify the festive spirit."
  },
  {
    "title": "SCC SkyCinema - Yeh Jawaani Hai Deewani",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "16th March 7:00 PM - 10:30 PM",
    "venue": "Forum South Bengaluru",
    "event_id": "31934",
    "location": "Konanakunte Cross Metro Station, Anjanadri Layout, Konanakunte",
    "description": "\"Life mein jitna bhi try karo, kuch na kuch toh chhootega hi. Toh jahaan hai, wahi ka maza lete hai.\"\"- Yeh Jawaani Hai Deewani\r\n\r\nEnjoy your favorite movie on a breezy terrace, perched on the rooftop of Forum South Bangalore Mall. Here you'll have an unobstructed view of the night sky, creating a unique and immersive cinema experience as you sink into comfy bean bags or mattresses and watch the movie on a large screen with the skyline of the city as your backdrop.\r\n\r\nScreening Schedule: \r\n\r\n16th March, Saturday - Yeh Jawaani Hai Deewani\r\n\r\nGates open at 7:00 pm and the movie starts at 7.30 pm.\r\n\r\nSeating:\r\n\r\nSeating will be allocated on a first-come-first-served basis.\r\n\r\nWe recommend that you carry warm clothes/blankets for your comfort during the screening.",
    "start": "2024-03-16T19:00:00+05:30",
    "end": "2024-03-16T22:30:00+05:30"
  },
  {
    "title": "SCC Open Air Cinema - Notting Hill",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "16th March 7:00 PM - 10:30 PM",
    "venue": "Ecoworld. The Bay Food Court",
    "event_id": "31935",
    "location": "RMZ Eco World Rd, Adarsh Palm Retreat, Bellandur",
    "description": "\"I'm just a girl, standing in front of a boy, asking him to love her. And I think we have a future together.\" - Notting Hill\r\n\r\nJoin us for an evening of laughter, love, and unexpected connections as Sunset Cinema Club presents a screening of this timeless classic at Ecodeck.\r\n\r\nLocated in Bangalore's bustling metropolis, this business hub transforms into a haven of relaxation and entertainment as the sun sets and the stars begin to emerge, as your film screening begins. Enjoy your favorite film on a large screen with surround sound, as you sink into comfy bean bags, in the great outdoors.\r\n\r\nScreening Schedule:\r\n\r\n16th March, Saturday - Notting Hill\r\n\r\nGates open at 7:00 pm and the movie starts at 7.30 pm.",
    "start": "2024-03-16T19:00:00+05:30",
    "end": "2024-03-16T22:30:00+05:30"
  },
  {
    "title": "SCC Picnic Cinema - Under The Tuscan Sun",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "17th March 7:00 PM - 10:30 PM",
    "venue": "GCBC - Garden City Beer Collective",
    "event_id": "31936",
    "location": "82/2, Gantiganahalli",
    "description": "\"Unthinkably good things can happen, even late in the game.\" - Under The Tuscan Sun \r\n\r\nEmbark on a journey to the sun-soaked landscapes of Italy as Sunset Cinema Club presents a special screening of the enchanting film, \"Under the Tuscan Sun.\" Join us for an evening of romance, self-discovery, and the picturesque beauty of Tuscan dreams under the open sky at Garden City Beer Collective.\r\n\r\nCome for an evening of cinematic delight, as the sun goes down, and the show comes on! Enjoy a picnic-y ambiance, where you can sit or even lie down on comfy bean bags, surrounded by lush green grass! String lights illuminate the area, casting a warm glow that sets the perfect mood for the evening, while you enjoy your favorite film on a large screen with surround sound accompanied by delicious munchies and drinks!",
    "start": "2024-03-17T19:00:00+05:30",
    "end": "2024-03-17T22:30:00+05:30"
  },
  {
    "title": "SCC Picnic Cinema - Love Aaj Kal",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "24th March 7:00 PM - 10:30 PM",
    "venue": "GCBC - Garden City Beer Collective",
    "event_id": "31938",
    "location": "82/2, Gantiganahalli",
    "description": "\"Jaane se pehle, ek aakhri baar milna kyun zaroori hota hai?” - Love Aaj Kal\r\n\r\nCome for an evening of cinematic delight, as the sun goes down, and the show comes on! Enjoy a picnic-y ambiance, where you can sit or even lie down on comfy bean bags, surrounded by lush green grass! String lights illuminate the area, casting a warm glow that sets the perfect mood for the evening, while you enjoy your favorite film on a large screen with surround sound accompanied with delicious munchies and drinks!\r\n\r\nScreening Schedule: \r\n\r\n24th March, Sunday - Love Aaj Kal\r\n\r\nGates open at 7:00 pm and the movie starts at 7.30 pm.\r\n\r\nSeating:\r\n\r\nBeanbag seating is available at the venue. \r\n\r\nSeating will be allocated on a first-come-first-served basis\r\n\r\nWe recommend that you carry warm clothes/blankets for your comfort during the screening",
    "start": "2024-03-24T19:00:00+05:30",
    "end": "2024-03-24T22:30:00+05:30"
  },
  {
    "title": "SCC Open Air Cinema - Zindagi Na Milegi Dobara",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "23rd March 7:00 PM - 10:30 PM",
    "venue": "GCBC - Garden City Beer Collective",
    "event_id": "31939",
    "location": "82/2, Gantiganahalli",
    "description": "\"Seize the day, my friend. Pehle is din ko poori tarah jiyo, phir chalis ke bare mein sochna.\" - Zindagi Na Milegi Dobara\r\n\r\nRelive the surreal moments, laughter, and life-changing experiences of this modern day classic with Sunset Cinema Club at Ecodeck.\r\n\r\nLocated in Bangalore's bustling metropolis, this business hub transforms into a haven of relaxation and entertainment as the sun sets and the stars begin to emerge, as your film screening begins. Enjoy your favorite film on a large screen with surround sound, as you sink into comfy bean bags, in the great outdoors.\r\n\r\nScreening Schedule:\r\n\r\n23rd March, Saturday - Zindagi Na Milegi Dobara\r\n\r\nGates open at 7:00 pm and the movie starts at 7:30 pm.\r\n\r\nSeating:\r\n\r\nBean Bag seating is available\r\n\r\nSeating will be allocated on a first-come-first-served basis",
    "start": "2024-03-23T19:00:00+05:30",
    "end": "2024-03-23T22:30:00+05:30"
  },
  {
    "title": "SCC SkyCinema - Ticket To Paradise",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "30th March 7:00 PM - 9:00 PM",
    "venue": "Forum South Bengaluru",
    "event_id": "31941",
    "location": "Konanakunte Cross Metro Station, Anjanadri Layout, Konanakunte",
    "description": "\"There’s Not Enough Alcohol In The World.” - Ticket to Paradise\r\n\r\nWe have a ticket to paradise for you and the seatmate you bring along for the screening of this exciting new film, starring everyone's favorite duo, George Clooney and Julia Roberts playing a divorced couple who team up to sabotage the impending wedding of their daughter in Bali. \r\n\r\nEnjoy your favorite movie on a breezy terrace, perched on the rooftop of Forum South Bangalore Mall. Here you'll have an unobstructed view of the night sky, creating a unique and immersive cinema experience as you sink into comfy bean bags or mattresses and watch the movie on a large screen with the skyline of the city as your backdrop.\r\n\r\nScreening Schedule: \r\n\r\n30th March, Saturday - Ticket to Paradise\r\n\r\nGates open at 7:00 pm and the movie starts at 7.30 pm",
    "start": "2024-03-30T19:00:00+05:30",
    "end": "2024-03-30T21:00:00+05:30"
  },
  {
    "title": "SCC Open Air Cinema - Band Baaja Baarat",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "30th March 7:00 PM - 11:00 PM",
    "venue": "Ecoworld. The Bay Food Court",
    "event_id": "31942",
    "location": "RMZ Eco World Rd, Adarsh Palm Retreat, Bellandur",
    "description": "Get ready for a night of excess, adrenaline, and unabashed indulgence as Sunset Cinema Club presents a special screening of this blockbuster hit at Ecodeck. Brace yourselves for a rollercoaster ride through the high-stakes world of finance, where greed knows no bounds and the pursuit of success takes a wild turn. Located in Bangalore's bustling metropolis, this business hub transforms into a haven of relaxation and entertainment as the sun sets and the stars begin to emerge, as your film screening begins. Enjoy your favorite film on a large screen with surround sound, as you sink into comfy bean bags, in the great outdoors.",
    "start": "2024-03-30T19:00:00+05:30",
    "end": "2024-03-30T23:00:00+05:30"
  },
  {
    "title": "SCC Picnic Cinema - The Grand Budapest Hotel",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "31st March 7:00 PM - 10:00 PM",
    "venue": "GCBC - Garden City Beer Collective",
    "event_id": "31943",
    "location": "82/2, Gantiganahalli",
    "description": "\"Rudeness is merely an expression of fear. People fear they won't get what they want.\" - The Grand Budapest Hotel\r\n\r\nEmbark on a journey to the whimsical world of Wes Anderson as Sunset Cinema Club presents a special screening of this visually enchanting film. Join us for an evening of cinematic elegance, where the charm of the Grand Budapest as its eccentric characters come to life at our venue in Garden City Beer Collective. Come for an evening of cinematic delight, as the sun goes down, and the show comes on! Enjoy a picnic-y ambiance, where you can sit or even lie down on comfy bean bags, surrounded by lush green grass! String lights illuminate the area, casting a warm glow that sets the perfect mood for the evening, while you enjoy your favorite film on a large screen with surround sound accompanied by delicious munchies and drinks!",
    "start": "2024-03-31T19:00:00+05:30",
    "end": "2024-03-31T22:00:00+05:30"
  },
  {
    "title": "Kal Ki Chinta Nahi Karta ft. Ravi Gupta",
    "cost": "₹399 onwards",
    "datetime": "30th March 3:00 PM - 4:15 PM",
    "venue": "Dr. BR Ambedkar Bhavan",
    "event_id": "32101",
    "location": "XHRW+X6R, Millers Rd, Near Bhagwan Mahaveer Jain Hospital, Kaverappa Layout, Vasanth Nagar, Bengaluru,",
    "description": "Forget your Kal ki Chinta and Join us in this super funny Show by Ravi Gupta. Kal Ki Chinta Nahi Karta is new stand up special by Ravi Gupta.",
    "url": "https://in.bookmyshow.com/events/kal-ki-chinta-nahi-karta-ft-ravi-gupta/ET00329412"
  },
  {
    "title": "Vipul Goyal Live in Bangalore",
    "cost": "₹799 onwards",
    "datetime": "17th March 6:15 PM - 7:30 PM",
    "venue": "MLR Convention Centre",
    "event_id": "32106",
    "location": "Cassia Block, Campus, JP Nagar 7th Phase, J. P. Nagar, Bengaluru,",
    "description": "Vipul Goyal from TVF’s hugely popular web series ‘Humorously Yours’ will now come to your city, yeah.. you can experience the jokes LIVE. Vipul Goyal with his trove of relatable jokes and cult-y punchlines will have you laughing like a hyena.",
    "url": "https://in.bookmyshow.com/events/vipul-goyal-live-in-bangalore/ET00384290"
  },
  {
    "title": "Shame On Me by Sapan Verma",
    "cost": "₹499 onwards",
    "datetime": "31st March 5:00 PM - 6:00 PM",
    "venue": "The Underground Comedy Club",
    "event_id": "32107",
    "location": "Building No.480, KHB Colony, 5th Block, Koramangala, Bengaluru",
    "description": "A veteran of shows across the globe, Sapan`s killer observations and hilarious storytelling have seen him open for Coldplay and Jay-Z at India`s Global Citizen Festival, headline the first-ever Indian comedy showcase at Melbourne International Comedy Festival, and train celebrities to perform comedy on two sensational seasons of his show, One Mic Stand (Amazon Prime). His new hour of jokes is not to be missed!",
    "url": "https://in.bookmyshow.com/bengaluru/events/shame-on-me/ET00376252"
  },
  {
    "title": "Sunburn Holi Weekend Ft. Marshmello - Bengaluru",
    "cost": "₹999 onwards",
    "datetime": "22nd March 4:00 PM - 10:00 PM",
    "venue": "Bengaluru International Exhibition Centre",
    "event_id": "32109",
    "location": "10th Mile, Tumkur Main Road , Madavara Post Dasanapura, Hobli, Bengaluru,",
    "url": "https://in.bookmyshow.com/events/sunburn-holi-weekend-ft-marshmello-bengaluru/ET00385750"
  },
  {
    "title": "Simon Doty (Anjunadeep) live at Gylt",
    "cost": "₹499 onwards",
    "datetime": "16th March 5:00 PM - 12:30 AM",
    "venue": "GYLT",
    "event_id": "32111",
    "location": "22, Hennur Bagalur Main Rd, Visthar, Bengaluru",
    "description": "GYLT & REDROOM_BLR X PUMPROOM presents Canadian Producer Simon Doty at Gylt  on Saturday 16th March 2024. Bringing in the Anjunadeep goodness, A Star that resonates rush of emotions and incredibly well-knit sets that have constantly kept this artist on the top pedestal of sought-after artists from the Anjunadeep stable.",
    "url": "https://in.bookmyshow.com/events/simon-doty-anjunadeep-live-at-gylt/ET00387494"
  },
  {
    "title": "Holi at the Palace",
    "subtitle": "Legendary Holi at Jayamahal Palace",
    "cost": "₹299 onwards",
    "datetime": "24th March 12:00 PM - 10:00 PM",
    "venue": "Jayamahal Palace",
    "event_id": "32160",
    "location": "1, Jayamahal Main Rd, near Cantonment Railway Station Road, Nandi Durga Road Extension, Jayamahal",
    "description": "House & EDM with the legendary\r\nDJ IVAN\r\n\r\nThe Ultimate Holi Beats with The King of Bollywood \r\nDJ Jasmeet \r\n\r\nSundowner Set with the charming \r\nDJ Martin DSouza \r\n\r\n10 hours of nonstop music with undoubtedly 3 of the top DJs in Bangalore\r\nwith Live Dhol, Ample car parking and space for everybody, an Exclusive VIP Zone, Organic Colors, Holi Festive Decor, and well curated F&B - top food brands with a lip-smacking variety",
    "start": "2024-03-24T12:00:00+05:30",
    "end": "2024-03-24T22:00:00+05:30"
  },
  {
    "title": "Gulaaal Season 7",
    "subtitle": "Whitefield’s Biggest Holi Festival",
    "cost": "₹49 onwards",
    "datetime": "23rd to 25th March 11:00 AM onwards",
    "venue": "Aloft Hotel Lawns, Whitefield",
    "event_id": "32491",
    "location": "17C, Sadaramangala Rd, off Whitefield Main Road, opposite Itpl, Sadara Mangala Industrial Area, Thigalarapalya, Whitefield",
    "description": "Get ready to immerse yourself in a kaleidoscope of colors and happiness at our Holi event! Let's paint the town with laughter, love, and vibrant hues as we celebrate the arrival of spring and the triumph of good over evil. We have been coloring Bengaluru every year with full music, masti, dance, and color. Get ready for the most happening Holi festival Gulaaal Season 7"
  },
  {
    "title": "Mohe Rang De",
    "subtitle": "A Holi Extravaganza Like No Other!",
    "cost": "₹49 onwards",
    "datetime": "25th March 11:00 AM - 7:00 PM",
    "venue": "Manpho Spectrum 2",
    "event_id": "32515",
    "location": "Manpho Spectrum, No 90/1, Veerannapalya, Nagawara Ring Rd, Opp BEL Corp. Office",
    "description": "Get ready to immerse yourself in a spectrum of colors at the most anticipated Holi festival of the year! \"Mohe Rang De\" promises an unforgettable celebration, now at an even larger venue to double the fun!\r\n\r\nEvent Highlights \r\n1. Massive Open Ground.\r\n2. Huge Parking Space.\r\n3. Unlimited Colors\r\n4. 8 Hours of Continuous Music\r\n5. Get lost in 8 hours of thrilling music with our lineup of 10 celebrity DJs, including DJ Oppozit, DJ Ashwin, DJ Vijju, DJ Manny, DJ Mavis, DJ Pyrotics, DJ Kash, DJ J&A, and DJ Pillar, with MC Samaira Khan leading the charge!\r\n6. Live Veg/Non-Veg food stall and beverage stalls.\r\n7. Live Dhol\r\n8. A massive bar setup, \r\n9. A stage that promises to elevate the celebration.",
    "start": "2024-03-25T11:00:00+05:30",
    "end": "2024-03-25T19:00:00+05:30"
  },
  {
    "title": "Holi Sundowner",
    "subtitle": "Celebrity holi bash!",
    "cost": "₹999 onwards",
    "datetime": "22nd March 2:15 PM - 9:00 PM",
    "venue": "Manpho Spectrum",
    "event_id": "32596",
    "location": "Manpho Spectrum, No 90/1, Veerannapalya, Nagawara Ring Rd, Opp BEL Corp. Office, Bangalore",
    "description": "A Holi Celebrity Bash which is the first of its kind as a sundowner and colours to play all evening and night keeping the heat aside. Dance the Sundowner Away with live music by DJ Olly Esse, Progressive Brothers, and more Artists. Join us and have the best Holi ever with the best fire and Color show.  Feel the rainbow awaken your spirit with Holi Sundowner, the most vibrant Holi celebration in town.",
    "start": "2024-03-22T14:15:00+05:30",
    "end": "2024-03-22T21:00:00+05:30"
  },
  {
    "title": "Holi Barsane Wali",
    "subtitle": "No Dhaka Shaka – only Pao Ruka!",
    "cost": "₹1299 onwards",
    "datetime": "25th March 11:00 AM - 4:00 PM",
    "venue": "Urban Valley Resort",
    "event_id": "32619",
    "location": "Urban Valley Resort, Vaderahalli Village, Kanakapura Rd, Bengaluru, Karnataka 560082",
    "description": "Holi hai Boss! Let`s get ready and bring your friends/ family to whom you couldn`t meet due to traffic and forget about North South Bangalore. We bring you a perfect resort where you can enjoy Holi in a spacious arena with yummy thandai (authentic Holi beverage ) with pakodas.\r\nDance on DJ beats with Live Dhol beats. Enjoy the festival of colours with your loved ones.",
    "start": "2024-03-25T11:00:00+05:30",
    "end": "2024-03-25T16:00:00+05:30"
  },
  {
    "title": "Phoolon Wali Holi Ft. Panjabi MC",
    "subtitle": "Experience India`s First Ever Flower Holi Party!",
    "cost": "₹499 onwards",
    "datetime": "24th March 12:00 PM - 7:00 PM",
    "venue": "Oia",
    "event_id": "32682",
    "location": "162/2, Main Road, Hennur",
    "description": "Experience the most colorful celebration of Holi with a twist!\r\n\r\nJoin us at Bangalore`s most vibrant event, Oia presents Phoolon wali Holi, on 24th March, starting at 12 PM.\r\n\r\nFeaturing Punjabi MC (Fame Mundian To Bach Ke), Vipul Khurana, Dr Prakhar, Santana, and Virat Munjal, immerse yourself in the festivities with live Dhol, a cascade of flowers, delicious food and beverages, and international acts.\r\n\r\nLet`s bloom together in a riot of joy and music, where the air is filled with the fragrance of flowers and the spirit of togetherness! \r\n\r\nEvery participant will receive a bag of vibrant flowers and colors.",
    "start": "2024-03-24T12:00:00+05:30",
    "end": "2024-03-24T19:00:00+05:30"
  },
  {
    "title": "CrossOver ft. M.O.S",
    "subtitle": "CrossOver Summer Edition this Saturday. 🍾",
    "cost": "Free entry",
    "datetime": "16th March 7:00 PM - 11:55 PM",
    "venue": "High Ultra Lounge",
    "event_id": "32726",
    "location": "26/1, Rooftop, World Trade Center, Dr Rajkumar Rd, Malleshwara, Bengaluru",
    "description": "Excitement fills us as we bring the Anjunadeep Sensation M.O.S. to Bangalore, marking its inaugural appearance at HIGH Ultra Lounge for our CrossOver Summer Edition  this Saturday. 🍾\r\n\r\nAlso Featuring: A John, Kara & Somyth B2B Holytrinity",
    "start": "2024-03-16T19:00:00+05:30",
    "end": "2024-03-16T23:55:00+05:30"
  },
  {
    "title": "Holi Invasion 2024",
    "subtitle": "Open Air Rooftop Holi Concert",
    "cost": "₹499 onwards",
    "datetime": "25th March 10:00 AM - 4:00 PM",
    "venue": "Magique, Koramangala",
    "event_id": "32827",
    "location": "Plot No, 36, 100 Feet Rd, opp. to Shilton Royale Hotel, Srinivagilu, Chandra Reddy Layout, S T Bed Layout, Koramangala, Bengaluru, Karnataka 560095",
    "description": "Biggest Rooftop Holi Party in Bangalore! Enjoy Non-Stop Bollywood, Punjabi, Commercial Music 25th March 11 AM Onwards - with The Best DJs Of Bangalore Right Under One Club! ",
    "start": "2024-03-25T10:00:00+05:30",
    "end": "2024-03-25T16:00:00+05:30"
  },
  {
    "title": "Dhum Pichak Dhum",
    "subtitle": "by Banjara and Gypsy",
    "cost": "₹399 onwards",
    "datetime": "25th March 11:00 AM - 4:00 PM",
    "venue": "Dhwani - Bar & Kitchen",
    "event_id": "32828",
    "location": "43, Lower Ground Floor, 7th Main Rd, Appareddipalya, Indiranagar, Bengaluru, Karnataka 560038",
    "description": "Grand Holi Festival celebration at Dhwani, Indiranagar with colors, DJ and Live Dhol. \r\n\r\nBring your friends and gang to make this holi celebration super special. All day long party with dry and wet colors.\r\n\r\nNo holding back. Kyunki party yunhi chalegi",
    "start": "2024-03-25T11:00:00+05:30",
    "end": "2024-03-25T16:00:00+05:30"
  },
  {
    "title": "Holi High ft. Stebin Ben",
    "subtitle": "Prepare for an explosion of colours and music!",
    "cost": "₹999 onwards",
    "datetime": "23rd March 7:00 PM - 1:00 AM",
    "venue": "Phoenix Marketcity",
    "event_id": "32829",
    "location": "Palm Meadows, Prestige Ozone, Whitefield Main Road, Whitefield, Devasandra Industrial Estate, Krishnarajapura, Bengaluru, Karnataka 560048",
    "description": "Get set to immerse yourself in a spectacular celebration of music and colours at Phoenix Mall! On 23rd March, mark your calendars for the inaugural \"Stebin Ben Live in Concert\" event, where the vivacious spirit of Holi converges with the enchantment of live music for an experience like no other.\r\n\r\nTaking centre stage is the sensational Stebin Ben, whose infectious energy promises to ignite the crowd and keep you dancing all night long. Join us as we make history and revel in the magic of music, laughter, and unforgettable moments.\r\n\r\nDon't miss out on this one-of-a-kind event – secure your tickets now and let's make the inaugural \"Stebin Ben Live in Concert\" at Phoenix Mall an experience to remember!",
    "start": "2024-03-23T19:00:00+05:30",
    "end": "2024-03-24T01:00:00+05:30"
  },
  {
    "title": "Shreya Ghoshal, A RED LIVE & KALALUHA Concert",
    "subtitle": "By Superhits 93.5 RED FM",
    "cost": "₹749 onwards",
    "datetime": "11th May 7:30 PM - 10:00 PM",
    "venue": null,
    "event_id": "33048",
    "location": "Bengaluru",
    "description": "Superhits 93.5 RED FM brings Shreya Ghoshal, All hearts tour Bengaluru RED LIVE\r\nin Concert Co-presented by Kalaluha.\r\nLet's experience the magic of Shreya Ghoshal's All Hearts Tour in Namma\r\nBengaluru. Prepare to be captivated by the mesmerizing blend of Shreya Ghoshal's\r\nsoulful voice and magnetic stage presence, accompanied by a talented band that\r\ninfuses energy and finesse into every performance.",
    "start": "2024-05-11T19:30:00+05:30",
    "end": "2024-05-11T22:00:00+05:30"
  },
  {
    "title": "Usha Uthup Live with AIR",
    "subtitle": "Usha Uthup's First Live Open-Air Concert",
    "cost": "₹999 onwards",
    "datetime": "23rd March 6:00 PM - 9:30 PM",
    "venue": "Garuda Mall",
    "event_id": "33084",
    "location": "Magrath Rd, Ashok Nagar, Bengaluru, Karnataka 560025",
    "description": "Celebrating the timeless music of Usha Uthup, who has captivated audiences worldwide for 55 years and counting. This Concert celebrates Music Diva's 55-year Musical Journey.\r\n\r\nThe concert marks the 2nd collaboration between Usha Uthup and Bangalore's very own Multi-lingual, Multi-genre band - Alive India Rockstars (AIR), mentored by Supratiek Ghosh - Founder of Alive India & Lead Singer of Iconic Band Aurko \r\n\r\nThe Concert Series is Alive India's Fundraiser & Awareness Campaign in support of Sponsoring deserving musicians with Free Food, Shelter, Upskill Training & Sustainable Career under Alive India Music Foundation NGO's MSR (Musicians Social Responsibility)",
    "start": "2024-03-23T18:00:00+05:30",
    "end": "2024-03-23T21:30:00+05:30"
  },
  {
    "title": "Holi Utsav",
    "subtitle": "Champagne Showers and Color Splash",
    "cost": "₹399 onwards",
    "datetime": "24th March 11:00 AM - 5:30 PM",
    "venue": "High Ultra Lounge",
    "event_id": "33085",
    "location": "26/1, Rooftop, World Trade Center, Dr Rajkumar Rd, Malleshwara, Bengaluru, Karnataka 560055",
    "description": "The most funky Holi celebration of Bangalore is back again! With Dj Suketu to spin the best of bollywood and holi tracks.\r\nGet ready to Dance in with colours flowing all around you! This Holi at High Ultra Lounge rooftop is surely going to fill your memory with vibrant colours, one that you will remember for a long time!",
    "start": "2024-03-24T11:00:00+05:30",
    "end": "2024-03-24T17:30:00+05:30"
  },
  {
    "title": "Holi Festival Rang Barse",
    "subtitle": "by Glory Resonant",
    "cost": "₹499 onwards",
    "datetime": "23rd to 25th March 11:00 AM onwards",
    "venue": "Renaissance Bengaluru",
    "event_id": "33123",
    "location": "No 17 And 17, 1, Race Course Rd, Madhava Nagar, Extension",
    "description": "Get ready to be a part of the most vibrant and exhilarating Holi festival of your life! Our\r\nspectacular event invites you to dive into a world of colors, laughter, and love as we\r\ncelebrate the arrival of spring and the victory of good over evil.\r\n\r\nThis year, we have curated an unparalleled experience that will leave you spellbound\r\nwith its array of attractions. Be prepared for a visual spectacle with Unlimited Colors,\r\nan exhilarating Color Blast & Rain Dance, and a rhythmic Groove on the Booming\r\nBeats of 10 renowned DJs from India, spinning an eclectic mix of Music, Bollywood,\r\nEDM, Hip-hop, and Punjabi beats that will make you dance the night away."
  },
  {
    "title": "Rang Leela 2024",
    "subtitle": "Immerse yourself in a whirlwind of color",
    "cost": "₹49 onwards",
    "datetime": "24th March 11:00 AM - 7:00 PM",
    "venue": "Manpho Convention Centre",
    "event_id": "33182",
    "location": "No. 91/4, 102/3, Opp BEL Corporate Office, Hebbal Flyover, Veerannapalya Rd, Manayata Tech Park, Nagavara",
    "description": "Join us for RANG LEELA 2024 - The ultimate Holi celebration at MANPHO CONVENTION CENTRE, Manayata Tech Park Nagavara.\r\n\r\nFood stalls and Pop-ups will accompany the live music by our lineup of the city’s top DJs for what is bound to be a great time. Get your family and friends and sway the day away at the biggest Holi Party in town.\r\n\r\nDress code alert: Wearing white will make things all the more special.\r\n\r\nYour tickets include one pouch of colour and don`t worry, there will be plenty of colour flying around once the party gets started!",
    "start": "2024-03-24T11:00:00+05:30",
    "end": "2024-03-24T19:00:00+05:30"
  }
]