[
  {
    "title": "Seedhe Maut - Lunch Break India Tour 2024",
    "subtitle": "Still On A Lunch Break!",
    "cost": "₹943 onwards",
    "datetime": "27th April 7:00 PM - 10:00 PM",
    "venue": "Venue to be Announced",
    "event_id": "31673",
    "location": "Bengaluru",
    "description": "Catch the 'best in the business' in a city near you! Seedhe Maut are taking their hit mixtape on a massive 12-city pan-India tour. The dynamic duo, known for their explosive live performances, will be playing an extended set and will feature several special guests as well as a few surprises! Get your tickets now! \r\n\r\nHaving mastered the art of delivering razor-sharp rhymes - this Delhi-based duo comprising Encore ABJ and Calm has used their lyrical dexterity to push forward the boundaries of Hip-Hop in India. Presenting Hindi Rap in a revolutionary new format, Seedhe Maut is taking the industry by storm and is unanimously regarded as the next big thing to break in the rapidly growing subculture landscape.\r\n\r\nAge Restriction: 16+",
    "start": "2024-04-27T19:00:00+05:30",
    "end": "2024-04-27T22:00:00+05:30"
  },
  {
    "title": "Shreya Ghoshal “All Hearts Tour\" - Bengaluru",
    "subtitle": "By Superhits 93.5 RED FM",
    "cost": "₹999 onwards",
    "datetime": "11th May 7:30 PM - 10:00 PM",
    "venue": null,
    "event_id": "33048",
    "location": "Bengaluru",
    "description": "Superhits 93.5 RED FM brings Shreya Ghoshal, All hearts tour Bengaluru RED LIVE\r\nin Concert Co-presented by Kalaluha.\r\nLet's experience the magic of Shreya Ghoshal's All Hearts Tour in Namma\r\nBengaluru. Prepare to be captivated by the mesmerizing blend of Shreya Ghoshal's\r\nsoulful voice and magnetic stage presence, accompanied by a talented band that\r\ninfuses energy and finesse into every performance.",
    "start": "2024-05-11T19:30:00+05:30",
    "end": "2024-05-11T22:00:00+05:30"
  },
  {
    "title": "Mid Wicket Stories",
    "cost": "₹17000 onwards",
    "datetime": "6th April 11:30 PM - 11:59 PM",
    "venue": "ITC Gardenia, a Luxury Collection Hotel",
    "event_id": "33249",
    "location": "1, Residency Rd, Ashok Nagar",
    "description": "Stumps Up for Stories: An Evening with Cricket's Icons Sir Geoffrey Boycott and Sunil Gavaskar. Calling all cricket fans for timeless conversation. Join us for an unforgettable evening as we discuss the legends who shaped the game we love. Don't miss this once-in-a-lifetime opportunity to hear the inside stories from the heroes of cricket. They are going to discuss cricket stories from the time when the internet was not there. Get ready for a journey back in time as we bring together legendary cricketers for a timeless conversation that transcends eras! From Yesterday's Glory to Today's Inspiration: Join us for an unforgettable evening of cricket stories and timeless wisdom from the cricketing legends who've shaped the game we adore. It's not just an event; it's a pilgrimage for every cricket fan seeking to relive the magic of yesteryears.",
    "url": "https://insider.in/mid-wicket-stories-presents-stories-of-the-legends-2024-apr6-2024/event#"
  },
  {
    "title": "Married Men These Days",
    "cost": "₹299 onwards",
    "datetime": "7th April 9:00 PM - 11:59 PM",
    "venue": "The Underground Comedy Club",
    "event_id": "33619",
    "location": "Building No.480, KHB Colony, 5th Block, Koramangala",
    "description": "Welcome to the most hilarious celebration of love – it`s the \"Married Men These Day\" Standup Line Up! Grab your sweetheart, leave the kids with the babysitter, and get ready for a night of gut-busting laughter as our seasoned comics navigate the ups and downs of married life. Picture this: a lineup of witty husbands who`ve mastered the art of surviving \"These Days\". From the quest for the perfect gift to the delicate dance of planning the ideal date night, our comedians will take you on a rollercoaster of relatable anecdotes and side-splitting observations about the challenges and triumphs of being married on the most love-filled day of the year. Expect uproarious tales of last-minute flower shopping, attempts at romantic gestures gone wrong, and the eternal struggle to decode the mysteries of the perfect Love Greeting card.",
    "url": "https://insider.in/married-men-these-days-apr7-2024/event#"
  },
  {
    "title": "Ridiculous - Stand Up Comedy Show",
    "cost": "₹249 onwards",
    "datetime": "6th April to 4th May 6:30 PM onwards",
    "venue": "Atta Galata",
    "event_id": "33620",
    "location": "178, 5th Main Rd, Binnamangala, Hoysala Nagar, Indiranagar",
    "description": "About the show: Prepare yourself for an unforgettable evening of laughter as \"Ridiculous\" takes center stage with four of the wittiest stand-up comedians hailing from the vibrant city of Bangalore. Join us for a comedy extravaganza that blends the city`s tech-savvy charm, cultural quirks, and the unique flavor of everyday life. Ridiculous promises an evening filled with relatable humor delivered with the unique comedic flair that sets Bangalore`s stand-up comedy scene apart.",
    "url": "https://insider.in/ridiculous-stand-up-comedy-show-mar2-2024/event#"
  },
  {
    "title": "CrossOver Music Festival",
    "subtitle": "Unwind. Experience. Relive.",
    "cost": "Free entry",
    "datetime": "6th to 7th April 7:00 PM onwards",
    "venue": "HIGH Ultra Lounge",
    "event_id": "33797",
    "location": "26/1, Rooftop, World Trade Center, Dr Rajkumar Rd, Malleshwara",
    "description": "Bangalore’s very own music festival - CrossOver Music Festival is back in your city with a massive Artist Line up & Production like never seen before this April. Brace yourselves, techno lovers. \r\n\r\n#CentiGradeTurns11Edition\r\n\r\n6th April: Hunter/Game (Afterlife) + Ranjana & many more\r\n\r\n7th April: Almost Human B2B Mafaiza + Sidbit & many more"
  },
  {
    "title": "SCC SkyCinema - Jab We Met",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "6th April 7:00 PM - 10:30 PM",
    "venue": "Forum South Bengaluru",
    "event_id": "33855",
    "location": "Konanakunte Cross Metro Station, Anjanadri Layout, Konanakunte",
    "description": "\"Mein Apni Favourite Hoon” - Jab We Met \r\n\r\nAll aboard for a night of love, laughter, and unforgettable moments as we bring you the iconic Bollywood masterpiece. Sunset Cinema Club invites you to join us for a cinematic experience that will touch your heart and leave you with a smile at Forum South Bangalore Mall. \r\n\r\nEnjoy your favorite movie on a breezy terrace, perched on the rooftop of Forum South Bangalore Mall. Here you'll have an unobstructed view of the night sky, creating a unique and immersive cinema experience as you sink into comfy bean bags or mattresses and watch the movie on a large screen with the skyline of the city as your backdrop.",
    "start": "2024-04-06T19:00:00+05:30",
    "end": "2024-04-06T22:30:00+05:30"
  },
  {
    "title": "SCC Picnic Cinema - Scent Of A Woman",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "6th April 7:00 PM - 10:30 PM",
    "venue": "GCBC - Garden City Beer Collective",
    "event_id": "33858",
    "location": "82/2, Gantiganahalli",
    "description": "\"The day we stop looking, Charlie, is the day we die.\" - Scent Of A Woman\r\n\r\nSunset Cinema Club invites you to embark on an unforgettable cinematic experience with a screening of this timeless classic at Garden City Beer Collective (GCBC). This gripping drama explores themes of friendship, honor, and the beauty of life's simple pleasures.\r\n\r\nCome for an evening of cinematic delight, as the sun goes down, and the show comes on! Enjoy a picnic-y ambiance, where you can sit or even lie down on comfy bean bags, surrounded by lush green grass! String lights illuminate the area, casting a warm glow that sets the perfect mood for the evening, while you enjoy your favorite film on a large screen with surround sound accompanied with delicious munchies and drinks!",
    "start": "2024-04-06T19:00:00+05:30",
    "end": "2024-04-06T22:30:00+05:30"
  },
  {
    "title": "SCC SkyCinema - Baby's Day Out",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "13th April 7:00 PM - 10:30 PM",
    "venue": "Forum South Bengaluru",
    "event_id": "33859",
    "location": "Konanakunte Cross Metro Station, Anjanadri Layout, Konanakunte",
    "description": "\"I'm telling you. That kid is a genius.\" - Baby's Day Out \r\n\r\nGet ready for a heartwarming journey into the world of pure innocence as Sunset Cinema Club presents this family comedy classic at Forum South Bangalore Mall. Join us for an evening filled with giggles, mischief, and the delightful escapades of Baby Bink under the sunlit sky. \r\n\r\nEnjoy your favorite movie on a breezy terrace, perched on the rooftop of Forum South Bangalore Mall. Here you'll have an unobstructed view of the night sky, creating a unique and immersive cinema experience as you sink into comfy bean bags or mattresses and watch the movie on a large screen with the skyline of the city as your backdrop.",
    "start": "2024-04-13T19:00:00+05:30",
    "end": "2024-04-13T22:30:00+05:30"
  },
  {
    "title": "SCC Picnic Cinema - About Time",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "14th April 7:00 PM - 10:30 PM",
    "venue": "GCBC - Garden City Beer Collective",
    "event_id": "33861",
    "location": "82/2, Gantiganahalli, Bengaluru",
    "description": "\"I am going to live every day as if it's the last day of my life.\" - About Time\r\n\r\nPrepare for an extraordinary evening under the stars as Sunset Cinema Club invites you to the screening of this heartwarming and time-bending film. Join us for a cinematic journey that explores love, laughter, and the magic found in the most ordinary moments at Garden City Beer Collective (GCBC). \r\n\r\nCome for an evening of cinematic delight, as the sun goes down, and the show comes on! Enjoy a picnic-y ambiance, where you can sit or even lie down on comfy bean bags, surrounded by lush green grass! String lights illuminate the area, casting a warm glow that sets the perfect mood for the evening, while you enjoy your favorite film on a large screen with surround sound accompanied by delicious munchies and drinks!",
    "start": "2024-04-14T19:00:00+05:30",
    "end": "2024-04-14T22:30:00+05:30"
  },
  {
    "title": "SCC - Harry Potter and the Prisoner of Azkaban",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "20th April 7:00 PM - 10:30 PM",
    "venue": "Forum South Bengaluru",
    "event_id": "33863",
    "location": "Konanakunte Cross Metro Station, Anjanadri Layout, Konanakunte",
    "description": "\"\"\"Happiness can be found even in the darkest of times if one only remembers to turn on the light.\"\" - Harry Potter and the Prisoner of Azkaban\r\n\r\nEmbark on a journey with Harry, Ron, Hermione, and the entire Hogwarts cast in the third installment of the beloved series. Sunset Cinema Club invites you for an evening filled with mysterious encounters, daring adventures, and the unveiling of secrets that will keep you on the edge of your seat at Forum South Bangalore Mall. \r\n\r\nEnjoy your favorite movie on a breezy terrace, perched on the rooftop of Forum South Bangalore Mall. Here you'll have an unobstructed view of the night sky, creating a unique and immersive cinema experience as you sink into comfy bean bags or mattresses and watch the movie on a large screen with the skyline of the city as your backdrop.",
    "start": "2024-04-20T19:00:00+05:30",
    "end": "2024-04-20T22:30:00+05:30"
  },
  {
    "title": "SCC Picnic Cinema - Up!",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "20th April 7:00 PM - 10:30 PM",
    "venue": "GCBC - Garden City Beer Collective",
    "event_id": "33866",
    "location": "82/2, Gantiganahalli, Bengaluru",
    "description": "\"Adventure is out there. It's waiting for us!\" -Up!\r\n\r\nSunset Cinema Club invites you to immerse yourself in the touching story of Carl and Russell as they set out on a whimsical and emotional adventure. Celebrate this charming tale of friendship, adventure, and the power of dreams at Garden City Beer Collective (GCBC). \r\n\r\nCome for an evening of cinematic delight, as the sun goes down, and the show comes on! Enjoy a picnic-y ambiance, where you can sit or even lie down on comfy bean bags, surrounded by lush green grass! String lights illuminate the area, casting a warm glow that sets the perfect mood for the evening, while you enjoy your favorite film on a large screen with surround sound accompanied by delicious munchies and drinks!",
    "start": "2024-04-20T19:00:00+05:30",
    "end": "2024-04-20T22:30:00+05:30"
  },
  {
    "title": "SCC SkyCinema - Veer Zaara",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "27th April 7:00 PM - 10:30 PM",
    "venue": "Forum South Bengaluru",
    "event_id": "33867",
    "location": "Konanakunte Cross Metro Station, Anjanadri Layout, Konanakunte",
    "description": "\"Aaj se meri har raahein, meri manzilein, aur meri kahani sirf tumse.\"- Veer Zaara\r\n\r\nImmerse in an evening of timeless romance and soul-stirring melodies as Sunset Cinema Club brings this Bollywood classic to Forum South Bangalore Mall. Join us for a cinematic experience that transcends borders, celebrates love, and tugs at the strings of your heart.\r\n\r\n Enjoy your favorite movie on a breezy terrace, perched on the rooftop of Forum South Bangalore Mall. Here you'll have an unobstructed view of the night sky, creating a unique and immersive cinema experience as you sink into comfy bean bags or mattresses and watch the movie on a large screen with the skyline of the city as your backdrop.",
    "start": "2024-04-27T19:00:00+05:30",
    "end": "2024-04-27T22:30:00+05:30"
  },
  {
    "title": "SCC Picnic Cinema - Hasee Toh Phasee",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "28th April 7:00 PM - 10:30 PM",
    "venue": "GCBC - Garden City Beer Collective",
    "event_id": "33869",
    "location": "82/2, Gantiganahalli, Bengaluru",
    "description": "\"Meri life mein koi role nahi hai. Main life ka role play karta hoon.\" - Hasee Toh Phasee\r\n\r\nSunset Cinema Club invites you to a delightful romantic comedy that follows the quirky love story of Nikhil and Meeta at Garden City Beer Collective (GCBC). With its refreshing storyline and endearing performances, this movie is sure to leave you smiling.  \r\n\r\nCome for an evening of cinematic delight, as the sun goes down, and the show comes on! Enjoy a picnic-y ambiance, where you can sit or even lie down on comfy bean bags, surrounded by lush green grass! String lights illuminate the area, casting a warm glow that sets the perfect mood for the evening, while you enjoy your favorite film on a large screen with surround sound accompanied by delicious munchies and drinks!",
    "start": "2024-04-28T19:00:00+05:30",
    "end": "2024-04-28T22:30:00+05:30"
  },
  {
    "title": "Church Street Gaming by The Boardgame Den",
    "cost": "₹450 onwards",
    "datetime": "23rd March to 27th April 3:00 PM onwards",
    "venue": "The Boardgame Den",
    "event_id": "34030",
    "location": "Pavilion Mall, 62/63, Church St, Haridevpur, Shanthala Nagar, Ashok Nagar",
    "description": "Detox from technology, interact with people, and have a blast! We have games from around the world that will get you hooked. Chill out with a light fun game or indulge in a rapt Euro one. Boardgames are for everyone! We have been collecting international board games for the last 15 years. We gather every weekend to play these games. Anyone over the age of 14 is welcome! You can come by yourself or in a group and don't worry about not knowing how to play them. We will help you find a suitable game, gather players, and teach you the rules. The events are conducted inside the WeWork Pavillion, which is on Church Street, in between the Metro Station and Starbucks. It is the Purva building right opposite Matteo Coffee. PS: We charge a flat entry fee for the entire event and don't charge additionally per game or by the hour. Once you are in, feel free to play as many games as you like until close.",
    "url": "https://insider.in/church-street-gaming-by-the-boardgame-den-aug26-2023/event#"
  },
  {
    "title": "Motta Maadi Music - Unplugged!",
    "cost": "₹600 onwards",
    "datetime": "7th April 1:00 PM - 8:30 PM",
    "venue": "Jyoti Nivas Pre-University College",
    "event_id": "34031",
    "location": "WJM8+FFW, Hosur Rd, KHB Colony, 5th Block, Koramangala",
    "description": "Vanakkam Bangalore Makkaley!\r\n\r\nAs promised, we are bringing the ‘Unplugged’ show to Bengaluru! This dream show of ours was launched in Chennai last November and finally, we are bringing it to other cities :) Bringing in raw and exhilarating music, celebrating the most beautiful thamizh melodies, and more importantly the beautiful The Sunshine Orchestra. Our ‘Unplugged’ show was one of our favorite shows ever. When we did it in Chennai, it was emotional and magical! Please come along with your friends and family to sing along in this format :)  We are performing in ‘Jyoti Nivas Auditorium- Koramangala’ on April 7th - Sunday Come off. It will be magical ♥️",
    "url": "https://insider.in/motta-maadi-music-unplugged-bangalore--apr7-2024/event#"
  },
  {
    "title": "Kids Art Summer Camp",
    "cost": "₹6400 onwards",
    "datetime": "1st to 5th April 11:00 AM onwards",
    "venue": "Paint Cafe Studio",
    "event_id": "34032",
    "location": "16, 4th floor, SV Atrium, Tree Park Metro Station, ECC Rd, behind Bhagini Icon, near Kadugodi, Upkar Layout, Whitefield",
    "description": "Unlock Your Child's Creative Potential: Join Our 5-Day Art Summer Camp!\r\n\r\nDay 1: Let their imagination soar with pottery hand building, where they'll mold and shape clay into beautiful creations.\r\nDay 2: Watch their green thumbs at work as they create their very own mini garden in a jar, learning about plant care and design along the way.\r\nDay 3: Canvas painting extravaganza! Your child will explore colors, textures, and techniques to create their masterpiece.\r\nDay 4: Get ready for a unique twist with Deco podge art on a clock, where they'll personalize timepieces with their designs and flair.\r\nDay 5: Ignite their senses with candle making, where they'll craft fragrant candles to illuminate any space.\r\n\r\nDon't miss out on this enriching and fun-filled summer camp experience for your kid! Sign up now to secure your child's spot in a week of creativity and exploration.",
    "url": "https://insider.in/kids-art-summer-camp-apr1-2024/event#"
  },
  {
    "title": "Karaoke Nights Ft. KJ Naveen",
    "subtitle": "Free",
    "cost": "entry 4th to 25th April",
    "datetime": "8:30 PM onwards Hard Rock Cafe, Whitefield",
    "venue": "Unit G-25 & 26, Ground Floor, Park Square Mall International Tech Park, Bangalore, Pattandur Agrahara",
    "event_id": "34033",
    "location": "ABOUT THIS EVENT",
    "description": "Read more",
    "url": "https://insider.in/karaoke-nights-ft-kj-naveen-apr4-2024/event#"
  },
  {
    "title": "Boogie Nights Ft. Prashu",
    "subtitle": "Free",
    "cost": "entry 5th to 12th April",
    "datetime": "8:00 PM onwards Hard Rock Cafe, St Marks Rd",
    "venue": "40, St Marks Rd, Shanthala Nagar, Ashok Nagar",
    "event_id": "34035",
    "location": "ABOUT THIS EVENT",
    "description": "Read more",
    "url": "https://insider.in/boogie-nights-ft-prashu-apr5-2024/event#"
  },
  {
    "title": "Blockbuster Friday Ft. DJ Franky",
    "subtitle": "Free",
    "cost": "entry 5th to 26th April",
    "datetime": "8:30 PM onwards Hard Rock Cafe Bengaluru Whitefield",
    "venue": "Unit G-25 & 26, Ground Floor, Park Square Mall International Tech Park, Bangalore, Pattandur Agrahara",
    "event_id": "34036",
    "location": "ABOUT THIS EVENT",
    "description": "Read more",
    "url": "https://insider.in/blockbuster-friday-ft-dj-franky-apr5-2024/event#"
  },
  {
    "title": "Mere Khayal Se By Amandeep Singh",
    "cost": "₹499 onwards",
    "datetime": "6th April 6:00 PM - 11:59 PM",
    "venue": "Just BLR",
    "event_id": "34037",
    "location": "Deena Complex, Opp MC Donald, Brigade Rd, Shanthala Nagar, Ashok Nagar",
    "description": "After giving multiple sold out shows in 30+ cities Amandeep is coming to Bangalore with his special ‘Mere Khayal Se.’ An hour long show with a mix bag of poetries, shayaris and personal life stories by Amandeep Singh with a twist. We all have our own perspective of viewing things but what if all the things that we see have something hidden behind them. Amandeep is here not just to entertain you but also let you see things beyond the words. So come and spend an amazing evening full of stories, poems and love.",
    "url": "https://insider.in/mere-khayal-se-by-amandeep-singh-a-storytelling-show-bangalore-apr6-2024/event#"
  },
  {
    "title": "The human being and the cosmos",
    "cost": "₹50 onwards",
    "datetime": "6th April 6:30 PM - 11:59 PM",
    "venue": "New Acropolis Jayanagar",
    "event_id": "34038",
    "location": "Ground Floor, #264, 7th Cross Rd, 6th Block, 1st Block, Jayanagar 1st Block, Jayanagar",
    "description": "Here's a glimpse into Living Philosophy! How can we engage more fully with life? Is reality more than it seems to be? We are all the time living 3 levels of life: the personal, the social and the global / cosmic. The voice of the personal level often tends to drown out the other two, and we especially forget that we are linked to life itself! In this talk, we explore the connection between the laws of individual life and the universe – through ideas of the 3 levels of reality according to Greek philosophy, Dharma and Karma, destiny and free will. It invites you to develop an approach to engage fully with life, through meaningful steps in the world.",
    "url": "https://insider.in/the-human-being-and-the-cosmos-apr6-2024/event#"
  },
  {
    "title": "Gautham Govindan LIVE",
    "cost": "₹349 onwards",
    "datetime": "28th April 7:00 PM - 11:59 PM",
    "venue": "Ministry Of Comedy",
    "event_id": "34039",
    "location": "18th Main Road, 138/B, 5th Cross Rd, behind Cafe Coffee Day, KHB Colony, 5th Block, Koramangala",
    "description": "With over 20+million views on Instagram and Youtube, Gautham Govindan brings to you his first solo show. Gautham Govindan also brings to you this description which he’s having a tough time writing. All he can guarantee is an hour of laughs with material honed over the last 2 years. I’ll see you - I mean - He’ll see you there.",
    "url": "https://insider.in/gautham-govindan-live-apr28-2024/event#"
  },
  {
    "title": "MAGIQUE presents HIDDEN EMPIRE",
    "subtitle": "Impulsive, deeply moving soundscape",
    "cost": "₹699 onwards",
    "datetime": "31st March 8:00 PM - 1:00 AM",
    "venue": "Magique, Koramangala",
    "event_id": "34052",
    "location": "Plot No, 36, 100 Feet Rd, opp. to Shilton Royale Hotel, Srinivagilu, Chandra Reddy Layout, S T Bed Layout, Koramangala",
    "description": "Magique presents Hidden Empire Hailing from Germany, the duo consists of Branko and Niklas, who have been pushing the boundaries of electronic music since their debut in 2015. They have released numerous tracks on some of the world's top techno labels and have gained a loyal following of fans from around the globe.By sharing a musical vision of creating an impulsive, deeply moving soundscape, using the very essential and deepest elements of House and Techno.\r\n\r\nThe corresponding result is a floating, emotional journey through a distinctive mixture of genres. The euphoric and uplifting combination of straight drums and hypnotic melodies is made for enormous sound systems and long club nights.",
    "start": "2024-03-31T20:00:00+05:30",
    "end": "2024-04-01T01:00:00+05:30"
  },
  {
    "title": "nu:beat Nights At WL Club",
    "subtitle": "From IBIZA To INDIA",
    "cost": "₹299 onwards",
    "datetime": "5th April 7:00 PM - 1:00 AM",
    "venue": "White Lotus Club, Bengaluru",
    "event_id": "34127",
    "location": "26, Haralur Main Rd, near HP Petrol Station, Amblipura, PWD Quarters, Ambalipura, HSR Layout",
    "description": "Get ready for an electrifying night of beats, performances, and the ultimate kicks!\r\n\r\nHeadlining the event is the sensational DJ duo ANSWER. Also hitting the stage are DJ ASHTRIX, DJ AUDIOPHILE, rapper AUTHEN, Indo-Western fusion trio FLUTE FANTASY, genre-liberated band TABLE FOR 4, and beatboxer RON.\r\n\r\nBut this event isn't just about the music – it's the perfect mix of rhythm and style. Join us as we launch the hottest new brand to hit Indian shores!",
    "start": "2024-04-05T19:00:00+05:30",
    "end": "2024-04-06T01:00:00+05:30"
  },
  {
    "title": "Pet Fiesta",
    "subtitle": "Namma Bengaluru Pet Show",
    "cost": "₹299 onwards",
    "datetime": "7th April 11:00 AM - 10:00 PM",
    "venue": "Jayamahal Palace",
    "event_id": "34133",
    "location": "1, Jayamahal Main Rd, near Cantonment Railway Station Road, Nandi Durga Road Extension, Jayamahal",
    "description": "Welcome to the Pet Fiesta, a lively and vibrant event celebrating our beloved furry friends! From playful pups to majestic felines, this festival is a paradise for all animal lovers. Enjoy a day filled with exciting activities such as pet parades, talent shows, and even a petting zoo for the little ones. \r\n\r\nDon't forget to browse through the numerous stalls offering treats, toys, and accessories for your cherished companions. Whether you have a four-legged friend of your own or simply appreciate the joy animals bring, the Pet Fiesta promises a day of fun and laughter for everyone. Join us in this enchanting celebration of the special bond between humans and their pets!",
    "start": "2024-04-07T11:00:00+05:30",
    "end": "2024-04-07T22:00:00+05:30"
  },
  {
    "title": "Soul Jams",
    "subtitle": " by Soul Ventures",
    "cost": "₹590 onwards",
    "datetime": "6th April 4:30 PM - 8:30 PM",
    "venue": "ButterFly - Brew Bite & Fly",
    "event_id": "34217",
    "location": "57, 3rd Floor, 1st Main Rd, Sarakki Industrial Layout, Dollar Layout, 3rd Phase, J. P. Nagar",
    "description": "Soul Jams is the ultimate destination for music lovers! Join us for an evening of relaxation, unwinding, and rejuvenation. Our welcoming space allows you to be yourself and feel at home. \r\nBring your guitars, cajones, and voices to sing your heart out alongside our vibrant community in a beautiful jamming session. \r\n\r\nThe event comprises three soul-enriching parts: \r\n\r\n1. Soul Open Mic: Perform for a warm and appreciative audience, regardless of where you are on your musical journey. Reach out to @souljams_live on Instagram to book your slot.\r\n2. Social Mixers: Connect with like-minded individuals and find your tribe, fostering meaningful connections. \r\n3. Soul Jamming: Sing, play instruments, and join the community in a spontaneous, free-flowing musical experience. We create music together, fostering an atmosphere of refreshment and excitement.",
    "start": "2024-04-06T16:30:00+05:30",
    "end": "2024-04-06T20:30:00+05:30"
  }
]