[
  {
    "title": "DANIEL SLOSS: CAN’T - India Tour 2024 - Bengaluru",
    "cost": "₹999 onwards",
    "datetime": "17th March 7:00 PM - 11:59 PM",
    "venue": "St. John's Auditorium",
    "event_id": "30743",
    "location": "WJJC+JP8, 18th Main Rd, John Nagar, Koramangala, Bengaluru,",
    "description": "Daniel’s previous ground-breaking, global smash-hits include ‘HUBRiS’ (the world’s biggest solo comedy touring show and 5th biggest ticket selling event for most of 2021 as reported in Pollstar) and ‘X’ (his acclaimed tour de force about sexual assault. ‘X’ toured non-stop for 300 performances over 17 months around the globe, traversing Europe, UK, U.S., Canada, Australia, Hong Kong, Japan and even packing a Moscow arena (becoming Russia’s biggest-ever English language comedy show and creating a sensation with a joke about the importance of sex education – not a taboo subject in Putin’s Russia – an illegal one.). The film of ‘X’ is on HBO in USA, Canada and was the first UK comedy special with a UK premiere in cinemas, following a nationwide release at Vue",
    "url": "https://insider.in/daniel-sloss-cant-india-tour-2024-bangalore-mar17-2024/event"
  },
  {
    "title": "Sitar For Mental Health",
    "subtitle": "HSBC presents ‘SFMH’ - Rishab Rikhiram Sharma",
    "cost": "₹354 onwards",
    "datetime": "31st March 7:00 PM - 10:00 PM",
    "venue": "Prestige Srihari Khoday Centre",
    "event_id": "31539",
    "location": "Silver Oak Plantation, 25, Mudalappa St, Anjanadri Layout, Konanakunte, Bengaluru, Karnataka 560062",
    "description": "Sitar for Mental Health events are immersive experiences that bridge ancient practices of sound and energy medicine using traditional Indian music, designed to invoke states of deep reflection, receptivity, and introspection.\r\n\r\nSitarist, music producer, and mental health advocate, Rishab Rikhiram Sharma, is made for the spotlight and his multi-faceted career is shaping up to be nothing short of iconic. Rishab presents his massive fourth Pan India SFMH Tour across eleven cities. Bringing awareness towards Mental health by inducing education and experiences of the auditory sensory processing system which Classical music brings forth and re-introduces the sound of the Sitar as a transformational tool.",
    "start": "2024-03-31T19:00:00+05:30",
    "end": "2024-03-31T22:00:00+05:30"
  },
  {
    "title": "Seedhe Maut - Lunch Break India Tour 2024",
    "subtitle": "Still On A Lunch Break!",
    "cost": "₹943 onwards",
    "datetime": "27th April 7:00 PM - 10:00 PM",
    "venue": "Venue to be Announced",
    "event_id": "31673",
    "location": "Bengaluru",
    "description": "Catch the 'best in the business' in a city near you! Seedhe Maut are taking their hit mixtape on a massive 12-city pan-India tour. The dynamic duo, known for their explosive live performances, will be playing an extended set and will feature several special guests as well as a few surprises! Get your tickets now! \r\n\r\nHaving mastered the art of delivering razor-sharp rhymes - this Delhi-based duo comprising Encore ABJ and Calm has used their lyrical dexterity to push forward the boundaries of Hip-Hop in India. Presenting Hindi Rap in a revolutionary new format, Seedhe Maut is taking the industry by storm and is unanimously regarded as the next big thing to break in the rapidly growing subculture landscape.\r\n\r\nAge Restriction: 16+",
    "start": "2024-04-27T19:00:00+05:30",
    "end": "2024-04-27T22:00:00+05:30"
  },
  {
    "title": "Bangalore Holi Festival 2024",
    "subtitle": "| Rain Dance | Disco Bash |",
    "cost": "₹200 onwards",
    "datetime": "23rd to 25th March 11:00 AM onwards",
    "venue": "Skygarden, Whitefield",
    "event_id": "31831",
    "location": "Metro station, 3rd floor HVP Aster, ITPL Main Rd, near Garudacharpalya, Kaveri Nagar, Krishnarajapura",
    "description": "It's gonna be a riot of COLORS!\r\n\r\nBangalore's Biggest #HOLI Festival 2024 is back at SKY GARDEN, WHITEFIELD, and you wouldn't want to be anywhere else on this 'Holi'Day! \r\nChoose from or be there on all 3 days with 8 hours of Music & FNB."
  },
  {
    "title": "Bengaluru Holi Carnival",
    "subtitle": "Holi Carnival in Bangalore",
    "cost": "₹499 onwards",
    "datetime": "23rd to 25th March 11:00 AM onwards",
    "venue": "Hotel Royal Orchid, Domlur",
    "event_id": "31905",
    "location": "No 1, Golf Avenue, adjoining KGA Golf Course, HAL Old Airport Rd, Domlur",
    "description": "This year's Biggest Holi Carnival at Hotel Royal Orchid Domlur promises a multitude of surprises!\r\n\r\nA grand setup awaits you\r\nComplimentary colors for everyone\r\nExpansive lawn area\r\nDelicious food stalls\r\nEnjoy a rain dance to amplify the festive spirit."
  },
  {
    "title": "SCC Picnic Cinema - Love Aaj Kal",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "24th March 7:00 PM - 10:30 PM",
    "venue": "GCBC - Garden City Beer Collective",
    "event_id": "31938",
    "location": "82/2, Gantiganahalli",
    "description": "\"Jaane se pehle, ek aakhri baar milna kyun zaroori hota hai?” - Love Aaj Kal\r\n\r\nCome for an evening of cinematic delight, as the sun goes down, and the show comes on! Enjoy a picnic-y ambiance, where you can sit or even lie down on comfy bean bags, surrounded by lush green grass! String lights illuminate the area, casting a warm glow that sets the perfect mood for the evening, while you enjoy your favorite film on a large screen with surround sound accompanied with delicious munchies and drinks!\r\n\r\nScreening Schedule: \r\n\r\n24th March, Sunday - Love Aaj Kal\r\n\r\nGates open at 7:00 pm and the movie starts at 7.30 pm.\r\n\r\nSeating:\r\n\r\nBeanbag seating is available at the venue. \r\n\r\nSeating will be allocated on a first-come-first-served basis\r\n\r\nWe recommend that you carry warm clothes/blankets for your comfort during the screening",
    "start": "2024-03-24T19:00:00+05:30",
    "end": "2024-03-24T22:30:00+05:30"
  },
  {
    "title": "SCC Open Air Cinema - Zindagi Na Milegi Dobara",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "23rd March 7:00 PM - 10:30 PM",
    "venue": "GCBC - Garden City Beer Collective",
    "event_id": "31939",
    "location": "82/2, Gantiganahalli",
    "description": "\"Seize the day, my friend. Pehle is din ko poori tarah jiyo, phir chalis ke bare mein sochna.\" - Zindagi Na Milegi Dobara\r\n\r\nRelive the surreal moments, laughter, and life-changing experiences of this modern day classic with Sunset Cinema Club at Ecodeck.\r\n\r\nLocated in Bangalore's bustling metropolis, this business hub transforms into a haven of relaxation and entertainment as the sun sets and the stars begin to emerge, as your film screening begins. Enjoy your favorite film on a large screen with surround sound, as you sink into comfy bean bags, in the great outdoors.\r\n\r\nScreening Schedule:\r\n\r\n23rd March, Saturday - Zindagi Na Milegi Dobara\r\n\r\nGates open at 7:00 pm and the movie starts at 7:30 pm.\r\n\r\nSeating:\r\n\r\nBean Bag seating is available\r\n\r\nSeating will be allocated on a first-come-first-served basis",
    "start": "2024-03-23T19:00:00+05:30",
    "end": "2024-03-23T22:30:00+05:30"
  },
  {
    "title": "SCC SkyCinema - Ticket To Paradise",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "30th March 7:00 PM - 9:00 PM",
    "venue": "Forum South Bengaluru",
    "event_id": "31941",
    "location": "Konanakunte Cross Metro Station, Anjanadri Layout, Konanakunte",
    "description": "\"There’s Not Enough Alcohol In The World.” - Ticket to Paradise\r\n\r\nWe have a ticket to paradise for you and the seatmate you bring along for the screening of this exciting new film, starring everyone's favorite duo, George Clooney and Julia Roberts playing a divorced couple who team up to sabotage the impending wedding of their daughter in Bali. \r\n\r\nEnjoy your favorite movie on a breezy terrace, perched on the rooftop of Forum South Bangalore Mall. Here you'll have an unobstructed view of the night sky, creating a unique and immersive cinema experience as you sink into comfy bean bags or mattresses and watch the movie on a large screen with the skyline of the city as your backdrop.\r\n\r\nScreening Schedule: \r\n\r\n30th March, Saturday - Ticket to Paradise\r\n\r\nGates open at 7:00 pm and the movie starts at 7.30 pm",
    "start": "2024-03-30T19:00:00+05:30",
    "end": "2024-03-30T21:00:00+05:30"
  },
  {
    "title": "SCC Open Air Cinema - Band Baaja Baarat",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "30th March 7:00 PM - 11:00 PM",
    "venue": "Ecoworld. The Bay Food Court",
    "event_id": "31942",
    "location": "RMZ Eco World Rd, Adarsh Palm Retreat, Bellandur",
    "description": "Get ready for a night of excess, adrenaline, and unabashed indulgence as Sunset Cinema Club presents a special screening of this blockbuster hit at Ecodeck. Brace yourselves for a rollercoaster ride through the high-stakes world of finance, where greed knows no bounds and the pursuit of success takes a wild turn. Located in Bangalore's bustling metropolis, this business hub transforms into a haven of relaxation and entertainment as the sun sets and the stars begin to emerge, as your film screening begins. Enjoy your favorite film on a large screen with surround sound, as you sink into comfy bean bags, in the great outdoors.",
    "start": "2024-03-30T19:00:00+05:30",
    "end": "2024-03-30T23:00:00+05:30"
  },
  {
    "title": "SCC Picnic Cinema - The Grand Budapest Hotel",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "31st March 7:00 PM - 10:00 PM",
    "venue": "GCBC - Garden City Beer Collective",
    "event_id": "31943",
    "location": "82/2, Gantiganahalli",
    "description": "\"Rudeness is merely an expression of fear. People fear they won't get what they want.\" - The Grand Budapest Hotel\r\n\r\nEmbark on a journey to the whimsical world of Wes Anderson as Sunset Cinema Club presents a special screening of this visually enchanting film. Join us for an evening of cinematic elegance, where the charm of the Grand Budapest as its eccentric characters come to life at our venue in Garden City Beer Collective. Come for an evening of cinematic delight, as the sun goes down, and the show comes on! Enjoy a picnic-y ambiance, where you can sit or even lie down on comfy bean bags, surrounded by lush green grass! String lights illuminate the area, casting a warm glow that sets the perfect mood for the evening, while you enjoy your favorite film on a large screen with surround sound accompanied by delicious munchies and drinks!",
    "start": "2024-03-31T19:00:00+05:30",
    "end": "2024-03-31T22:00:00+05:30"
  },
  {
    "title": "Holi at the Palace",
    "subtitle": "Legendary Holi at Jayamahal Palace",
    "cost": "₹299 onwards",
    "datetime": "24th March 12:00 PM - 10:00 PM",
    "venue": "Jayamahal Palace",
    "event_id": "32160",
    "location": "1, Jayamahal Main Rd, near Cantonment Railway Station Road, Nandi Durga Road Extension, Jayamahal",
    "description": "House & EDM with the legendary\r\nDJ IVAN\r\n\r\nThe Ultimate Holi Beats with The King of Bollywood \r\nDJ Jasmeet \r\n\r\nSundowner Set with the charming \r\nDJ Martin DSouza \r\n\r\n10 hours of nonstop music with undoubtedly 3 of the top DJs in Bangalore\r\nwith Live Dhol, Ample car parking and space for everybody, an Exclusive VIP Zone, Organic Colors, Holi Festive Decor, and well curated F&B - top food brands with a lip-smacking variety",
    "start": "2024-03-24T12:00:00+05:30",
    "end": "2024-03-24T22:00:00+05:30"
  },
  {
    "title": "Gulaaal Season 7",
    "subtitle": "Whitefield’s Biggest Holi Festival",
    "cost": "₹49 onwards",
    "datetime": "23rd to 25th March 11:00 AM onwards",
    "venue": "Aloft Hotel Lawns, Whitefield",
    "event_id": "32491",
    "location": "17C, Sadaramangala Rd, off Whitefield Main Road, opposite Itpl, Sadara Mangala Industrial Area, Thigalarapalya, Whitefield",
    "description": "Get ready to immerse yourself in a kaleidoscope of colors and happiness at our Holi event! Let's paint the town with laughter, love, and vibrant hues as we celebrate the arrival of spring and the triumph of good over evil. We have been coloring Bengaluru every year with full music, masti, dance, and color. Get ready for the most happening Holi festival Gulaaal Season 7"
  },
  {
    "title": "Mohe Rang De",
    "subtitle": "A Holi Extravaganza Like No Other!",
    "cost": "₹49 onwards",
    "datetime": "25th March 11:00 AM - 7:00 PM",
    "venue": "Manpho Spectrum 2",
    "event_id": "32515",
    "location": "Manpho Spectrum, No 90/1, Veerannapalya, Nagawara Ring Rd, Opp BEL Corp. Office",
    "description": "Get ready to immerse yourself in a spectrum of colors at the most anticipated Holi festival of the year! \"Mohe Rang De\" promises an unforgettable celebration, now at an even larger venue to double the fun!\r\n\r\nEvent Highlights \r\n1. Massive Open Ground.\r\n2. Huge Parking Space.\r\n3. Unlimited Colors\r\n4. 8 Hours of Continuous Music\r\n5. Get lost in 8 hours of thrilling music with our lineup of 10 celebrity DJs, including DJ Oppozit, DJ Ashwin, DJ Vijju, DJ Manny, DJ Mavis, DJ Pyrotics, DJ Kash, DJ J&A, and DJ Pillar, with MC Samaira Khan leading the charge!\r\n6. Live Veg/Non-Veg food stall and beverage stalls.\r\n7. Live Dhol\r\n8. A massive bar setup, \r\n9. A stage that promises to elevate the celebration.",
    "start": "2024-03-25T11:00:00+05:30",
    "end": "2024-03-25T19:00:00+05:30"
  },
  {
    "title": "Holi Sundowner",
    "subtitle": "Celebrity holi bash!",
    "cost": "₹999 onwards",
    "datetime": "22nd March 2:15 PM - 9:00 PM",
    "venue": "Manpho Spectrum",
    "event_id": "32596",
    "location": "Manpho Spectrum, No 90/1, Veerannapalya, Nagawara Ring Rd, Opp BEL Corp. Office, Bangalore",
    "description": "A Holi Celebrity Bash which is the first of its kind as a sundowner and colours to play all evening and night keeping the heat aside. Dance the Sundowner Away with live music by DJ Olly Esse, Progressive Brothers, and more Artists. Join us and have the best Holi ever with the best fire and Color show.  Feel the rainbow awaken your spirit with Holi Sundowner, the most vibrant Holi celebration in town.",
    "start": "2024-03-22T14:15:00+05:30",
    "end": "2024-03-22T21:00:00+05:30"
  },
  {
    "title": "Holi Barsane Wali",
    "subtitle": "No Dhaka Shaka – only Pao Ruka!",
    "cost": "₹1299 onwards",
    "datetime": "25th March 11:00 AM - 4:00 PM",
    "venue": "Urban Valley Resort",
    "event_id": "32619",
    "location": "Urban Valley Resort, Vaderahalli Village, Kanakapura Rd, Bengaluru, Karnataka 560082",
    "description": "Holi hai Boss! Let`s get ready and bring your friends/ family to whom you couldn`t meet due to traffic and forget about North South Bangalore. We bring you a perfect resort where you can enjoy Holi in a spacious arena with yummy thandai (authentic Holi beverage ) with pakodas.\r\nDance on DJ beats with Live Dhol beats. Enjoy the festival of colours with your loved ones.",
    "start": "2024-03-25T11:00:00+05:30",
    "end": "2024-03-25T16:00:00+05:30"
  },
  {
    "title": "Phoolon Wali Holi Ft. Panjabi MC",
    "subtitle": "Experience India`s First Ever Flower Holi Party!",
    "cost": "₹499 onwards",
    "datetime": "24th March 12:00 PM - 7:00 PM",
    "venue": "Oia",
    "event_id": "32682",
    "location": "162/2, Main Road, Hennur",
    "description": "Experience the most colorful celebration of Holi with a twist!\r\n\r\nJoin us at Bangalore`s most vibrant event, Oia presents Phoolon wali Holi, on 24th March, starting at 12 PM.\r\n\r\nFeaturing Punjabi MC (Fame Mundian To Bach Ke), Vipul Khurana, Dr Prakhar, Santana, and Virat Munjal, immerse yourself in the festivities with live Dhol, a cascade of flowers, delicious food and beverages, and international acts.\r\n\r\nLet`s bloom together in a riot of joy and music, where the air is filled with the fragrance of flowers and the spirit of togetherness! \r\n\r\nEvery participant will receive a bag of vibrant flowers and colors.",
    "start": "2024-03-24T12:00:00+05:30",
    "end": "2024-03-24T19:00:00+05:30"
  },
  {
    "title": "Holi Invasion 2024",
    "subtitle": "Open Air Rooftop Holi Concert",
    "cost": "₹499 onwards",
    "datetime": "25th March 10:00 AM - 4:00 PM",
    "venue": "Magique, Koramangala",
    "event_id": "32827",
    "location": "Plot No, 36, 100 Feet Rd, opp. to Shilton Royale Hotel, Srinivagilu, Chandra Reddy Layout, S T Bed Layout, Koramangala, Bengaluru, Karnataka 560095",
    "description": "Biggest Rooftop Holi Party in Bangalore! Enjoy Non-Stop Bollywood, Punjabi, Commercial Music 25th March 11 AM Onwards - with The Best DJs Of Bangalore Right Under One Club! ",
    "start": "2024-03-25T10:00:00+05:30",
    "end": "2024-03-25T16:00:00+05:30"
  },
  {
    "title": "Dhum Pichak Dhum",
    "subtitle": "by Banjara and Gypsy",
    "cost": "₹399 onwards",
    "datetime": "25th March 11:00 AM - 4:00 PM",
    "venue": "Dhwani - Bar & Kitchen",
    "event_id": "32828",
    "location": "43, Lower Ground Floor, 7th Main Rd, Appareddipalya, Indiranagar, Bengaluru, Karnataka 560038",
    "description": "Grand Holi Festival celebration at Dhwani, Indiranagar with colors, DJ and Live Dhol. \r\n\r\nBring your friends and gang to make this holi celebration super special. All day long party with dry and wet colors.\r\n\r\nNo holding back. Kyunki party yunhi chalegi",
    "start": "2024-03-25T11:00:00+05:30",
    "end": "2024-03-25T16:00:00+05:30"
  },
  {
    "title": "Holi High ft. Stebin Ben",
    "subtitle": "Prepare for an explosion of colours and music!",
    "cost": "₹999 onwards",
    "datetime": "23rd March 7:00 PM - 10:00 PM",
    "venue": "Phoenix Marketcity",
    "event_id": "32829",
    "location": "Palm Meadows, Prestige Ozone, Whitefield Main Road, Whitefield, Devasandra Industrial Estate, Krishnarajapura, Bengaluru, Karnataka 560048",
    "description": "Get set to immerse yourself in a spectacular celebration of music and colours at Phoenix Mall! On 23rd March, mark your calendars for the inaugural \"Stebin Ben Live in Concert\" event, where the vivacious spirit of Holi converges with the enchantment of live music for an experience like no other.\r\n\r\nTaking centre stage is the sensational Stebin Ben, whose infectious energy promises to ignite the crowd and keep you dancing all night long. Join us as we make history and revel in the magic of music, laughter, and unforgettable moments.\r\n\r\nDon't miss out on this one-of-a-kind event – secure your tickets now and let's make the inaugural \"Stebin Ben Live in Concert\" at Phoenix Mall an experience to remember!",
    "start": "2024-03-23T19:00:00+05:30",
    "end": "2024-03-23T22:00:00+05:30"
  },
  {
    "title": "Shreya Ghoshal, A RED LIVE & KALALUHA Concert",
    "subtitle": "By Superhits 93.5 RED FM",
    "cost": "₹749 onwards",
    "datetime": "11th May 7:30 PM - 10:00 PM",
    "venue": null,
    "event_id": "33048",
    "location": "Bengaluru",
    "description": "Superhits 93.5 RED FM brings Shreya Ghoshal, All hearts tour Bengaluru RED LIVE\r\nin Concert Co-presented by Kalaluha.\r\nLet's experience the magic of Shreya Ghoshal's All Hearts Tour in Namma\r\nBengaluru. Prepare to be captivated by the mesmerizing blend of Shreya Ghoshal's\r\nsoulful voice and magnetic stage presence, accompanied by a talented band that\r\ninfuses energy and finesse into every performance.",
    "start": "2024-05-11T19:30:00+05:30",
    "end": "2024-05-11T22:00:00+05:30"
  },
  {
    "title": "Usha Uthup Live with AIR",
    "subtitle": "Usha Uthup's First Live Open-Air Concert",
    "cost": "₹999 onwards",
    "datetime": "23rd March 6:00 PM - 9:30 PM",
    "venue": "Garuda Mall",
    "event_id": "33084",
    "location": "Magrath Rd, Ashok Nagar, Bengaluru, Karnataka 560025",
    "description": "Celebrating the timeless music of Usha Uthup, who has captivated audiences worldwide for 55 years and counting. This Concert celebrates Music Diva's 55-year Musical Journey.\r\n\r\nThe concert marks the 2nd collaboration between Usha Uthup and Bangalore's very own Multi-lingual, Multi-genre band - Alive India Rockstars (AIR), mentored by Supratiek Ghosh - Founder of Alive India & Lead Singer of Iconic Band Aurko \r\n\r\nThe Concert Series is Alive India's Fundraiser & Awareness Campaign in support of Sponsoring deserving musicians with Free Food, Shelter, Upskill Training & Sustainable Career under Alive India Music Foundation NGO's MSR (Musicians Social Responsibility)",
    "start": "2024-03-23T18:00:00+05:30",
    "end": "2024-03-23T21:30:00+05:30"
  },
  {
    "title": "Holi Utsav",
    "subtitle": "Champagne Showers and Color Splash",
    "cost": "₹399 onwards",
    "datetime": "24th March 11:00 AM - 5:30 PM",
    "venue": "High Ultra Lounge",
    "event_id": "33085",
    "location": "26/1, Rooftop, World Trade Center, Dr Rajkumar Rd, Malleshwara, Bengaluru, Karnataka 560055",
    "description": "The most funky Holi celebration of Bangalore is back again! With Dj Suketu to spin the best of bollywood and holi tracks.\r\nGet ready to Dance in with colours flowing all around you! This Holi at High Ultra Lounge rooftop is surely going to fill your memory with vibrant colours, one that you will remember for a long time!",
    "start": "2024-03-24T11:00:00+05:30",
    "end": "2024-03-24T17:30:00+05:30"
  },
  {
    "title": "Holi Festival Rang Barse",
    "subtitle": "by Glory Resonant",
    "cost": "₹499 onwards",
    "datetime": "23rd to 25th March 11:00 AM onwards",
    "venue": "Renaissance Bengaluru",
    "event_id": "33123",
    "location": "No 17 And 17, 1, Race Course Rd, Madhava Nagar, Extension",
    "description": "Get ready to be a part of the most vibrant and exhilarating Holi festival of your life! Our\r\nspectacular event invites you to dive into a world of colors, laughter, and love as we\r\ncelebrate the arrival of spring and the victory of good over evil.\r\n\r\nThis year, we have curated an unparalleled experience that will leave you spellbound\r\nwith its array of attractions. Be prepared for a visual spectacle with Unlimited Colors,\r\nan exhilarating Color Blast & Rain Dance, and a rhythmic Groove on the Booming\r\nBeats of 10 renowned DJs from India, spinning an eclectic mix of Music, Bollywood,\r\nEDM, Hip-hop, and Punjabi beats that will make you dance the night away."
  },
  {
    "title": "Rang Leela 2024",
    "subtitle": "Immerse yourself in a whirlwind of color",
    "cost": "₹49 onwards",
    "datetime": "24th March 11:00 AM - 7:00 PM",
    "venue": "Manpho Convention Centre",
    "event_id": "33182",
    "location": "No. 91/4, 102/3, Opp BEL Corporate Office, Hebbal Flyover, Veerannapalya Rd, Manayata Tech Park, Nagavara",
    "description": "Join us for RANG LEELA 2024 - The ultimate Holi celebration at MANPHO CONVENTION CENTRE, Manayata Tech Park Nagavara.\r\n\r\nFood stalls and Pop-ups will accompany the live music by our lineup of the city’s top DJs for what is bound to be a great time. Get your family and friends and sway the day away at the biggest Holi Party in town.\r\n\r\nDress code alert: Wearing white will make things all the more special.\r\n\r\nYour tickets include one pouch of colour and don`t worry, there will be plenty of colour flying around once the party gets started!",
    "start": "2024-03-24T11:00:00+05:30",
    "end": "2024-03-24T19:00:00+05:30"
  },
  {
    "title": "Maha Holi Ft Nucleya & Kr$na | Holi 2024",
    "cost": "₹149 onwards",
    "datetime": "24th to 25th March 11:00 AM onwards",
    "venue": "KTPO, Whitefield",
    "event_id": "33243",
    "location": "Plot No.121, Road No.5, Export Promotion Industrial Park, EPIP 2nd Phase, Whitefield Industrial Area",
    "description": "Welcome to Maha Holi 2024, where the rhythm of joy meets the hues of celebration. Featuring iconic artists, including the legendary DJ Nucleya dropping his BASS RANI, BASS RAJA and the lyrical maestro Kr$na trending with Joota Japani & Hola Amigo this festival promises to be a sensory extravaganza like no other. Get ready to dance, laugh, and create memories that will last a lifetime as we paint the town with music and colors! Don't miss out on this epic equation of fun and festivity.",
    "url": "https://insider.in/maha-holi-ft-nucleya-krna-holi-2024/event#"
  },
  {
    "title": "Aratu Live In Concert",
    "cost": "₹299 onwards",
    "datetime": "23rd March 8:30 PM - 11:59 PM",
    "venue": "GYLT",
    "event_id": "33245",
    "location": "22, 1st Main Rd, Visthar, Bengaluru",
    "description": "🎵 Get ready to hit the high notes of fun with ARATU – the band that's pitch-perfect for your good vibes weekend! Let our melodies be the key to unlocking your dance floor potential – it's time to break out those treble moves! 💃 Aratu's tunes are the rhythm to your good vibes symphony, turning every event into a major chord of joy! 🎉🕺 So, bass-ically, prepare for a night where the beats drop, and the laughter rises! 🚀",
    "url": "https://insider.in/aratu-live-in-concert-mar23-2024/event#"
  },
  {
    "title": "Love of Live ft. The Love Buzz",
    "cost": "₹499 onwards",
    "datetime": "21st March 8:00 PM - 11:59 PM",
    "venue": "Fandom at Gilly's Redefined",
    "event_id": "33248",
    "location": "1st floor of Gillys redefined,# 413, 100 Feet Road,, 4th Block, Koramangala, KHB Block Koramangala, Koramangala 4-B Block, 5th Block, Koramangala",
    "description": "Known for their high energy sets and hypnotic melodies, The Love Buzz describe themselves as the scuzzy power pop princes of Ireland. They are the tongue in cheek beacon of hope blending their hyper-caustic pogo punk with timeless pop bangers. ‘Their guitars are crunchy, their drums are bullying and their basslines knit it all together like a middle child hatching a plan.’ With their first EP Candyflip, the band explored different variants in style and challenged the genre locked norms of today's scene, breeding a caustic hyper-saturated concoction of Punk Pop and Indie. Hot Press Magazine cited them as “Pure off the bone punkadelic pleasure!” In a review of their Single ‘The Picky Eater’. After gigging extensively around the country and beyond, the guys put their heads down again, worked on new songs, and headed back to the studio with the finished creation being their EP",
    "url": "https://insider.in/love-of-live-ft-the-love-buzz/event#"
  },
  {
    "title": "Mid Wicket Stories",
    "cost": "₹17000 onwards",
    "datetime": "6th April 11:30 PM - 11:59 PM",
    "venue": "ITC Gardenia, a Luxury Collection Hotel",
    "event_id": "33249",
    "location": "1, Residency Rd, Ashok Nagar",
    "description": "Stumps Up for Stories: An Evening with Cricket's Icons Sir Geoffrey Boycott and Sunil Gavaskar. Calling all cricket fans for timeless conversation. Join us for an unforgettable evening as we discuss the legends who shaped the game we love. Don't miss this once-in-a-lifetime opportunity to hear the inside stories from the heroes of cricket. They are going to discuss cricket stories from the time when the internet was not there. Get ready for a journey back in time as we bring together legendary cricketers for a timeless conversation that transcends eras! From Yesterday's Glory to Today's Inspiration: Join us for an unforgettable evening of cricket stories and timeless wisdom from the cricketing legends who've shaped the game we adore. It's not just an event; it's a pilgrimage for every cricket fan seeking to relive the magic of yesteryears.",
    "url": "https://insider.in/mid-wicket-stories-presents-stories-of-the-legends-2024-apr6-2024/event#"
  },
  {
    "title": "Under The Sky Sundowner At Sheraton Grand",
    "cost": "₹399 onwards",
    "datetime": "10th to 24th March 5:00 PM onwards",
    "venue": "Sheraton Grand Bengaluru Whitefield Hotel & Convention Center",
    "event_id": "33250",
    "location": "Prestige Shantiniketan Hoodi, Whitefield, Thigalarapalya, Krishnarajapura",
    "description": "Experience the ultimate poolside soirée at Sundowner, an enchanting evening under the starlit sky in Whitefield. Dive into the mesmerizing beats of the best melodic house and Hindi melodic house, enhanced with live instruments, making it a truly unique affair. For the first time in Whitefield, indulge in a pool party like no other, featuring great music that will keep you dancing all night long. Savor irresistible offers on beverages and delectable food options, adding to the allure of the evening. Held at the luxurious Sheraton Grand Hotel Whitefield, this event promises an ambiance of luxury and relaxation. Let the tunes curated by Altspace Live elevate your experience, creating memories that will last a lifetime. Gather your friends and family for a memorable evening by the poolside.",
    "url": "https://insider.in/under-the-sky-sundowner-at-sheraton-grand-whitefield-mar10-2024/event#"
  },
  {
    "title": "Catharsis Vol 3",
    "cost": "₹499 onwards",
    "datetime": "17th March 6:30 PM - 11:59 PM",
    "venue": "Fandom at Gilly's Redefined",
    "event_id": "33251",
    "location": "1st floor of Gillys redefined,# 413, 100 Feet Road,, 4th Block, Koramangala, KHB Block Koramangala, Koramangala 4-B Block, 5th Block, Koramangala",
    "description": "Catharsis Vol. 3 invites you to immerse yourself in a night of musical discovery and raw emotion. As the latest installment in our groundbreaking gig series, Catharsis continues its commitment to showcasing original music from diverse genres. Our mission is to provide a platform for exceptionally talented bands, connecting them with audiences eager to explore beyond their musical comfort zones and revel in the exhilaration of live performances. This edition of Catharsis promises an eclectic lineup that promises to captivate and electrify. Catharsis Vol. 3 invites you to embrace the spirit of discovery, transcend musical boundaries, and experience the thrill of live music. Join us for a night that promises to be a celebration of originality, talent, and the unifying power of music.",
    "url": "https://insider.in/catharsis-vol-3-mar17-2024/event#"
  },
  {
    "title": "Sunny Tunes",
    "subtitle": "Free",
    "cost": "entry 24th March",
    "datetime": "1:00 PM - 11:59 PM Hard Rock Cafe, St Marks Rd",
    "venue": "40, St Marks Rd, Shanthala Nagar, Ashok Nagar",
    "event_id": "33253",
    "location": "ABOUT THIS EVENT",
    "description": "Read more",
    "url": "https://insider.in/sunny-tunes-mar24-2024/event#"
  },
  {
    "title": "Soul Smoke",
    "cost": "₹750 onwards",
    "datetime": "28th March 9:00 PM - 11:59 PM",
    "venue": "Hard Rock Cafe, St Marks Rd",
    "event_id": "33254",
    "location": "40, St Marks Rd, Shanthala Nagar, Ashok Nagar",
    "description": "Prepare for an unforgettable Thursday night in Bengaluru where Soul Smoke performing live at Bengaluru`s amazing entertainment hotspot Hard Rock Cafe. Electric Beats, Killer Tunes, Finger Licking Food, Spectacular Cocktails, And Many More! Come And Join The Party!",
    "url": "https://insider.in/soul-smoke-mar28-2024/event"
  },
  {
    "title": "The Spaven D&B Curation",
    "cost": "₹499 onwards",
    "datetime": "30th March 8:00 PM - 11:59 PM",
    "venue": "Fandom at Gilly's Redefined",
    "event_id": "33255",
    "location": "1st floor of Gillys redefined,# 413, 100 Feet Road,, 4th Block, Koramangala, KHB Block Koramangala, Koramangala 4-B Block, 5th Block, Koramangala",
    "description": "Saras Co. presents The Spaven D&B Curation, a special curation, and reinterpretation of timeless jungle classics by UK-based producer/composer and drummer Richard Spaven, with Chris 'Fatty' Hargreaves on bass, supported by Mumbai’s very own Drum and Bass. Experience the finest live D&B from the UK through a unique sonic journey, exploring the roots of jungle and drum & bass while paying homage to the architects of sound system culture. Richard will be joined by Christopher Hargreaves (Fatty Bassman) on bass. Expect classics, and improvisation, all while honoring the origins of Jungle/D&B. Stick around for an intimate talk/dialogue with Richard Spaven, delving into the significance of classic tunes and offering a deeper understanding of their cultural impact and enduring relevance, while dissecting the tunes that shaped a movement.",
    "url": "https://insider.in/the-spaven-db-curation-with-fatty-bassman-drum-ani-bass-mar30-2024/event#"
  },
  {
    "title": "Tribute to KK Ft. Root Three Five",
    "cost": "₹750 onwards",
    "datetime": "30th March 9:00 PM - 11:59 PM",
    "venue": "Hard Rock Cafe Bengaluru Whitefield",
    "event_id": "33256",
    "location": "Unit G-25 & 26, Ground Floor, Park Square Mall International Tech Park, Bangalore, Pattandur Agrahara",
    "description": "Tribute to KK Ft. Root Three Five (From Hyderabad) Root Three Five (35) exploded onto the live music scene after winning the Nxt Big Star competition in 2017. The Root 35 band blends soulful Indian and Western music and unique ideas. The band blends soulful Indian and Western music with high-energy rock and unique ideas. Every member brings in their distinct sound and personality to collectively form a tight performing unit. In a short period, they have gained a lot of traction and love from their audiences. So what are you waiting for? Catch them performing live KK`s hits. Just reserve your spots and be ready to experience a night full of rock `n` roll.",
    "url": "https://insider.in/tribute-to-kk-ft-root-three-five-mar30-2024/event#"
  },
  {
    "title": "Polaroid Saturdays ft DJ Loy | ONIB (UB City)",
    "subtitle": "Free",
    "cost": "entry 23rd March",
    "datetime": "8:00 PM - 1:00 AM One Night In Bangkok",
    "venue": "UB City, 203, 2nd Floor, The Collection, Vittal Mallya Rd, KG Halli, D' Souza Layout, Ashok Nagar",
    "event_id": "33257",
    "location": "ABOUT THIS EVENT",
    "description": "Read more",
    "url": "https://insider.in/polaroid-saturdays-ft-dj-loy-onib-ub-city-23rd-march-mar23-2024/event#"
  },
  {
    "title": "Colorland",
    "subtitle": "The Festival Of Color",
    "cost": "₹399 onwards",
    "datetime": "25th March 12:00 PM - 8:00 PM",
    "venue": "White Lotus Club",
    "event_id": "33270",
    "location": "26, Haralur Main Rd, near HP Petrol Station, Amblipura, PWD Quarters, Ambalipura, HSR Layout",
    "description": "Highlights:\r\n\r\nHuge dance floor\r\nFlowers\r\nColors\r\nSocial distance & thermal scanners\r\nSanitized venue\r\n6 hours of non-stop music\r\nParking available\r\nColorland - the festival of colors\r\n\r\nNon-stop Bollywood, Punjabi & Gujarati music with the best Bollywood & Punjabi DJs of B-town right under one open air",
    "start": "2024-03-25T12:00:00+05:30",
    "end": "2024-03-25T20:00:00+05:30"
  },
  {
    "title": "Disco Holi With Ranvijay Singh & Gautam Gulati",
    "subtitle": "Step into a world of color and music",
    "cost": "₹299 onwards",
    "datetime": "24th to 25th March 11:00 AM onwards",
    "venue": "Sunburn Union",
    "event_id": "33282",
    "location": "passport office, Mantri Avenue, next to Koramangala, KHB Games Village, Koramangala",
    "description": "Join us on March 24th with Ranvijay Singh and 25th with Gautam Gulati for two days of unforgettable festivities and joyous revelry. Experience pulsating beats, immersive performances, and a fusion of traditional and contemporary entertainment that will keep you dancing from sunset till dawn. Secure your spot now for an experience like no other!"
  },
  {
    "title": "Colour Splash 2024",
    "subtitle": "Dive into a vibrant whirlwind of colors.",
    "cost": "₹499 onwards",
    "datetime": "25th March 11:00 AM - 5:30 PM",
    "venue": "The Leela Palace, Bhartiya City",
    "event_id": "33333",
    "location": "6/2, Thanisandra Main Rd, Devin Paradise Enclave, Tirumanahalli, Bengaluru, Karnataka 560064",
    "description": "Join us for an unforgettable Color Splash experience in 2024!\r\n\r\n 🎨 Let the hues of joy, love, and togetherness fill your day as we paint the town with happiness and laughter. 💫 Indulge in traditional festivities, mouthwatering delicacies, and lively music that will ignite your senses and create cherished memories.",
    "start": "2024-03-25T11:00:00+05:30",
    "end": "2024-03-25T17:30:00+05:30"
  },
  {
    "title": "Rang De Hotel 2024",
    "subtitle": "Holi more than colours!",
    "cost": "₹99 onwards",
    "datetime": "24th to 25th March 11:00 AM onwards",
    "venue": "Radha Hometel",
    "event_id": "33362",
    "location": "Rd Number 2, Phase 2, Brookefield",
    "description": "Let`s be a part of a memorable HOLI EVENT at Radha Hometel Hotel, Brookfield, Whitefield\r\n\r\nBest Dj`s | Free Colors | Family & Kids Friendly | Delicious Food Counter | Separate Bar Counter | Biggest Lawn with Capacity of 5k People | Huge Setup | Dance performance & many mor"
  },
  {
    "title": "Soul Jams",
    "subtitle": " by Soul Ventures",
    "cost": "₹590 onwards",
    "datetime": "23rd March 4:30 PM - 8:30 PM",
    "venue": "Garden City Beer Collective",
    "event_id": "33395",
    "location": "82/2, Gantiganahalli, Bengaluru",
    "description": "Soul Jams is the ultimate destination for music lovers! Join us for an evening of relaxation, unwinding, and rejuvenation. Our welcoming space allows you to be yourself and feel at home. \r\nBring your guitars, cajones, and voices to sing your heart out alongside our vibrant community in a beautiful jamming session. You can also enjoy listening to amazing artists or take the stage yourself, supported by an accepting and supportive community.\r\nThe event comprises three soul-enriching parts: \r\n\r\n1. Soul Open Mic: Perform for a warm and appreciative audience, regardless of where you are on your musical journey. \r\n2. Social Mixers: Connect with like-minded individuals and find your tribe, fostering meaningful connections. \r\n3. Soul Jamming: Sing, play instruments, and join the community in a spontaneous, free-flowing musical experience. We create music together, fostering an atmosphere of refreshment and excitement.",
    "start": "2024-03-23T16:30:00+05:30",
    "end": "2024-03-23T20:30:00+05:30"
  }
]