[
  {
    "title": "Seedhe Maut - Lunch Break India Tour 2024",
    "subtitle": "Still On A Lunch Break!",
    "cost": "₹943 onwards",
    "datetime": "27th April 7:00 PM - 10:00 PM",
    "venue": "Venue to be Announced",
    "event_id": "31673",
    "location": "Bengaluru",
    "description": "Catch the 'best in the business' in a city near you! Seedhe Maut are taking their hit mixtape on a massive 12-city pan-India tour. The dynamic duo, known for their explosive live performances, will be playing an extended set and will feature several special guests as well as a few surprises! Get your tickets now! \r\n\r\nHaving mastered the art of delivering razor-sharp rhymes - this Delhi-based duo comprising Encore ABJ and Calm has used their lyrical dexterity to push forward the boundaries of Hip-Hop in India. Presenting Hindi Rap in a revolutionary new format, Seedhe Maut is taking the industry by storm and is unanimously regarded as the next big thing to break in the rapidly growing subculture landscape.\r\n\r\nAge Restriction: 16+",
    "start": "2024-04-27T19:00:00+05:30",
    "end": "2024-04-27T22:00:00+05:30"
  },
  {
    "title": "Shreya Ghoshal “All Hearts Tour\" - Bengaluru",
    "subtitle": "By Superhits 93.5 RED FM",
    "cost": "₹999 onwards",
    "datetime": "11th May 7:30 PM - 10:00 PM",
    "venue": "New Horizon College of Engineering",
    "event_id": "33048",
    "location": "Bellandur, Outer Ring Road, Bengaluru, Karnataka 560103, India",
    "description": "Superhits 93.5 RED FM brings Shreya Ghoshal, All hearts tour Bengaluru RED LIVE\r\nin Concert Co-presented by Kalaluha.\r\nLet's experience the magic of Shreya Ghoshal's All Hearts Tour in Namma\r\nBengaluru. Prepare to be captivated by the mesmerizing blend of Shreya Ghoshal's\r\nsoulful voice and magnetic stage presence, accompanied by a talented band that\r\ninfuses energy and finesse into every performance.",
    "start": "2024-05-11T19:30:00+05:30",
    "end": "2024-05-11T22:00:00+05:30"
  },
  {
    "title": "Mid Wicket Stories",
    "cost": "₹17000 onwards",
    "datetime": "6th April 11:30 PM - 11:59 PM",
    "venue": "ITC Gardenia, a Luxury Collection Hotel",
    "event_id": "33249",
    "location": "1, Residency Rd, Ashok Nagar",
    "description": "Stumps Up for Stories: An Evening with Cricket's Icons Sir Geoffrey Boycott and Sunil Gavaskar. Calling all cricket fans for timeless conversation. Join us for an unforgettable evening as we discuss the legends who shaped the game we love. Don't miss this once-in-a-lifetime opportunity to hear the inside stories from the heroes of cricket. They are going to discuss cricket stories from the time when the internet was not there. Get ready for a journey back in time as we bring together legendary cricketers for a timeless conversation that transcends eras! From Yesterday's Glory to Today's Inspiration: Join us for an unforgettable evening of cricket stories and timeless wisdom from the cricketing legends who've shaped the game we adore. It's not just an event; it's a pilgrimage for every cricket fan seeking to relive the magic of yesteryears.",
    "url": "https://insider.in/mid-wicket-stories-presents-stories-of-the-legends-2024-apr6-2024/event#"
  },
  {
    "title": "Married Men These Days",
    "cost": "₹299 onwards",
    "datetime": "7th April 9:00 PM - 11:59 PM",
    "venue": "The Underground Comedy Club",
    "event_id": "33619",
    "location": "Building No.480, KHB Colony, 5th Block, Koramangala",
    "description": "Welcome to the most hilarious celebration of love – it`s the \"Married Men These Day\" Standup Line Up! Grab your sweetheart, leave the kids with the babysitter, and get ready for a night of gut-busting laughter as our seasoned comics navigate the ups and downs of married life. Picture this: a lineup of witty husbands who`ve mastered the art of surviving \"These Days\". From the quest for the perfect gift to the delicate dance of planning the ideal date night, our comedians will take you on a rollercoaster of relatable anecdotes and side-splitting observations about the challenges and triumphs of being married on the most love-filled day of the year. Expect uproarious tales of last-minute flower shopping, attempts at romantic gestures gone wrong, and the eternal struggle to decode the mysteries of the perfect Love Greeting card.",
    "url": "https://insider.in/married-men-these-days-apr7-2024/event#"
  },
  {
    "title": "Ridiculous - Stand Up Comedy Show",
    "cost": "₹249 onwards",
    "datetime": "6th April to 4th May 6:30 PM onwards",
    "venue": "Atta Galata",
    "event_id": "33620",
    "location": "178, 5th Main Rd, Binnamangala, Hoysala Nagar, Indiranagar",
    "description": "About the show: Prepare yourself for an unforgettable evening of laughter as \"Ridiculous\" takes center stage with four of the wittiest stand-up comedians hailing from the vibrant city of Bangalore. Join us for a comedy extravaganza that blends the city`s tech-savvy charm, cultural quirks, and the unique flavor of everyday life. Ridiculous promises an evening filled with relatable humor delivered with the unique comedic flair that sets Bangalore`s stand-up comedy scene apart.",
    "url": "https://insider.in/ridiculous-stand-up-comedy-show-mar2-2024/event#"
  },
  {
    "title": "CrossOver Music Festival",
    "subtitle": "Unwind. Experience. Relive.",
    "cost": "Free entry",
    "datetime": "6th to 7th April 7:00 PM onwards",
    "venue": "HIGH Ultra Lounge",
    "event_id": "33797",
    "location": "26/1, Rooftop, World Trade Center, Dr Rajkumar Rd, Malleshwara",
    "description": "Bangalore’s very own music festival - CrossOver Music Festival is back in your city with a massive Artist Line up & Production like never seen before this April. Brace yourselves, techno lovers. \r\n\r\n#CentiGradeTurns11Edition\r\n\r\n6th April: Hunter/Game (Afterlife) + Ranjana & many more\r\n\r\n7th April: Almost Human B2B Mafaiza + Sidbit & many more"
  },
  {
    "title": "SCC SkyCinema - Jab We Met",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "6th April 7:00 PM - 10:30 PM",
    "venue": "Forum South Bengaluru",
    "event_id": "33855",
    "location": "Konanakunte Cross Metro Station, Anjanadri Layout, Konanakunte",
    "description": "\"Mein Apni Favourite Hoon” - Jab We Met \r\n\r\nAll aboard for a night of love, laughter, and unforgettable moments as we bring you the iconic Bollywood masterpiece. Sunset Cinema Club invites you to join us for a cinematic experience that will touch your heart and leave you with a smile at Forum South Bangalore Mall. \r\n\r\nEnjoy your favorite movie on a breezy terrace, perched on the rooftop of Forum South Bangalore Mall. Here you'll have an unobstructed view of the night sky, creating a unique and immersive cinema experience as you sink into comfy bean bags or mattresses and watch the movie on a large screen with the skyline of the city as your backdrop.",
    "start": "2024-04-06T19:00:00+05:30",
    "end": "2024-04-06T22:30:00+05:30"
  },
  {
    "title": "SCC SkyCinema - Baby's Day Out",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "13th April 7:00 PM - 10:30 PM",
    "venue": "Forum South Bengaluru",
    "event_id": "33859",
    "location": "Konanakunte Cross Metro Station, Anjanadri Layout, Konanakunte",
    "description": "\"I'm telling you. That kid is a genius.\" - Baby's Day Out \r\n\r\nGet ready for a heartwarming journey into the world of pure innocence as Sunset Cinema Club presents this family comedy classic at Forum South Bangalore Mall. Join us for an evening filled with giggles, mischief, and the delightful escapades of Baby Bink under the sunlit sky. \r\n\r\nEnjoy your favorite movie on a breezy terrace, perched on the rooftop of Forum South Bangalore Mall. Here you'll have an unobstructed view of the night sky, creating a unique and immersive cinema experience as you sink into comfy bean bags or mattresses and watch the movie on a large screen with the skyline of the city as your backdrop.",
    "start": "2024-04-13T19:00:00+05:30",
    "end": "2024-04-13T22:30:00+05:30"
  },
  {
    "title": "SCC Picnic Cinema - About Time",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "14th April 7:00 PM - 10:30 PM",
    "venue": "GCBC - Garden City Beer Collective",
    "event_id": "33861",
    "location": "82/2, Gantiganahalli, Bengaluru",
    "description": "\"I am going to live every day as if it's the last day of my life.\" - About Time\r\n\r\nPrepare for an extraordinary evening under the stars as Sunset Cinema Club invites you to the screening of this heartwarming and time-bending film. Join us for a cinematic journey that explores love, laughter, and the magic found in the most ordinary moments at Garden City Beer Collective (GCBC). \r\n\r\nCome for an evening of cinematic delight, as the sun goes down, and the show comes on! Enjoy a picnic-y ambiance, where you can sit or even lie down on comfy bean bags, surrounded by lush green grass! String lights illuminate the area, casting a warm glow that sets the perfect mood for the evening, while you enjoy your favorite film on a large screen with surround sound accompanied by delicious munchies and drinks!",
    "start": "2024-04-14T19:00:00+05:30",
    "end": "2024-04-14T22:30:00+05:30"
  },
  {
    "title": "SCC - Harry Potter and the Prisoner of Azkaban",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "20th April 7:00 PM - 10:30 PM",
    "venue": "Forum South Bengaluru",
    "event_id": "33863",
    "location": "Konanakunte Cross Metro Station, Anjanadri Layout, Konanakunte",
    "description": "\"\"\"Happiness can be found even in the darkest of times if one only remembers to turn on the light.\"\" - Harry Potter and the Prisoner of Azkaban\r\n\r\nEmbark on a journey with Harry, Ron, Hermione, and the entire Hogwarts cast in the third installment of the beloved series. Sunset Cinema Club invites you for an evening filled with mysterious encounters, daring adventures, and the unveiling of secrets that will keep you on the edge of your seat at Forum South Bangalore Mall. \r\n\r\nEnjoy your favorite movie on a breezy terrace, perched on the rooftop of Forum South Bangalore Mall. Here you'll have an unobstructed view of the night sky, creating a unique and immersive cinema experience as you sink into comfy bean bags or mattresses and watch the movie on a large screen with the skyline of the city as your backdrop.",
    "start": "2024-04-20T19:00:00+05:30",
    "end": "2024-04-20T22:30:00+05:30"
  },
  {
    "title": "SCC Picnic Cinema - Up!",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "20th April 7:00 PM - 10:30 PM",
    "venue": "GCBC - Garden City Beer Collective",
    "event_id": "33866",
    "location": "82/2, Gantiganahalli, Bengaluru",
    "description": "\"Adventure is out there. It's waiting for us!\" -Up!\r\n\r\nSunset Cinema Club invites you to immerse yourself in the touching story of Carl and Russell as they set out on a whimsical and emotional adventure. Celebrate this charming tale of friendship, adventure, and the power of dreams at Garden City Beer Collective (GCBC). \r\n\r\nCome for an evening of cinematic delight, as the sun goes down, and the show comes on! Enjoy a picnic-y ambiance, where you can sit or even lie down on comfy bean bags, surrounded by lush green grass! String lights illuminate the area, casting a warm glow that sets the perfect mood for the evening, while you enjoy your favorite film on a large screen with surround sound accompanied by delicious munchies and drinks!",
    "start": "2024-04-20T19:00:00+05:30",
    "end": "2024-04-20T22:30:00+05:30"
  },
  {
    "title": "SCC SkyCinema - Veer Zaara",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "27th April 7:00 PM - 10:30 PM",
    "venue": "Forum South Bengaluru",
    "event_id": "33867",
    "location": "Konanakunte Cross Metro Station, Anjanadri Layout, Konanakunte",
    "description": "\"Aaj se meri har raahein, meri manzilein, aur meri kahani sirf tumse.\"- Veer Zaara\r\n\r\nImmerse in an evening of timeless romance and soul-stirring melodies as Sunset Cinema Club brings this Bollywood classic to Forum South Bangalore Mall. Join us for a cinematic experience that transcends borders, celebrates love, and tugs at the strings of your heart.\r\n\r\n Enjoy your favorite movie on a breezy terrace, perched on the rooftop of Forum South Bangalore Mall. Here you'll have an unobstructed view of the night sky, creating a unique and immersive cinema experience as you sink into comfy bean bags or mattresses and watch the movie on a large screen with the skyline of the city as your backdrop.",
    "start": "2024-04-27T19:00:00+05:30",
    "end": "2024-04-27T22:30:00+05:30"
  },
  {
    "title": "SCC Picnic Cinema - Hasee Toh Phasee",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "28th April 7:00 PM - 10:30 PM",
    "venue": "GCBC - Garden City Beer Collective",
    "event_id": "33869",
    "location": "82/2, Gantiganahalli, Bengaluru",
    "description": "\"Meri life mein koi role nahi hai. Main life ka role play karta hoon.\" - Hasee Toh Phasee\r\n\r\nSunset Cinema Club invites you to a delightful romantic comedy that follows the quirky love story of Nikhil and Meeta at Garden City Beer Collective (GCBC). With its refreshing storyline and endearing performances, this movie is sure to leave you smiling.  \r\n\r\nCome for an evening of cinematic delight, as the sun goes down, and the show comes on! Enjoy a picnic-y ambiance, where you can sit or even lie down on comfy bean bags, surrounded by lush green grass! String lights illuminate the area, casting a warm glow that sets the perfect mood for the evening, while you enjoy your favorite film on a large screen with surround sound accompanied by delicious munchies and drinks!",
    "start": "2024-04-28T19:00:00+05:30",
    "end": "2024-04-28T22:30:00+05:30"
  },
  {
    "title": "Church Street Gaming by The Boardgame Den",
    "cost": "₹450 onwards",
    "datetime": "23rd March to 27th April 3:00 PM onwards",
    "venue": "The Boardgame Den",
    "event_id": "34030",
    "location": "Pavilion Mall, 62/63, Church St, Haridevpur, Shanthala Nagar, Ashok Nagar",
    "description": "Detox from technology, interact with people, and have a blast! We have games from around the world that will get you hooked. Chill out with a light fun game or indulge in a rapt Euro one. Boardgames are for everyone! We have been collecting international board games for the last 15 years. We gather every weekend to play these games. Anyone over the age of 14 is welcome! You can come by yourself or in a group and don't worry about not knowing how to play them. We will help you find a suitable game, gather players, and teach you the rules. The events are conducted inside the WeWork Pavillion, which is on Church Street, in between the Metro Station and Starbucks. It is the Purva building right opposite Matteo Coffee. PS: We charge a flat entry fee for the entire event and don't charge additionally per game or by the hour. Once you are in, feel free to play as many games as you like until close.",
    "url": "https://insider.in/church-street-gaming-by-the-boardgame-den-aug26-2023/event#"
  },
  {
    "title": "Motta Maadi Music - Unplugged!",
    "cost": "₹600 onwards",
    "datetime": "7th April 1:00 PM - 8:30 PM",
    "venue": "Jyoti Nivas Pre-University College",
    "event_id": "34031",
    "location": "WJM8+FFW, Hosur Rd, KHB Colony, 5th Block, Koramangala",
    "description": "Vanakkam Bangalore Makkaley!\r\n\r\nAs promised, we are bringing the ‘Unplugged’ show to Bengaluru! This dream show of ours was launched in Chennai last November and finally, we are bringing it to other cities :) Bringing in raw and exhilarating music, celebrating the most beautiful thamizh melodies, and more importantly the beautiful The Sunshine Orchestra. Our ‘Unplugged’ show was one of our favorite shows ever. When we did it in Chennai, it was emotional and magical! Please come along with your friends and family to sing along in this format :)  We are performing in ‘Jyoti Nivas Auditorium- Koramangala’ on April 7th - Sunday Come off. It will be magical ♥️",
    "url": "https://insider.in/motta-maadi-music-unplugged-bangalore--apr7-2024/event#"
  },
  {
    "title": "Karaoke Nights Ft. KJ Naveen",
    "subtitle": "Free",
    "cost": "entry 4th to 25th April",
    "datetime": "8:30 PM onwards Hard Rock Cafe, Whitefield",
    "venue": "Unit G-25 & 26, Ground Floor, Park Square Mall International Tech Park, Bangalore, Pattandur Agrahara",
    "event_id": "34033",
    "location": "ABOUT THIS EVENT",
    "description": "Read more",
    "url": "https://insider.in/karaoke-nights-ft-kj-naveen-apr4-2024/event#"
  },
  {
    "title": "Boogie Nights Ft. Prashu",
    "subtitle": "Free",
    "cost": "entry 5th to 12th April",
    "datetime": "8:00 PM onwards Hard Rock Cafe, St Marks Rd",
    "venue": "40, St Marks Rd, Shanthala Nagar, Ashok Nagar",
    "event_id": "34035",
    "location": "ABOUT THIS EVENT",
    "description": "Read more",
    "url": "https://insider.in/boogie-nights-ft-prashu-apr5-2024/event#"
  },
  {
    "title": "Mere Khayal Se By Amandeep Singh",
    "cost": "₹499 onwards",
    "datetime": "6th April 6:00 PM - 11:59 PM",
    "venue": "Just BLR",
    "event_id": "34037",
    "location": "Deena Complex, Opp MC Donald, Brigade Rd, Shanthala Nagar, Ashok Nagar",
    "description": "After giving multiple sold out shows in 30+ cities Amandeep is coming to Bangalore with his special ‘Mere Khayal Se.’ An hour long show with a mix bag of poetries, shayaris and personal life stories by Amandeep Singh with a twist. We all have our own perspective of viewing things but what if all the things that we see have something hidden behind them. Amandeep is here not just to entertain you but also let you see things beyond the words. So come and spend an amazing evening full of stories, poems and love.",
    "url": "https://insider.in/mere-khayal-se-by-amandeep-singh-a-storytelling-show-bangalore-apr6-2024/event#"
  },
  {
    "title": "The human being and the cosmos",
    "cost": "₹50 onwards",
    "datetime": "6th April 6:30 PM - 11:59 PM",
    "venue": "New Acropolis Jayanagar",
    "event_id": "34038",
    "location": "Ground Floor, #264, 7th Cross Rd, 6th Block, 1st Block, Jayanagar 1st Block, Jayanagar",
    "description": "Here's a glimpse into Living Philosophy! How can we engage more fully with life? Is reality more than it seems to be? We are all the time living 3 levels of life: the personal, the social and the global / cosmic. The voice of the personal level often tends to drown out the other two, and we especially forget that we are linked to life itself! In this talk, we explore the connection between the laws of individual life and the universe – through ideas of the 3 levels of reality according to Greek philosophy, Dharma and Karma, destiny and free will. It invites you to develop an approach to engage fully with life, through meaningful steps in the world.",
    "url": "https://insider.in/the-human-being-and-the-cosmos-apr6-2024/event#"
  },
  {
    "title": "Gautham Govindan LIVE",
    "cost": "₹349 onwards",
    "datetime": "28th April 7:00 PM - 11:59 PM",
    "venue": "Ministry Of Comedy",
    "event_id": "34039",
    "location": "18th Main Road, 138/B, 5th Cross Rd, behind Cafe Coffee Day, KHB Colony, 5th Block, Koramangala",
    "description": "With over 20+million views on Instagram and Youtube, Gautham Govindan brings to you his first solo show. Gautham Govindan also brings to you this description which he’s having a tough time writing. All he can guarantee is an hour of laughs with material honed over the last 2 years. I’ll see you - I mean - He’ll see you there.",
    "url": "https://insider.in/gautham-govindan-live-apr28-2024/event#"
  },
  {
    "title": "nu:beat Nights At WL Club",
    "subtitle": "From IBIZA To INDIA",
    "cost": "₹299 onwards",
    "datetime": "5th April 7:00 PM - 1:00 AM",
    "venue": "White Lotus Club, Bengaluru",
    "event_id": "34127",
    "location": "26, Haralur Main Rd, near HP Petrol Station, Amblipura, PWD Quarters, Ambalipura, HSR Layout",
    "description": "Get ready for an electrifying night of beats, performances, and the ultimate kicks!\r\n\r\nHeadlining the event is the sensational DJ duo ANSWER. Also hitting the stage are DJ ASHTRIX, DJ AUDIOPHILE, rapper AUTHEN, Indo-Western fusion trio FLUTE FANTASY, genre-liberated band TABLE FOR 4, and beatboxer RON.\r\n\r\nBut this event isn't just about the music – it's the perfect mix of rhythm and style. Join us as we launch the hottest new brand to hit Indian shores!",
    "start": "2024-04-05T19:00:00+05:30",
    "end": "2024-04-06T01:00:00+05:30"
  },
  {
    "title": "Pet Fiesta",
    "subtitle": "Namma Bengaluru Pet Show",
    "cost": "₹299 onwards",
    "datetime": "7th April 11:00 AM - 10:00 PM",
    "venue": "Jayamahal Palace",
    "event_id": "34133",
    "location": "1, Jayamahal Main Rd, near Cantonment Railway Station Road, Nandi Durga Road Extension, Jayamahal",
    "description": "Welcome to the Pet Fiesta, a lively and vibrant event celebrating our beloved furry friends! From playful pups to majestic felines, this festival is a paradise for all animal lovers. Enjoy a day filled with exciting activities such as pet parades, talent shows, and even a petting zoo for the little ones. \r\n\r\nDon't forget to browse through the numerous stalls offering treats, toys, and accessories for your cherished companions. Whether you have a four-legged friend of your own or simply appreciate the joy animals bring, the Pet Fiesta promises a day of fun and laughter for everyone. Join us in this enchanting celebration of the special bond between humans and their pets!",
    "start": "2024-04-07T11:00:00+05:30",
    "end": "2024-04-07T22:00:00+05:30"
  },
  {
    "title": "Soul Jams",
    "subtitle": " by Soul Ventures",
    "cost": "₹590 onwards",
    "datetime": "6th April 4:30 PM - 8:30 PM",
    "venue": "ButterFly - Brew Bite & Fly",
    "event_id": "34217",
    "location": "57, 3rd Floor, 1st Main Rd, Sarakki Industrial Layout, Dollar Layout, 3rd Phase, J. P. Nagar",
    "description": "Soul Jams is the ultimate destination for music lovers! Join us for an evening of relaxation, unwinding, and rejuvenation. Our welcoming space allows you to be yourself and feel at home. \r\nBring your guitars, cajones, and voices to sing your heart out alongside our vibrant community in a beautiful jamming session. \r\n\r\nThe event comprises three soul-enriching parts: \r\n\r\n1. Soul Open Mic: Perform for a warm and appreciative audience, regardless of where you are on your musical journey. Reach out to @souljams_live on Instagram to book your slot.\r\n2. Social Mixers: Connect with like-minded individuals and find your tribe, fostering meaningful connections. \r\n3. Soul Jamming: Sing, play instruments, and join the community in a spontaneous, free-flowing musical experience. We create music together, fostering an atmosphere of refreshment and excitement.",
    "start": "2024-04-06T16:30:00+05:30",
    "end": "2024-04-06T20:30:00+05:30"
  },
  {
    "title": "Remix Nights",
    "subtitle": "Ft DJ Franky Paul",
    "cost": "₹1000 onwards",
    "datetime": "6th April 9:00 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34293",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Make some noise and have fun, since the music gets two times better when a DJ lifts his hands in the air.\r\nStarting at 9 p.m., Hard Rock Cafe, Bengaluru is happy to host DJ FRANKY and his incredible sounds for the musically charged Blockbusters.\r\nPrepare to party and enjoy the evening with excellent food, live music, and cool drinks.",
    "start": "2024-04-06T21:00:00+05:30",
    "end": "2024-04-06T23:00:00+05:30"
  },
  {
    "title": "Classic Rock",
    "subtitle": "Ft. Sid And The Difference",
    "cost": "₹250 onwards",
    "datetime": "11th April 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34299",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Catch Sid and the Difference playing live on 11th April i.e.Thursday, 8:30 pm onwards only at Hard Rock Cafe, Bengaluru.\r\n⚡️Join us for an evening full of great music, lip-smacking food & refreshing cocktails.",
    "start": "2024-04-11T20:30:00+05:30",
    "end": "2024-04-11T23:00:00+05:30"
  },
  {
    "title": "Tribute to MLTR & Backstreet Boys",
    "subtitle": "Ft The Showcase (From Mizoram)",
    "cost": "₹1000 onwards",
    "datetime": "13th April 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34311",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Everybody knows and loves the Backstreet Boys & MLTR ... and we mean EVERYBOOOOOOODY.\r\n\r\nWe know you grew up listening to them, you might have had their posters on your college dorm rooms, and you`ve performed \"I Want It That Way\" on karaoke nights. If this was you, we promise to rock your body right (did you sing that last part? Yeah, you did!)\r\n\r\n`If Blues had a baby, they would name it Rock `N` Roll,` That is the funda the band believes in and that`s what they are planning to bring to Hard Rock Cafe, as a tribute to Michael Learns To Rock (MLTR) and Backstreet Boys,\r\n\r\nThat`s right, all your favorite songs by rockstars from the SHOWCASE band will be performed, accompanied by delicious drinks and food.\r\n\r\nSee you there! Reserve your spots now !!!!!",
    "start": "2024-04-13T20:30:00+05:30",
    "end": "2024-04-13T23:00:00+05:30"
  },
  {
    "title": "Rock and Roll",
    "subtitle": "Ft. Six Blade Knife ",
    "cost": "₹250 onwards",
    "datetime": "18th April 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34316",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Catch Six Blade Knife band playing live on 18th April i.e.Thursday, 7pm onwards only at Hard Rock Cafe, Bengaluru.\r\n⚡️Join us for an evening full of great music, lip-smacking food & refreshing cocktails.",
    "start": "2024-04-18T20:30:00+05:30",
    "end": "2024-04-18T23:00:00+05:30"
  },
  {
    "title": "Tribute to Pink Floyd",
    "subtitle": "Ft Retro Legendar Act (Pune)",
    "cost": "₹1000 onwards",
    "datetime": "20th April 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34317",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Mark your calendars for a Pink Floyd tribute happening at Hard Rock Cafe, Bengaluru on April 20.\r\n\r\nPink Floyd was the pioneer of psychedelic music and one of the biggest selling acts ever on the planet. The group acquired a sensational reputation by performing sound & light shows and built a cult following that continues to grow even after years of the bands breaking up.\r\n\r\nKnow about your band\r\n\r\nRetro Legendary Act (RLA) band has been playing for several years and has made a name for themselves by tapping the primal essence and drama of music. Persevering beyond the mere three-chord progression, this smokin` combo rips through Rockin`, Jumpin`, Swingin` tunes from the 70s to their latest originals.",
    "start": "2024-04-20T20:30:00+05:30",
    "end": "2024-04-20T23:00:00+05:30"
  },
  {
    "title": "Classic Rock",
    "subtitle": "Dimensions",
    "cost": "₹250 onwards",
    "datetime": "25th April 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34318",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Dimensions, a band that performs in various genres, was formed by rock renegades from Bangalore. With nearly 40 years of live music experience between the members of the band, the band`s primary focus is to re-create and offer the best live musical experiences to its audiences.\r\nBe there to see them live at your favorite Hard Rock Cafe Bengaluru location.\r\nTimings: 8:30 pm onwards.",
    "start": "2024-04-25T20:30:00+05:30",
    "end": "2024-04-25T23:00:00+05:30"
  },
  {
    "title": "Rock Around The World",
    "subtitle": "Ft Adhir Punja Project",
    "cost": "₹1000 onwards",
    "datetime": "27th April 9:00 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34319",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Experience the magic of live music with Adhir`s captivating performance on Saturday, April 27th, starting from 9:00 PM onwards at Hard Rock cafe, Bengaluru. Let the talented artist serenade you with soulful melodies and mesmerizing tunes throughout the evening. Join us for an unforgettable musical journey that will leave you enchanted. Don`t miss this opportunity to immerse yourself in the perfect blend of rhythm and melody.",
    "start": "2024-04-27T21:00:00+05:30",
    "end": "2024-04-27T23:00:00+05:30"
  },
  {
    "title": "Blockbuster Friday",
    "subtitle": "Ft. DJ Franky",
    "cost": "Free entry",
    "datetime": "5th April 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34328",
    "location": "Unit G 25 & 26, Ground Floor, Park Square Mall, International Tech Park, Pattandur Agrahara, Whitefield",
    "description": "Make some noise and have fun, since the music gets two times better when a DJ lifts his hands in the air.\r\nEvery Friday night, starting at 8:30 p.m., Hard Rock Cafe Whitefield, Bengaluru is happy to host DJ FRANKY and his incredible sounds for the musically charged Blockbusters.\r\nPrepare to party and enjoy the evening with excellent food, live music, and cool drinks.",
    "start": "2024-04-05T20:30:00+05:30",
    "end": "2024-04-05T23:00:00+05:30"
  },
  {
    "title": "Chimos School Of Rock",
    "subtitle": "Ft. CHIMO",
    "cost": "₹750 onwards",
    "datetime": "6th April 9:00 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34329",
    "location": "Unit G 25 & 26, Ground Floor, Park Square Mall, International Tech Park, Pattandur Agrahara, Whitefield",
    "description": "Join the Ultimate Groove Experience with CHIMO`s School of Rock at Hard Rock Cafe! 🎉\r\nGet ready to dance the night away with CHIMO, the electrifying pop/funk band that`s set to ignite the stage!\r\n🎶 Whether you`re a die-hard music lover, a budding musician eager to soak up inspiration, or simply someone in search of an unforgettable weekend vibe, the School of Rock event is your ticket to an evening of pure musical magic taking on covers like Marron 5, Daft Punk, Michael Bublé and many more.\r\nFrom irresistible pop hits to funky jams guaranteed to get your feet tapping, CHIMO promises a performance that`ll leave you exhilarated and wanting more. 🕺💃 Don`t miss your chance to be part of this epic celebration of music and talent!",
    "start": "2024-04-06T21:00:00+05:30",
    "end": "2024-04-06T23:00:00+05:30"
  },
  {
    "title": "Blockbuster Friday",
    "subtitle": "FT. DJ Franky",
    "cost": "Free entry",
    "datetime": "12th April 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34330",
    "location": "Unit G 25 & 26, Ground Floor, Park Square Mall, International Tech Park, Pattandur Agrahara, Whitefield",
    "description": "Make some noise and have fun, since the music gets two times better when a DJ lifts his hands in the air.\r\nEvery Friday night, starting at 8:30 p.m., Hard Rock Cafe Whitefield, Bengaluru is happy to host DJ FRANKY and his incredible sounds for the musically charged Blockbusters.\r\nPrepare to party and enjoy the evening with excellent food, live music, and cool drinks.",
    "start": "2024-04-12T20:30:00+05:30",
    "end": "2024-04-12T23:00:00+05:30"
  },
  {
    "title": "Remix Nights",
    "subtitle": "Ft. Ayush",
    "cost": "Free entry",
    "datetime": "13th April 9:00 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34332",
    "location": "Unit G 25 & 26, Ground Floor, Park Square Mall, International Tech Park, Pattandur Agrahara, Whitefield",
    "description": "Make some noise and have fun, since the music gets two times better when a DJ lifts his hands in the air.\r\nFriday night, starting at 9 p.m., Hard Rock Cafe Whitefield Bengaluru is happy to host DJ Ayush and his incredible sounds for the musically charged Blockbusters.\r\nPrepare to party and enjoy the evening with excellent food, live music, and cool drinks.",
    "start": "2024-04-13T21:00:00+05:30",
    "end": "2024-04-13T23:00:00+05:30"
  },
  {
    "title": "Bollywood Chartbusters",
    "subtitle": "Ft Mann (Mizoram)",
    "cost": "₹750 onwards",
    "datetime": "14th April 9:00 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34333",
    "location": "Unit G 25 & 26, Ground Floor, Park Square Mall, International Tech Park, Pattandur Agrahara, Whitefield",
    "description": "This band is based out of Mizoram, the band will play soulful Bollywood songs..\r\nCatch them live at Hard Rock Cafe, Whitefield, Bengaluru.",
    "start": "2024-04-14T21:00:00+05:30",
    "end": "2024-04-14T23:00:00+05:30"
  },
  {
    "title": "Blockbuster Friday",
    "subtitle": "FT. DJ Franky",
    "cost": "Free entry",
    "datetime": "19th April 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34334",
    "location": "Unit G 25 & 26, Ground Floor, Park Square Mall, International Tech Park, Pattandur Agrahara, Whitefield",
    "description": "Make some noise and have fun, since the music gets two times better when a DJ lifts his hands in the air.\r\nEvery Friday night, starting at 8:30 p.m., Hard Rock Cafe Whitefield, Bengaluru is happy to host DJ FRANKY and his incredible sounds for the musically charged Blockbusters.\r\nPrepare to party and enjoy the evening with excellent food, live music, and cool drinks.",
    "start": "2024-04-19T20:30:00+05:30",
    "end": "2024-04-19T23:00:00+05:30"
  },
  {
    "title": "Blockbuster Friday",
    "subtitle": "FT. DJ Franky",
    "cost": "Free entry",
    "datetime": "26th April 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34349",
    "location": "Unit G 25 & 26, Ground Floor, Park Square Mall, International Tech Park, Pattandur Agrahara, Whitefield",
    "description": "Make some noise and have fun, since the music gets two times better when a DJ lifts his hands in the air.\r\nEvery Friday night, starting at 8:30 p.m., Hard Rock Cafe Whitefield, Bengaluru is happy to host DJ FRANKY and his incredible sounds for the musically charged Blockbusters.\r\nPrepare to party and enjoy the evening with excellent food, live music, and cool drinks.",
    "start": "2024-04-26T20:30:00+05:30",
    "end": "2024-04-26T23:00:00+05:30"
  },
  {
    "title": "Tribute to KK",
    "subtitle": "Ft. 3 Shots Bourbon",
    "cost": "₹750 onwards",
    "datetime": "27th April 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34351",
    "location": "Unit G 25 & 26, Ground Floor, Park Square Mall, International Tech Park, Pattandur Agrahara, Whitefield",
    "description": "Why sing alone when you can sing with the incredibly talented 3 SHOTS BOURBON at Hard Rock Cafe as we celebrate his music in honor of him?\r\nIt will be a once-in-a-lifetime encounter that will leave you with enduring memories when the band performs your favorite tunes.\r\nJoin us for a night of live music, delicious cuisine, and cool cocktails.",
    "start": "2024-04-27T20:30:00+05:30",
    "end": "2024-04-27T23:00:00+05:30"
  },
  {
    "title": "SoMAD Y2K - A Early 2000s Throwback Party",
    "subtitle": "Ft. KAVE, RITZ AND MORE",
    "cost": "Free entry",
    "datetime": "6th April 8:00 PM - 1:00 AM",
    "venue": "Daddy Bangalore",
    "event_id": "34368",
    "location": "963, 12th Main Rd, HAL 2nd Stage, Doopanahalli, Indiranagar",
    "description": "Join us for a once-in-a-lifetime celebration as we Party at the Hottest Daily Bar of Town DADDY! With all your loved ones coming together to transport ourselves back to the turn of the millennium with our unforgettable Y2K Party! Get ready to relive the excitement, anticipation, and vibrant energy of the year 2000 in a night filled with nostalgia and throwback vibes.\r\nThroughout the night, our DJs will be spinning the greatest hits from the late 90s and early 2000s, bringing back memories with every beat. Dance your heart out to the infectious rhythms of *SYNC, Britney Spears, Destiny's Child, and the Backstreet Boys. Don't be surprised if you find yourself busting out your best moves to \"Macarena\" or singing along to \"Livin' la Vida Loca\" at the top of your lungs.",
    "start": "2024-04-06T20:00:00+05:30",
    "end": "2024-04-07T01:00:00+05:30"
  },
  {
    "title": "Brews of Bangalore by BuzzinUp",
    "subtitle": "Bangalore's first ever beer and coffee festival",
    "cost": "₹199 onwards",
    "datetime": "28th April 12:00 PM - 10:00 PM",
    "venue": "Indiranagar Club",
    "event_id": "34388",
    "location": "Sangeetha Sabha, 4th Cross Rd, 8th cross, HAL 2nd Stage, Indiranagar",
    "description": "A Multi-Brand Beer & Coffee Extravaganza\" presented by BuzzinUp promises to be Bangalore's ultimate celebration of everyone's favorite beverages - beer & coffee. Set against the scenic backdrop of the lawns of Indiranagar Club on the 28th of April, this event offers beer & coffee aficionados a full-day beer symposium filled with chugs, beer games, delicious food, and entertainment. It's a one-of-a-kind opportunity to indulge in the finest brews from various brands while enjoying a vibrant atmosphere of fun and camaraderie. Whether you're a seasoned beer enthusiast or simply enjoy the occasional pint, \"Beers of Bangalore\" is the place to be for an unforgettable beer and coffee experience.",
    "start": "2024-04-28T12:00:00+05:30",
    "end": "2024-04-28T22:00:00+05:30"
  },
  {
    "title": "SCC Picnic Cinema - Rockstar",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "6th April 7:00 PM - 10:30 PM",
    "venue": "Nexus Shantiniketan Mall",
    "event_id": "34399",
    "location": "Whitefield Main Rd, Thigalarapalya, Krishnarajapura",
    "description": "“Kissi manzar par mein rukka nahin\r\n\r\nKabhi khud se bhi mila nahin\r\n\r\nYeh gilla toh hai mein khafa nahin\r\n\r\nSheher ek se gaon ek se, Log ek se, naam ek” - Rockstar\r\n\r\nGet ready to be swept away by soulful melodies as Sunset Cinema Club brings you an unforgettable screening of Rockstar at Nexus Shantiniketan. \r\n\r\nLocated in the heart of Whitefield, this bustling mall transforms into a haven of relaxation and entertainment as the sun sets the stars begin to emerge, and your movie screening begins. Enjoy your favorite film on a large screen with surround sound, as you sink into comfy bean bags or mattresses, in the great outdoors.",
    "start": "2024-04-06T19:00:00+05:30",
    "end": "2024-04-06T22:30:00+05:30"
  },
  {
    "title": "SCC Picnic Cinema - Kuch Kuch Hota Hai",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "13th April 7:00 PM - 10:30 PM",
    "venue": "Nexus Shantiniketan Mall",
    "event_id": "34401",
    "location": "Whitefield Main Rd, Thigalarapalya, Krishnarajapura",
    "description": "\"Kuch kuch hota hai, Anjali, tum nahi samjhogi.\" - Kuch Kuch Hota Hai\r\n\r\nSunset Cinema Club invites you to join us for a captivating evening as we revisit the iconic romance that has captured hearts for generations. Relive the magic of love, friendship, and unforgettable moments at Nexus Shantiniketan. \r\n\r\nLocated in the heart of Whitefield, this bustling mall transforms into a haven of relaxation and entertainment as the sun sets the stars begin to emerge, and your movie screening begins. Enjoy your favorite film on a large screen with surround sound, as you sink into comfy bean bags or mattresses, in the great outdoors.",
    "start": "2024-04-13T19:00:00+05:30",
    "end": "2024-04-13T22:30:00+05:30"
  },
  {
    "title": "Karan Randhawa LIVE",
    "subtitle": "Presented by DJ Hassan",
    "cost": "₹299 onwards",
    "datetime": "13th April 7:00 PM - 1:00 AM",
    "venue": "White Lotus Club",
    "event_id": "34516",
    "location": "26, Haralur Main Rd, near HP Petrol Station, Amblipura, PWD Quarters, Ambalipura, HSR Layout",
    "description": "Get ready for an electrifying night filled with the hottest Punjabi beats and stellar performances. Join us on 13th April for an unforgettable celebration featuring live performances by Karan Randhawa, renowned DJ Hassan, and much more! Don't miss out on this epic event! 🌟\r\n\r\nPerformance Lineup: Karan Randhawa will perform his famous hits:\r\n•⁠  ⁠Phulkaari 🌺\r\n•⁠  ⁠Jhanjra 💍\r\n•⁠  ⁠Tere Bare 🎵\r\n•⁠  ⁠Jatti 👸\r\n•⁠  ⁠Gede 💃\r\n•⁠  ⁠Wait ⏳\r\n•⁠  ⁠Kaali Raat 🌙\r\n•⁠  ⁠Glock 🔫\r\n•⁠  ⁠Haye Oye 😍\r\n•⁠  ⁠Na Sun Mitran Da 🎶\r\n    And more!",
    "start": "2024-04-13T19:00:00+05:30",
    "end": "2024-04-14T01:00:00+05:30"
  },
  {
    "title": "The Bollywood Mayhem",
    "subtitle": "Bollywood rituals every weekend!",
    "cost": "Free entry",
    "datetime": "6th April 9:00 PM - 1:00 AM",
    "venue": "Magique, Koramangala",
    "event_id": "34521",
    "location": "Plot No, 36, 100 Feet Rd, opp. to Shilton Royale Hotel, Srinivagilu, Chandra Reddy Layout, S T Bed Layout, Koramangala",
    "description": "Join us for an unforgettable Bollywood night filled with electrifying beats and scintillating dance moves at MAGIQUE. Groove to the tunes of Guru Music and Senleo as we transform the venue into a vibrant party hub for an exhilarating Saturday night experience. Come celebrate with us, and let's make this night one to remember!",
    "start": "2024-04-06T21:00:00+05:30",
    "end": "2024-04-07T01:00:00+05:30"
  },
  {
    "title": "Champagne Shower 2.0",
    "subtitle": "Ft. DJ Tej",
    "cost": "Free entry",
    "datetime": "5th April 8:00 PM - 1:00 AM",
    "venue": "Magique",
    "event_id": "34523",
    "location": "Plot No, 36, 100 Feet Rd, opp. to Shilton Royale Hotel, Srinivagilu, Chandra Reddy Layout, S T Bed Layout, Koramangala",
    "description": "Get ready to groove as we bring you an unforgettable night at Magique.\r\n\r\nDJ TEJ will be taking over the console, spinning the hottest Bollywood beats that will keep you dancing all night long. Don't miss out on this electrifying experience, where music meets MAGIQUE.",
    "start": "2024-04-05T20:00:00+05:30",
    "end": "2024-04-06T01:00:00+05:30"
  },
  {
    "title": "Nusha at Sunburn Union",
    "cost": "₹499 onwards",
    "datetime": "6th April 7:00 PM - 1:00 AM",
    "venue": "Sunburn Union",
    "event_id": "34526",
    "location": "passport office, Mantri Avenue, next to Koramangala, KHB Games Village, Koramangala",
    "description": "Embark on a sonic odyssey with Nusha, a pioneering Romanian female artist deeply entrenched in the techno scene since 2007. Her musical journey, marked by relentless experimentation and refined taste, has garnered acclaim worldwide, and now she graces the stage at Sunburn Union on April 6th for an unmissable performance.",
    "url": "https://insider.in/nusha-at-sunburn-union-apr6-2024/event#"
  },
  {
    "title": "Jingle Land",
    "subtitle": "The Land of Music and Entertainment",
    "cost": "₹749 onwards",
    "datetime": "8th June 3:30 PM - 10:30 PM",
    "venue": "Phoenix Marketcity, Bangalore",
    "event_id": "34555",
    "location": "Palm Meadows, Prestige Ozone, Whitefield Main Road, Whitefield, Devasandra Industrial Estate, Krishnarajapura",
    "description": "Hello Music Enthusiasts! JINGLE LAND is here!\r\nExperience the electrifying atmosphere of a musical extravaganza as diverse bands unite on one stage. Vibrant melodies fill the air, ranging from soulful ballads to heart-pounding rhythms. Enthusiastic crowds sway in harmony, immersed in the pulsating energy of live performances. Each band will bring its unique flair, captivating audiences with its raw talent and infectious passion.",
    "start": "2024-06-08T15:30:00+05:30",
    "end": "2024-06-08T22:30:00+05:30"
  }
]