[
  {
    "title": "Vineeth Srinivasan Live",
    "subtitle": "A Musical Journey",
    "cost": "₹399 onwards",
    "datetime": "13th July 7:00 PM - 10:00 PM",
    "venue": "Phoenix Marketcity",
    "event_id": "39523",
    "location": "Palm Meadows, Prestige Ozone, Whitefield Main Road, Whitefield, Devasandra Industrial Estate, Krishnarajapura",
    "description": "Join us for an unforgettable evening with Vineeth Srinivasan on 13th July 2024 at Phoenix Marketcity, Whitefield. Presented by Noizz Entertainment in association with Sia Entertainment, this concert promises to be a musical extravaganza.  Vineeth Srinivasan is a celebrated figure in the Indian music industry, renowned for his contributions to Indian cinema. Not only a star in the Malayalam music scene, Vineeth is also a multilingual singer, captivating audiences with songs in Tamil, Telugu, and Hindi. His melodic richness and emotional depth have made him a beloved artist!  Experience his famous hits like \"Karale\" from Ustad Hotel, \"Anuraagam\" from Thattathin Marayathu, \"Akaleyo Nee\" from Urumi, \"Thangamey\" from Naanum Rowdy Dhaan, and \"Mental Madhilo\" from Okka Kshanam. Don't miss this chance to see Vineeth Srinivasan live and witness his versatile talent firsthand!",
    "share_url": "https://zoma.to/live-event/39523",
    "start": "2024-07-13T19:00:00+05:30",
    "end": "2024-07-13T22:00:00+05:30"
  },
  {
    "title": "Ankita's Brother : A Stand Up Show By Anmol Garg",
    "subtitle": "Come & meet the Corporate Babaji",
    "cost": "₹399 onwards",
    "datetime": "12th July 8:00 PM - 11:00 PM",
    "venue": "The Underground Comedy Club",
    "event_id": "40716",
    "location": "Building No.480, KHB Colony, 5th Block, Koramangala",
    "description": "Tired of your corporate job?\r\n\r\nConfused about what to do in life?\r\nEver felt lost?\r\n\r\nIf yes, this show is for you!\r\n\r\nAnmol Garg, popularly known as Corporate Babaji, brings to you his theme based set Ankita`s Brother where he shares with you his life story and answers the million dollar question How to find your passion?\r\n\r\nThis is going to be 1 hour of non-stop laughter!\r\nIn short, he`ll help you forget about your corporate job :P",
    "share_url": "https://zoma.to/live-event/40716",
    "start": "2024-07-12T20:00:00+05:30",
    "end": "2024-07-12T23:00:00+05:30"
  },
  {
    "title": "DGTL Bengaluru 2024",
    "subtitle": "DGTL returns to Bengaluru to recreate the magic and experience you’ve been waiting for",
    "cost": "₹3650 onwards",
    "datetime": "9th to 10th November 2:00 PM onwards",
    "venue": "Jayamahal Palace",
    "event_id": "40858",
    "location": "1, Jayamahal Main Rd, near Cantonment Railway Station Road, Nandi Durga Road Extension, Jayamahal",
    "description": "DGTL India 2023 saw over 15,000 attendees across 3 days enjoying world-class techno and electronic music, stunning lighting and stage designs, conceptual showcases, and vital sustainability initiatives, resulting in an immersive, audio-visual experience.\r\nBook your tickets now to secure your spot for this year!\r\nDGTL is a global electronic music festival with editions in Amsterdam, Santiago (Chile), São Paulo (Brazil), Bengaluru & Mumbai, and during the Amsterdam Dance Event. Besides its focus on music, DGTL features unique art installations and exciting sustainability projects. Its sustainability program sets it apart in the festival landscape.\r\nImportant Note: No entry without a wristband. If you lose, damage, remove, or tamper with your tickets/wristbands, no replacements will be issued, and entry will not be allowed.",
    "share_url": "https://zoma.to/live-event/40858"
  },
  {
    "title": "Hues of Harmony ft. Priyanka NK",
    "subtitle": "Live in Concert!",
    "cost": "₹699 onwards",
    "datetime": "13th July 7:00 PM - 10:00 PM",
    "venue": "Nexus Shantiniketan",
    "event_id": "40919",
    "location": "Whitefield Main Rd, Thigalarapalya, Krishnarajapuram",
    "description": "From classic hits to contemporary favourites, Priyanka NK will enchant you with her soulful singing.\r\n\r\nPriyanka NK is an Indian playback singer known for her captivating vocals and versatile performances. With a passion for music from a young age, Priyanka honed her skills and rose to prominence in the Indian music industry. She has mesmerized audiences with her soulful renditions across various genres, including Tamil, Telugu, and Kannada. Over the years, Priyanka NK has collaborated with leading music composers and singers, delivering chart-topping hits and unforgettable melodies.\r\n\r\nWith a repertoire that spans across languages and genres, Priyanka NK continues to enchant audiences with her soul-stirring performances, leaving an indelible mark on the world of music.",
    "share_url": "https://zoma.to/live-event/40919",
    "start": "2024-07-13T19:00:00+05:30",
    "end": "2024-07-13T22:00:00+05:30"
  },
  {
    "title": "CrossOver ft. Martin Roth",
    "subtitle": "Event by: Centigrade",
    "cost": "Free entry",
    "datetime": "7th July 7:00 PM - 1:00 AM",
    "venue": "Sunburn Union",
    "event_id": "41899",
    "location": "Mantri Avenue, Koramangala 6th Block, Bangalore",
    "description": "Excitement fills us as we bring the Anjunadeep spearhead MARTIN ROTH to Bangalore, marking its inaugural appearance at Sunburn Union for our CrossOver Showcase this July. 🍾",
    "share_url": "https://zoma.to/live-event/41899",
    "start": "2024-07-07T19:00:00+05:30",
    "end": "2024-07-08T01:00:00+05:30"
  },
  {
    "title": "LIL MIC | A Open Mic for Kids",
    "subtitle": "Step into a world of wonder and watch as young stars ignite the stage with their boundless creativity and infectious energy at dowithlit's Lil Mic! ",
    "cost": "₹99 onwards",
    "datetime": "7th July 5:00 PM - 7:00 PM",
    "venue": "Pops of Pastel",
    "event_id": "42351",
    "location": "1st Floor, No. 53, 1st Floor, Shree Chambers, Subbarama Chetty Road, Nettakallappa Cir, above Karnataka Bank ATM, Basavanagudi, Bengaluru, Karnataka 560004",
    "description": "Hello Bengaluru!\r\nCalling all young superstars-in-the-making! Get ready to rock the mic and light up the stage at our famed open mics, now for kids🌟🎤 It's an explosion of talent as kids aged 5-13 unleash their inner rockstars, comedians, poets, and everything in between! With each act more electrifying than the last, this event is a rollercoaster ride of laughs, cheers, and jaw-dropping moments.\r\nDWL Open Mic brings you a platform to perform your poetry, stories or music. Our open mics which became popular online during the lockdown, is now going around cities in India bringing like-minded artists together to perform, jam and network. Perform or catch the best performances from some of the most talented artists in your city. Either way, DWL Open Mics is an experience of it's own.",
    "share_url": "https://zoma.to/live-event/42351",
    "start": "2024-07-07T17:00:00+05:30",
    "end": "2024-07-07T19:00:00+05:30"
  },
  {
    "title": "Chowraasta Live",
    "subtitle": "Telugu Music Night",
    "cost": "₹499 onwards",
    "datetime": "6th July 8:00 PM - 12:00 AM",
    "venue": "Macaw by Stories",
    "event_id": "42885",
    "location": "No 2224 , 2225 AECS Layout Singasandra Hosur, Service Rd, Bengaluru, Karnataka 560068",
    "description": "Chowraasta is a dynamic Telugu band known for their eclectic blend of traditional and contemporary sounds. Their music resonates with a wide audience, combining soulful melodies, powerful lyrics, and infectious rhythms. Each performance by Chowraasta is a journey through the diverse landscape of Telugu music, infused with their unique style and passion.\r\nJoin Us for a Night to Remember\r\nGather your friends, family, and fellow music enthusiasts for an incredible night with Chowraasta. Whether you're a long-time fan or new to their music, this live performance is a must-attend event that promises great entertainment and unforgettable memories.",
    "share_url": "https://zoma.to/live-event/42885",
    "start": "2024-07-06T20:00:00+05:30",
    "end": "2024-07-07T00:00:00+05:30"
  },
  {
    "title": "Skandagiri Sunrise / Night Trek",
    "subtitle": "Witness the magnificent view of clouds with sunrise",
    "cost": "₹4500 onwards",
    "datetime": "5th to 7th July 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "42936",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Skandagiri, also known as Kalwarbetta or Kalavara Durga, is a mountain fortress 70 km from Bangalore. This 8 km, 4-hour trek offers a moderately difficult climb starting at Papagni Temple, leading through dense shrubs and steep terrain. At the summit, explore Tipu Sultan’s ruins and enjoy a stunning sunrise above the clouds.\r\nTotal Trek distance: 22 Kms, Level of Trek: Moderate.\r\nThings to Carry:\r\n• Raincoat/Poncho (during monsoon)\r\n• ID proof\r\n• Backpack\r\n• Sunscreen/cap\r\n• Track pants\r\n• Full sleeve cotton t-shirt (to avoid getting sunburnt)\r\n• Torch (with extra batteries)\r\n• Personal Medication\r\n• Necessary toiletries\r\n• Shoes with a good grip",
    "share_url": "https://zoma.to/live-event/42936"
  },
  {
    "title": "Bandajje waterfalls trek",
    "subtitle": "Discover Bandaje Falls: A Trekker's Hidden Paradise",
    "cost": "₹4000 onwards",
    "datetime": "5th to 7th July 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "42939",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Situated in the Charmadi Ghats area of the western ghats, this offbeat trail to Bandaje waterfalls is one of the must-do treks when in Bangalore. The journey takes you through magnificent meadows, river streams, and lush green forests, all of which are a delight to behold. Embark on this exciting trek and see the beauty for yourself.\r\nTotal Trek distance: 22 Kms, Level of Trek: Moderate.\r\nThings to Carry:\r\n• Raincoat/Poncho (during monsoon)\r\n• ID proof\r\n• Backpack\r\n• Sunscreen/cap\r\n• Track pants\r\n• Full sleeve cotton t-shirt (to avoid getting sunburnt)\r\n• Torch (with extra batteries)\r\n• Personal Medication\r\n• Necessary toiletries\r\n• Shoes with a good grip",
    "share_url": "https://zoma.to/live-event/42939"
  },
  {
    "title": "Kodachadri Trek & Jog falls",
    "subtitle": "Highlights of Nagara fort and Jog falls",
    "cost": "₹4500 onwards",
    "datetime": "5th to 7th July 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "42940",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Experience the breathtaking panoramic views of the Kodachadri Hills in Valur, Karnataka. Located at an altitude of 1343 meters, these hills are surrounded by dense forest and attract thousands of visitors annually. Challenge yourself on a 2-day trek from Bangalore, navigating tricky terrains to reach the summit and admire the vast Western Ghats. Explore the natural wonders of Kodachadri, including Hidlumane Waterfalls, Nagara Fort, and Jog Falls.\r\nTotal Trek distance: 22 Kms, Level of Trek: Moderate.\r\nThings to Carry:\r\n• Raincoat/Poncho (during monsoon)\r\n• ID proof\r\n• Backpack\r\n• Sunscreen/cap\r\n• Track pants\r\n• Full sleeve cotton t-shirt (to avoid getting sunburnt)\r\n• Torch (with extra batteries)\r\n• Personal Medication\r\n• Necessary toiletries\r\n• Shoes with a good grip",
    "share_url": "https://zoma.to/live-event/42940"
  },
  {
    "title": "Ettina Bhuja Trek",
    "subtitle": "Ettina Bhuja: Trek to Panoramic Views in Nature's Lap",
    "cost": "₹3500 onwards",
    "datetime": "5th to 7th July 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "42941",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Ettina Bhuja, meaning Ox's Shoulder in Kannada, is near Dharmasthala, in Byrapura village, Mudigere range, Chikmagalur district. Located about 250km from Bangalore, it's an ideal weekend getaway.\r\nThough not well-known among trekkers, Ettina Bhuja offers scenic landscapes at 1300m altitude with grasslands, forests, bamboo, and cane plantations. The trek features the soothing sounds of nature.\r\nAt the top, which resembles an ox's hump, enjoy panoramic views of dense green forests.\r\nTotal Trek distance: 22 Kms, Level of Trek: Moderate.\r\nThings to Carry:\r\n• Raincoat/Poncho (during monsoon)\r\n• ID proof\r\n• Backpack\r\n• Sunscreen/cap\r\n• Track pants\r\n• Full sleeve cotton t-shirt (to avoid getting sunburnt)\r\n• Torch (with extra batteries)\r\n• Personal Medication\r\n• Necessary toiletries\r\n• Shoes with a good grip",
    "share_url": "https://zoma.to/live-event/42941"
  },
  {
    "title": "Tadiandamol trek",
    "subtitle": "Conquer Tadiandamol: Coorg's Pinnacle of Natural Beauty",
    "cost": "₹3600 onwards",
    "datetime": "5th to 7th July 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "42942",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Coorg in South Karnataka refreshes minds with its lush greenery and stunning Western Ghats views. Its replenishing nature, tricky terrains, wooded slopes, and misty valleys attract many travelers and trekkers. Tadiandamol, Coorg's highest peak at 1,748m, is surrounded by the Shola forests' stunning greenery. Enjoy exploring Coorg's captivating landscape, and feel the pride of conquering its highest peak, rewarded with sweeping views of green forests and coffee plantations.\r\nTotal Trek distance: 22 Kms, Level of Trek : Moderate.\r\nThings to Carry:\r\n• Raincoat/Poncho (during monsoon)\r\n• ID proof\r\n• Backpack\r\n• Sunscreen/cap\r\n• Track pants\r\n• Full sleeve cotton t-shirt (to avoid getting sun burnt)\r\n• Torch (with extra batteries)\r\n• Personal Medication\r\n• Necessary toiletries\r\n• Shoes with a good grip",
    "share_url": "https://zoma.to/live-event/42942"
  },
  {
    "title": "Dudhsagar Trek",
    "subtitle": "Trek Dudhsagar: Witness Goa's Majestic 'Sea of Milk'",
    "cost": "₹4950 onwards",
    "datetime": "5th to 7th July 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "42943",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Head out on an adventurous trek to Dudhsagar Falls, located on Goa's eastern border. Known as the ‘Sea of Milk,’ this four-tiered waterfall on the Mandovi River is one of India's tallest, standing at 310m (1017 feet) with an average width of 30m (100 feet).\r\n\r\nThe falls are nestled in the Bhagwan Mahaveer Sanctuary and Mollem National Park within the Western Ghats, marking the border between Karnataka and Goa. Surrounded by thick deciduous forests, the area boasts rich biodiversity, perfect for a two-day trek.\r\n\r\nTotal trek distance: 22 km, moderate difficulty.\r\n\r\nThings to carry:\r\n• Raincoat/Poncho (monsoon)\r\n• ID proof\r\n• Backpack\r\n• Sunscreen/Cap\r\n• Track pants\r\n• Full sleeve cotton T-shirt\r\n• Torch (with extra batteries)\r\n• Personal medication\r\n• Necessary toiletries\r\n• Shoes with a good grip",
    "share_url": "https://zoma.to/live-event/42943"
  },
  {
    "title": "Night camping, trek & activities @Ramanagar",
    "subtitle": "Explore Ramanagara: Climb Ancient Granite Outcrops",
    "cost": "₹1750 onwards",
    "datetime": "5th to 7th July 9:00 PM onwards",
    "venue": "Majestic Metro Station",
    "event_id": "42944",
    "location": "Kempegowda Rd, Kempegowda, Sevashrama",
    "description": "Ramanagara, 50 km southwest of Bangalore, stands at 747 meters (2450 feet) and is famous for its massive granite outcrops. Known for short rock climbs, grades range from 5.8 to 5.11 American. It features some of the world's oldest granite outcrops, including Ramdevarabetta, famous for its cave entrances in \"Passage to India.\" The trek distance is 4 km, with a moderate difficulty level.\r\nTotal Trek distance: 22 Kms, Level of Trek: Moderate.\r\nThings to Carry:\r\n• Raincoat/Poncho (during monsoon)\r\n• ID proof\r\n• Backpack\r\n• Sunscreen/cap\r\n• Track pants\r\n• Full sleeve cotton t-shirt (to avoid getting sunburnt)\r\n• Torch (with extra batteries)\r\n• Personal Medication\r\n• Necessary toiletries\r\n• Shoes with a good grip",
    "share_url": "https://zoma.to/live-event/42944"
  },
  {
    "title": "Chikmagalur Weekend Getaway",
    "subtitle": "Experience serenity of Coffee Land",
    "cost": "₹4999 onwards",
    "datetime": "5th to 7th July 9:30 PM onwards",
    "venue": "Pickup Point",
    "event_id": "43016",
    "location": "#467, CK Complex, 479, 4th Ave St, Teacher's Colony, 1st Block Koramangala, HSR Layout 5th Sector",
    "description": "This paradise of misty hills and lush green tea and coffee plantations is a sweet escape from the noisy city life, resting peacefully at a height of 3,400 ft. Get ready to immerse yourself in the arms of nature! \r\nWhether you’re a thrill-seeker or a nature lover, Chikmagalur’s got you covered. Hike through the rugged terrain, or take a dip in one of the many cascading waterfalls, there’s so much to explore",
    "share_url": "https://zoma.to/live-event/43016"
  },
  {
    "title": "Coorg Weekend Getaway",
    "subtitle": "Experience the scotland of India",
    "cost": "₹4999 onwards",
    "datetime": "5th to 7th July 9:30 PM onwards",
    "venue": "Pickup Point",
    "event_id": "43018",
    "location": "#467, CK Complex, 479, 4th Ave St, Teacher's Colony, 1st Block Koramangala, HSR Layout 5th Sector",
    "description": "Time to put on your adventure hat and escape to a place where relaxation and thrill collide in the most tantalizing way possible! Imagine waking up to the aroma of freshly ground coffee beans surrounded by lush greenery worthy of a postcard.\r\n\r\nGet ready to explore winding trails and stunning waterfalls, trading city life for an unforgettable adventure that will stay with you forever. Coorg's calling, are you ready",
    "share_url": "https://zoma.to/live-event/43018"
  },
  {
    "title": "Wayanad Weekend Getaway",
    "subtitle": "Break the shackles of daily life and expreience adventures in God's own contry.",
    "cost": "₹5999 onwards",
    "datetime": "5th to 8th July 9:30 PM onwards",
    "venue": "Pickup Point",
    "event_id": "43020",
    "location": "#467, CK Complex, 479, 4th Ave St, Teacher's Colony, 1st Block Koramangala, HSR Layout 5th Sector",
    "description": "The lush-green town of Wayanad in Kerala is hidden in the Malabar region on the Western Ghats. Sparsely populated, the forest-covered region abounds in picturesque hills meandered with streams, tea estates, and wildlife sanctuaries. Referred to as the ‘Spice Garden of India’, Wayanad is a hub of spices such as cardamom, star anise, fenugreek, black pepper, black cumin, etc. Adding to its treasures are Asia’s second largest and India’s largest damn, the Banasura Sagar Dam, the Edakkal Caves from the Neolithic Age to trek to. Witness a majestic sunset at the backdrop of the dam, go hiking, mountaineering, camping, or rock climbing, you’d never run out of fun activities at Wayanad.",
    "share_url": "https://zoma.to/live-event/43020"
  },
  {
    "title": "Kodaikanal Weekend Getaway",
    "subtitle": "Get your freedom from the city noise and Experience Princess of Hill stations",
    "cost": "₹5999 onwards",
    "datetime": "5th to 8th July 8:30 PM onwards",
    "venue": "Pickup Point",
    "event_id": "43023",
    "location": "#467, CK Complex, 479, 4th Ave St, Teacher's Colony, 1st Block Koramangala, HSR Layout 5th Sector",
    "description": "Kodaikanal, also known as the Princess of Hills in Tamil Nadu, is one of the most popular tourist destinations in South India. Often considered for a romantic weekend retreat, the quaint little town is blessed with a perfect temperature at any given season. If you are seeking time alone in the lap of nature with your loved ones, Kodai is the place to go. Adorned with cascading waterfalls, shimmering lakes, and undulating green hills, the town will leave you awestruck with its natural beauty.",
    "share_url": "https://zoma.to/live-event/43023"
  },
  {
    "title": "Munnar Weekend Getaway",
    "subtitle": "Emrance the misty hills and relish your soul with the aroma of the tea estates.",
    "cost": "₹6899 onwards",
    "datetime": "5th to 8th July 8:30 PM onwards",
    "venue": "Pickup Point",
    "event_id": "43025",
    "location": "#467, CK Complex, 479, 4th Ave St, Teacher's Colony, 1st Block Koramangala, HSR Layout 5th Sector",
    "description": "Munnar is a popular hill station located in the state of Kerala, India. It is known for its breathtaking landscapes, tea gardens, spice plantations, and cool climate, making it a favored destination for nature lovers and adventure enthusiasts. It is also known for its stunning landscapes, tea plantations, and pleasant weather. Munnar, with its scenic beauty, tea gardens, and tranquil ambiance, provides a perfect getaway to experience the charm of Kerala's hill stations",
    "share_url": "https://zoma.to/live-event/43025"
  },
  {
    "title": "Ooty-Connoor Weekend Getaway",
    "subtitle": "Experience the tranquil Nilgiri Hills in India and enjoy the fragrant tea estates.",
    "cost": "₹6299 onwards",
    "datetime": "5th to 8th July 8:30 PM onwards",
    "venue": "Pickup Point",
    "event_id": "43027",
    "location": "#467, CK Complex, 479, 4th Ave St, Teacher's Colony, 1st Block Koramangala, HSR Layout 5th Sector",
    "description": "Ooty and Coonoor are charming hill stations nestled in the Nilgiri Hills of Tamil Nadu, India. Here's a brief overview of each:\r\n\r\nAlso known as the \"Queen of Hill Stations,\" Ooty is one of the most popular tourist destinations in South India.\r\nIt boasts pleasant weather throughout the year, with cool temperatures making it a perfect retreat from the heat of the plains. Ooty is famous for its sprawling tea gardens, lush green landscapes, and picturesque viewpoints like Doddabetta Peak, offering panoramic views of the surrounding hills.",
    "share_url": "https://zoma.to/live-event/43027"
  },
  {
    "title": "Gokarna-Murudeshwar Weekend Getaway",
    "subtitle": "Experience the lovely beach paradise and relish your soul with the endless view of arabian sea",
    "cost": "₹5299 onwards",
    "datetime": "5th to 8th July 8:30 PM onwards",
    "venue": "Pickup Point",
    "event_id": "43029",
    "location": "#467, CK Complex, 479, 4th Ave St, Teacher's Colony, 1st Block Koramangala, HSR Layout 5th Sector",
    "description": "What do you visualize if we ask you about a weekend on a beach? We would not be surprised if you say Goa. And that’s precisely why we need an alternative to Goa, one which is away from the humdrum of life, one which brings peace and serenity for the weekend.\r\n\r\nThis is precisely what Gokarna offers. If you are looking for a place for an escapade, to take a break after the week-long 9-5 office hours, and are tired of glancing at pictures of breath-taking beaches on your monitor, go ahead and pack your bags already.",
    "share_url": "https://zoma.to/live-event/43029"
  },
  {
    "title": "Hampi Weekend Getaway",
    "subtitle": "Experience Karnataka's favourite UNESCO heritage site and ancient beauty.",
    "cost": "₹4999 onwards",
    "datetime": "5th to 8th July 9:30 PM onwards",
    "venue": "Pickup Point",
    "event_id": "43031",
    "location": "#467, CK Complex, 479, 4th Ave St, Teacher's Colony, 1st Block Koramangala, HSR Layout 5th Sector",
    "description": "Exploring the Ancient Beauty of Hampi in Karnataka\r\n\r\nHampi, located in Karnataka, is a site of great historical significance. Once the capital city of the Vijayanagara Empire, it is now a UNESCO World Heritage Site with over 500 ruins and monuments. Many consider Hampi to be the second largest city of its time, following only Beijing.\r\n\r\nSituated on the banks of the Tungabhadra River, Hampi boasts ancient India's grandeur with its intricate architecture, brilliant engineering, and breathtaking scenery. The most significant structure is the Virupaksha Temple, dedicated to the empire's patron deity.\r\n\r\nBut Hampi isn't just about history! The town blends history and modernity, featuring aesthetic cafes, cultural performances, and a variety of cuisines from around the world in nearby Hippie Town. This is a place where people can gain a fresh perspective on life.",
    "share_url": "https://zoma.to/live-event/43031"
  },
  {
    "title": "Pondicherry Weekend Getaway",
    "subtitle": "Live your ' Sagar Kinare, Dil Yeh Pukare' Bollywood dreams.",
    "cost": "₹5999 onwards",
    "datetime": "5th to 8th July 9:30 PM onwards",
    "venue": "Pickup Point",
    "event_id": "43033",
    "location": "#467, CK Complex, 479, 4th Ave St, Teacher's Colony, 1st Block Koramangala, HSR Layout 5th Sector",
    "description": "Pondicherry, also known as Puducherry, is a charming coastal town on India's southeastern coast. This Union Territory blends French and Indian influences, creating a laid-back, multicultural vibe. The French Quarter, with its cobblestone streets and colonial architecture, contrasts with bustling markets and vibrant Tamil culture.\r\n\r\nPondicherry boasts serene beaches like Promenade Beach and Paradise Beach, and the iconic Aurobindo Ashram, offering a perfect mix of relaxation and spiritual exploration. The town's allure is enhanced by delectable French-inspired cuisine and the colorful streets of the Auroville community. Pondicherry is a haven for those seeking a peaceful escape with cultural richness.",
    "share_url": "https://zoma.to/live-event/43033"
  },
  {
    "title": "Core Pop’s Up",
    "subtitle": "featuring Frankey & Sandrino",
    "cost": "₹499 onwards",
    "datetime": "6th July 8:00 PM - 1:00 AM",
    "venue": "HIGH Ultra Lounge",
    "event_id": "43096",
    "location": "26/1, Rooftop, World Trade Center, Dr Rajkumar Rd, Malleshwaram, Bengaluru, Karnataka 560055",
    "description": "As its name suggests, the philosophy behind Core is to touch the hearts of those who attend the festival by soulful Music, Art and Culture from different Artists and Artisans from across the world.",
    "share_url": "https://zoma.to/live-event/43096",
    "start": "2024-07-06T20:00:00+05:30",
    "end": "2024-07-07T01:00:00+05:30"
  },
  {
    "title": "Jackfruit Dance Party",
    "subtitle": "ft. Bliss Inc., GST, Rishi Sippy, That90'sKid + more",
    "cost": "₹499 onwards",
    "datetime": "7th July 3:00 PM - 1:00 AM",
    "venue": "Koramangala Social",
    "event_id": "43097",
    "location": "Seventh Block, Plot 118, 80 Feet Rd, above Bodyworks Spa, KHB Colony, 7th Block, Koramangala, Bengaluru, Karnataka 560095",
    "description": "Nodding to genre-melted decades of the past Bliss Inc. is the manifestation of a sonic ritual intent\r\n\r\non guiding us through the internal journey towards self-discovery.\r\n\r\nJoin Bliss Inc., Rishi Sippy, G.S.T, That90sKid, Master Shifu, Ode, & Tonkatsukitty for a tripped out Sunday sundowner with delicious cocktails and sonics at the Jackfruit Dance Party, Koramangala Social, Bangalore.",
    "share_url": "https://zoma.to/live-event/43097",
    "start": "2024-07-07T15:00:00+05:30",
    "end": "2024-07-08T01:00:00+05:30"
  },
  {
    "title": "Sultan Of Rock",
    "subtitle": "Classic Rock",
    "cost": "₹249 onwards",
    "datetime": "4th July 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "43179",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Catch Sultan of Rock playing live on 4th July i.e. Thursday, 8:30 pm onwards only at Hard Rock Cafe, Bengaluru.\r\nJoin us for an evening full of great music, lip-smacking food & refreshing cocktails.",
    "share_url": "https://zoma.to/live-event/43179",
    "start": "2024-07-04T20:30:00+05:30",
    "end": "2024-07-04T23:00:00+05:30"
  },
  {
    "title": "Tribute to Metallica",
    "subtitle": "ft. Vortex",
    "cost": "₹499 onwards",
    "datetime": "6th July 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "43180",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Embark on a mesmerizing journey as the live band performance takes center stage, delivering an electrifying live performance that captures the essence of rhythmic magic. Immerse yourself in an unforgettable musical experience, where every note and beat harmonize to create an electrifying atmosphere, leaving you enchanted and immersed in the magic of music.",
    "share_url": "https://zoma.to/live-event/43180",
    "start": "2024-07-06T20:30:00+05:30",
    "end": "2024-07-06T23:00:00+05:30"
  },
  {
    "title": "Go Funk Yourself",
    "subtitle": "Jazz & Blues",
    "cost": "₹249 onwards",
    "datetime": "11th July 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "43181",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Your favorite night is here.\r\n\r\nThe incredibly skilled GO FUNK YOURSELF will perform their spectacular and enchanted foot-tapping tunes live for you to groove and dance at Hard Rock Cafe Bengaluru.\r\nAbout the band: Go Funk Yourself is a Bengaluru based band that is on a mission to create an experience that moves and inspires its attendees. Coming from a nature of improvisation, they often trail into moments that are purely born on stage live with the audience. Their set consists of unreleased originals that have found their way to audiences who truly want to funk themselves.\r\nSo, what are you waiting for? Prepare for the most incredible night to kick off your weekend.\r\nReserve your spots now for a night full of rock & roll.",
    "share_url": "https://zoma.to/live-event/43181",
    "start": "2024-07-11T20:30:00+05:30",
    "end": "2024-07-11T23:00:00+05:30"
  },
  {
    "title": "Tribute to Arctic Monkeys",
    "subtitle": "Ft The Alan's Project",
    "cost": "₹499 onwards",
    "datetime": "13th July 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "43182",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Catch The Alan`s Project paying tribute to Artic Monkeys live on 13th July i.e. Saturday, 8:30 pm onwards only at Hard Rock Cafe, Bengaluru.\r\nJoin us for an evening full of great music, lip-smacking food & refreshing cocktails.",
    "share_url": "https://zoma.to/live-event/43182",
    "start": "2024-07-13T20:30:00+05:30",
    "end": "2024-07-13T23:00:00+05:30"
  },
  {
    "title": "Pop & Party Chartbusters",
    "subtitle": "Ft Black In White (From Goa)",
    "cost": "₹499 onwards",
    "datetime": "20th July 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "43183",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Black IN White is one of the most renowned Pop-Rock bands from Goa, India. They are one of the most influential and prominent groups and are known for their unique style of music and electrifying performances all over the globe.\r\n\r\nThe Band comprises of:\r\nGenevieve - Vocals\r\nShay Ryan- Vocals\r\nNoel Rosh- Keyboards\r\nAckley Araujo- Drums\r\nChristoffer Daniel- Guitars\r\nEDM Gomes- Bass",
    "share_url": "https://zoma.to/live-event/43183",
    "start": "2024-07-20T20:30:00+05:30",
    "end": "2024-07-20T23:00:00+05:30"
  },
  {
    "title": "Tribute to Arijit SIngh",
    "subtitle": "Ft Root 35 (From Hyderabad)",
    "cost": "₹499 onwards",
    "datetime": "20th July 9:00 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "43184",
    "location": "Unit G 25 & 26, Ground Floor, Park Square Mall, International Tech Park, Pattandur Agrahara, Whitefield",
    "description": "Root Three Five (35) exploded onto the live music scene after winning the Nxt Big Star competition in 2017. The Root 35 band blends soulful Indian and Western music and unique ideas. The band blends soulful Indian and Western music with high-energy rock and unique ideas. Every member brings in their distinct sound and personality to collectively form a tight performing unit. In a short span of time, they have gained a lot of traction and love from their audiences.\r\nSo what are you waiting for? Just reserve your spots and be ready to experience a night full of rock `n` roll.",
    "share_url": "https://zoma.to/live-event/43184",
    "start": "2024-07-20T21:00:00+05:30",
    "end": "2024-07-20T23:00:00+05:30"
  },
  {
    "title": "Tribute to Pink Floyd",
    "subtitle": "Ft Darklight",
    "cost": "₹499 onwards",
    "datetime": "27th July 9:00 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "43185",
    "location": "Unit G 25 & 26, Ground Floor, Park Square Mall, International Tech Park, Pattandur Agrahara, Whitefield",
    "description": "Dark Light is a five-piece psychedelic/progressive rock band from Bangalore whose music has been compared to a soulful blend of stadium rock`s ferocity and fury with progressive elements and ambient psychedelic soundscapes. They significantly draw inspiration from artists such as Porcupine Tree, Pink Floyd, U2, Opeth, Guns N` Roses, Radiohead, and Led Zeppelin and aim to make music that will captivate you and leave you wanting more.\r\nAnd of course, enjoy some beer and great bar fare as the ticket cost includes cover charges as well.",
    "share_url": "https://zoma.to/live-event/43185",
    "start": "2024-07-27T21:00:00+05:30",
    "end": "2024-07-27T23:00:00+05:30"
  },
  {
    "title": "Paint with Puppies",
    "subtitle": "India's First Painting With Puppies",
    "cost": "₹1200 onwards",
    "datetime": "7th July 10:30 AM - 12:30 PM",
    "venue": "Oyster, Bar & Kitchen",
    "event_id": "43314",
    "location": "#36, 3rd floor, 14th Main Rd, Sector 7, HSR Layout",
    "description": "Have you ever dreamed of painting alongside the most adorable companions imaginable? Now's your chance! Don't miss out on the event of the month: Painting with Puppies! It's not just a workshop; it's an unforgettable experience that will touch your heart and ignite your creativity like never before.\r\nImagine yourself surrounded by cuddly, adoptable puppies, their wagging tails and playful energy inspiring every brushstroke. But it's not just about painting; it's about making a difference. With each ticket purchased, you're supporting animal welfare initiatives, spreading love and compassion to those who need it most.\r\nIndulge in unlimited snuggles, laughter, and pure joy as you create your masterpiece alongside your furry friends. This isn't just another workshop—it's a chance to create memories that will last a lifetime while giving back to the community.",
    "share_url": "https://zoma.to/live-event/43314",
    "start": "2024-07-07T10:30:00+05:30",
    "end": "2024-07-07T12:30:00+05:30"
  },
  {
    "title": "We Jam",
    "subtitle": "By We Collective",
    "cost": "₹399 onwards",
    "datetime": "6th July 4:30 PM - 8:00 PM",
    "venue": "Koramangala Social",
    "event_id": "43484",
    "location": "Seventh Block, Plot 118, 80 Feet Rd, above Bodyworks Spa, KHB Colony, 7th Block, Koramangala, Bengaluru",
    "description": "We Jam is the ultimate haven for music lovers!\r\n\r\nCome enjoy a relaxing and fun evening with us. A space where you can be yourself and feel at home.\r\nJoin our welcoming community for a lively jamming session; bring your guitars, cajones, and most importantly yourself to jam along. \r\n\r\nThe event features three parts:\r\n\r\nOpen Mic: Perform for a warm and supportive audience, no matter where you are on your musical journey. Reach out to @wejam.blr on Instagram to book your slot.\r\nSocial Mixer: Connect with fellow music lovers and jam along to your favourite songs. Be a part of fun and exciting music based games and get a chance to win exciting goodies. \r\nJamming Session: Sing, play instruments, and join the community in a warm cozy, free-flowing musical experience. Together, we create music and memories.",
    "share_url": "https://zoma.to/live-event/43484",
    "start": "2024-07-06T16:30:00+05:30",
    "end": "2024-07-06T20:00:00+05:30"
  },
  {
    "title": "Yoga with Puppies",
    "subtitle": "A cause-led Experience in India",
    "cost": "₹999 onwards",
    "datetime": "14th July 9:30 AM - 11:00 AM",
    "venue": "Oyster, Bar & Kitchen",
    "event_id": "43510",
    "location": "36, 3rd floor, 14th Main Rd, Sector 7, HSR Layout, Bengaluru, Karnataka 560102",
    "description": "Welcome to the most pawsitively delightful yoga experience: Downward Doggies! Picture yourself on your yoga mat, surrounded by adorable, adoptable puppies frolicking around you. As you flow through your poses, their playful energy infuses each movement with joy and warmth. But this isn't just about yoga; it's about spreading love and support for our furry friends. Every ticket sold helps support local animal shelters and rescue organizations, ensuring these precious pups find their forever homes. Feel the stress melt away as you sink into your poses, with puppy kisses and tail wags adding an extra dose of happiness to your practice. It's not just about finding your inner zen; it's about embracing the love and companionship that these furry yogis bring to your mat.\r\n",
    "share_url": "https://zoma.to/live-event/43510",
    "start": "2024-07-14T09:30:00+05:30",
    "end": "2024-07-14T11:00:00+05:30"
  }
]