[
  {
    "title": "Seedhe Maut - Lunch Break India Tour 2024",
    "subtitle": "Still On A Lunch Break!",
    "cost": "₹943 onwards",
    "datetime": "27th April 7:00 PM - 10:00 PM",
    "venue": "Forum South Bengaluru",
    "event_id": "31673",
    "location": "Konanakunte Cross Metro Station, Anjanadri Layout, Konanakunte",
    "description": "Catch the 'best in the business' in a city near you! Seedhe Maut are taking their hit mixtape on a massive 12-city pan-India tour. The dynamic duo, known for their explosive live performances, will be playing an extended set and will feature several special guests as well as a few surprises! Get your tickets now! \r\n\r\nHaving mastered the art of delivering razor-sharp rhymes - this Delhi-based duo comprising Encore ABJ and Calm has used their lyrical dexterity to push forward the boundaries of Hip-Hop in India. Presenting Hindi Rap in a revolutionary new format, Seedhe Maut is taking the industry by storm and is unanimously regarded as the next big thing to break in the rapidly growing subculture landscape.\r\n\r\nAge Restriction: 16+",
    "share_url": "https://zoma.to/live-event/31673",
    "start": "2024-04-27T19:00:00+05:30",
    "end": "2024-04-27T22:00:00+05:30"
  },
  {
    "title": "Shreya Ghoshal “All Hearts Tour\" - Bengaluru",
    "subtitle": "By Superhits 93.5 RED FM",
    "cost": "₹999 onwards",
    "datetime": "11th May 7:30 PM - 10:00 PM",
    "venue": "New Horizon College of Engineering",
    "event_id": "33048",
    "location": "Bellandur, Outer Ring Road, Bengaluru, Karnataka 560103, India",
    "description": "Superhits 93.5 RED FM brings Shreya Ghoshal, All hearts tour Bengaluru RED LIVE\r\nin Concert Co-presented by Kalaluha.\r\nLet's experience the magic of Shreya Ghoshal's All Hearts Tour in Namma\r\nBengaluru. Prepare to be captivated by the mesmerizing blend of Shreya Ghoshal's\r\nsoulful voice and magnetic stage presence, accompanied by a talented band that\r\ninfuses energy and finesse into every performance.",
    "share_url": "https://zoma.to/live-event/33048",
    "start": "2024-05-11T19:30:00+05:30",
    "end": "2024-05-11T22:00:00+05:30"
  },
  {
    "title": "Ridiculous - Stand Up Comedy Show",
    "cost": "₹249 onwards",
    "datetime": "6th April to 4th May 6:30 PM onwards",
    "venue": "Atta Galata",
    "event_id": "33620",
    "location": "178, 5th Main Rd, Binnamangala, Hoysala Nagar, Indiranagar",
    "description": "About the show: Prepare yourself for an unforgettable evening of laughter as \"Ridiculous\" takes center stage with four of the wittiest stand-up comedians hailing from the vibrant city of Bangalore. Join us for a comedy extravaganza that blends the city`s tech-savvy charm, cultural quirks, and the unique flavor of everyday life. Ridiculous promises an evening filled with relatable humor delivered with the unique comedic flair that sets Bangalore`s stand-up comedy scene apart.",
    "url": "https://insider.in/ridiculous-stand-up-comedy-show-mar2-2024/event#",
    "share_url": "https://zoma.to/live-event/33620"
  },
  {
    "title": "SCC SkyCinema - Veer Zaara",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "27th April 7:00 PM - 10:30 PM",
    "venue": "Forum South Bengaluru",
    "event_id": "33867",
    "location": "Konanakunte Cross Metro Station, Anjanadri Layout, Konanakunte",
    "description": "\"Aaj se meri har raahein, meri manzilein, aur meri kahani sirf tumse.\"- Veer Zaara\r\n\r\nImmerse in an evening of timeless romance and soul-stirring melodies as Sunset Cinema Club brings this Bollywood classic to Forum South Bangalore Mall. Join us for a cinematic experience that transcends borders, celebrates love, and tugs at the strings of your heart.\r\n\r\n Enjoy your favorite movie on a breezy terrace, perched on the rooftop of Forum South Bangalore Mall. Here you'll have an unobstructed view of the night sky, creating a unique and immersive cinema experience as you sink into comfy bean bags or mattresses and watch the movie on a large screen with the skyline of the city as your backdrop.",
    "share_url": "https://zoma.to/live-event/33867",
    "start": "2024-04-27T19:00:00+05:30",
    "end": "2024-04-27T22:30:00+05:30"
  },
  {
    "title": "SCC Picnic Cinema - Hasee Toh Phasee",
    "subtitle": "When the sun goes down the show comes on",
    "cost": "₹600 onwards",
    "datetime": "26th April 7:00 PM - 10:30 PM",
    "venue": "GCBC - Garden City Beer Collective",
    "event_id": "33869",
    "location": "82/2, Gantiganahalli, Bengaluru",
    "description": "\"Meri life mein koi role nahi hai. Main life ka role play karta hoon.\" - Hasee Toh Phasee\r\n\r\nSunset Cinema Club invites you to a delightful romantic comedy that follows the quirky love story of Nikhil and Meeta at Garden City Beer Collective (GCBC). With its refreshing storyline and endearing performances, this movie is sure to leave you smiling.  \r\n\r\nCome for an evening of cinematic delight, as the sun goes down, and the show comes on! Enjoy a picnic-y ambiance, where you can sit or even lie down on comfy bean bags, surrounded by lush green grass! String lights illuminate the area, casting a warm glow that sets the perfect mood for the evening, while you enjoy your favorite film on a large screen with surround sound accompanied by delicious munchies and drinks!",
    "share_url": "https://zoma.to/live-event/33869",
    "start": "2024-04-26T19:00:00+05:30",
    "end": "2024-04-26T22:30:00+05:30"
  },
  {
    "title": "Church Street Gaming by The Boardgame Den",
    "cost": "₹450 onwards",
    "datetime": "23rd March to 27th April 3:00 PM onwards",
    "venue": "The Boardgame Den",
    "event_id": "34030",
    "location": "Pavilion Mall, 62/63, Church St, Haridevpur, Shanthala Nagar, Ashok Nagar",
    "description": "Detox from technology, interact with people, and have a blast! We have games from around the world that will get you hooked. Chill out with a light fun game or indulge in a rapt Euro one. Boardgames are for everyone! We have been collecting international board games for the last 15 years. We gather every weekend to play these games. Anyone over the age of 14 is welcome! You can come by yourself or in a group and don't worry about not knowing how to play them. We will help you find a suitable game, gather players, and teach you the rules. The events are conducted inside the WeWork Pavillion, which is on Church Street, in between the Metro Station and Starbucks. It is the Purva building right opposite Matteo Coffee. PS: We charge a flat entry fee for the entire event and don't charge additionally per game or by the hour. Once you are in, feel free to play as many games as you like until close.",
    "url": "https://insider.in/church-street-gaming-by-the-boardgame-den-aug26-2023/event#",
    "share_url": "https://zoma.to/live-event/34030"
  },
  {
    "title": "Karaoke Nights Ft. KJ Naveen",
    "subtitle": "Free",
    "cost": "entry 4th to 25th April",
    "datetime": "8:30 PM onwards Hard Rock Cafe, Whitefield",
    "venue": "Unit G-25 & 26, Ground Floor, Park Square Mall International Tech Park, Bangalore, Pattandur Agrahara",
    "event_id": "34033",
    "location": "ABOUT THIS EVENT",
    "description": "Read more",
    "url": "https://insider.in/karaoke-nights-ft-kj-naveen-apr4-2024/event#",
    "share_url": "https://zoma.to/live-event/34033"
  },
  {
    "title": "Gautham Govindan LIVE",
    "cost": "₹349 onwards",
    "datetime": "28th April 7:00 PM - 11:59 PM",
    "venue": "Ministry Of Comedy",
    "event_id": "34039",
    "location": "18th Main Road, 138/B, 5th Cross Rd, behind Cafe Coffee Day, KHB Colony, 5th Block, Koramangala",
    "description": "With over 20+million views on Instagram and Youtube, Gautham Govindan brings to you his first solo show. Gautham Govindan also brings to you this description which he’s having a tough time writing. All he can guarantee is an hour of laughs with material honed over the last 2 years. I’ll see you - I mean - He’ll see you there.",
    "url": "https://insider.in/gautham-govindan-live-apr28-2024/event#",
    "share_url": "https://zoma.to/live-event/34039"
  },
  {
    "title": "Classic Rock",
    "subtitle": "Dimensions",
    "cost": "₹250 onwards",
    "datetime": "25th April 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34318",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Dimensions, a band that performs in various genres, was formed by rock renegades from Bangalore. With nearly 40 years of live music experience between the members of the band, the band`s primary focus is to re-create and offer the best live musical experiences to its audiences.\r\nBe there to see them live at your favorite Hard Rock Cafe Bengaluru location.\r\nTimings: 8:30 pm onwards.",
    "share_url": "https://zoma.to/live-event/34318",
    "start": "2024-04-25T20:30:00+05:30",
    "end": "2024-04-25T23:00:00+05:30"
  },
  {
    "title": "Rock Around The World",
    "subtitle": "Ft Adhir Punja Project",
    "cost": "₹1000 onwards",
    "datetime": "27th April 9:00 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34319",
    "location": "40-3, St Mark's Rd, Srinivas Nagar, Shanthala Nagar, Ashok Nagar",
    "description": "Experience the magic of live music with Adhir`s captivating performance on Saturday, April 27th, starting from 9:00 PM onwards at Hard Rock cafe, Bengaluru. Let the talented artist serenade you with soulful melodies and mesmerizing tunes throughout the evening. Join us for an unforgettable musical journey that will leave you enchanted. Don`t miss this opportunity to immerse yourself in the perfect blend of rhythm and melody.",
    "share_url": "https://zoma.to/live-event/34319",
    "start": "2024-04-27T21:00:00+05:30",
    "end": "2024-04-27T23:00:00+05:30"
  },
  {
    "title": "Blockbuster Friday",
    "subtitle": "FT. DJ Franky",
    "cost": "Free entry",
    "datetime": "26th April 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34349",
    "location": "Unit G 25 & 26, Ground Floor, Park Square Mall, International Tech Park, Pattandur Agrahara, Whitefield",
    "description": "Make some noise and have fun, since the music gets two times better when a DJ lifts his hands in the air.\r\nEvery Friday night, starting at 8:30 p.m., Hard Rock Cafe Whitefield, Bengaluru is happy to host DJ FRANKY and his incredible sounds for the musically charged Blockbusters.\r\nPrepare to party and enjoy the evening with excellent food, live music, and cool drinks.",
    "share_url": "https://zoma.to/live-event/34349",
    "start": "2024-04-26T20:30:00+05:30",
    "end": "2024-04-26T23:00:00+05:30"
  },
  {
    "title": "Tribute to KK",
    "subtitle": "Ft. 3 Shots Bourbon",
    "cost": "₹750 onwards",
    "datetime": "27th April 8:30 PM - 11:00 PM",
    "venue": "Hard Rock Cafe",
    "event_id": "34351",
    "location": "Unit G 25 & 26, Ground Floor, Park Square Mall, International Tech Park, Pattandur Agrahara, Whitefield",
    "description": "Why sing alone when you can sing with the incredibly talented 3 SHOTS BOURBON at Hard Rock Cafe as we celebrate his music in honor of him?\r\nIt will be a once-in-a-lifetime encounter that will leave you with enduring memories when the band performs your favorite tunes.\r\nJoin us for a night of live music, delicious cuisine, and cool cocktails.",
    "share_url": "https://zoma.to/live-event/34351",
    "start": "2024-04-27T20:30:00+05:30",
    "end": "2024-04-27T23:00:00+05:30"
  },
  {
    "title": "Brews of Bangalore by BuzzinUp",
    "subtitle": "Bangalore's first ever beer and coffee festival",
    "cost": "₹199 onwards",
    "datetime": "5th May 12:00 PM - 10:00 PM",
    "venue": "Indiranagar Club",
    "event_id": "34388",
    "location": "Sangeetha Sabha, 4th Cross Rd, 8th cross, HAL 2nd Stage, Indiranagar",
    "description": "A Multi-Brand Beer & Coffee Extravaganza\" presented by BuzzinUp promises to be Bangalore's ultimate celebration of everyone's favorite beverages - beer & coffee. Set against the scenic backdrop of the lawns of Indiranagar Club on the 5th of May, this event offers beer & coffee aficionados a full-day beer symposium filled with chugs, beer games, delicious food, and entertainment. It's a one-of-a-kind opportunity to indulge in the finest brews from various brands while enjoying a vibrant atmosphere of fun and camaraderie. Whether you're a seasoned beer enthusiast or simply enjoy the occasional pint, \"Beers of Bangalore\" is the place to be for an unforgettable beer and coffee experience.",
    "share_url": "https://zoma.to/live-event/34388",
    "start": "2024-05-05T12:00:00+05:30",
    "end": "2024-05-05T22:00:00+05:30"
  },
  {
    "title": "Jingle Land",
    "subtitle": "The Land of Music and Entertainment",
    "cost": "₹899 onwards",
    "datetime": "8th June 3:30 PM - 10:30 PM",
    "venue": "Phoenix Marketcity, Bangalore",
    "event_id": "34555",
    "location": "Palm Meadows, Prestige Ozone, Whitefield Main Road, Whitefield, Devasandra Industrial Estate, Krishnarajapura",
    "description": "Hello Music Enthusiasts! JINGLE LAND is here!\r\nExperience the electrifying atmosphere of a musical extravaganza as diverse bands unite on one stage. Vibrant melodies fill the air, ranging from soulful ballads to heart-pounding rhythms. Enthusiastic crowds sway in harmony, immersed in the pulsating energy of live performances. Each band will bring its unique flair, captivating audiences with its raw talent and infectious passion.",
    "share_url": "https://zoma.to/live-event/34555",
    "start": "2024-06-08T15:30:00+05:30",
    "end": "2024-06-08T22:30:00+05:30"
  },
  {
    "title": "Core Summer Fest Bangalore",
    "subtitle": "Coming Soon!",
    "cost": "7th to 8th June 12:00 PM onwards",
    "datetime": "Venue to be announced Bengaluru",
    "venue": "ABOUT THIS EVENT",
    "event_id": "34820",
    "share_url": "https://zoma.to/live-event/34820",
    "start": null,
    "end": null
  },
  {
    "title": "Rafael Cerato & Stoked",
    "subtitle": "CentiGrade Turns 11!",
    "cost": "Free entry",
    "datetime": "21st April 7:00 PM - 1:00 AM",
    "venue": "Sunburn Union",
    "event_id": "35127",
    "location": "passport office, Mantri Avenue, next to Koramangala, KHB Games Village, Koramangala",
    "description": "Unlock the experience. One of India’s biggest Nightlife & Entertainment brands CentiGrade Turns 11 this April at the stunning Sunburn Union. Here we are Bangalore, calling for a massive celebration.\r\n\r\nFEATURING:\r\n\r\nRafael Cerato (France)\r\nStoked (India)\r\n+ More Acts TBA",
    "share_url": "https://zoma.to/live-event/35127",
    "start": "2024-04-21T19:00:00+05:30",
    "end": "2024-04-22T01:00:00+05:30"
  },
  {
    "title": "SCC Open Air Cinema - Madagascar",
    "subtitle": "When the sun goes down the show comes on ",
    "cost": "₹600 onwards",
    "datetime": "28th April 7:00 PM - 10:30 PM",
    "venue": "The Galleria Mall",
    "event_id": "35216",
    "location": "Police Station, SH 9, opposite Yelahanka, Ambedkar Colony",
    "description": "\"I like to move it, move it!\" - Madagascar\r\n\r\nSunset Cinema Club invites you all to join us for a wild adventure as we journey to the heart of Africa with our screening of this animated classic at The Galleria Mall, Bangalore. Come with your friends and family and get ready for a roaring good time under the stars.\r\n\r\nLocated in the heart of Yelahanka, this bustling mall transforms into a haven of relaxation and entertainment as the sun sets the stars begin to emerge, and your movie screening begins. Enjoy your favorite film on a large screen with surround sound, as you sink into comfy bean bags, in the great outdoors.",
    "share_url": "https://zoma.to/live-event/35216",
    "start": "2024-04-28T19:00:00+05:30",
    "end": "2024-04-28T22:30:00+05:30"
  },
  {
    "title": "Under The Sky Sundowner",
    "subtitle": "Free",
    "cost": "entry 7th to 28th April",
    "datetime": "5:00 PM onwards Sheraton Grand Bengaluru Whitefield Hotel & Convention Center",
    "venue": "Prestige Shantiniketan Hoodi, Whitefield, Thigalarapalya, Krishnarajapura",
    "event_id": "35364",
    "location": "ABOUT THIS EVENT",
    "description": "Read more",
    "url": "https://insider.in/under-the-sky-sundowner-at-sheraton-grand-whitefield-apr7-2024/event",
    "share_url": "https://zoma.to/live-event/35364"
  },
  {
    "title": "17th May",
    "subtitle": "7:00 PM - 11:59 PM",
    "cost": "Chowdiah Memorial Hall 16th Cross Rd, Vyalikaval, Kodandarampura, Malleshwara,",
    "datetime": "ABOUT THIS EVENT Varijashree's eponymous original music album “VARI” set for release in May 2024 on GroundUp Music, USA, produced by Grammy® Award Winning artist Michael League of Snarky Puppy is a conjunction of Indian music and Global music presented on the sonic platter of Indian classical and folk percussion. The heart and soul of the album lie in its sound with a mission to transcend boundaries.",
    "venue": "Read more",
    "event_id": "35368",
    "url": "https://insider.in/vari-album-release-tour-bengaluru-may17-2024/event",
    "share_url": "https://zoma.to/live-event/35368"
  },
  {
    "title": "Kashmir – Tulips Season Apr 27 – May 1",
    "cost": "₹999 onwards",
    "datetime": "27th April 9:16 AM - 1:16 PM",
    "venue": "Silk Board Bus Stand",
    "event_id": "35369",
    "location": "WJ8C+JQM, Central Silk Board Colony, Stage 2, BTM Layout",
    "description": "Kashmir also known as “Heaven on earth”, then you must plan a visit to Kashmir, specially the tulips season April-May. We are excited to bring a beautiful heavenly trip to Kashmir this summers. Get set ready to enjoy shikara rides and get submerged in beauty of sonmarg and Phalgam.",
    "url": "https://insider.in/kashmir-tulips-season-apr-27-may-1-apr27-2024/event",
    "share_url": "https://zoma.to/live-event/35369"
  },
  {
    "title": "Pumproom Open Air Feat Cristoph High Ultra Lounge",
    "cost": "₹499 onwards",
    "datetime": "21st to 22nd April 4:00 PM onwards",
    "venue": "High Ultra Lounge",
    "event_id": "35370",
    "location": "26/1, Rooftop, World Trade Center, Dr Rajkumar Rd, Malleswaram",
    "description": "Embark on an unforgettable sonic journey at PUMPROOM's open-air music festival on April 21st, 2024 only at the highest dancefloor in the city - HIGH ULTRA LOUNGE. This electrifying event promises an evening of pure musical ecstasy, headlined by the incomparable CRISTOPH.",
    "url": "https://insider.in/pumproom-open-air-feat-cristoph-high-ultra-lounge-apr21-2024/event",
    "share_url": "https://zoma.to/live-event/35370"
  },
  {
    "title": "Social Symphony by LEA- II 90s vs 2k Tamil Concert",
    "cost": "₹499 onwards",
    "datetime": "11th May 4:30 PM - 11:59 PM",
    "venue": "Bengaluru Gayana Samaaja",
    "event_id": "35372",
    "location": "XH4F+675, Krishna Rajendra Rd, Chikkanna Garden, Basavanagudi",
    "url": "https://insider.in/social-symphony-by-lea-ii-90s-vs-2k-tamil-concert-may11-2024/event",
    "share_url": "https://zoma.to/live-event/35372"
  },
  {
    "title": "Nikhita Gandhi Live In Concert",
    "cost": "₹699 onwards",
    "datetime": "18th May 6:00 PM - 11:59 PM",
    "venue": "Phoenix Market City",
    "event_id": "35373",
    "location": "Phoenix Marketcity, Palm Meadows, Prestige Ozone, Whitefield Main Road, Whitefield, Devasandra Industrial Estate, Krishnarajapura",
    "url": "https://insider.in/nikhita-gandhi-live-in-concert-may18-2024/event",
    "share_url": "https://zoma.to/live-event/35373"
  },
  {
    "title": "Satori [v] ft. Kohra at #IndiranagarSOCIAL",
    "cost": "₹420 onwards",
    "datetime": "20th to 21st April 8:00 PM onwards",
    "venue": "Indiranagar Social",
    "event_id": "35375",
    "location": "37, 80 Feet Rd, Hal, HAL 3rd Stage, Indiranagar,",
    "description": "We're proud to feature Kohra, a luminary in India's electronic music scene for nearly two decades. His sound is boundless, and his soundscapes immersive - continuously pushing the envelope of the musical experience. This ethos echoes in his founding of Qilla Records, a label that has been a sanctuary for sonic explorers since 2011. A&R of Qilla and Satori curator, Vishal Unni, joins in once again, opening the decks for the night",
    "url": "https://insider.in/satori-v-at-indiranagarsocial-apr20-2024/event",
    "share_url": "https://zoma.to/live-event/35375"
  },
  {
    "title": "Sunday Improv Jam",
    "cost": "₹99 onwards",
    "datetime": "21st April 11:00 AM - 11:59 PM",
    "venue": "Cubbon Park Metro Entrance (Park Side)",
    "event_id": "35377",
    "location": "XHJW+9QR, Cubbon Rd, Ambedkar Veedhi, Shivaji Nagar",
    "url": "https://insider.in/sunday-improv-jam/event",
    "share_url": "https://zoma.to/live-event/35377"
  },
  {
    "title": "Thaikkudam Bridge Live with AIR",
    "subtitle": "Electrifying stage presence and seamless fusion",
    "cost": "₹799 onwards",
    "datetime": "27th April 6:00 PM - 9:30 PM",
    "venue": "Garuda Mall",
    "event_id": "35902",
    "location": "56, Commissariat Rd, Ashok Nagar",
    "description": "Thaikkudam Bridge is a household name, particularly in the southern regions, thanks to their sensational hits like Navarasam and Fishrock.\r\n\r\nTheir electrifying stage presence and seamless fusion of diverse instruments have consistently left audiences awestruck, creating unforgettable experiences time and again.\r\n\r\nThis isn't just another concert; it's the Alive India Fundraiser & Awareness Concert, aiming to support deserving musicians through the Alive India Music Foundation NGO's MSR (Musicians Social Responsibility) Campaign, \"Sing to Save - Changing Lives Through Music\" mission. Our goal is to provide musicians with essentials like free food, shelter, upskill training, and sustainable career opportunities.",
    "share_url": "https://zoma.to/live-event/35902",
    "start": "2024-04-27T18:00:00+05:30",
    "end": "2024-04-27T21:30:00+05:30"
  }
]